<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;
<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//EN">
%mailing-lists;
<!ENTITY % trademarks PUBLIC "-//FreeBSD//ENTITIES DocBook Trademark Entities//EN">
%trademarks;
]>

<article>
  <articleinfo>
    <title>Escrevendo relat&oacute;rios de problema no FreeBSD</title>

    <pubdate>$FreeBSD: articles/problem-reports/article.sgml,v 1.8 2003/12/11 15:40:47 ebrandi Exp $</pubdate>

    <legalnotice id="trademarks" role="trademarks">
      &tm-attrib.freebsd;
      &tm-attrib.ibm;
      &tm-attrib.intel;
      &tm-attrib.sparc;
      &tm-attrib.sun;
      &tm-attrib.general;
    </legalnotice>

    <abstract>
      <para>
	Este artigo descreve qual a melhor forma de formular e de
	submeter um rel&aacute;torio de problemas para o Projeto
	FreeBSD.</para>
    </abstract>

    <authorgroup>
      <author>
        <firstname>Dag-Erling</firstname>
        <surname>Sm&oslash;rgrav</surname>
        <contrib>Contribu&iacute;do por </contrib>
      </author>
    </authorgroup>
  </articleinfo>

  <indexterm><primary>relat&oacute;rio de problemas</primary></indexterm>

  <section id="pr-intro">
    <title>Introdu&ccedil;&atilde;o</title>

    <para>
      Uma das experi&ecirc;ncias mais frustrantes que algu&eacute;m pode ter como
      um usu&aacute;rio de programa &eacute; submeter um relat&oacute;rio de problema
      apenas para v&ecirc;-lo ser sumariamente fechado com uma informa&ccedil;&atilde;o
      curta e inutil como <quote>n&atilde;o &eacute; um bug</quote> ou <quote>PR
      falso</quote>.  DE forma similar, uma das experi&ecirc;ncias mais
      frustrantes para um desenvolvedor de software &eacute; ser inundado com
      relat&oacute;rios de problemas que n&atilde;o s&atilde;o realmente relat&oacute;rios de
      problemas mas sim solicita&ccedil;&otilde;es de suporte, ou ent&atilde;o que
      contenham pouca ou nenhuma informa&ccedil;&atilde;o sobre como o problema
      ocorre e como reproduzi-lo.</para>
    
    <para>
      Este documento procura descrever como escrever bons relat&oacute;rios
      de problema. O que, voc&ecirc; pergunta, &eacute; um bom relat&oacute;rio de
      problema?  Bem, indo direto ao final, um bom relat&oacute;rio de
      problemas &eacute; aquele que se pode analisar e tratar rapidamente,
      para a satisfa&ccedil;&atilde;o mutua do usu&aacute;rio e do desenvolvedor.</para> 
    
    <para>
      Embora o foco prim&aacute;rio deste artigo seja a elabora&ccedil;&atilde;o de
      relat&oacute;rios de problemas no FreeBSD, a maior parte dele pode ser
      aplicada tranquilamente a outros projetos de software.</para>
    
    <para>
      Observe que este artigo esta organizado de forma tem&aacute;tica, e n&atilde;o
      de forma cronol&oacute;gica, desta forma voc&ecirc; deve ler o documento todo
      antes de enviar um relat&oacute;rio de problema, &eacute; melhor trata-lo como
      um tutorial passo-a-passo.</para>
    
  </section>

  <section id="pr-when">
    <title>Quando enviar um relat&oacute;rio de problema</title>

    <para>
      Existem muitos tipos de problemas, e n&atilde;o s&atilde;o todos que devem
      originar um relat&oacute;rio de problemas. Naturalmente, ningu&eacute;m &eacute;
      perfeito e haver&aacute; ocasi&otilde;es onde voc&ecirc; estar&aacute; certo de que
      encontrou um bug em um programa quando de fato voc&ecirc; entendeu
      errado a sintaxe de um comando ou ent&atilde;o cometeu um erro de
      digita&ccedil;&atilde;o em um arquivo de configura&ccedil;&atilde;o (o que por sua vez pode
      indicar uma documenta&ccedil;&atilde;o pobre em detalhes ou ent&atilde;o uma
      manipula&ccedil;&atilde;o pobre do erro por parte da aplica&ccedil;&atilde;o).  H&aacute; ainda
      muitos casos onde enviar um relat&oacute;rio de problema <emphasis>n&atilde;o
      </emphasis> &eacute;
      claramente a melhor a&ccedil;&atilde;o a ser tomada, e servir&aacute; somente frustrar
      os desenvolvedores.  Inversamente, existem situa&ccedil;&otilde;es onde &eacute;
      recomendado que se envie um relat&oacute;rio de problema sobre um
      detreminado bug ou ent&atilde;o sobre pedido de nova funcionalidade, por
      exemplo.</para>
      
    <para>
      Sendo assim como voc&ecirc; ir&aacute; determinar o que &eacute; um bug e o que n&atilde;o
      &eacute; ?  Porque existe uma regra simples que diz que se o seu
      problema n&atilde;o &eacute; um bug se ele puder ser expressado com uma
      pergunta (normalmente na forma <quote>Como eu fa&ccedil;o X?</quote> ou
      ent&atilde;o como <quote>Onde eu posso encontrar Y?</quote>).  N&atilde;o &eacute;
      sempre claro dessa forma, mas a regra da pergunta cobre a grande
      maioria dos casos.  Se voc&ecirc; esta procurando por uma resposta,
      considere enviar a sua pergunta para a lista
      &a.questions;.</para>
    
    <para>
      Em alguns casos pode ser apropriado enviar um relat&oacute;rio de
      problema para algo que n&atilde;o &eacute; realmente um bug, como por
      exemplo:</para>
    
    <itemizedlist>
      <listitem>
        <para>
	  Solicita&ccedil;&atilde;o de adi&ccedil;&atilde;o de novos recursos. Geralmente &eacute; uma
	  boa id&eacute;ia circular estas propostas nas listas de discuss&atilde;o
	  antes de envia-la em um relat&oacute;rio de problema.</para>
      </listitem>

      <listitem>
        <para>
	  Notifica&ccedil;&otilde;es de atualiza&ccedil;&otilde;es de softwares mantidos
	  externamente (principalmente do ports, mas tamb&eacute;m sobre
	  componentes do sistema b&aacute;sico mantidos externamente, como por
	  exemplo o BIND e varios outros utilit&aacute;rios GNU).</para>
      </listitem>
    </itemizedlist>

    <para>
      Um outro ponto &eacute; que o sistema onde voc&ecirc; observou o bug n&atilde;o
      estiver razo&aacute;velmente atualizado, voc&ecirc; deve considerar
      seriamente uma atualiza&ccedil;&atilde;o e ap&oacute;s voc&ecirc; deve tentar reproduzir 
      o problema no sistema atualizado antes de enviar o relat&oacute;rio de
      problema.  N&atilde;o existe nada que irrite um desenvolvedor mais do
      que receber um relat&oacute;rio de problema para um bug que ele ja
      corrigiu.</para>

    <para>
      Finalmente, um bug que n&atilde;o pode ser reproduzido raramente poder&aacute;
      ser corrigido.  Se o erro ocorrer somente uma vez e voc&ecirc; n&atilde;o
      puder o reproduzir, e tudo indicar que n&atilde;o ocorre mais nigu&eacute;m,
      as chances de que nenhum dos desenvolvedores poder&aacute; reproduzi-lo 
      ou de descobrir o que est&aacute; errado s&atilde;o minimas.  Isso n&atilde;o
      significa que ele n&atilde;o aconteceu, mas significa que as possibilidades
      de seu relat&oacute;rio do problema leve a solu&ccedil;&atilde;o do problema s&atilde;o bem
      reduzidas, e voc&ecirc; deve considerar a possibilidade de deixar o 
      assunto de lado.</para>
  </section>

  <section id="pr-prep">
    <title>Prepara&ccedil;&atilde;o</title>

    <para>
      Uma boa regra a ser seguida sempre &eacute; realizar uma busca a
      respeito do assunto, antes de enviar um relat&oacute;rio de problema.
      Pode ser que o seu problema j&aacute; tenha sido reportado; pode ser
      que ele esteja sendo debatido nas listas de discuss&atilde;o, ou que o
      foi recentemente; e pode ser inclusive que ele ja foi corrigido
      em uma vers&atilde;o mais recente do que a que voce esta utilizando.
      Consequentemente voc&ecirc; deve verificar em todos os lugares &oacute;bvios 
      antes de enviar antes de enviar o rel&aacute;torio de problema.  Para o
      FreeBSD, isto significa:</para>
      
    <itemizedlist>
      <listitem>
        <para>A lista de 
          <ulink URL="../../books/faq/index.html">perguntas e
	  respostas mais frequentes</ulink> sobre o FreeBSD (FAQ).  O
	  FAQ tenta dar repostas a uma larga variedade de perguntas,
	  como aquelas que dizem respeito a 
          <ulink URL="../../books/faq/hardware.html">compatibilidade 
	  hardware</ulink>,
          <ulink URL="../../books/faq/applications.html">aplica&ccedil;&otilde;es de
	  usu&aacute;rios</ulink>, e
          <ulink URL="../../books/faq/kernelconfig.html">configura&ccedil;&atilde;o
	  do kernel</ulink>.</para>
      </listitem>

      <listitem>
        <para>As 
          <ulink
            URL="../../books/handbook/eresources.html#ERESOURCES-MAIL">
	    listas de discuss&atilde;o</ulink>&mdash; se voc&ecirc; n&atilde;o participar da 
	    lista desejada, utilize o <ulink
            URL="http://www.FreeBSD.org/search/search.html#mailinglists">
            mecanismo de busca do hist&oacute;rico</ulink> no web site do
	    FreeBSD.  Se o seu problema n&atilde;o estiver sendo discutido
	    nas listas, voc&ecirc; pode tentar enviar uma mensagem a
	    respeito dele, e aguardar alguns dias para ver se algu&eacute;m
	    menciona algo que voc&ecirc; tenha esquecido.</para>
      </listitem>

      <listitem>
        <para>
	  Opcionalmente, utilize o seu mecanismo de busca preferido
	  para fazer uma consulta a internet em geral de refer&ecirc;ncias
	  sobre o seu problema. Voc&ecirc; pode se deparar refer&ecirc;ncias a
	  arquivos de listas de discuss&atilde;o ou de grupos de noticias nos
	  quais voc&ecirc; n&atilde;o tinha nem pensado em procurar.</para>
      </listitem>

      <listitem>
        <para>
	  Na sequ&ecirc;ncia, verifique o <ulink
	  URL="http://www.FreeBSD.org/cgi/query-pr-summary.cgi?query">banco
	  de dados de relat&oacute;rios de problema do FreeBSD</ulink>
	  (GNATS).  A menos que o seu problema seja recente ou muito
	  obscuro, existe uma grande chance dele j&aacute; ter sido
	  reportado.</para>
      </listitem>

      <listitem>
        <para>
	  Finalmente, se voce estiver atualizando de uma vers&atilde;o para
	  outra &mdash; e especialmente se voc&ecirc; estiver atualizando
	  para o ramo <literal>-current</literal> voc&ecirc; deve estudar
	  cuidadosamente o conteudo do arquivo
	  <filename>/usr/src/UPDATING</filename> no seu sistema ou
	  ent&atilde;o a sua vers&atilde;o mais recente <ulink
	  URL="http://www.FreeBSD.org/cgi/cvsweb.cgi/src/UPDATING">
	  no reposit&oacute;rio CVS.</ulink>. Este arquivo cont&eacute;m muitas
	  informa&ccedil;&otilde;es vitais.</para>
      </listitem>
    </itemizedlist>

    <para>Agora, voc&ecirc; precisa ter certeza que o seu relat&oacute;rio de
      problema ir&aacute; chegar at&eacute; as pessoas corretas.</para>

    <para>
      O primeiro ponto a ser verificado &eacute; se o problema &eacute; um bug em um
      software de terceiros (um port ou um package que voc&ecirc; tenha
      instalado), se for, voc&ecirc; deve reportar o bug ao autor original e
      n&atilde;o ao Projeto FreeBSD.  Existem 2 exce&ccedil;&otilde;es a essa regra:
      A primeira &eacute; se o bug  n&atilde;o ocorre em outras plataformas, neste
      caso o problema deve ser encaminhado para a pessoa que portou o
      software para o FreeBSD; A segunda &eacute; se o autor original ja
      tiver corrigido o bug e liberado um patch ou uma nova vers&atilde;o do
      seu software, e o port para o FreeBSD n&atilde;o tiver sido atualizado
      ainda.</para>
      
    <para>
      O segundo ponto a ser verificado &eacute; que o sistema de rastreamento
      de bugs do FreeBSD ordena os relat&oacute;rios de problemas de acordo
      com a categoria que o usu&aacute;rio selecionou.  Desta forma, se voc&ecirc;
      selecionar a categoria errada quando enviar o seu relat&oacute;rio de
      problemas, existe uma boa chance que ele passe desapercebido por
      um tempo at&eacute; que alguem lhe atribua categoria correta.</para>
  </section>

  <section id="pr-writing">
    <title>Escrevendo o relat&oacute;rio de problemas</title>

    <para>
      Agora que voc&ecirc; j&aacute; decidiu que o seu assunto merece um relat&oacute;rio
      de problema, e que ele &eacute; um problema do FreeBSD, &eacute; hora de
      escrever o relat&oacute;rio sobre o seu problema atual.  Antes de
      entrarmos na mecanica do programa utilizado para gerar e enviar
      os PRs, aqui est&atilde;o algumas dicas e truques para ajud&aacute;lo a se
      certificar de que o seu PR ser&aacute; o mais efetivo possivel.</para>
    
    <section>
      <title>Dicas e truques para escrever um bom relat&oacute;rio de
      problema</title>

      <itemizedlist>
        <listitem>
          <para><emphasis>Do not leave the <quote>Synopsis</quote>
            line empty.</emphasis>  The PRs go both onto a mailing list
            that goes all over the world (where the <quote>Synopsis</quote> is used
            for the <literal>Subject:</literal> line), but also into a
            database.  Anyone who comes along later and browses the
            database by synopsis, and finds a PR with a blank subject
            line, tends just to skip over it.  Remember that PRs stay
            in this database until they are closed by someone; an
            anonymous one will usually just disappear in the
            noise.</para>
        </listitem>

        <listitem>
          <para><emphasis>Avoid using a weak <quote>Synopsis</quote>
            line.</emphasis>  You should not assume that anyone reading
            your PR has any context for your submission, so the more
            you provide, the better.  For instance, what part of the
            system does the problem apply to?  Do you only see the
            problem while installing, or while running?  To
            illustrate, instead of <literal>Synopsis: portupgrade is
            broken</literal>, see how much more informative this
            seems: <literal>Synopsis: port sysutils/portupgrade
            coredumps on -current</literal>.  (In the case of ports,
            it is especially helpful to have both the category and
            portname in the <quote>Synopsis</quote> line.)</para>
        </listitem>

        <listitem>
          <para><emphasis>If you have a patch, say so.</emphasis>
            A PR with a patch included is much more likely to be
            looked at than one without.  If you are including one,
            put the string <literal>[patch]</literal> at the
            beginning of the <quote>Synopsis</quote>.  (Although it is
            not mandatory to use that exact string, by convention,
            that is the one that is used.)</para>
        </listitem>

        <listitem>
          <para><emphasis>If you are a maintainer, say so.</emphasis>
            If you are maintaining a part of the source code (for
            instance, a port), you might consider adding the string
            <literal>[maintainer update]</literal> at the beginning of
            your synopsis line and/or set the <quote>Class</quote> of
            your PR to <literal>maintainer-update</literal>.  This way
            any committer that handles your PR will not have to check
            with the <filename>Makefile</filename> of the PR every
            time the PR is viewed to make sure this is an update sent
            by the maintainer of the port.</para>
        </listitem>

        <listitem>
          <para><emphasis>Be specific.</emphasis>
            The more information you supply about what problem you
            are having, the better your chance of getting a response.
            You should include such things as what version you are
            running (there is a place to put that, see below);
            which architecture you are running on;
            whether you are running from a release CDROM, or from
            a system maintained by &man.cvsup.1; (and, if so, how
            recently you updated); and, if a kernel problem,
            if you have read <literal>src/UPDATING</literal>
            (someone is guaranteed to ask).  You do not necessarily
            have to provide your kernel configuration, which ports
            you have available, and a core dump (including these
            by default only tends to fill up the database), but you
            should be prepared to make them available, either
            privately or publicly, if so asked.</para>
        </listitem>

        <listitem>
          <para><emphasis>Avoid vague requests for features.</emphasis>
            PRs of the form <quote>someone should really implement something
            that does so-and-so</quote> are less likely to get results than
            very specific requests.  Remember, the source is available
            to everyone, so if you want a feature, the best way to
            ensure it being included is to get to work!  Also consider
            the fact that many things like this would make a better
            topic for discussion on <literal>freebsd-questions</literal>
            than an entry in the PR database, as discussed above.</para>
        </listitem>

        <listitem>
          <para><emphasis>Make sure no one else has already submitted
            a similar PR.</emphasis> Although this has already been
            mentioned above, it bears repeating here.  It only take a
            minute or two to use the web-based search engine at
            <ulink URL="http://www.FreeBSD.org/cgi/query-pr-summary.cgi?query"></ulink>.
            (Of course, everyone is guilty of forgetting to do this
            now and then.)</para> </listitem>

        <listitem>
          <para><emphasis>Avoid controversial requests.</emphasis>
            If your PR addresses an area that has been controversial
            in the past, you should probably be prepared to not only
            offer patches, but also justification for why the patches
            are <quote>The Right Thing To Do</quote>.  As noted above,
            a careful search of the mailing lists using the archives
            at <ulink URL="http://www.FreeBSD.org/search/search.html#mailinglists"></ulink>
            is always good preparation.</para>
        </listitem>

        <listitem>
          <para><emphasis>Be polite.</emphasis>
            Almost anyone who would potentially work on your PR is a
            volunteer.  No one likes to be told that they have to do
            something when they are already doing it for some
            motivation other than monetary gain.  This is a good thing
            to keep in mind at all times on Open Source
            projects.</para>
        </listitem>
      </itemizedlist>
    </section>

    <section>
      <title>Antes de voc&ecirc; iniciar</title>

      <para>Before running the &man.send-pr.1; program, make sure your
        <envar>VISUAL</envar> (or <envar>EDITOR</envar> if
        <envar>VISUAL</envar> is not set) environment variable is set
        to something sensible.</para>

      <para>You should also make sure that mail delivery works fine.
        &man.send-pr.1; uses mail messages for the submission and
        tracking of problem reports.  If you cannot post mail messages
        from the machine you're running &man.send-pr.1; on, your
        problem report will not reach the GNATS database.  For details
        on the setup of mail on FreeBSD, see the <quote>Electronic
        Mail</quote> chapter of the FreeBSD Handbook at
        <ulink URL="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/mail.html"></ulink>.</para>
    </section>

    <section>
      <title>Anexando pachs ou arquivos</title>

      <para>The &man.send-pr.1; program has provisions for attaching
        files to a problem report.  You can attach as many files as
        you want provided that each has a unique base name (i.e. the
        name of the file proper, without the path).  Just use the
        <option>-a</option> command-line option to specify the names
        of the files you wish to attach:</para>

<screen>&prompt.user; <userinput>send-pr -a /var/run/dmesg -a /tmp/errors</userinput></screen>

      <para>Do not worry about binary files, they will be automatically
        encoded so as not to upset your mail agent.</para>

      <para>If you attach a patch, make sure you use the
        <option>-c</option> or <option>-u</option> option to
        &man.diff.1; to create a context or unified diff (unified is
        preferred), and make
        sure to specify the exact CVS revision numbers of the files
        you modified so the developers who read your report will be
        able to apply them easily.  A patch against the CURRENT or HEAD
        CVS branch is preferred since all new code should be applied
        and tested there first.  After appropriate or substantial testing
        has been done, the code will be merged/migrated to the STABLE
        branch.</para>

      <para>If you attach a patch inline, instead of as an attachment,
        note that the most common problem by far is the tendency of some
        email programs to render tabs as spaces, which will completely
        ruin anything intended to be part of a Makefile.</para>

      <para>Also note that while including small patches in a PR is
        generally all right&mdash;particularly when they fix the problem
        described in the PR&mdash;large patches and especially new code
        which may require substantial review before committing should
        be placed on a web or ftp server, and the URL should be
        included in the PR instead of the patch.  Patches in email
        tend to get mangled, especially when GNATS is involved, and
        the larger the patch, the harder it will be for interested
        parties to unmangle it.  Also, posting a patch on the web
        allows you to modify it without having to resubmit the entire
        patch in a followup to the original PR.</para>

      <para>You should also take note that unless you explicitly
        specify otherwise in your PR or in the patch itself, any
        patches you submit will be assumed to be licensed under the
        same terms as the original file you modified.</para>
    </section>

    <section>
      <title>Preenchendo o template</title>

      <para>When you run &man.send-pr.1;, you are presented with a
        template.  The template consists of a list of fields, some of
        which are pre-filled, and some of which have comments explaining
        their purpose or listing acceptable values.  Do not worry
        about the comments; they will be removed automatically if you
        do not modify them or remove them yourself.</para>

      <para>At the top of the template, below the
        <literal>SEND-PR:</literal> lines, are the email headers.  You
        do not normally need to modify these, unless you are sending
        the problem report from a machine or account that can send but
        not receive mail, in which case you will want to set the
        <literal>From:</literal> and <literal>Reply-To:</literal> to
        your real email address.  You may also want to send yourself
        (or someone else) a carbon copy of the problem report by
        adding one or more email addresses to the
        <literal>Cc:</literal> header.</para>

      <para>Next comes a series of single-line fields:</para>

      <itemizedlist>
        <listitem>
          <para><emphasis>Submitter-Id:</emphasis> Do not change this.
            The default value of <literal>current-users</literal> is
            correct, even if you run FreeBSD-STABLE.</para>
        </listitem>

        <listitem>
          <para><emphasis>Originator:</emphasis> This is normally
            prefilled with the <literal>gecos</literal> field of the
            currently logged-in
            user.  Please specify your real name, optionally followed
            by your email address in angle brackets.</para>
        </listitem>

        <listitem>
          <para><emphasis>Organization:</emphasis> Whatever you feel
            like.  This field is not used for anything
            significant.</para>
        </listitem>

        <listitem>
          <para><emphasis>Confidential:</emphasis> This is prefilled
            to <literal>no</literal>.   Changing it makes no sense as
            there is no such thing as a confidential FreeBSD problem
            report&mdash;the PR database is distributed worldwide by
            <application>CVSup</application>.</para>
        </listitem>

        <listitem>
          <para><emphasis>Synopsis:</emphasis> Fill this out with a
            short and accurate description of the problem.  The
            synopsis is used as the subject of the problem report
            email, and is used in problem report listings and
            summaries; problem reports with obscure synopses tend to
            get ignored.</para>

          <para>As noted above, if your problem report includes a patch,
            please have the synopsis start with <literal>[patch]</literal>;
            if you are a maintainer, you may consider adding
            <literal>[maintainer update]</literal> and/or set the
            <quote>Class</quote> of your PR to
            <literal>maintainer-update</literal>.</para>
        </listitem>

        <listitem>
          <para><emphasis>Severity:</emphasis> One of
            <literal>non-critical</literal>,
            <literal>serious</literal> or
            <literal>critical</literal>.  Do not overreact; refrain
            from labeling your problem <literal>critical</literal>
            unless it really is (e.g. <username>root</username> exploit, easily
            reproducible panic).  Developers tend to ignore this and
            the next field, precisely because problem report
            submitters tend to overrate their problems.</para>
        </listitem>

        <listitem>
          <para><emphasis>Priority:</emphasis> One of
            <literal>low</literal>, <literal>medium</literal> or
            <literal>high</literal>.  See above.</para>
        </listitem>

        <listitem>
          <para><emphasis>Category:</emphasis> Choose one of the
            following:</para>
          <itemizedlist>
            <listitem>
              <para><literal>advocacy:</literal> problems relating to
                FreeBSD's public image.  Rarely used.</para>
            </listitem>

            <listitem>
              <para><literal>alpha:</literal> problems specific to the
                Alpha platform.</para>
            </listitem>

            <listitem>
              <para><literal>amd64:</literal> problems specific to the
                AMD64 platform.</para>
            </listitem>

            <listitem>
              <para><literal>bin:</literal> problems with userland
                programs in the base system.</para>
            </listitem>

            <listitem>
              <para><literal>conf:</literal> problems with
                configuration files, default values etc.</para>
            </listitem>

            <listitem>
              <para><literal>docs:</literal> problems with manual pages
                or on-line documentation.</para>
            </listitem>

            <listitem>
              <para><literal>gnu:</literal> problems with GNU software
                such as &man.gcc.1; or &man.grep.1;.</para>
            </listitem>

            <listitem>
              <para><literal>i386:</literal> problems specific to the
                &i386; platform.</para>
            </listitem>

            <listitem>
              <para><literal>ia64:</literal> problems specific to the
              ia64 platform.</para>
            </listitem>

            <listitem>
              <para><literal>java:</literal> problems related to &java;.
              </para>
            </listitem>

            <listitem>
              <para><literal>kern:</literal> problems with
                kernel.</para>
            </listitem>

            <listitem>
              <para><literal>misc:</literal> anything that does not fit
                in any of the other categories.  (Note that it is
                easy for things to get lost in this category).</para>
            </listitem>

            <listitem>
              <para><literal>ports:</literal> problems relating to the
                ports tree.</para>
            </listitem>

            <listitem>
              <para><literal>powerpc:</literal> problems specific to the
                &powerpc; platform.</para>
            </listitem>

            <listitem>
              <para><literal>sparc64:</literal> problems specific to the
                &sparc64; platform.</para>
            </listitem>

            <listitem>
              <para><literal>standards:</literal> Standards conformance
               issues.</para>
             </listitem>

             <listitem>
               <para><literal>www:</literal> Changes or enhancements to
               the FreeBSD website.</para>
             </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para><emphasis>Class:</emphasis> Choose one of the
            following:</para>

          <itemizedlist>
            <listitem>
              <para><literal>sw-bug:</literal> software bugs.</para>
            </listitem>

            <listitem>
              <para><literal>doc-bug:</literal> errors in
                documentation.</para>
            </listitem>

            <listitem>
              <para><literal>change-request:</literal> requests for
                additional features or changes in existing
                features.</para>
            </listitem>

            <listitem>
              <para><literal>update:</literal> updates to ports or
                other contributed software.</para>
            </listitem>

            <listitem>
              <para><literal>maintainer-update:</literal> updates to
                ports for which you are the maintainer.</para>
            </listitem>
          </itemizedlist>
        </listitem>

        <listitem>
          <para><emphasis>Release:</emphasis> The version of FreeBSD
            that you are running.  This is filled out automatically by
            &man.send-pr.1; and need only be changed if you are
            sending a problem report from a different system than the
            one that exhibits the problem.</para>
        </listitem>
      </itemizedlist>

      <para>Finally, there is a series of multi-line fields:</para>

      <itemizedlist>
        <listitem>
          <para><emphasis>Environment:</emphasis> This should
            describe, as accurately as possible, the environment in
            which the problem has been observed.  This includes the
            operating system version, the version of the specific
            program or file that contains the problem, and any other
            relevant items such as system configuration, other
            installed software that influences the problem,
            etc.&mdash;quite simply everything a developer needs to
            know to reconstruct the environment in which the problem
            occurs.</para>
        </listitem>

        <listitem>
          <para><emphasis>Description:</emphasis> A complete and
            accurate description of the problem you are experiencing.
            Try to avoid speculating about the causes of the problem
            unless you are certain that you are on the right track, as
            it may mislead a developer into making incorrect
            assumptions about the problem.</para>
        </listitem>

        <listitem>
          <para><emphasis>How-To-Repeat:</emphasis> A summary of the
            actions you need to take to reproduce the problem.</para>
        </listitem>

        <listitem>
          <para><emphasis>Fix:</emphasis> Preferably a patch, or at
            least a workaround (which not only helps other people with
            the same problem work around it, but may also help a
            developer understand the cause for the problem), but if
            you do not have any firm ideas for either, it is better to
            leave this field blank than to speculate.</para>
        </listitem>
      </itemizedlist>
    </section>

    <section>
      <title>Enviando o relat&oacute;rio de problemas</title>

      <para>Once you are done filling out the template, have saved it,
        and exit your editor, &man.send-pr.1; will prompt you with
        <prompt>s)end, e)dit or a)bort?</prompt>.  You can then hit
        <userinput>s</userinput> to go ahead and submit the problem report,
        <userinput>e</userinput> to restart the editor and make
        further modifications, or <userinput>a</userinput> to abort.
        If you choose the latter, your problem report will remain on
        disk (&man.send-pr.1; will tell you the filename before it
        terminates), so you can edit it at your leisure, or maybe
        transfer it to a system with better net connectivity, before
        sending it with the <option>-f</option> to
        &man.send-pr.1;:</para>

<screen>&prompt.user; <userinput>send-pr -f ~/my-problem-report</userinput></screen>

      <para>This will read the specified file, validate the contents,
        strip comments and send it off.</para>
    </section>

  </section>

  <section id="pr-followup">
    <title>Acompanhamento</title>

    <para>Once your problem report has been filed, you will receive a
      confirmation by email which will include the tracking number
      that was assigned to your problem report and a URL you can use
      to check its status.  With a little luck, someone will take an
      interest in your problem and try to address it, or, as the case
      may be, explain why it is not a problem.  You will be
      automatically notified of any change of status, and you will
      receive copies of any comments or patches someone may attach to
      your problem report's audit trail.</para>

    <para>If someone requests additional information from you, or you
      remember or discover something you did not mention in the
      initial report, just mail it to
      <email>bug-followup@FreeBSD.org</email>, making sure that the
      tracking number is included in the subject so the bug tracking
      system will know what problem report to attach it to.</para>

    <para>If the problem report remains open after the problem has
      gone away, just send a follow-up (in the manner prescribed
      above) saying that the problem report can be closed, and, if
      possible, explaining how or when the problem was fixed.</para>
  </section>

  <section id="pr-further">
    <title>Leituras futuras</title>

    <para>This is a list of resources relevant to the proper writing
      and processing of problem reports.  It is by no means complete.</para>

    <itemizedlist>
      <listitem>
        <para><ulink
            url="http://www.chiark.greenend.org.uk/~sgtatham/bugs.html">
            How to Report Bugs Effectively</ulink>&mdash;an excellent
            essay by Simon G. Tatham on composing useful (non-FreeBSD-specific)
            problem reports.</para>
      </listitem>
      <listitem>
        <para><ulink
          url="../../articles/pr-guidelines/article.html">Problem
          Report Handling Guidelines</ulink>&mdash;valuable insight
          into how problem reports are handled by the FreeBSD
          developers.</para>
      </listitem>
    </itemizedlist>
  </section>
</article>

