<!--
     The FreeBSD Documentation Project

     $FreeBSD: doc/en_US.ISO8859-1/books/handbook/boot/chapter.sgml,v 1.55 2003/08/23 23:26:43 simon Exp $
-->

<chapter id="boot">
  <title>O processo de inicializa&ccedil;&atilde;o do FreeBSD</title>

  <sect1 id="boot-synopsis">
    <title>Sinópse</title>
    <indexterm><primary>booting</primary></indexterm>
    <indexterm><primary>bootstrap</primary></indexterm>

    <para>O processo de inicializa&ccedil;&atilde;o e carregamento de um computador com sistema operacional
      refere-se a um <quote>processo de inicializar</quote>, ou simplesmente
      <quote>carregar</quote>. O processo de inicializa&ccedil;&atilde;o do FreeBSD fornece uma grande flexibilidade 
      que acontece quando voc&ecirc; inicia o sistema,
      permitindo que voc&ecirc; selecione diferentes opera&ccedil;&otilde;es no sistema instalado no
      computador, ou igualar diferentes vers&otilde;es do mesmo sistema operacional
      ou do kernel instalado.</para>

    <para>Este cap&iacute;tulo detalha as op&ccedil;&otilde;es de configura&ccedil;&atilde;o que voc&ecirc; pode ajustar e
      personalizar o processo de inicializa&ccedil;&atilde;o do FreeBSD. Isto inclui tudo o que 
      acontece desde a hora do kernel do FreeBSD carregar, testar os dispositivos, e
      inicializar &man.init.8;. Se voc&ecirc; n&atilde;o souber quando isso acontece, isto
      acontece quando a cor do texto muda de branco brilhante para cinza.</para>

    <para>Depois de ler este cap&iacute;tulo, voc&ecirc; saber&aacute;:</para>

    <itemizedlist>
      <listitem>
	<para>O que os componentes do FreeBSD tiram e colocam no sistema, e como
	  eles interagem.</para>
      </listitem>

      <listitem>
	<para>As op&ccedil;&otilde;es que voc&ecirc; pode dar a componentes no FreeBSD
	  colocando ou tirando para controlar o processo de inicializa&ccedil;&atilde;o.</para>
      </listitem>
      
      <listitem>
        <para>O b&aacute;sico do &man.device.hints.5;.</para>
      </listitem>
    </itemizedlist>

    <note>
      <title>Somente x86</title>

      <para>Este cap&iacute;tulo somente descreve o processo de inicializa&ccedil;&atilde;o para FreeBSD rodando
	em sistemas Intel x86.</para>
    </note>
  </sect1>

  <sect1 id="boot-introduction">
    <title>Problema na inicializa&ccedil;&atilde;o</title>

    <para>Voltando a um computador inicializando o sistema operacional a atitude &eacute; um
      dilema interessante. Por defini&ccedil;&atilde;o, o computador n&atilde;o sabe qualquer
      coisa antes que o sistema operacional esteja iniciando. isto inclui
      rodar programas do disco. Assim se o computador n&atilde;o pode rodar um
      programa do disco sem o sistema operacional, e os programas do sistema operacional
      est&atilde;o no disco, como o sistema operacional foi inicializado?</para>

    <para>Este problema paralelo est&atilde;o no livro <citetitle>As aventuras de
      Baron Munchausen</citetitle>. Um caracter teve afastado parte way down a
      manhole, and pulled himself out by grabbing his bootstraps, and
      lifting.  Nos dias de computa&ccedil;&atilde;o o termo
      <firstterm>colocar e tirar</firstterm> foi aplicado no mecanismo usado para
      carregar o sistema operacional, que se tornou compacto para
      <quote>carregar</quote>.</para>

    <para>No hardware x86 o Sistema B&aacute;sico de Entrada/Saida (BIOS) &eacute; respons&aacute;vel
      por carregar o sistema operacional. Para fazer isto, na BIOS aparece o
      hard disk para o Master Boot Record (MBR), que deve ser alocado sobre um
      local espec&iacute;fico do disco. A BIOS tem bastante mudan&ccedil;as que podem ser feitas para carregar e
      rodar a MBR, e assume que a MBR pode ent&atilde;o carregar a saida do resto das
      tarefas involvidas na inicializa&ccedil;&atilde;o do sistema operacional.</para>

    <indexterm>
      <primary>BIOS</primary>
      <secondary>Basic Input/Output System - BIOS</secondary>
    </indexterm>

    <para>Se voc&Ecirc; tiver somente um sistema operacional instalado no seu disco ent&atilde;o
      MBR padr&atilde;o ser&aacute; suficiente. Esta MBR procurar&aacute; pela primeira parti&ccedil;&atilde;o inicializ&aacute;vel
      no disco, e entao roda o c&oacute;digo nesta parti&ccedil;&atilde;o para carregar o
      restante do sistema operacional.</para>

    <para>Se voc&ecirc; tiver instalado v&aacute;rios sistemas operacionais em seus discos ent&atilde;o
      voc&ecirc; pode instalar uma MBR diferente, um que pode mostrar uma lista de
      diferentes sistemas operacionais, e permite a voc&ecirc; escolher um para carregar.
      FreeBSD vem com um MBR que pode ser instalado, e outros
      sistemas operacionais vendidos fornecem MBRs alternativos.</para>

    <para>O restante do sistema bootstrap do FreeBSD e divido em tr&ecirc;s
      est&aacute;gios. O primeiro est&aacute;gio e executado pela MBR, que sabe apenas iniciar
      o computador em um estado espec&iacute;fico e rodar o segundo est&aacute;gio. O
      segundo est&aacute;gio pode fazer mais um peda&ccedil;o em pouco tempo, depois roda o terceiro est&aacute;gio.
      O terceiro est&aacute;gio terminar&aacute; a tarefa de carregar o sistema operacional. O
      trabalho e dividido dentro destes tr&ecirc;s est&aacute;gios porque o padr&atilde;o do PC imp&otilde;e
      limites sobre o tamanho dos programas que podem ser rodados nos est&aacute;gios 1 e
      2. Encadear as tarefas permite que o FreeBSD forne&ccedil;a um carregador mais
      flex&iacute;vel.</para>

    <indexterm><primary>kernel</primary></indexterm>
    <indexterm><primary><command>init</command></primary></indexterm>

    <para>O kernel ent&atilde;o e inicializado &eacute; esta inicializa&ccedil;&atilde;o testa os dispositivos,
      e ent&atilde;o inicializa estes para o uso. Uma vez que o processo de inicializa&ccedil;&atilde;o do kernel
      e terminado, o kernel passa o controle do processo para
      &man.init.8;, qual se certifica que os discos est&atilde;o em um estado aproveitavel.
      &man.init.8; come&ccedil;a ent&atilde;o a configura&ccedil;&atilde;o user-level que
      mounta o sistema de arquivos, seta e levanta drivers de rede para comunica&ccedil;&atilde;o com
      a mesma, e normalmente inicia todos os processos que
      s&atilde;o rodados sobre um sistema FreeBSD na inicializa&ccedil;&atilde;o.</para>
  </sect1>

  <sect1 id="boot-blocks">
    <title>A MBR, e est&aacute;gios da inicializa&ccedil;&atilde;o Um, Dois, e Tr&ecirc;s</title>

    <sect2 id="boot-boot0">
      <title>MBR, <filename>/boot/boot0</filename></title>
      <indexterm><primary>Master Boot Record (MBR)</primary></indexterm>

      <para>A MBR do FreeBSD &eacute; localizada no <filename>/boot/boot0</filename>.
	Esta &eacute; uma <emphasis>copia</emphasis> do MBR, por que a real MBR deve
	ficar em uma parte especial do disco, fora da &aacute;rea do FreeBSD.</para>

      <para><filename>boot0</filename> e muito simples, visto que o
	programa dentro da <abbrev>MBR</abbrev> pode ter no maximo o tamanho de 512 bytes.
	Se voce tiver instalado na MBR o FreeBSD e tiver instalado
	multiplos sistemas operacionais em seu HD entao voce vera um
	menu similar a este um na hora da inicializacao:</para>

      <example id="boot-boot0-example">
	<title><filename>boot0</filename> Screenshot</title>

	<screen>F1 DOS
F2 FreeBSD
F3 Linux
F4 ??
F5 Drive 1

Default: F2</screen>
      </example>

      <para>Outros sistemas operacionais, em particular &windows;&nbsp;95, tem conhecimento que
	sobscrevem informacoes ja existentes na MBR com suas proprias. Se isto acontecer a voce,
	ou voce queira substituir sua existente MBR com o FreeBSD MBR entao use
	o seguinte comando:</para>

      <screen>&prompt.root; <userinput>fdisk -B -b /boot/boot0 <replaceable>device</replaceable></userinput></screen>

      <para>Como <replaceable>dispositivo</replaceable> e o dispositivo de que voce
	carrega, como <devicename>ad0</devicename> para o primeiro disco IDE,
	<devicename>ad2</devicename> para o primeiro disco IDE da segunda
	controladora IDE, <devicename>da0</devicename> para o primeiro disco SCSI,
	e assim por diante.</para>

      <para>Se voce for um usuario  Linux, entretanto, e preferir que
	<application>LILO</application> controle o processo de inicializacao, voce pode
	editar o arquivo <filename>/etc/lilo.conf</filename> para FreeBSD, ou
	selecionar <option>Leave The Master Boot Record Untouched</option>
	durante o processo de instalacao do FreeBSD. Se voce tiver instalado o
	gerenciador de boot do FreeBSD, voce pode carregar dentro do Linux e modificar o
	<application>LILO</application> no arquivo de configuracao
	<filename>/etc/lilo.conf</filename> e adicionar a seguinte
	opcao:</para>

      <programlisting>other=/dev/hdXY
table=/dev/hdb
loader=/boot/chain.b
label=FreeBSD</programlisting>

      <para>Qual permitira a inicializacao do FreeBSD e Linux via
	<application>LILO</application>. Em outro exemplo, nos usamos
	<replaceable>XY</replaceable> para determinar o numero do drive e
	particao. Se estiver usando um drive <acronym>SCSI</acronym>, voce
	ira querer mudar o <replaceable>/dev/hdXY</replaceable> para leitura
	algo similar a <replaceable>/dev/sdXY</replaceable>, com
	novamente usando a sintase <replaceable>XY</replaceable>. O
	<option>loader=/boot/chain.b</option> pode ser omitido se voce tiver
	ambos os sistemas operacionais na mesma particao. Voce pode agora rodar
	<command>/sbin/lilo -v</command> para executar suas novas alteracoes no
	sistema, este deve ser verificado com messagens na tela.</para>
    </sect2>
  
    <sect2 id="boot-boot1">
      <title>Estagio Um, <filename>/boot/boot1</filename>, e Estagio Dois,
	<filename>/boot/boot2</filename></title>
      
      <para>Conceitual o primeiro e segundo estagios sao parte do mesmo
	programa, sobre a mesma area do disco. Por que do espaco contido
	eles foram divididos em duas partes, mas voce deve instala-los juntos.</para>

      <para>Eles sao encontrados no setor de inicializacao, 
	que e onde <link
	  linkend="boot-boot0">boot0</link>, ou alguns outros programas na
	<abbrev>MBR</abbrev> espera encontrar um programa para rodar
	continuar o processo de carga. O arquivo no diretorio
	<filename>/boot</filename> sao copiados dos arquivos reais,
	que sao armazenados fora do sistema de arquivos do FreeBSD.</para>

      <para><filename>boot1</filename> e muito simples, desde tambem possa
	somente ser 512 bytes
	de tamanho, e sabemos justamente para o
	<firstterm>disklabel</firstterm> do FreeBSD, com informacoes armazenadas
	no silindro, para procurar e executar o <filename>boot2</filename>.</para>
      
      <para><filename>boot2</filename> e ligeiramente mais sofisticado, e compreende
	bastante o sistema de arquivos do FreeBSD para procurar arquivos nele, e pode
	fornecer uma simples interface para escolher o kernel ou o carregador para
	executar.</para>

      <para>Desde o <link linkend="boot-loader">carregador</link> e
	mais sofisticado, e forncecido um boa facil-para-usar
	configuracao de inicializacao, <filename>boot2</filename> usualmente executa
	isto, mas previamente isto
	era tarefa para executar diretamente no kernel.</para>

      <example id="boot-boot2-example">
	<title><filename>boot2</filename> Screenshot</title>

	<screen>&gt;&gt; FreeBSD/i386 BOOT
Default: 0:ad(0,a)/kernel
boot:</screen>
      </example>

      <para>Se voce precisar sempre substituir a instalacao
	<filename>boot1</filename> e <filename>boot2</filename> use
	&man.disklabel.8;.</para>
      
      <screen>&prompt.root; <userinput>disklabel -B <replaceable>diskslice</replaceable></userinput></screen>

      <para>Onde <replaceable>diskslice</replaceable> e o disco e silindro
	da sua inicializacao, tal como <devicename>ad0s1</devicename> para o primeiro
	HD sobre a IDE.</para>

      <warning>
	<title>Modalidade Perigosamente Dedicada</title>

	<para>Se voce usar apenas o nome do disco, tal como
	  <devicename>ad0</devicename>, no &man.disklabel.8; comando voce
	  ira criar um disco perigosamente dedicado, sem particoes.  Isto nao
	  devera ser o que voce quer fazer, assim que voce verificar o dobro
	  do &man.disklabel.8; depois voce devera pressionar
	  <keycap>Return</keycap>.</para>
      </warning>
    </sect2>

  <sect2 id="boot-loader">
    <title>Estagio tres, <filename>/boot/loader</filename></title>

    <indexterm><primary>boot-loader</primary></indexterm>
    <para>A inicializacao e o estagio final dos tres-estagios
      de bootstrap, e e localizado no sistema de arquivos, usualmente como
      <filename>/boot/loader</filename>.</para>
      
    <para>A inicializacao e usada como um metodo amigavel para
      configuracao, usando um jogo de comandos internos facil-para-usar,
      voltado por um interpretador mais poderoso, com um jogo de comandos mais complexo.</para> 

    <sect3 id="boot-loader-flow">
      <title>Fluxo de programa do carregador</title>
      
      <para>Durante a initializacao, o carregador sodara para uma
	console e para discos, e figura de saida de que os discos sao 
	carregados. Isto setara variaveis conformemente, e um
	interpretador e iniciado onde os comandos do usuario podem ser passados de 
        um script ou interativamente.</para>
      <indexterm><primary>carregados</primary></indexterm>
      <indexterm><primary>carregados na configuracao</primary></indexterm>

      <para>Entao o carregador lera entao o
	<filename>/boot/loader.rc</filename>, que por padrao le
	dentro de  <filename>/boot/defaults/loader.conf</filename> que
	seta padroes para variaveis e leen em 
	<filename>/boot/loader.conf</filename> para mudanca destas variaveis locais.
	<filename>loader.rc</filename> eles atuam
	sobre estas variaveis, carregando qualquer modulo e kernel que sao
	selecionados.</para>

      <para>Finalmente, por padrao, o carregador emite uma espera de  10 segundos
	para precionar alguma tecla, e carregar o kernel se este nao for interrompido.
	Se interrompido, ao usuario e apresentado um alerta no prompt que e para
	entender o facil-para-usar o comando setado, onde o usuario pode
	ajustar variaveis, descarregar todos os modulos, carregar modulos, e eles
	finalmente carregar ou reiniciar.</para>

    </sect3>
    
    <sect3 id="boot-loader-commands">
      <title>Comandos Carregando e Compilando</title>
      
      <para>Estes sao os comandos mais comum usados na carga do sistema. Para uma
        completa discussao de todas avaliacoes dos comandos, por favor veja
        &man.loader.8;.</para>

      <variablelist>
	<varlistentry>
	  <term>auto carregamento <replaceable>segundos</replaceable></term>

	  <listitem>
	    <para>O processo de carregamento do kernel nao e interrompido
	      durante o tempo concedido, em segundos. Isto mostra uma
	      contagem regrassiva, e o tempo padrao concedido e 10
	      segundos.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>boot
	    <optional><replaceable>-options</replaceable></optional>
	    <optional><replaceable>kernelname</replaceable></optional></term>

	  <listitem>
	    <para>Imediatamente o processo de carregamento do kernel, com as
	      opcoes dadas, se existir, e com o nome do kernel dado,
	      se isto for.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>boot-conf</term>

	  <listitem>
	    <para>Ir atraves da mesma configuracao automatica dos
	      modulos baseados em variaveis como que acontece no boot.
	      Isto somente faz sentido se voce primeiramente
	      <command>descarregar</command>, e alterar algumas
	      variaveis, do <envar>kernel</envar> mais frequente.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>help
	    <optional><replaceable>topico</replaceable></optional></term>

	  <listitem>
	    <para>Mensagens de ajuda soa lidas em
	      <filename>/boot/loader.help</filename>. Se o topico
	      dado for <literal>index</literal>, entao a lista de
	      topicos disponiveis e dada.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>include <replaceable>filename</replaceable>
	    &hellip;</term>

	  <listitem>
	    <para>Processa o arquivo com o nome dado ao mesmo. O
	      arquivos e lido, e interpretado linha por linha. Um
	      erro immediatamente para o comando de inclusao.</para>
	  </listitem>
	</varlistentry>
	<varlistentry>
	  <term>load <optional><option>-t</option>
	    <replaceable>type</replaceable></optional>
	    <replaceable>filename</replaceable></term>

	  <listitem>
	    <para>Carregar o kernel, kernel modular, ou arquivo do
	      tipo preparado, com o nome dado. Alguns argumentos
	      depois do nome do arquivo sao passados para o arquivo.</para>
	  </listitem>
	</varlistentry>
	<varlistentry>
	  <term>ls <optional><option>-l</option></optional>
	    <optional><replaceable>path</replaceable></optional></term>

	  <listitem>
	    <para>Mostra uma lista de arquivos dentro dos caminhos dados, ou
	      o diretorio do root, se o caminho nao e especificado. Se e especificado
	      <option>-l</option>, tamanho do arquivo sera
	      mostrado tambem.</para>
	  </listitem>
	</varlistentry>
	<varlistentry>
	  <term>lsdev <optional><option>-v</option></optional></term>

	  <listitem>
	    <para>Lista todos os dispositivos que pode ser possivel
	      para carregar modulos. Se <option>-v</option> e
	      especificado, mais detalhes serao mostrados.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>lsmod <optional><option>-v</option></optional></term>

	  <listitem>
	    <para>Mostra modulos carregados. Se <option>-v</option> e
	      especificado, mais detalhes serao mostrados.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>more <replaceable>filename</replaceable></term>

	  <listitem>
	    <para>Mostra os arquivos especificados, com uma pausa em cada
	      <varname>LINHA</varname> mostrada.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>reboot</term>

	  <listitem>
	    <para>Imediatamente reiniciara o sistema.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>set <replaceable>variable</replaceable></term>
	  <term>set
	    <replaceable>variable</replaceable>=<replaceable>value</replaceable></term>

	  <listitem>
	    <para>Seta as variaveis do ambiente do carregador.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>unload</term>

	  <listitem>
	    <para>Remove todos modulos carregados.</para>
	  </listitem>
	</varlistentry>
      </variablelist>
    </sect3>

    <sect3 id="boot-loader-examples">
      <title>Exemplos de carregador</title>

      <para>Estao aqui alguns exemplos praticos do uso do carregador:</para>

      <itemizedlist>
	<indexterm><primary>single-user mode</primary></indexterm>
	<listitem>
	  <para>Para simplesmente carregar seu kernel usual, mas em modo usuario-singular:</para>

	  <screen><userinput>boot -s</userinput></screen>
	</listitem>

	<listitem>
	  <para>Para descarregar seu kernel e modulos usuais, e entao
	    carregar apenas seu kernel velho (ou outro):</para>
    <indexterm>
      <primary><filename>kernel.old</filename></primary>
    </indexterm>

	  <screen><userinput>unload</userinput>
<userinput>load <replaceable>kernel.old</replaceable></userinput></screen>

	  <para>Voce pode usar o <filename>kernel.GENERIC</filename> para
	    referir ao kernel generico que vem no disco instalado,
	    ou <filename>kernel.old</filename> para consultar 
	    seu kernel previamente instalado (quando voce tiver atualizado
	    ou configurado seu kernel, por exemplo).</para>

	  <note>
	    <para>Use o seguinte para carregar seus modulos usuais com
	      outro kernel:</para>

	    <screen><userinput>unload</userinput>
<userinput>set kernel="<replaceable>kernel.old</replaceable>"</userinput>
<userinput>boot-conf</userinput></screen></note>
	</listitem>

	<listitem>
	  <para>Para carregar um script de configuracao do kernel (um script automatizado
	    qual faca as coisas que voce faria normalmente dentro do
	    kernel na configuracao do boot-time):</para>

	  <screen><userinput>load -t userconfig_script <replaceable>/boot/kernel.conf</replaceable></userinput></screen>
	</listitem>
      </itemizedlist>
  </sect3>
    </sect2>
  </sect1>

  <sect1 id="boot-kernel">
    <title>Interacao do Kernel durante o boot</title>
    <indexterm>
      <primary>kernel</primary>
      <secondary>interacao do boot</secondary>
    </indexterm>
    
    <para>Uma vez que o kernel e carregado pelo either <link
	linkend="boot-loader">loader</link> (como usado) ou <link
	linkend="boot-boot1">boot2</link> (passando o carregador), isto
      examina suas boot flags, se existir, e ajusta seu comportamento como
      necessario.</para>

    <sect2 id="boot-kernel-bootflags">
      <indexterm>
        <primary>kernel</primary>
        <secondary>bootflags</secondary>
      </indexterm>
      <title>Kernel Boot Flags</title>

      <para>Estao aqui as boot flags mais comuns:</para>

      <variablelist id="boot-kernel-bootflags-list">
	<varlistentry>
	  <term><option>-a</option></term>

	  <listitem>
	    <para>durante a inicializacao do kernel, pede para o dispositivo
	      para montar um arquivo de sistema do root.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><option>-C</option></term>

	  <listitem>
	    <para>boot do CDROM.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><option>-c</option></term>

	  <listitem>
	    <para>rode UserConfig, o configurador do boot-time kernel</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><option>-s</option></term>

	  <listitem>
	    <para>boot dentro usando o modo single-user</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><option>-v</option></term>

	  <listitem>
	    <para>seja mais verbose durante a inicializacao do kernel</para>
	  </listitem>
	</varlistentry>
      </variablelist>

      <note>
	<para>Existem outras boot flags, leia &man.boot.8; para maiores
	  informacoes sobre elas.</para></note>
    </sect2>

<!--    <sect2 id="boot-kernel-userconfig">
      <title>UserConfig: o configurador do  Boot-time do Kernel</title>
      
      <para> </para>
    </sect2> -->
  </sect1>
  
  <sect1 id="device-hints">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Tom</firstname>
	  <surname>Rhodes</surname>
	  <contrib>Contribuido por </contrib>
	</author>
      </authorgroup>
      <!-- 18 OCT 2002 -->
    </sect1info>
    <indexterm>
      <primary>device.hints</primary>
    </indexterm>
    <title>Dispositivos Hints</title>

    <note><para>Esta e uma caracteristica do FreeBSD&nbsp;5.0 e posteriores que nao 
      existe em versoes atrasadas.</para></note>

    <para>Durante a inicializacao do sistema, o boot &man.loader.8; ira ler o arquivo
      &man.device.hints.5;. Este arquivo armazena informacoes do boot do kernel 
      conhecidas como variaveis, sobretudo referenciando as vezes <quote>device hints</quote>.
      Estas <quote>device hints</quote> sao usadas pelos drivers do dispositivo para configuraracao
      do dispositivo.</para>
      
    <para>Device hints podem tambem ser especificados no <link linkend="boot-loader">
      estagio 3 no prompt de inicializacao</link>. Variaveis podem ser adicionadas usando
      comando <command>set</command>, removidas com o comando <command>unset</command>, e visualizadas
      com o comando <command>show</command>. Variaveis setadas dentro do arquivo
      <filename>/boot/device.hints</filename> podem ser canceladas aqui tambem. Device hints incorporadas no
      boot nao sao permanentes e serao perdidas na proxima 
      inicializacao.</para>

    <para>Uma vez que o sistema e carregado, o comando &man.kenv.1; pode ser usado para
      dump todas as variaveis.</para>

    <para>A sintaxe para o arquivo <filename>/boot/device.hints</filename> e uma variavel por linha, usando
      a mistura padrao <quote>#</quote> como marcadores do comentario. Linhas sao
      construidas como segue:</para>

    <screen><userinput>hint.driver.unit.keyword="<replaceable>value</replaceable>"</userinput></screen>

    <para>A sintaxe para o estagio 3 do boot loader e:</para>
    <screen><userinput>set hint.driver.unit.keyword=<replaceable>value</replaceable></userinput></screen>

    <para><literal>driver</literal> e o nome do dispositivo, <literal>unit</literal>
      e o numero do driver dispositivo, e <literal>keyword</literal> e a sugestao
      keyword. O keyword pode consistir nas seguintes opcoes:</para>

    <itemizedlist>
      <listitem>
	<para><literal>at</literal>: especifica o dispositivo para o qual e anexado.</para>
      </listitem>

      <listitem>
	<para><literal>port</literal>: especifica o endereco de inicio do <acronym>I/O</acronym>
	  para ser usado.</para>
      </listitem>

      <listitem>
	<para><literal>irq</literal>: especifica o numero da interrupcao requerida para ser usado.</para>
      </listitem>

      <listitem>
	<para><literal>drq</literal>: especifica o numero do canal DMA.</para>
      </listitem>

      <listitem>
	<para><literal>maddr</literal>: especifica o endereco fisico da memoria ocupado pelo
	  dispositivo.</para>
      </listitem>

      <listitem>
	<para><literal>flags</literal>: seta variacoes de bits de flags para o dispositivos.</para>
      </listitem>

      <listitem>
	<para><literal>disabled</literal>: if set to <literal>1</literal> the device is disabled.</para>
      </listitem>
    </itemizedlist>

    <para>Os drivers do dispositivo podem ou nao aceitar (se requerido) mais hints nao listadas aqui, veja
      a pagina do manual deles e recomendado. Para maiores informacoes, consulte o
      &man.device.hints.5;, &man.kenv.1;, &man.loader.conf.5;, e &man.loader.8;
      paginas de manuais.</para>
  </sect1>

  <sect1 id="boot-init">
    <indexterm>
      <primary><command>init</command></primary>
    </indexterm>
    <title>Init: Inicializacao do controle de processos</title>
	
    <para>Uma vez que o kernel termina o boot, isto passa para controle
      dos processos do usuario &man.init.8;, que e localizado no
      <filename>/sbin/init</filename>, ou o caminho do programa especificado
      em <envar>init_path</envar> variavel dentro da
      <command>inicializacao</command>.</para>

    <sect2 id="boot-autoreboot">
      <title>Sequencia automatica de Reinicializacao</title>
      
      <para>A sequencia de reinicializacao aautomatica certifica-se que o
	sistema de arquivos disponiveis sobre o sistema sao consistentes. Se eles
	nao sao, e &man.fsck.8; nao podem reparar
	as inconsistencias, &man.init.8; deixe o sistema
	em <link linkend="boot-singleuser">modo single-user</link>
	para que o administrador do sistema tome cuidado dos problemas
	diretamente.</para>
    </sect2>

    <sect2 id="boot-singleuser">
      <title>Single-User Mode</title>
      <indexterm><primary>single-user mode</primary></indexterm>
      <indexterm><primary>console</primary></indexterm>
      
      <para>Este modo pode ser acessado <link
	  linkend="boot-autoreboot">automaticamente na sequencia da reinicializacao
	  </link>, ou pelo usuario na inicializacao com a opcao
	<option>-s</option> ou configuracao do
	<envar>boot_single</envar> variavel dentro do
	<command>loader</command>.</para>

      <para>Isto pode ser utilizado chamando
	&man.shutdown.8; sem utilizar as opcoes de rebootar
	(<option>-r</option>) ou parar (<option>-h</option>),
	do <link linkend="boot-multiuser">modo multi-user
	 </link>.</para>

      <para>Se a <literal>console</literal> do sistema for setada
	para <literal>insecure</literal> em <filename>/etc/ttys</filename>,
	entao os prompts do sistema depois do password do <username>root</username>
	e inicializado o modo single-user.</para>

      <example id="boot-insecure-console">
	<title>Um Insecure Console em <filename>/etc/ttys</filename></title>

	<programlisting># name  getty                           type    status          comments
#
# If console is marked "insecure", then init will ask for the root password
# when going to single-user mode.
console none                            unknown off insecure</programlisting>
      </example>

      <note>
	<para>Uma console <literal>insecure</literal> significa que voce
	  considera sua seguranca fisica para a console ser
	  insecure, e quiser para fazer isto somente quem saiba a senha do
	  <username>root</username> pode usar o modo single-user, e isto
	  nao nao dignifica que voce pode rodar sua console insecurely. Assim,
	  se voce quiser seguranca, escolha <literal>insecure</literal>,
	  nao <literal>secure</literal>.</para>
      </note>
    </sect2>
    
    <sect2 id="boot-multiuser">
      <title>Multi-User Mode</title>
      <indexterm><primary>multi-user mode</primary></indexterm>
      
      <para>Se &man.init.8; encontra seus arquivos de sistema para ser
	em ordem, ou uma vez que o usuario terminou em <link
	  linkend="boot-singleuser">modo single-user</link>, o
	sistema entra em modo  multi-user, onde comeca a
	configuracao dos recursos do sistema.</para>

      <sect3 id="boot-rc">
      <indexterm><primary>arquivos rc</primary></indexterm>
	<title>Recursos de Configuracao (rc)</title>

	<para>O recurso de configuracao do sistema le dentro
	  configuracoes padroes do
	  <filename>/etc/defaults/rc.conf</filename>, e o
	  sistema-especifica detalhes do
	  <filename>/etc/rc.conf</filename>, e entao procede a
	  mountagem do sistema de arquivos mencionados em
	  <filename>/etc/fstab</filename>, iniciando os servicos da rede,
	  inicializando varios daemons do sistema, e
	  finalmente executando os scripts de inicializacao de pacotes instalados
	  localmente.</para>

	<para>A pagina do manual &man.rc.8; e uma boa referencia para o recurso de
	  configuracao do sistema, como sao examinados os scripts
	  themselves.</para>
      </sect3>
    </sect2>
  </sect1>

  <sect1 id="boot-shutdown">
    <title>Sequencia do Shutdown</title>
    <indexterm>
      <primary><command>shutdown</command></primary>
    </indexterm>

    <para>Sob controle o shutdown, via &man.shutdown.8;,
      &man.init.8; tentara rodar o script
      <filename>/etc/rc.shutdown</filename>, e entao proceder o envio de
      todos os processos do <literal>TERM</literal>, e subsequente 
      do <literal>KILL</literal> tambem alguns que nao terminarem 
      timely.</para>

    <para>Para suportar baixar uma maquina FreeBSD sobre arquiteturas e sistemas
      que suportam power management, simplesmente use o comando
      <command>shutdown -p now</command> para turnar power off
      imediatamente. Para justamente reboot o sistema FreeBSD, justamente use
      <command>shutdown -r now</command>. Voce necessitara ser
      <username>root</username> ou um membro do
      grupo <groupname>operator</groupname> para rodar &man.shutdown.8;.
      O &man.halt.8; e comandos &man.reboot.8; podem ate ser usados,
      consultando por favor seus manuais de referencia e &man.shutdown.8; 
      para maiores informacoes.</para>

    <note>
      <para>Power management requer &man.acpi.4; suporte no kernel
	ou carregar algum modulo para FreeBSD&nbsp;5.X e &man.apm.4;
	suporte para FreeBSD&nbsp;4.X.</para>
    </note>

  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->

