<!--
     The FreeBSD Documentation Project

     $FreeBSD: doc/en_US.ISO8859-1/books/handbook/boot/chapter.sgml,v 1.55 2003/08/23 23:26:43 simon Exp $
-->

<chapter id="boot">
  <title>O processo de inicializa&ccedil;&atilde;o do FreeBSD</title>

  <sect1 id="boot-synopsis">
    <title>Sinópse</title>
    <indexterm><primary>booting</primary></indexterm>
    <indexterm><primary>bootstrap</primary></indexterm>

    <para>O processo de inicializa&ccedil;&atilde;o e carregamento de um computador com sistema operacional
      refere-se a um <quote>processo de inicializar</quote>, ou simplesmente
      <quote>carregar</quote>. O processo de inicializa&ccedil;&atilde;o do FreeBSD fornece uma grande flexibilidade 
      que acontece quando voc&ecirc; inicia o sistema,
      permitindo que voc&ecirc; selecione diferentes opera&ccedil;&otilde;es no sistema instalado no
      computador, ou igualar diferentes vers&otilde;es do mesmo sistema operacional
      ou do kernel instalado.</para>

    <para>Este cap&iacute;tulo detalha as op&ccedil;&otilde;es de configura&ccedil;&atilde;o que voc&ecirc; pode ajustar e
      personalizar o processo de inicializa&ccedil;&atilde;o do FreeBSD. Isto inclui tudo o que 
      acontece desde a hora do kernel do FreeBSD carregar, testar os dispositivos, e
      inicializar &man.init.8;. Se voc&ecirc; n&atilde;o souber quando isso acontece, isto
      acontece quando a cor do texto muda de branco brilhante para cinza.</para>

    <para>Depois de ler este cap&iacute;tulo, voc&ecirc; saber&aacute;:</para>

    <itemizedlist>
      <listitem>
	<para>O que os componentes do FreeBSD tiram e colocam no sistema, e como
	  eles interagem.</para>
      </listitem>

      <listitem>
	<para>As op&ccedil;&otilde;es que voc&ecirc; pode dar a componentes no FreeBSD
	  colocando ou tirando para controlar o processo de inicializa&ccedil;&atilde;o.</para>
      </listitem>
      
      <listitem>
        <para>O b&aacute;sico do &man.device.hints.5;.</para>
      </listitem>
    </itemizedlist>

    <note>
      <title>Somente x86</title>

      <para>Este cap&iacute;tulo somente descreve o processo de inicializa&ccedil;&atilde;o para FreeBSD rodando
	em sistemas Intel x86.</para>
    </note>
  </sect1>

  <sect1 id="boot-introduction">
    <title>Problema na inicializa&ccedil;&atilde;o</title>

    <para>Voltando a um computador inicializando o sistema operacional a atitude &eacute; um
      dilema interessante. Por defini&ccedil;&atilde;o, o computador n&atilde;o sabe qualquer
      coisa antes que o sistema operacional esteja iniciando. isto inclui
      rodar programas do disco. Assim se o computador n&atilde;o pode rodar um
      programa do disco sem o sistema operacional, e os programas do sistema operacional
      est&atilde;o no disco, como o sistema operacional foi inicializado?</para>

    <para>Este problema paralelo est&atilde;o no livro <citetitle>As aventuras de
      Baron Munchausen</citetitle>. Um caracter teve afastado parte way down a
      manhole, and pulled himself out by grabbing his bootstraps, and
      lifting.  Nos dias de computa&ccedil;&atilde;o o termo
      <firstterm>colocar e tirar</firstterm> foi aplicado no mecanismo usado para
      carregar o sistema operacional, que se tornou compacto para
      <quote>carregar</quote>.</para>

    <para>No hardware x86 o Sistema B&aacute;sico de Entrada/Saida (BIOS) &eacute; respons&aacute;vel
      por carregar o sistema operacional. Para fazer isto, na BIOS aparece o
      hard disk para o Master Boot Record (MBR), que deve ser alocado sobre um
      local espec&iacute;fico do disco. A BIOS tem bastante mudan&ccedil;as que podem ser feitas para carregar e
      rodar a MBR, e assume que a MBR pode ent&atilde;o carregar a sa&iacute;da do resto das
      tarefas envolvidas na inicializa&ccedil;&atilde;o do sistema operacional.</para>

    <indexterm>
      <primary>BIOS</primary>
      <secondary>Basic Input/Output System - BIOS</secondary>
    </indexterm>

    <para>Se voc&ecirc; tiver somente um sistema operacional instalado no seu disco ent&atilde;o a
      MBR padr&atilde;o ser&aacute; suficiente. Esta MBR procurar&aacute; pela primeira parti&ccedil;&atilde;o inicializ&aacute;vel
      no disco, e entao roda o c&oacute;digo nesta parti&ccedil;&atilde;o para carregar o
      restante do sistema operacional.</para>

    <para>Se voc&ecirc; tiver instalado v&aacute;rios sistemas operacionais em seus discos ent&atilde;o
      voc&ecirc; pode instalar uma MBR diferente, que possa mostrar uma lista de
      diferentes sistemas operacionais, e permitir a voc&ecirc; escolher um para carregar.
      FreeBSD vem com um MBR que pode ser instalado, e outros
      sistemas operacionais vendidos fornecem MBRs alternativos.</para>

    <para>O restante do sistema bootstrap do FreeBSD &eacute; divido em tr&ecirc;s
      est&aacute;gios. O primeiro est&aacute;gio &eacute; executado pela MBR, que sabe apenas iniciar
      o computador em um estado espec&iacute;fico e rodar o segundo est&aacute;gio. O
      segundo est&aacute;gio pode fazer mais um peda&ccedil;o em pouco tempo, depois roda o terceiro est&aacute;gio.
      O terceiro est&aacute;gio terminar&aacute; a tarefa de carregar o sistema operacional. O
      trabalho &eacute; dividido dentro destes tr&ecirc;s est&aacute;gios porque o padr&atilde;o do PC imp&otilde;e
      limites sobre o tamanho dos programas que podem ser rodados nos est&aacute;gios 1 e
      2. Encadear as tarefas permite que o FreeBSD forne&ccedil;a um carregador mais
      flex&iacute;vel.</para>

    <indexterm><primary>kernel</primary></indexterm>
    <indexterm><primary><command>init</command></primary></indexterm>

    <para>O kernel ent&atilde;o &eacute; inicializado e come&ccedil;a a testar os dispositivos,
      e ent&atilde;o inicializa estes para o uso. Uma vez que o processo de inicializa&ccedil;&atilde;o do kernel
      &eacute; terminado, o kernel passa o controle do processo para
      &man.init.8;, qual se certifica que os discos est&atilde;o em um estado aproveitavel.
      &man.init.8; come&ccedil;a ent&atilde;o a configura&ccedil;&atilde;o a n&iacute;vel-de-usu&aacute;rio que
      monta o sistema de arquivos, seta e levanta drivers de rede para comunica&ccedil;&atilde;o com
      a mesma, e normalmente inicia todos os processos que
      s&atilde;o rodados sobre um sistema FreeBSD na inicializa&ccedil;&atilde;o.</para>
  </sect1>

  <sect1 id="boot-blocks">
    <title>A MBR, e os est&aacute;gios de inicializa&ccedil;&atilde;o Um, Dois, e Tr&ecirc;s</title>

    <sect2 id="boot-boot0">
      <title>MBR, <filename>/boot/boot0</filename></title>
      <indexterm><primary>Master Boot Record (MBR)</primary></indexterm>

      <para>A MBR do FreeBSD &eacute; localizada no <filename>/boot/boot0</filename>.
	Esta &eacute; uma <emphasis>c&oacute;pia</emphasis> do MBR, por que a real MBR deve
	ficar em uma parte especial do disco, fora da &aacute;rea do FreeBSD.</para>

      <para><filename>boot0</filename> &eacute; muito simples, visto que o
	programa dentro da <abbrev>MBR</abbrev> pode ter no m&aacute;ximo 512 bytes.
	Se voc&ecirc; tiver instalado na MBR o FreeBSD e instalado
	m&uacute;ltiplos sistemas operacionais em seu HD ent&atilde;o voc&ecirc; vera um
	menu similar a este na hora da inicializa&ccedil;&atilde;o:</para>

      <example id="boot-boot0-example">
	<title><filename>boot0</filename> Screenshot</title>

	<screen>F1 DOS
F2 FreeBSD
F3 Linux
F4 ??
F5 Drive 1

Default: F2</screen>
      </example>

      <para>Outros sistemas operacionais, em particular &windows;&nbsp;95, tem conhecimento que
	sobscrevem informa&ccedil;&otilde;es j&aacute; existentes na MBR com suas pr&oacute;prias. Se isto acontecer a voc&ecirc;,
	ou voc&ecirc; queira substituir sua MBR existente com o FreeBSD MBR ent&atilde;o use
	o seguinte comando:</para>

      <screen>&prompt.root; <userinput>fdisk -B -b /boot/boot0 <replaceable>device</replaceable></userinput></screen>

      <para>Onde <replaceable>device</replaceable> &eacute; o dispositivo que voc&ecirc;
	carrega, como <devicename>ad0</devicename> para o primeiro disco IDE,
	<devicename>ad2</devicename> para o primeiro disco IDE da segunda
	controladora IDE, <devicename>da0</devicename> para o primeiro disco SCSI,
	e assim por diante.</para>

      <para>Se voc&ecirc; for um usu&aacute;rio Linux, entretanto, e preferir que o
	<application>LILO</application> controle o processo de inicializa&ccedil;&atilde;o, voc&ecirc; pode
	editar o arquivo <filename>/etc/lilo.conf</filename> para FreeBSD, ou
	selecionar <option>Leave The Master Boot Record Untouched</option>
	durante o processo de instala&ccedil;&atilde;o do FreeBSD. Se voc&ecirc; tiver instalado o
	gerenciador de boot do FreeBSD, voc&ecirc; pode carregar dentro do Linux e modificar o
	<application>LILO</application> no arquivo de configura&ccedil;&atilde;o
	<filename>/etc/lilo.conf</filename> e adicionar a seguinte
	op&ccedil;&atilde;o:</para>

      <programlisting>other=/dev/hdXY
table=/dev/hdb
loader=/boot/chain.b
label=FreeBSD</programlisting>

      <para>o qual permitir&aacute; a inicializa&ccedil;&atilde;o do FreeBSD e Linux via
	<application>LILO</application>. Em outro exemplo, n&oacute;s usamos
	<replaceable>XY</replaceable> para determinar o n&uacute;mero do drive e da
	parti&ccedil;&atilde;o. Se estiver usando um drive <acronym>SCSI</acronym>, voc&ecirc;
	ir&aacute; querer mudar o <replaceable>/dev/hdXY</replaceable> para leitura
	algo similar a <replaceable>/dev/sdXY</replaceable>,
	novamente usando a sintaxe <replaceable>XY</replaceable>. O
	<option>loader=/boot/chain.b</option> pode ser omitido se voc&ecirc; tiver
	ambos os sistemas operacionais na mesma parti&ccedil;&atilde;o. Voc&ecirc; pode agora rodar
	<command>/sbin/lilo -v</command> para executar suas novas altera&ccedil;&otilde;es no
	sistema, este deve ser verificado com mensagens na tela.</para>
    </sect2>
  
    <sect2 id="boot-boot1">
      <title>Est&aacute;gio Um, <filename>/boot/boot1</filename>, e Est&aacute;gio Dois,
	<filename>/boot/boot2</filename></title>
      
      <para>Conceitualmente o primeiro e segundo est&aacute;gios s&atilde;o parte do mesmo
	programa, sobre a mesma &aacute;rea do disco. Devido o espa&ccedil;o contido
	eles foram divididos em duas partes, mas voc&ecirc; deve instal&aacute;-los juntos.</para>

      <para>Eles s&atilde;o encontrados no setor de inicializa&ccedil;&atilde;o, 
	que &eacute; onde <link
	  linkend="boot-boot0">boot0</link>, ou alguns outros programas na
	<abbrev>MBR</abbrev> espera encontrar um programa para rodar
	continuar o processo de carga. O arquivo no diret&oacute;rio
	<filename>/boot</filename> s&atilde;o c&oacute;pias dos arquivos reais,
	que s&atilde;o armazenados fora do sistema de arquivos do FreeBSD.</para>

      <para><filename>boot1</filename> &eacute; muito simples, este tamb&eacute;m pode
	somente ter o tamanho m&aacute;ximo de 512 bytes,
	e sabemos que justamente para o
	<firstterm>disklabel</firstterm> do FreeBSD, com informa&ccedil;&otilde;es armazenadas
	no <foreignphrase>slice</foreignphrase>, para procurar e executar o <filename>boot2</filename>.</para>
      
      <para><filename>boot2</filename> &eacute; ligeiramente mais sofisticado, e compreende
	bastante o sistema de arquivos do FreeBSD para procurar arquivos nele, e pode
	fornecer uma rela&ccedil;&atilde;o simples para escolher o kernel ou o carregador para
	executar.</para>

      <para>Desde o <link linkend="boot-loader">carregador</link>
	mais sofisticado, &eacute; forncecido uma boa ajuda na
	configura&ccedil;&atilde;o de inicializa&ccedil;&atilde;o, <filename>boot2</filename> usualmente executa
	isto, mas previamente isto
	era tarefa para executar diretamente no kernel.</para>

      <example id="boot-boot2-example">
	<title><filename>boot2</filename> Screenshot</title>

	<screen>&gt;&gt; FreeBSD/i386 BOOT
Default: 0:ad(0,a)/kernel
boot:</screen>
      </example>

      <para>Se voc&ecirc; precisar sempre substituir a instala&ccedil;&atilde;o
	<filename>boot1</filename> e <filename>boot2</filename> use
	&man.disklabel.8;.</para>
      
      <screen>&prompt.root; <userinput>disklabel -B <replaceable>diskslice</replaceable></userinput></screen>

      <para>Onde <replaceable>diskslice</replaceable> &eacute; o disco e <foreignphrase>slice</foreignphrase>
	da sua inicializa&ccedil;&atilde;o, tal como <devicename>ad0s1</devicename> para o primeiro
	HD sobre a IDE.</para>

      <warning>
	<title>Modalidade Perigosamente Dedicada</title>

	<para>Se voc&ecirc; usar apenas o nome do disco, tal como
	  <devicename>ad0</devicename>, no comando &man.disklabel.8; voc&ecirc;
	  ir&aacute; criar um disco perigosamente dedicado, sem parti&ccedil;&otilde;es. Isto n&atilde;o
	  devera ser o que voc&ocirc; quer fazer, assim que voc&ecirc; verificar o dobro
	  do &man.disklabel.8; depois voc&ecirc; dever&aacute; pressionar
	  <keycap>Return</keycap>.</para>
      </warning>
    </sect2>

  <sect2 id="boot-loader">
    <title>Est&aacute;gio tr&ecirc;s, <filename>/boot/loader</filename></title>

    <indexterm><primary>boot-loader</primary></indexterm>
    <para>A inicializa&ccedil;&atilde;o e o est&aacute;gio final dos tr&ecirc;s-est&aacute;gios
      de bootstrap, &eacute; localizado no sistema de arquivos, usualmente como
      <filename>/boot/loader</filename>.</para>
      
    <para>A inicializa&ccedil;&atilde;o &eacute; usada como um m&eacute;todo amig&aacute;vel para
      configura&ccedil;&atilde;o, usando um jogo de comandos internos f&aacute;cil-para-usar,
      voltado por um interpretador mais poderoso, com um jogo de comandos mais complexo.</para> 

    <sect3 id="boot-loader-flow">
      <title>Fluxo de programa do carregador</title>
      
      <para>Durante a initializa&ccedil;&atilde;o, o carregador sondar&aacute; para um
	console e para discos, e figura de sa&iacute;da de que os discos s&atilde;o 
	carregados. Isto setar&aacute; vari&aacute;veis conformemente, e um
	interpretador &eacute; iniciado onde os comandos do usu&aacute;rio podem ser passados de 
        um script ou interativamente.</para>
      <indexterm><primary>carregados</primary></indexterm>
      <indexterm><primary>carregados na configura&ccedil;&atilde;o</primary></indexterm>

      <para>Ent&atilde;o o carregador ir&aacute; ler o
	<filename>/boot/loader.rc</filename>, que por padr&atilde;o l&ecirc;
	dentro de  <filename>/boot/defaults/loader.conf</filename> que
	seta padr&otilde;es para vari&aacute;veis e leem o 
	<filename>/boot/loader.conf</filename> para as mudan&ccedil;a destas vari&aacute;veis locais.
	<filename>loader.rc</filename> age ent&atilde;o
	sobre estas vari&aacute;veis, carregando qualquer m&oacute;dulo e kernel que s&atilde;o
	selecionados.</para>

      <para>Finalmente, por padr&atilde;o, o carregador emite uma espera de 10 segundos
	para pressionar alguma tecla, e carregar o kernel se este n&atilde;o for interrompido.
	Se interrompido, ao usu&aacute;rio &eacute; apresentado um alerta no prompt que &eacute; para
	entender o help do comando setado, onde o usu&aacute;rio pode
	ajustar vari&aacute;veis, descarregar todos os m&oacute;dulos, carregar m&oacute;dulos, e eles
	finalmente carregar ou reiniciar.</para>

    </sect3>
    
    <sect3 id="boot-loader-commands">
      <title>Comandos Carregando e Compilando</title>
      
      <para>Estes s&atilde;o os comandos mais comuns usados no carregamento do sistema. Para uma
        completa discuss&atilde;o de todas avalia&ccedil;&otilde;es dos comandos, por favor veja
        &man.loader.8;.</para>

      <variablelist>
	<varlistentry>
	  <term>autoboot <replaceable>seconds</replaceable></term>

	  <listitem>
	    <para>O processo de carregamento do kernel n&atilde;o &eacute; interrompido
	      durante o tempo concedido, em segundos. Isto mostra uma
	      contagem regrassiva, e o tempo padr&atilde;o concedido &eacute; 10
	      segundos.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>boot
	    <optional><replaceable>-options</replaceable></optional>
	    <optional><replaceable>kernelname</replaceable></optional></term>

	  <listitem>
	    <para>Imediatamente o processo de carregamento do kernel, com as
	      op&ccedil;&otilde;es dadas, se existir, e com o nome do kernel dado,
	      se for.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>boot-conf</term>

	  <listitem>
	    <para>Ir atrav&eacute;s da mesma configura&ccedil;&atilde;o autom&aacute;tica dos
	      m&oacute;dulos baseados em vari&aacute;veis como que acontece no boot.
	      Isto somente faz sentido se voc&ecirc; primeiramente
	      <command>descarregar</command>, e alterar algumas
	      vari&aacute;veis, do <envar>kernel</envar> mais freq&uuml;ente.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>help
	    <optional><replaceable>t&oacute;pico</replaceable></optional></term>

	  <listitem>
	    <para>Mensagens de ajuda s&atilde;o lidas em
	      <filename>/boot/loader.help</filename>. Se o t&oacute;pico
	      dado for <literal>index</literal>, ent&atilde;o a lista de
	      t&oacute;picos dispon&iacute;veis &eacute; dada.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>include <replaceable>filename</replaceable>
	    &hellip;</term>

	  <listitem>
	    <para>Processa o arquivo com o nome dado ao mesmo. O
	      arquivos &eacute; lido, e interpretado linha por linha. Um
	      erro imediatamente para o comando de inclus&atilde;o.</para>
	  </listitem>
	</varlistentry>
	<varlistentry>
	  <term>load <optional><option>-t</option>
	    <replaceable>type</replaceable></optional>
	    <replaceable>filename</replaceable></term>

	  <listitem>
	    <para>Carrega o kernel, o m&oacute;dulo do kernel, ou arquivo do
	      tipo dado, com o nome dado. Todos argumentos
	      depois do nome do arquivo s&atilde;o passados para o arquivo.</para>
	  </listitem>
	</varlistentry>
	<varlistentry>
	  <term>ls <optional><option>-l</option></optional>
	    <optional><replaceable>path</replaceable></optional></term>

	  <listitem>
	    <para>Mostra uma lista de arquivos dentro dos caminhos dados, ou
	      o diret&oacute;rio do root, se o caminho n&atilde;o &eacute; especificado. Se <option>-l</option>, 
              &eacute; especificada o tamanho do arquivo ser&aacute;
	      mostrado tamb&eacute;m.</para>
	  </listitem>
	</varlistentry>
	<varlistentry>
	  <term>lsdev <optional><option>-v</option></optional></term>

	  <listitem>
	    <para>Lista todos os dispositivos que pode ser poss&iacute;vel
	      para carregar m&oacute;dulos. Se <option>-v</option> for
	      especificado, mais detalhes ser&atilde;o mostrados.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>lsmod <optional><option>-v</option></optional></term>

	  <listitem>
	    <para>Mostra m&oacute;dulos carregados. Se <option>-v</option> for
	      especificado, mais detalhes ser&atilde;o mostrados.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>more <replaceable>filename</replaceable></term>

	  <listitem>
	    <para>Mostra os arquivos especificados, com uma pausa em cada
	      <varname>LINHA</varname> mostrada.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>reboot</term>

	  <listitem>
	    <para>Imediatamente reiniciar&aacute; o sistema.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>set <replaceable>variable</replaceable></term>
	  <term>set
	    <replaceable>variable</replaceable>=<replaceable>value</replaceable></term>

	  <listitem>
	    <para>Seta as vari&aacute;veis do ambiente carregado.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>unload</term>

	  <listitem>
	    <para>Remove todos m&oacute;dulos carregados.</para>
	  </listitem>
	</varlistentry>
      </variablelist>
    </sect3>

    <sect3 id="boot-loader-examples">
      <title>Exemplos de carregador</title>

      <para>Est&atilde;o aqui alguns exemplos pr&aacute;ticos do uso do carregador:</para>

      <itemizedlist>
	<indexterm><primary>single-user mode</primary></indexterm>
	<listitem>
	  <para>Para simplesmente carregar seu kernel usual, mas em modo mono-usu&aacute;rio:</para>

	  <screen><userinput>boot -s</userinput></screen>
	</listitem>

	<listitem>
	  <para>Para descarregar seu kernel e m&oacute;dulos usuais, e ent&atilde;o
	    carregar apenas seu kernel velho (ou outro):</para>
    <indexterm>
      <primary><filename>kernel.old</filename></primary>
    </indexterm>

	  <screen><userinput>unload</userinput>
<userinput>load <replaceable>kernel.old</replaceable></userinput></screen>

	  <para>Voc&ecirc; pode usar o <filename>kernel.GENERIC</filename> para
	    referir ao kernel gen&eacute;rico que vem no disco de instala&ccedil;&atilde;o,
	    ou <filename>kernel.old</filename> para consultar 
	    seu kernel previamente instalado (quando voc&ecirc; tiver atualizado
	    ou configurado seu kernel, por exemplo).</para>

	  <note>
	    <para>Use o seguinte para carregar seus m&oacute;dulos usuais com
	      outro kernel:</para>

	    <screen><userinput>unload</userinput>
<userinput>set kernel="<replaceable>kernel.old</replaceable>"</userinput>
<userinput>boot-conf</userinput></screen></note>
	</listitem>

	<listitem>
	  <para>Para carregar um script de configura&ccedil;&atilde;o do kernel (um script automatizado
	    qual fa&ccedil;a as coisas que voc&ecirc; faria normalmente dentro do
	    kernel na configura&ccedil;&atilde;o do boot-time):</para>

	  <screen><userinput>load -t userconfig_script <replaceable>/boot/kernel.conf</replaceable></userinput></screen>
	</listitem>
      </itemizedlist>
  </sect3>
    </sect2>
  </sect1>

  <sect1 id="boot-kernel">
    <title>Intera&ccedil;&atilde;o do Kernel durante o boot</title>
    <indexterm>
      <primary>kernel</primary>
      <secondary>intera&ccedil;&atilde;o do boot</secondary>
    </indexterm>
    
    <para>Uma vez que o kernel &eacute; carregado pelo carregador <link
	linkend="boot-loader">loader</link> (como usado) ou <link
	linkend="boot-boot1">boot2</link> (passando o carregador), isto
      examina suas op&ccedil;&atilde;o de boot, se existir, e ajusta seu comportamento como
      necess&aacute;rio.</para>

    <sect2 id="boot-kernel-bootflags">
      <indexterm>
        <primary>kernel</primary>
        <secondary>bootflags</secondary>
      </indexterm>
      <title>Kernel Boot Flags</title>

      <para>Est&atilde;o aqui as op&ccedil;&atilde;o de boot mais comuns:</para>

      <variablelist id="boot-kernel-bootflags-list">
	<varlistentry>
	  <term><option>-a</option></term>

	  <listitem>
	    <para>durante a inicializa&ccedil;&atilde;o o kernel, pede para o dispositivo
	      para montar um arquivo de sistema do root.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><option>-C</option></term>

	  <listitem>
	    <para>boot do CDROM.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><option>-c</option></term>

	  <listitem>
	    <para>rode UserConfig, o configurador do boot-time kernel</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><option>-s</option></term>

	  <listitem>
	    <para>boot em modo mono-usu&aacute;rio</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><option>-v</option></term>

	  <listitem>
	    <para>seja mais detalhado durante a inicializa&ccedil;&atilde;o do kernel</para>
	  </listitem>
	</varlistentry>
      </variablelist>

      <note>
	<para>Existem outras op&ccedil;&atilde;oes de boot, leia &man.boot.8; para maiores
	  informa&ccedil;&otilde;es sobre elas.</para></note>
    </sect2>

<!--    <sect2 id="boot-kernel-userconfig">
      <title>UserConfig: o configurador do Boot-time do Kernel</title>
      
      <para> </para>
    </sect2> -->
  </sect1>
  
  <sect1 id="device-hints">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Tom</firstname>
	  <surname>Rhodes</surname>
	  <contrib>Contribu&iacute;do por </contrib>
	</author>
      </authorgroup>
      <!-- 18 OCT 2002 -->
    </sect1info>
    <indexterm>
      <primary>device.hints</primary>
    </indexterm>
    <title>Dispositivos Hints</title>

    <note><para>Esta &eacute; uma caracter&iacute;stica do FreeBSD&nbsp;5.0 e posteriores que n&atilde;o 
      existe em vers&otilde;es anteriores.</para></note>

    <para>Durante a inicializa&ccedil;&atilde;o do sistema, o boot &man.loader.8; ir&aacute; ler o arquivo
      &man.device.hints.5;. Este arquivo armazena informa&ccedil;&otilde;es do boot do kernel 
      conhecidas como vari&aacute;veis, sobretudo referenciando as vezes <quote>device hints</quote>.
      Estas <quote>device hints</quote> s&atilde;o usadas pelos drivers do dispositivo para configurara&ccedil;&atilde;o
      do dispositivo.</para>
      
    <para>Device hints podem tamb&eacute;m ser especificados no <link linkend="boot-loader">
      est&aacute;gio 3 no prompt de inicializa&ccedil;&aacute;o</link>. Vari&aacute;veis podem ser adicionadas usando
      comando <command>set</command>, removidas com o comando <command>unset</command>, e visualizadas
      com o comando <command>show</command>. Vari&aacute;veis setadas dentro do arquivo
      <filename>/boot/device.hints</filename> podem ser canceladas aqui tamb&eacute;m. Device hints incorporadas no
      boot n&atilde;o s&atilde;o permanentes e ser&atilde;o perdidas na pr&oacute;xima 
      inicializa&ccedil;&atilde;o.</para>

    <para>Uma vez que o sistema &eacute; carregado, o comando &man.kenv.1; pode ser usado para
      obter todas as vari&aacute;veis.</para>

    <para>A sintaxe para o arquivo <filename>/boot/device.hints</filename> &eacute; uma vari&aacute;vel por linha, usando
      a mistura padr&atilde;o <quote>#</quote> como marcadores do coment&aacute;rio. Linhas s&atilde;o
      construidas como segue:</para>

    <screen><userinput>hint.driver.unit.keyword="<replaceable>value</replaceable>"</userinput></screen>

    <para>A sintaxe para o est&aacute;gio 3 do boot loader &eacute;:</para>
    <screen><userinput>set hint.driver.unit.keyword=<replaceable>value</replaceable></userinput></screen>

    <para><literal>driver</literal> &eacute; o nome do dispositivo, <literal>unit</literal>
      &eacute; o n&uacute;mero do driver do dispositivo, e <literal>keyword</literal> &eacute; a sugest&atilde;o
      keyword. O keyword pode consistir nas seguintes op&ccedil;&otilde;es:</para>

    <itemizedlist>
      <listitem>
	<para><literal>at</literal>: especifica o dispositivo para o qual &eacute; anexado.</para>
      </listitem>

      <listitem>
	<para><literal>port</literal>: especifica o endere&ccedil;o de in&iacute;cio do <acronym>I/O</acronym>
	  para ser usado.</para>
      </listitem>

      <listitem>
	<para><literal>irq</literal>: especifica o n&uacute;mero da interrup&ccedil;&atilde;o requerida para ser usado.</para>
      </listitem>

      <listitem>
	<para><literal>drq</literal>: especifica o n&uacute;mero do canal DMA.</para>
      </listitem>

      <listitem>
	<para><literal>maddr</literal>: especifica o endere&ccedil;o f&iacute;sico da mem&oacute;ria ocupado pelo
	  dispositivo.</para>
      </listitem>

      <listitem>
	<para><literal>flags</literal>: seta varia&ccedil;&otilde;es de bits de op&ccedil;&otilde;es para o dispositivos.</para>
      </listitem>

      <listitem>
	<para><literal>disabled</literal>: Se setada para <literal>1</literal> o dispositivo &eacute; desabilitado.</para>
      </listitem>
    </itemizedlist>

    <para>Os drivers do dispositivo podem ou n&atilde;o aceitar (se requerido) mais hints n&atilde;o listadas aqui, veja
      a p&aacute;gina do manual deles &eacute; recomendado. Para maiores informa&ccedil;&otilde;es, consulte as p&aacute;ginas
      de manuais &man.device.hints.5;, &man.kenv.1;, &man.loader.conf.5;, e &man.loader.8;.</para>
  </sect1>

  <sect1 id="boot-init">
    <indexterm>
      <primary><command>init</command></primary>
    </indexterm>
    <title>Init: Inicializa&ccedil;&atilde;o do controle de processos</title>
	
    <para>Uma vez que o kernel termina o boot, isto passa para controle
      dos processos do usu&aacute;rio &man.init.8;, que &eacute; localizado no
      <filename>/sbin/init</filename>, ou o caminho do programa especificado
      em <envar>init_path</envar> vari&aacute;vel dentro da
      <command>inicializa&ccedil;&atilde;o</command>.</para>

    <sect2 id="boot-autoreboot">
      <title>Sequ&ecirc;ncia autom&aacute;tica da Reinicializa&ccedil;&atilde;o</title>
      
      <para>A sequ&ecirc;ncia da reinicializa&ccedil;&atilde;o autom&aacute;tica certifica-se que o
	sistema de arquivos dispon&iacute;veis sobre o sistema s&atilde;o consistentes. Se eles
	n&atilde;o s&atilde;o, &man.fsck.8; e n&atilde;o podem reparar
	as inconsist&ecirc;ncias, &man.init.8; deixe o sistema
	em <link linkend="boot-singleuser">modo mono-usu&aacute;rio</link>
	para que o administrador do sistema tome cuidado dos problemas
	diretamente.</para>
    </sect2>

    <sect2 id="boot-singleuser">
      <title>Modo Mono-usu&aacute;rio</title>
      <indexterm><primary>single-user mode</primary></indexterm>
      <indexterm><primary>console</primary></indexterm>
      
      <para>Este modo pode ser acessado <link
	  linkend="boot-autoreboot">automaticamente na sequ&ecirc;ncia da reinicializa&ccedil;&atilde;o
	  </link>, ou pelo usu&aacute;rio na inicializa&ccedil;&atilde;o com a op&ccedil;&atilde;o
	<option>-s</option> ou setando a vari&aacute;vel
	<envar>boot_single</envar> dentro do
	<command>loader</command>.</para>

      <para>Isto pode ser utilizado chamando
	&man.shutdown.8; sem utilizar as op&ccedil;&otilde;es de rebootar
	(<option>-r</option>) ou parar (<option>-h</option>),
	do <link linkend="boot-multiuser">modo multi-usu&aacute;rio
	 </link>.</para>

      <para>Se o <literal>console</literal> do sistema for setada
	para <literal>insecure</literal> em <filename>/etc/ttys</filename>,
	ent&atilde;o o sistema alerta para a senha de <username>root</username>
	antes de inicializar em modo mono-usu&aacute;rio.</para>

      <example id="boot-insecure-console">
	<title>Um Console Insecure em <filename>/etc/ttys</filename></title>

	<programlisting># name  getty                           type    status          comments
#
# If console is marked "insecure", then init will ask for the root password
# when going to single-user mode.
console none                            unknown off insecure</programlisting>
      </example>

      <note>
	<para>Um console <literal>insecure</literal> significa que voc&ecirc;
	  considera sua seguran&ccedil;a f&iacute;sica para a console ser
	  insecure, e quer certificar que somente &aacute;lguem que saiba a senha de
	  <username>root</username> pode usar o modo mono-usu&aacute;rio, e isto
	  n&atilde;o significa que voc&ecirc; pode rodar sua console insecurely. Assim,
	  se voc&ecirc; quiser seguran&ccedil;a, escolha <literal>insecure</literal>,
	  n&atilde;o <literal>secure</literal>.</para>
      </note>
    </sect2>
    
    <sect2 id="boot-multiuser">
      <title>Modo Multi-Usu&aacute;rio</title>
      <indexterm><primary>multi-user mode</primary></indexterm>
      
      <para>Se &man.init.8; encontra seus arquivos de sistema para ser
	em ordem, ou uma vez que o usu&aacute;rio terminou em <link
	  linkend="boot-singleuser">modo mono-usu&aacute;rio</link>, o
	sistema entra em modo  multi-usu&aacute;rio, onde come&ccedil;a a
	configura&ccedil;&atilde;o dos recursos do sistema.</para>

      <sect3 id="boot-rc">
      <indexterm><primary>arquivos rc</primary></indexterm>
	<title>Configura&ccedil;&atilde;o de recursos (rc)</title>

	<para>O sistema de configura&ccedil;&atilde;o de recurso l&ecirc; as
	  configura&ccedil;&otilde;es padr&otilde;es do
	  <filename>/etc/defaults/rc.conf</filename>, e o
	  sistema-especifica detalhes do
	  <filename>/etc/rc.conf</filename>, e ent&atilde;o procede a
	  montagem do sistema de arquivos mencionados em
	  <filename>/etc/fstab</filename>, iniciando os servi&ccedil;os de rede,
	  inicializando v&aacute;rios daemons do sistema, e
	  finalmente executando os scripts de inicializa&ccedil;&atilde;o de pacotes instalados
	  localmente.</para>

	<para>A p&aacute;gina do manual &man.rc.8; &eacute; uma boa refer&ecirc;ncia para a
	  configura&ccedil;&atilde;o de recursos do sistema, como s&atilde;o examinados os scripts.</para>
      </sect3>
    </sect2>
  </sect1>

  <sect1 id="boot-shutdown">
    <title>Sequ&ecirc;ncia do Shutdown</title>
    <indexterm>
      <primary><command>shutdown</command></primary>
    </indexterm>

    <para>Sob controle o shutdown, via &man.shutdown.8;,
      &man.init.8; tentar&aacute; rodar o script
      <filename>/etc/rc.shutdown</filename>, e ent&atilde;o proceder o envio de
      todos os processos de <literal>TERM</literal>, e subsequente 
      do <literal>KILL</literal> tamb&eacute;m alguns que n&atilde;o terminarem 
      oportunamente.</para>

    <para>Para desligar uma m&aacute;quina FreeBSD sobre arquiteturas de sistemas
      que suportam gerenciamento de energia, simplesmente use o comando
      <command>shutdown -p now</command> para desligar
      imediatamente. Para apenas reinicializar o FreeBSD, use
      <command>shutdown -r now</command>. Voc&ecirc; precisa ser
      <username>root</username> ou um membro do
      grupo <groupname>operator</groupname> para rodar &man.shutdown.8;.
      Os comandos &man.halt.8; e &man.reboot.8; podem at&eacute; ser usados,
      consultando por favor seus manuais de refer&ecirc;ncia e &man.shutdown.8; 
      para maiores informa&ccedil;&otilde;es.</para>

    <note>
      <para>Gerenciamento de energia requer suporte &man.acpi.4; no kernel
	ou carregar algum m&oacute;dulo para FreeBSD&nbsp;5.X e suporte &man.apm.4;
	para FreeBSD&nbsp;4.X.</para>
    </note>

  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
