<!--
     The FreeBSD Documentation Project

     $FreeBSD: pt_BR.ISO8859-1/books/handbook/introduction/chapter.sgml,v 1.13 2003/12/12 16:55:04 eksffa Exp $
-->

<chapter id="introduction">
  <chapterinfo>
    <authorgroup>
      <author>
        <firstname>Jim</firstname>
	<surname>Mock</surname>
	<contrib>Restruturado, reorganizado e parcialmente
	  rescrito por </contrib>
      </author>
    </authorgroup>
  </chapterinfo>

  <title>Introdu&ccedil;&atilde;o</title>

  <sect1 id="introduction-synopsis">
    <title>Sin&oacute;pse</title>

    <para>Muito obrigado por seu interesse no FreeBSD! O cap&iacute;tulo a seguir
      cobre o Projeto FreeBSD em v&aacute;rios aspectos, como sua hist&oacute;ria,
      objetivos, modelo de desenvolvimento e outros.</para>

    <para>Ap&oacute;s a leitura deste cap&iacute;tulo, voc&ecirc; saber&aacute;:</para>

    <itemizedlist>
      <listitem>
	<para>Como FreeBSD se compara a outros sistemas operacionais de computadores.</para>
      </listitem>
      <listitem>
	<para>A hist&oacute;ria do projeto FreeBSD.</para>
      </listitem>
      <listitem>
	<para>Os objetivos do Projeto FreeBSD.</para>
      </listitem>
      <listitem>
	<para>A base do modelo  <foreignphrase>open-source</foreignphrase>
	          de desenvolvimento do FreeBSD.</para>
      </listitem>
      <listitem>
	<para>E &eacute; claro: de onde o nome <quote>FreeBSD</quote> surgiu.</para>
      </listitem>
    </itemizedlist>

  </sect1>

  <sect1 id="nutshell">
    <title>Bem-vindo ao FreeBSD!</title>
    <indexterm><primary>4.4BSD-Lite</primary></indexterm> 

    <para>FreeBSD &eacute; um sistema operacional baseado no 4.4BSD-Lite para
	computadores Intel ( x86 ), DEC <trademark>Alpha</trademark>, e Sun
	&ultrasparc;.  Vers&otilde;es para outras arquiteturas tamb&eacute;m est&atilde;o a
	caminho.  Voc&ecirc; tamb&eacute;m pode ler sobre <link linkend="history">
	a hist&oacute;ria do FreeBSD</link>, ou a <link linkend="relnotes">
	vers&atilde;o corrente</link>.  Se estiver interessando em contribuir
	com o projeto (c&oacute;digo, equipamento, contas diversas), veja o
	artigo <ulink url="../../articles/contributing/index.html">Contribuindo
	com o FreeBSD</ulink>.</para>

    <sect2 id="os-overview">
      <title>O que o FreeBSD pode fazer?</title>

      <para>FreeBSD tem muitas caracter&iacute;sticas valiosas.  Algumas destas
	s&atilde;o:</para>

      <itemizedlist>
        <indexterm><primary>Multitarefa Preemptiva</primary></indexterm>
	<listitem>
	  <para><emphasis>Multitarefa preemptiva</emphasis> com
	    ajustes din&acirc;micos de prioridade que garantem compartilhamento
	    claro e racional do computador entre as aplica&ccedil;&otilde;es e usu&aacute;rios, mesmo
	    sob a mais intensa demanda.</para>
	</listitem>

	<indexterm><primary>caracter&iacute;sticas multi-usu&aacute;rio</primary></indexterm>
	<listitem>
	  <para><emphasis>Caracteristicas multi-usu&aacute;rio</emphasis> que permite 
	    v&aacute;rias pessoas utilizarem um sistema FreeBSD de forma simult&acirc;nea,
	    para uma variedade de coisas.  Isto implica, por exemplo, que os
	    perif&eacute;ricos do sistema como impressoras e dispositivos de fita ser&atilde;o
	    apropriadamente compartilhados entre todos usu&aacute;rios no sistema ou na
	    rede, e que limites individuais possam ser definidos para usu&aacute;rios
	    e grupos de usu&aacute;rios, protegendo recursos cr&iacute;ticos do sistema de
	    sobrecarga.</para>
	</listitem>
      
	<indexterm><primary>rede TCP/IP</primary></indexterm>
	<listitem>
	  <para>Forte <emphasis>rede TCP/IP</emphasis> com suporte a padr&otilde;es
	    industriais como SLIP, PPP, NFS, DHCP e NIS.  Isto significa que
	    sua esta&ccedil;&atilde;o FreeBSD pode interagir f&aacute;cilmente com outros sistemas
	    da mesma forma que pode agir como um servidor corporativo,
	    oferecendo fun&ccedil;&otilde;es vitais como NFS (acesso remoto &agrave; arquivos) e
	    servi&ccedil;os de correio eletr&ocirc;nico, ou ent&atilde;o colocando sua empresa
	    na Internet com servi&ccedil;os de WWW, FTP, roteamento e firewall
	    (seguran&ccedil;a).</para>
	</listitem>

	<indexterm><primary>prote&ccedil;&atilde;o de mem&oacute;ria</primary></indexterm>      
	<listitem>
	  <para><emphasis>Prote&ccedil;&atilde;o de mem&oacute;ria</emphasis> garante que
	    aplica&ccedil;&ograve;es (ou usu&aacute;rios) n&atilde;o interferir&atilde;o entre s&iacute;.  A falha de
	    uma aplica&ccedil;&atilde;o n&atilde;o afetar&aacute; outras de forma alguma.</para>
	</listitem>
      
	<listitem>
	  <para>FreeBSD &eacute; um sistema operacional <emphasis>32-bit</emphasis>
	    (<emphasis>64-bit</emphasis> em plataforma Alpha e &ultrasparc;) e foi
	    projetado como tal desde seu princ&iacute;pio.</para>
	</listitem>

	<indexterm>
    <primary>Sistema de interface gr&aacute;fica X</primary>
    <seealso>XFree86</seealso>
  </indexterm>

	<listitem>
	  <para>O sistema de interface gr&aacute;fica, <emphasis>X Window System</emphasis>
	    (X11R6) padr&atilde;o industrial prov&ecirc; uma interface gr&aacute;fica com o usu&aacute;rio (<acronym>GUI</acronym>)
	    ao custo de uma placa VGA comum e um monitor, e ainda vem com c&oacute;digo fonte
	    completo.</para>
	</listitem>

	<indexterm>
	  <primary>compatibilidade bin&aacute;ria</primary>
	  <secondary>Linux</secondary>
	</indexterm>
	<indexterm>
	  <primary>binary compatibility</primary>
	  <secondary>SCO</secondary>
	</indexterm>
	<indexterm>
	  <primary>compatibilidade bin&aacute;ria</primary>
	  <secondary>SVR4</secondary>
	</indexterm>
	<indexterm>
	  <primary>compatibilidade bin&aacute;ria</primary>
	  <secondary>BSD/OS</secondary>
	</indexterm>
	<indexterm>
	  <primary>compatibilidade bin&aacute;ria</primary>
	  <secondary>NetBSD</secondary>
	</indexterm>
	<listitem>
	  <para><emphasis>Compatibilidade bin&aacute;ria</emphasis> com quaisquer
	    programas compilados para Linux, SCO, SVR4, BSDI and NetBSD.</para>
	</listitem>
	
	<listitem>
	  <para>Milhares de aplica&ccedil;&otilde;es prontas para imediata utiliza&ccedil;&atilde;o
	    (<foreignphrase><emphasis>ready-to-run</emphasis></foreignphrase>) 
	    est&atilde;o dispon&iacute;veis a partir da cole&ccedil;&atilde;o de <emphasis>ports</emphasis>
	    e <emphasis>packages</emphasis> do FreeBSD.  Por qu&ecirc; procurar na rede
	    quando &eacute; poss&iacute;vel encontrar tudo bem aqui?</para>
	</listitem>
      
	<listitem>
	  <para>Milhares de aplica&ccedil;&otilde;es adicionais e de f&aacute;cil portabilidade
	    est&atilde;o dispon&iacute;veis na Internet.  FreeBSD tem c&oacute;digo fonte compat&iacute;vel
	    com a maioria dos sistemas &unix; comerciais mais populares, 
	    e devido a isto a maioria das aplica&ccedil;&otilde;es requerem pouca, ou nenhuma
	    modifica&ccedil;&atilde;o para compilar corretamente.</para>
	</listitem>
      
	<indexterm><primary>mem&oacute;ria virtual</primary></indexterm>
	<listitem>
	  <para><emphasis>Mem&oacute;ria virtual</emphasis> paginada por demanda e
	    uma concep&ccedil;&atilde;o eficiente 
	    ( <foreignphrase>Merged VM/buffer cache</foreignphrase> )
	    que satisfaz a necessidade de recursos de aplica&ccedil;&otilde;es com grande
	    apetite para mem&oacute;ria, ao mesmo tempo que mant&eacute;m resposta interativa
	    aos outros usu&aacute;rios.</para>
	</listitem>
      
        <indexterm>
	  <primary>Multi-processamento Sim&eacute;trico (<acronym>SMP</acronym>)</primary>
	</indexterm>
	<listitem>
	  <para>Suporte <emphasis>SMP</emphasis> para m&aacute;quinas com m&uacute;ltiplas
	   CPUs.</para>
	</listitem>

	<indexterm>
	  <primary>compiladores</primary>
	  <secondary>C</secondary>
	</indexterm>
	<indexterm>
	  <primary>compiladores</primary>
	  <secondary>C++</secondary>
	</indexterm>
	<indexterm>
	  <primary>compiladores</primary>
	  <secondary>FORTRAN</secondary>
	</indexterm>
	<listitem>
	  <para>Conjunto completo de ferramentas de desenvolvimento em
	    linguagem <emphasis>C</emphasis>,
	    <emphasis>C++</emphasis>, <emphasis>Fortran</emphasis>, e
	    <emphasis>Perl</emphasis>.  Muitas linguagens adicionais para
	    pesquisa e desenvolvimento avan&ccedil;ado tamb&eacute;m est&atilde;o dispon&iacute;veis
	    na cole&ccedil;&atilde;o de <emphasis>ports</emphasis>
            e <emphasis>packages</emphasis>.</para>
	</listitem>

	<indexterm><primary>c&oacute;digo fonte</primary></indexterm>
	<listitem>
	  <para><emphasis>C&oacute;digo fonte</emphasis> dispon&iacute;vel para todo
	    o sistema significa que voc&ecirc; tem o n&iacute;vel mais completo de
	    controle sobre seu ambiente.  Por qu&ecirc; manter-se preso &agrave; 
	    solu&ccedil;&otilde;es propriet&aacute;rias e &agrave; merc&ecirc; do vendedor quando se pode
	    ter um sistema verdadeiramente aberto?</para>
	</listitem>
      
	<listitem>
	  <para>Extensa <emphasis>documenta&ccedil;&atilde;o online</emphasis>.</para>
	</listitem>
      
	<listitem>
	  <para><emphasis>E muito mais!</emphasis></para>
	</listitem>
      </itemizedlist>
    
      <indexterm><primary>4.4BSD-Lite</primary></indexterm>
      <indexterm>
        <primary>Grupo de Pesquisa em Sistemas Computacionais
	 (<acronym>CSRG</acronym>)</primary>
      </indexterm>
      <indexterm><primary>U.C. Berkeley</primary></indexterm>
      <para>FreeBSD &eacute; baseado a vers&atilde;o 4.4BSD-Lite do Grupo de Pesquisa
	em Sistemas Computacionais (<acronym>CSRG</acronym>) da Universidade
	da Calif&oacute;rnia, Berkeley, e carrega consigo a distinta tradi&ccedil;&atilde;o do
	desenvolvimento de sistemas BSD.  Em adi&ccedil;&atilde;o ao aprimorado trabalho
	realizado pelo <acronym>CSRG</acronym>, o projeto FreeBSD acrescentou
	ainda muitos milhares de horas no aperfei&ccedil;oamento do sistema para
	m&aacute;xima performance e confiabilidade em situa&ccedil;&otilde;es de demanda 
	da vida real.  Enquanto muitos dos gigantes comerciais se esfor&ccedil;am
	no campo dos sistemas operacionais para PC afim de oferecer tais
	funcionalidades com performance e confiabilidade, o FreeBSD os
	oferece <emphasis>agora</emphasis>!</para>

      <para>As aplica&ccedil;&otilde;es para as quais o FreeBSD pode ser utilizado s&oacute;
	 est&atilde;o limitadas por sua pr&oacute;pria imagina&ccedil;&atilde;o.  Do desenvolvimento
	de software &agrave; automa&ccedil;&atilde;o ind&uacute;strial, controle de invent&aacute;rio &agrave;
	corre&ccedil;&atilde;o remota da orienta&ccedil;&atilde;o de antenas de sat&eacute;lite; se pode ser feito
	com um produto &unix; comercial, &eacute; muito prov&aacute;vel que possa ser feito
	com FreeBSD tamb&eacute;m!  FreeBSD tamb&eacute;m se beneficia de forma significante
	de literalmente milhares de aplica&ccedil;&otilde;es de alta qualidade desenvolvidas
	por centros de pesquisa e universidades ao redor do mundo, usualmente
	dispon&iacute;veis &agrave; baixo ou nenhum custo.  Aplica&ccedil;&otilde;es comerciais tamb&eacute;m
	est&atilde;o dispon&iacute;veis e surgindo em grande n&uacute;mero a cada dia.</para>

      <para>Pelo fato do c&oacute;digo fonte para o FreeBSD estar geralmente dispon&iacute;vel, o sistema
	pode tamb&eacute;m ser customizado &aacute; um grau incr&iacute;vel para 
	aplica&ccedil;&otilde;es ou projetos
	especiais, e de formas geralmente n&atilde;o vi&aacute;veis com sistemas operacionais dos
	principais vendedores comerciais.  Aqui est&aacute; apenas uma amostra das aplica&ccedil;&otilde;es onde
	o FreeBSD est&aacute; sendo utilizado:</para>
    
      <itemizedlist>
	<listitem>
	  <para><emphasis>Servi&ccedil;os Internet:</emphasis> A infra-estrutura robusta de rede TCP/IP
	    criada no FreeBSD torna-o plataforma ideal para uma variedade de servi&ccedil;os Internet
	    tais como:</para>

	  <itemizedlist>
	    <indexterm><primary>servidores FTP</primary></indexterm>
	    <listitem>
	      <para>servidores FTP</para>
	    </listitem>
	  
	    <indexterm><primary>servidores <acronym>WWW</acronym></primary></indexterm>
	    <listitem>
	      <para>servidores <foreignphrase>Web</foreignphrase> 
		( padr&atilde;o ou seguro [SSL] )</para>
	    </listitem>

	    <indexterm><primary><foreignphrase>firewall</foreignphrase></primary></indexterm>
	    <indexterm><primary>Substitui&ccedil;&atilde;o de IPs</primary></indexterm>
	    <listitem>
	      <para>Servidores de interliga&ccedil;&atilde;o de redes 
		( <foreignphrase>gateway</foreignphrase> ),  <foreignphrase>firewall</foreignphrase> 
		e <acronym>NAT</acronym> ( <quote>Substitui&ccedil;&atilde;o de IPs</quote>).
	        </para>
	    </listitem>
	  
	    <indexterm><primary>correio eletr&ocirc;nico</primary></indexterm>
	    <listitem>
	      <para>Servidores de Correio Eletr&ocirc;nico</para>
	    </listitem>
	  
	    <indexterm><primary>USENET</primary></indexterm>
	    <listitem>
	      <para>Grupo de not&iacute;cias USENET ou sistemas de BBS</para>
	    </listitem>
	  
	    <listitem>
	      <para>E mais...</para>
	    </listitem>
	  </itemizedlist>

	  <para>Com FreeBSD, voc&ecirc; pode f&aacute;cilmente come&ccedil;ar com um ambiente
	    pequeno com um PC 386, de baixo custo, e atualizar todo
	    o sistema para um Xeon quadri-processado com sistema de
	    armazenamento RAID, de acordo com o crescimento de sua
	    empresa.</para>
	</listitem>
      
	<listitem>
	  <para><emphasis>Educa&ccedil;&atilde;o:</emphasis> Voc&ecirc; &eacute; estudante de
	    ci&ecirc;ncias computacionais ou algum campo relacionado &agrave; engenharia ?  
	    N&atilde;o h&aacute; melhor maneira para aprender sobre sistema operacionais,
	    arquitetura de computadores ou redes do que colocando a m&atilde;o
	    na massa, a partir da base de experi&ecirc;ncia que o FreeBSD pode oferecer.  
	    Uma s&eacute;rie de aplica&ccedil;&otilde;es CAD grauitamente dispon&iacute;veis, pacotes
	    de projeto e desenho gr&aacute;fico e de matem&aacute;tica tornam o sistema
	    altamente &uacute;til tamb&eacute;m para aqueles cujo interesse prim&aacute;rio
	    em um computador &eacute; realizar <emphasis>outras</emphasis>
	    tarefas de forma pr&aacute;tica !</para>
	</listitem>
      
	<listitem>
	  <para><emphasis>Pesquisa:</emphasis>  Com c&oacute;digo fonte do
	    sistema inteiro dispon&iacute;vel, o FreeBSD &eacute; uma plataforma excelente
	    para pesquisa em sistema operacionais bem como outros v&aacute;rios
	    ramos de ci&ecirc;ncias computacionais.  A natureza livre do FreeBSD
	    tamb&eacute;m possibilita que grupos remotos colaborem m&uacute;tuamente 
	    entre s&iacute; com id&eacute;ias ou desenvolvimento compartilhado sem a
	    necessidade de se preocupar com acordos especiais de licenciamento
            	    ou limita&ccedil;&otilde;es do que pode ser discutido em um f&oacute;rum aberto.</para>
	</listitem>
      
	<indexterm><primary>roteador</primary></indexterm>
	<indexterm><primary>Servidor DNS</primary></indexterm>
	<listitem>
	  <para><emphasis>Rede:</emphasis>  Precisa de um novo roteador ?
 	    Um novo servidor de nomes (DNS) ?  Um <foreignphrase>firewall</foreignphrase> 
	    para manter outras pessoas fora da sua rede interna ?  O FreeBSD pode f&aacute;cilmente
	    tornar aquele PC 386 ou 486 parado em um canto qualquer, em um avan&ccedil;ado
	    roteador com sofisticada capacidade de filtragem de pacotes.</para>
	</listitem>
      
	<indexterm>
	  <primary>Sistema de interface gr&aacute;fica X</primary>
	  <secondary>XFree86</secondary>
	</indexterm>
	<indexterm>
	  <primary>Sistema de interface gr&aacute;fica X</primary>
	  <secondary>Accelerated-X</secondary>
	</indexterm>
	<listitem>
	  <para><emphasis>Esta&ccedil;&atilde;o de trabalho gr&aacute;fica:</emphasis> FreeBSD &eacute; uma
	    boa escolha para solu&ccedil;&atilde;o de um terminal gr&aacute;fico de baixo custo,
	    seja utilizando o servidor &xfree86; (dispon&iacute;vel livremente) ou um
	    dos excelentes servidores comerciais oferecidos pela <ulink
	    url="http://www.xig.com">Xi Graphics</ulink>.  Diferente de um terminal
            	    X, o FreeBSD possibilita que v&aacute;rias aplica&ccedil;&otilde;es possam ser executadas
	    localmente, se desejado, desta forma aliviando a carga de um 
	    servidor central.  FreeBSD pode at&eacute; mesmo ser inicializado sem depender
	    da exist&ecirc;ncia de uma unidade de disco local (<quote>diskless</quote>),
	    tornando esta&ccedil;&otilde;es de trabalho ainda mais baratas e mais f&aacute;ceis de
	    administrar.</para>
	</listitem>
      
	<indexterm><primary>Cole&ccedil;&atilde;o de Compilador GNU</primary></indexterm>
	<listitem>
	  <para><emphasis>Desenvolvimento de Software:</emphasis>  Um sistema
	    FreeBSD b&aacute;sico vem com um conjunto completo de ferramentas de
	    desenvolvimento, incluindo o renomado compilador e depurador
	    C/C++ GNU.</para>
	</listitem>
      </itemizedlist>
    
      <para>FreeBSD est&aacute; dispon&iacute;vel tanto em c&oacute;digo fonte quando de forma bin&aacute;ria
	em CDROM, DVD, e por meio de FTP an&ocirc;nimo.  Refira-se ao 
	<xref linkend="mirrors"> para mais informa&ccedil;&ograve;es sobre como obter o
	 FreeBSD.</para>
    </sect2>

    <sect2>
      <title>Quem utiliza FreeBSD?</title>

      <indexterm>
	<primary>Usu&aacute;rios</primary>
	<secondary>Grandes s&iacute;tios rodando FreeBSD</secondary>
      </indexterm>

      <para>FreeBSD &eacute; utilizado para servir alguns dos maiores s&iacute;tios
        da Internet, incluindo:</para>

      <itemizedlist>
        <indexterm><primary>Yahoo!</primary></indexterm>
        <listitem>
	  <para><ulink url="http://www.yahoo.com/">Yahoo!</ulink></para>
	</listitem>

	<indexterm><primary>Apache</primary></indexterm>
	<listitem>
	  <para><ulink url="http://www.apache.org/">Apache</ulink></para>
	</listitem>

	<indexterm><primary>Blue Mountain Arts</primary></indexterm>
	<listitem>
	  <para><ulink url="http://www.bluemountain.com/">Blue Mountain
	    Arts</ulink></para>
	</listitem>

	<indexterm><primary>Pair Networks</primary></indexterm>
	<listitem>
	  <para><ulink url="http://www.pair.com/">Pair
	    Networks</ulink></para>
	</listitem>

	<indexterm><primary>Sony do Jap&atilde;o</primary></indexterm>
	<listitem>
	  <para><ulink url="http://www.sony.co.jp/">Sony do
	    Jap&atilde;o</ulink></para>
	</listitem>

	<indexterm><primary>Netcraft</primary></indexterm>
	<listitem>
	  <para><ulink url="http://www.netcraft.com/">Netcraft</ulink>
	    </para>
	</listitem>

	<indexterm><primary>Weathernews</primary></indexterm>
	<listitem>
	  <para><ulink url="http://www.wni.com/">Weathernews</ulink>
	</para></listitem>

	<indexterm><primary>Supervalu</primary></indexterm>
	<listitem>
	  <para><ulink
	    url="http://www.supervalu.com/">Supervalu</ulink></para>
	</listitem>

	<indexterm><primary>TELEHOUSE America</primary></indexterm>
	<listitem>
	  <para><ulink url="http://www.telehouse.com/">TELEHOUSE
	    America</ulink></para>
	</listitem>

	<indexterm><primary>Anti-V&iacute;rus Sophos</primary></indexterm>
	<listitem>
	  <para><ulink url="http://www.sophos.com/">Anti-V&iacute;rus Sophos
	    </ulink></para>
	</listitem>

	<indexterm><primary>JMA Wired</primary></indexterm>
	<listitem>
	  <para><ulink
	    url="http://www.jmawired.com/">JMA Wired</ulink></para>
	</listitem>
      </itemizedlist>

      <para>e muito mais.</para>
    </sect2>

  </sect1>
  
  <sect1 id="history">
    <title>Sobre o projeto FreeBSD</title>

    <para>A se&ccedil;&atilde;o a seguir oferece algumas informa&ccedil;&otilde;es b&aacute;sicas
      sobre projeto, incluindo uma breve hist&oacute;ria, seus objetivos e seu modelo de 
      desenvolvimento.</para>

    <sect2 id="intro-history">
      <sect2info role="firstperson">
	<authorgroup>
	  <author>
	    <firstname>Jordan</firstname>
	    <surname>Hubbard</surname>
	    <contrib>Contribui&ccedil;&atilde;o de </contrib>
	  </author>
	</authorgroup>
      </sect2info>

      <title>Uma Breve Hist&oacute;ria do FreeBSD</title>

      <indexterm><primary>386BSD Patchkit</primary></indexterm>
      <indexterm><primary>Hubbard, Jordan</primary></indexterm>
      <indexterm><primary>Williams, Nate</primary></indexterm>
      <indexterm><primary>Grimes, Rod</primary></indexterm>
      <indexterm>
        <primary>Projeto FreeBSD</primary>
        <secondary>hist&oacute;ria</secondary>
      </indexterm>
      <para>O projeto FreeBSD teve seu nascimento no in&iacute;cio de 1993, em parte 
	como uma consequ&ecirc;ncia do conjunto de manuten&ccedil;&atilde;o n&atilde;o-oficial
	do 386BSD (<quote>Unofficial 386BSD Patchkit</quote>) pelos seus 3 &uacute;ltimos
	coordenadores : Nate Williams, Rod Grimes e eu.</para>
    
      <indexterm><primary>386BSD</primary></indexterm>
        <para>Nosso objetivo original era produzir um <foreignphrase>snapshot</foreignphrase>
	intermedi&aacute;rio do 386BSD, de forma a poder corrigir uma s&eacute;rie de problemas
	com este sistema, que o mecanismo de manuten&ccedil;&atilde;o n&atilde;o era capaz
	de resolver.  Alguns se lembrar&atilde;o do nome nome inicial do
	projeto que era <quote>386BSD 0.5</quote> ou <quote>386BSD Interim</quote>
	em refer&ecirc;ncia a este fato.</para>
    
      <indexterm><primary>Jolitz, Bill</primary></indexterm>
      <para>386BSD era o sistema operacional de Bill Jolitz, que j&aacute; estava
	naquele instante sofrendo quase um ano de neglig&ecirc;ncia.  
	Como o mecanismo de manuten&ccedil;&atilde;o <foreignphrase>patchkit</foreignphrase>
	se tornava mais e mais desconfort&aacute;vel a cada dia que passava, fomos
	un&acirc;nimes em decidir que algo tinha que ser feito e decidimos ajudar
	Bill oferecendo a ele este <foreignphrase>snapshot</foreignphrase>
	<quote>interim</quote>.  Tais planos foram bruscamente interrompidos
	quando Bill Jollitz repentinamento decidiu retirar sua san&ccedil;&atilde;o ao 
	projeto sem nenhuma indica&ccedil;&atilde;o clara do que deveria ser feito.</para>

      <indexterm><primary>Greenman, David</primary></indexterm>
      <indexterm><primary>Walnut Creek CDROM</primary></indexterm>
      <para>N&atilde;o levou muito para decidirmos que o objetivo continuava a 
	valer a pena, mesmo sem a ajuda de Bill, e ent&atilde;o adotamos o nome
	<quote>FreeBSD</quote>, sugerido por David Greenman.  Nossos objetivos
	iniciais foram definidos depois de consultar os usu&aacute;rios recentes
	do sistema e, uma vez estando claro que o projeto estava na estrada
	para, talvez, tornar-se uma realidade, entrei em contato com a 
	Walnut Creek CDROM, com o olho aberto &aacute; possibilidade de aperfei&ccedil;oar
	os canais de distribui&ccedil;&atilde;o do FreeBSD para as pessoas que
	n&atilde;o tinham acesso &agrave; Internet.  Walnut Creek CDROM n&atilde;o apenas aprovou a
	id&eacute;ia de distribuir o FreeBSD em CD, mas tamb&eacute;m foi mais longe, ao ponto
	de oferecer ao projeto uma m&aacute;quina para trabalho dedicado e uma conex&atilde;o
	r&aacute;pida com a Internet.  Sem esta confian&ccedil;a, sem precedentes, 
	da Walnut Creek CDROM no que era, naquele momento, um projeto completamente
	desconhecido, &eacute; muito prov&aacute;vel que o FreeBSD n&atilde;o tivesse chegado t&atilde;o
	longe e t&atilde;o r&aacute;pido ao ponto em que est&aacute; hoje.</para>

      <indexterm><primary>4.3BSD-Lite</primary></indexterm>
      <indexterm><primary>Net/2</primary></indexterm>
      <indexterm><primary>U.C. Berkeley</primary></indexterm>
      <indexterm><primary>386BSD</primary></indexterm>
      <indexterm><primary>Funda&ccedil;&atilde;o do Software Livre</primary></indexterm>
      <para>A primeira distribui&ccedil;&atilde;o em CDROM (e na Internet em geral) foi o
	FreeBSD&nbsp;1.0, lan&ccedil;ado em Dezembro de 1993.  Era baseado na fita 
	 4.3BSD-Lite (<quote>Net/2</quote>) da Universidade da
	Calif&oacute;rnia, Berkeley (U.C. Berkeley), com muitos componentes originados
	do 386BSD e da Funda&ccedil;&atilde;o do Softare Livre (<foreignphrase>Free Software
	Foundation</foreignphrase>).  Foi um sucesso razo&aacute;velmente grande para
	uma primeira apari&ccedil;&atilde;o, e n&oacute;s continuamos o ciclo com uma vers&atilde;o
	altamente bem sucedida, o FreeBSD 1.1 <literal>release</literal> de
	Maio de 1994.</para>

      <indexterm><primary>Novell</primary></indexterm>
      <indexterm><primary>U.C. Berkeley</primary></indexterm>
      <indexterm><primary>Net/2</primary></indexterm>
      <indexterm><primary>AT&amp;T</primary></indexterm>
      <para>Por volta desta &eacute;poca, algumas n&uacute;vens de tempestade inesperadas
	come&ccedil;aram a se formar no horizonte, conforme a Novell e U.C. Berkeley
	acertaram ao longo do processo penal entre ambas, a respeito da situa&ccedil;&atilde;o 
	legal da fita contendo o Net/2 de Berkeley.  Uma das
	condi&ccedil;&otilde;es do acordo eram as concess&otilde;es da U.C. Berkeley
	que implicava que grandes trechos do Net/2 fossem c&oacute;digos
	<quote>impedidos</quote> e de propriedade da Novell, que havia
	por sua vez adquirido-os da AT&amp;T algum tempo antes.  O que Berkeley
	recebeu em retribui&ccedil;&atilde;o foi a <quote>ben&ccedil;&atilde;o</quote> da Novell 
	para o lan&ccedil;amento
	da vers&atilde;o 4.4BSD-Lite, que quando acontecesse, seria declarado
	como <quote>impedido</quote> e todos os usu&aacute;rios do Net/2 seriam fortemente
	encorajados a mudar de sistema para a nova vers&atilde;o.  Isso incluiu o
	FreeBSD, ao projeto foi dado o prazo final de Julho de 1994 para
	parar de distribuir seu produto baseado na vers&atilde;o Net/2.  Sob tais
	termos de acordo, o projeto poderia lan&ccedil;ar uma &uacute;ltima vers&atilde;o
	antes do prazo em quest&atilde;o, o que originou o
	FreeBSD&nbsp;1.1.5.1.</para>

      <para>O FreeBSD definiu ent&atilde;o a &aacute;rdua tarefa de literalmente
	se reinventar &agrave; partir de um sistema completamente novo e 
	consideravelmente incompleto, o 4.4BSD-Lite.  As vers&otilde;es <quote>Lite</quote>
	continham grandes blocos de c&oacute;digo a menos, removidos pelo <acronym>CSRG</acronym>
	de Berkeley (devido a v&aacute;rias decis&otilde;es legais), c&oacute;digos necess&aacute;rios para a
	constru&ccedil;&atilde;o de um sistema inicializ&aacute;vel e que podia ser utilizado 
	em produ&ccedil;&atilde;o e o fato &eacute;, que a convers&atilde;o do 4.4 para a plataforma Intel 
	era altamente incompleta.  
	O projeto levou at&eacute; Novembro de 1994 para concluir esta transi&ccedil;&atilde;o, quando
	lan&ccedil;ou a vers&atilde;o 2.0 do FreeBSD na rede mundial e em CDROM ( 
	em Dezembro ).  Apesar de um pouco bruta naquele instante, a vers&atilde;o teve um
	sucesso significante, e foi seguida pelo FreeBSD 2.0.5, mais robusto e
	de mais f&aacute;cil instala&ccedil;&atilde;o, em Junho de 1995.</para>

      <para>Lan&ccedil;amos o FreeBSD&nbsp;2.1.5 em Agosto de 1996, que foi bastante popular 
	entre os provedores de internet (ISP) e as empresas 
	a ponto de justificar a viabilidade de outra vers&atilde;o no ramo 2.1-STABLE.  
	Esta vers&atilde;o foi o FreeBSD&nbsp;2.1.7.1, lan&ccedil;ado em Fevereiro de 1997, 
	que marcou o t&eacute;rmino do desenvolvimento <foreignphrase>mainstream</foreignphrase>
	do 2.1-STABLE.  Agora em manuten&ccedil;&atilde;o, apenas aperfei&ccedil;oamentos de
	seguran&ccedil;a e outras corre&ccedil;&otilde;es cr&iacute;ticas s&atilde;o realizadas neste ramo
	(RELENG_2_1_0).</para>

      <para>O ramo 2.2 do FreeBSD foi iniciado a partir da s&eacute;rie parcial
	de desenvolvimento (<quote>-CURRENT</quote>) em Novembro de 1996, foi
	intitulado ramo RELENG_2_2, e a primeira vers&atilde;o completa (2.2.1) foi
	lan&ccedil;ada em Abril de 1997.  Vers&otilde;es posteriores ao longo do ramo 2.2 foram
	criadas no ver&atilde;o e outono de 1998, sendo a &uacute;ltima delas (2.2.8)
	lan&ccedil;ada em Novembro de 1998, marcando o in&iacute;cio do fim do ramo 2.2.</para>

      <para>A &aacute;rvore foi ramificada mais uma vez, em 20 de Janeiro de 1999, iniciando
	os ramos 4.0-CURRENT e 3.X-STABLE.  A partir da 3.X-STBALE, a vers&atilde;o 3.1
	foi lan&ccedil;ada, em 15 de Fevereiro de 1999; a vers&atilde;o 3.2 foi lan&ccedil;ada em
	15 de Maio de 1999; a 3.3 em 16 de Setembro de 1999; a vers&atilde;o 3.4 em 20
	de Dezembro de 1999, e a 3.5 em 24 de Junho de 2000, que foi complementada
	um pouco depois com uma pequena atualiza&ccedil;&atilde;o de seguran&ccedil;a, o 3.5.1, que 
	incorporava algumas corre&ccedil;&otilde;es de seguran&ccedil;a de &uacute;ltima hora para 
	o Kerberos.  Esta se tornou a vers&atilde;o final para o ramo 3.X.</para> 

      <para>Outro ramo foi iniciado em 13 de Mar&ccedil;o de 2000, 
	de forma emergencial na metade do ramo 4.X-STABLE, considerado agora
	o <quote>ramo -stable corrente</quote>.  Posteriormente houveram
	v&aacute;rias vers&otilde;es desta s&eacute;rie: 4.0-RELEASE foi apresentado ao mundo em
	Mar&ccedil;o de 2000, e a vers&atilde;o mais recente, &rel2.current;-RELEASE surgiu
	em &rel2.current.date;.  Existir&atilde;o vers&otilde;es adicionais ao longo do ramo
	4.X-STABLE (RELENG_4) ainda em 2003.</para>

      <para>A vers&atilde;o 5.0-RELEASE, muito aguardada, foi anunciada em
	19 de Janeiro de 2003.  O resultado culminante de aproximadamente tr&ecirc;s
	anos de trabalho, esta vers&atilde;o colocou o FreeBSD no caminho do suporte
	avan&ccedil;ado a multiprocessamento sim&eacute;trico, suporte avan&ccedil;ado a aplica&ccedil;&otilde;es
	<literal>multithread</literal> e apresentou ao p&uacute;blico suporte &agrave;s
	plataformas &ultrasparc; e <literal>ia64</literal>.  Esta vers&atilde;o foi
	seguida pela 5.1 em Junho de 2003.  Al&eacute;m de um n&uacute;mero muito grande de novas
	funcionalidades, as vers&otilde;es 5.X do FreeBSD contem ainda uma s&eacute;rie de
	trechos em desenvolvimento em todas as arquiteturas de sistemas
	relacionadas.  Por tal raz&atilde;o, as vers&otilde;es 5.X s&atilde;o consideradas vers&otilde;es
	de <quote>Nova Tecnologia</quote>, enquanto a s&eacute;rie 4.X atua como
	vers&otilde;es de <quote>Produ&ccedil;&atilde;o</quote>.  No momento apropriado, a s&eacute;rie 5.X
	ser&aacute; declarada est&aacute;vel e o trabalho mais recente ser&aacute; destinado ao 
	pr&oacute;ximo ramo de desenvolvimento, o 6.0-CURRENT.</para>

      <para>Por hora, projetos de desenvolvimento que requerem mais tempo
	continuam sendo realizados no ramo 5.X-CURRENT, e vers&otilde;es
	<foreignphrase>SNAPshot</foreignphrase> da s&eacute;rie em CDROM (e
	l&oacute;gico, na rede) est&atilde;o cont&iacute;nuamento sendo disponibilizados
	&agrave; partir do <ulink url="ftp://current.FreeBSD.org/pub/FreeBSD/snapshots/">
	servidor de <foreignphrase>snapshots</foreignphrase></ulink> e
	apresentado como o trabalho em progresso.</para>
    </sect2>
      
    <sect2 id="goals">
      <sect2info>
        <authorgroup>
          <author>
            <firstname>Jordan</firstname>
	    <surname>Hubbard</surname>
   	    <contrib>Contribui&ccedil;&atilde;o de </contrib>
	  </author>
        </authorgroup>
      </sect2info>

      <title>Objetivos do Projeto FreeBSD</title>
    
      <indexterm>
        <primary>Projeto FreeBSD</primary>
        <secondary>objetivos</secondary>
      </indexterm>
      <para>Os objetivos do Projeto FreeBSD s&atilde;o de oferecer
	<foreignphrase>software</foreignphrase>
	que pode ser utilizado para qualquer prop&oacute;sito, sem restri&ccedil;&otilde;es
	impeditivas.  Muitos de n&oacute;s investimos significantemente no
	c&oacute;digo (e no projeto) e certamente n&atilde;o seria uma surpresa se 
	de vez em quando recebessemos uma pequena compensa&ccedil;&atilde;o financeira, 
	mas definitivamente n&atilde;o insistimos nisso.  Acreditamos que nossa
	primeira e principal <quote>miss&atilde;o</quote> &eacute; oferecer c&oacute;digo
	para qualquer usu&aacute;rio, e para qualquer 
	prop&oacute;sito, de forma que o c&oacute;digo em quest&atilde;o chegue o mais
	longe que puder e que traga os maiores benef&iacute;cios que 
	forem poss&iacute;veis.  Este &eacute;, acreditamos, um dos principais
	fundamentos do projeto e do Software Livre, e um dos quais
	n&oacute;s apoiamos de forma entusiasmada.</para>
 
      <indexterm>
        <primary>Licen&ccedil;a P&uacute;blica Geral GNU (GPL)</primary>
      </indexterm>
      <indexterm>
        <primary>Licen&ccedil;a P&uacute;blica Menos Geral GNU (LGPL)</primary>
      </indexterm>
      <indexterm><primary>Direito autoral BSD</primary></indexterm>
      <para>O c&oacute;digo em nossa &aacute;rvore fonte sob a
	Licen&ccedil;a P&uacute;blica Geral GNU (GPL) ou
	Licen&ccedil;a P&uacute;blica Menos Geral GNU (LGPL) cont&eacute;m
	consideravelmente mais restri&ccedil;&otilde;es impeditivas, contudo,
	felizmente mais pelo lado de for&ccedil;ar o acesso irrestrito
	ao c&oacute;digo do que o oposto tradicional.  Devido &agrave;s
	complexidades adicionais que podem envolver o uso comercial
	de <foreignphrase>software</foreignphrase> GPL, n&oacute;s temos
	prefer&ecirc;ncia pelos programas lan&ccedil;ados sob a licen&ccedil;a de 
	direito autoral BSD sempre que poss&iacute;vel, por ser 
	uma licen&ccedil;a consideravelmente mais flex&iacute;vel.</para>
    </sect2>
  
    <sect2 id="development">
      <sect2info>
        <authorgroup>
          <author>
            <firstname>Satoshi</firstname>
	    <surname>Asami</surname>
   	    <contrib>Contribui&ccedil;&atilde;o de </contrib>
	  </author>
        </authorgroup>
      </sect2info>

      <title>O Modelo de Desenvolvimento FreeBSD</title>
    
      <indexterm>
        <primary>FreeBSD Project</primary>
        <secondary>modelo de desenvolvimento</secondary>
      </indexterm>
      <para>O desenvolvimento do FreeBSD &eacute; um processo
	muito aberto e flex&iacute;vel, literalmente composto pela
	contribui&ccedil;&atilde;o de centenas de pessoas ao redor do mundo, 
	como pode ser visto em nossa <ulink
	url="../../articles/contributors/article.html">lista de
	contribuidores</ulink>.  A infraestrutura de desenvolvimento
	do FreeBSD permite que estas centenas de desenvolvedores
	colaborem mutuamente pela Internet.  Estamos constantemente
	&agrave; procura de novos desenvolvedores e novas id&eacute;ias, e
	aqueles dispostos a se tornarem mais envolvidos com o projeto
	precisam apenas nos contatar atrav&eacute;s da lista &a.hackers;.  
	A lista &a.announce; tamb&eacute;m est&aacute; dispon&iacute;vel aos  
	que querem ficar mais informados sobre as principais
	&aacute;reas de trabalho do projeto FreeBSD.</para>

      <para>Informa&ccedil;&otilde;es &uacute;teis de se conhecer sobre o projeto FreeBSD
	e seu processo de desenvolvimento, seja trabalhando de forma
	independente ou em coopera&ccedil;&atilde;o m&uacute;tua:</para>

      <variablelist>
	<varlistentry>
	  <term>O reposit&oacute;rio CVS<anchor
	    id="development-cvs-repository"></term>

	  <indexterm>
      <primary>CVS</primary>
      <secondary>reposit&oacute;rio</secondary>
    </indexterm>
	  <indexterm>
	    <primary>Sistema de Vers&otilde;es Concorrentes</primary>
      <see>CVS</see>
	  </indexterm>
	  <listitem>
	    <para>A &aacute;rvore de fontes central do FreeBSD &eacute; mantida
		pelo <ulink url="http://www.cvshome.org/">CVS</ulink>
		(Sistema de Vers&otilde;es Concorrentes), uma ferramenta de
		controle de c&oacute;digo fonte dispon&iacute;vel gratuitamente,
		e que vem junto com o FreeBSD.  O 
		<ulink url="http://www.FreeBSD.org/cgi/cvsweb.cgi">reposit&oacute;rio
		CVS</ulink> prim&aacute;rio est&aacute; localizado em Santa Clara, Calif&oacute;rnia,
		nos EUA, onde ele &eacute; replicado em v&aacute;rias m&aacute;quinas espelho
		espalhadas ao redor do mundo.  A &aacute;rvore CVS, que cont&eacute;m 
		os ramos <link linkend="current">-CURRENT</link> e
		<link linkend="stable">-STABLE</link>, podem ser
		completamente replicadas, de forma extremamente f&aacute;cil,
		&agrave; sua pr&oacute;pria m&aacute;quina local.  Refira-se &agrave;
		se&ccedil;&atilde;o <link linkend="synching">Sincronizando seu c&oacute;digo fonte</link>
		para obter mais informa&ccedil;&otilde;es sobre isso.</para>
	  </listitem>
	</varlistentry>
      
	<varlistentry>
	  <term>A lista de <foreignphrase>committers</foreignphrase><anchor
	    id="development-committers"></term>
	      
	  <indexterm><primary><foreignphrase>committers</foreignphrase></primary></indexterm>
	  <listitem>
	    <para>Os <firstterm>committers</firstterm>
		s&atilde;o as pessoas que tem acesso de <emphasis>escrita</emphasis>
		na &aacute;rvore CVS, e tem autoriza&ccedil;&atilde;o para realizar modifica&ccedil;&otilde;es
		diretas na &aacute;rvore fonte do FreeBSD (o termo <quote>committer</quote>
		se origina no comando <command>commit</command> do &man.cvs.1;,
		que &eacute; utilizado para incluir novas mudan&ccedil;as no reposit&oacute;rio CVS).  
		Ou seja, os <foreignphrase>committers</foreignphrase> s&atilde;o os
		desenvolvedores do FreeBSD.  A melhor maneira de submeter
		modifica&ccedil;&otilde;es/contribui&ccedil;&otilde;es para revis&atilde;o
		dos <foreignphrase>committers</foreignphrase> &eacute; utilizar
		o comando &man.send-pr.1;.   Se algo estiver fora de
		conformidades com o sistema de &man.send-pr.1;, pode
		ser interessante entrar em contato com os desenvolvedores
		enviando uma mensagem de correio para a lista &a.committers;.</para>
	  </listitem>
	</varlistentry>
      
	<varlistentry>
	  <term>O Grupo Central (<literal>Core Team</literal>) do FreeBSD<anchor id="development-core"></term>

	  <indexterm><primary><literal>core team</literal></primary></indexterm>
	  <listitem>
	    <para>O <firstterm>FreeBSD core team</firstterm>
		seria equivalente ao corpo de diretores,
		se o Projeto FreeBSD fosse uma empresa.  A tarefa prim&aacute;ria
		do <literal>core team</literal> &eacute; garantir que o projeto,
		de forma geral, esteja em boa forma e caminhando nas 
		dire&ccedil;&otilde;es corretas, bem como o recrutamento de novos
		membros para o <literal>core team</literal> conforme
		outros v&atilde;o se desligando do cargo.  O <literal>core team</literal>
		atual foi eleito a partir de um grupo de desenvolvedores
		que se candidataram ao cargo, em Junho de 2002.  Elei&ccedil;&otilde;es
		para o <literal>core team</literal> acontecem a cada
		2 anos.</para>

	    <para>Alguns membros do <literal>core team</literal>
		tem ainda &aacute;reas espec&iacute;ficas de responsabilidade
		no projeto, o que significa que eles s&atilde;o respons&aacute;veis
		por garantir que um trecho bastante relevante e grande
		do sistema funcionem como se espera.  Para a lista
		completa dos desenvolvedores do FreeBSD e suas
		respectivas &aacute;reas de responsabilidade, por gentileza,
		consulte a <ulink url="../../articles/contributors/article.html">
		Lista de Contribuidores.</ulink></para>

	    <note>
	      <para>A maioria dos membros do <literal>core team</literal> s&atilde;o
		volunt&aacute;rios no desenvolvimento do FreeBSD, e n&atilde;o se beneficiam
		financeiramente do projeto, de forma que <quote>desenvolvimento</quote>
		n&atilde;o pode ser confundido com <quote>suporte garantido</quote> por
		parte destes.  A analogia com o <quote>corpo de diretores</quote>
		feita acima n&atilde;o &eacute; muito precisa, melhor seria  
		dizermos que estas s&atilde;o as pessoas que
		desistiram de suas vidas em favor do FreeBSD.</para>
	    </note>
	  </listitem>
	</varlistentry>
      
	<varlistentry>
	  <term>Contribuidores externos</term>

	  <indexterm><primary>contribuidores</primary></indexterm>
	  <listitem>
	    <para>Por &uacute;ltimo, mas definitivamente n&atilde;o em
		&uacute;ltimo, o maior grupo de desenvolvedores s&atilde;o
		os pr&oacute;prios usu&aacute;rios do sistema, que oferecem
		retorno e corre&ccedil;&otilde;es de problemas ao projeto
		de maneira consideravelmente constante.  A forma
		principal de se manter em sintonia com os trechos
		de desenvolvimento menos centralizados no FreeBSD,
		&eacute; se inscrever na lista &a.hackers onde tais
		assuntos s&atilde;o discutidos.  Veja <xref
		linkend="eresources"> para obter mais
		informa&ccedil;&otilde;es sobre as in&uacute;meras listas
		de discuss&atilde;o do projeto FreeBSD.</para>
	  
	    <para><citetitle><ulink
		url="../../articles/contributors/article.html">A
		Lista de contribuidores do FreeBSD</ulink></citetitle> &eacute; 
		grande e est&aacute; em constante crescimento, ent&atilde;o por que
		voc&ecirc; n&atilde;o entra nessa lista hoje, contribuindo com alguma
		coisa para o projeto FreeBSD?</para>

	    <para>Oferecer c&oacute;digo n&atilde;o &eacute; a &uacute;nica maneira de contribuir
		com o projeto; para uma lista mais completa do que
		precisa ser feito, por gentileza, refira-se ao
		<ulink url="../../../../index.html">s&iacute;tio WWW do
		Projeto FreeBSD</ulink>.</para>
	  </listitem>
	</varlistentry>
      </variablelist>
    
      <para>Em resumo, nosso modelo de desenvolvimento &eacute;
	um conjunto de circulos conc&ecirc;ntricos.  O modelo
	centralizado &eacute; projetado com o objetivo de oferecer
	conveni&ecirc;ncia aos <emphasis>usu&aacute;rios</emphasis>
	do FreeBSD, que s&atilde;o agraciados com um modelo simples
	para acompanhar uma base centralizada de c&oacute;digos,
	e n&atilde;o para afastar contribuidores em potencial !  Nosso
	desejo &eacute; apresentar um sistema operacional est&aacute;vel
	com um amplo e coerente conjunto de <link linkend="ports">
	programas aplicativos</link> que os usu&aacute;rios podem
	instalar e utilizar de forma f&aacute;cil.  O modelo
	atual funciona muito bem na realiza&ccedil;&atilde;o deste
	objetivo.</para>
    
      <para>Tudo que pedimos aos que desejam se juntar a n&oacute;s
	como desenvolvedores FreeBSD, &eacute; um pouco da mesma
	dedica&ccedil;&atilde;o que os membros atuais tem, pra prover
	o cont&iacute;nuo sucesso do projeto!</para>
    </sect2>

    <sect2 id="relnotes">
      <title>A Vers&atilde;o Atual do FreeBSD</title>

      <indexterm><primary>NetBSD</primary></indexterm>
      <indexterm><primary>OpenBSD</primary></indexterm>
      <indexterm><primary>386BSD</primary></indexterm>
      <indexterm><primary>Funda&ccedil;&atilde;o do Software Livre</primary></indexterm>
      <indexterm><primary>U.C. Berkeley</primary></indexterm>
      <indexterm>
        <primary>Grupo de Pesquisa em Sistemas Computacionais (<acronym>CSRG</acronym>)</primary>
      </indexterm>
      <para>FreeBSD &eacute; um sistema cujos fontes foram inteiramente baseados no
	4.4BSD-Lite, dispon&iacute;vel livremente para computadores
	baseados em Intel &i386;, &i486;,
	&pentium;,
        &pentium;&nbsp;Pro,
        &celeron;,
        &pentium;&nbsp;II,
        &pentium;&nbsp;III,
        &pentium;&nbsp;4 (ou compat&iacute;avel),
        &xeon;, DEC <trademark>Alpha</trademark>
        e Sun &ultrasparc;.  O sistema &eacute; baseado primariamente em
	programas do <acronym>CSRG</acronym> (Grupo de Pesquisa em
	Sistemas Computacionais) da U.C. Berkeley, com algumas
	melhorias incorporadas do NetBSD, OpenBSD, 386BSD
	e da Funda&ccedil;&atilde;o do Software Livre (FSF).</para>

      <para>Desde o lan&ccedil;amento do FreeBSD&nbsp;2.0 no final de 1994, a
	performance, as funcionalidades, e a estabilidade do FreeBSD
	foram dramaticamente incrementados.  
	A maior modifica&ccedil;&atilde;o foi a melhoria do sistema de mem&oacute;ria
	virtual com a inclus&atilde;o do <foreignphrase>merged VM/file buffer cache
	</foreignphrase> que n&atilde;o apenas melhora a
	performance, mas tamb&eacute;m reduz peda&ccedil;os perdidos de mem&oacute;ria no
	FreeBSD, tornando a configura&ccedil;&atilde;o m&iacute;nima de 5 MB um requerimento
	mais aceit&aacute;vel.  Outras melhorias incluem suporte completo &agrave;
	cliente e servidor NIS, suporte &agrave; <literal>transaction TCP</literal>,
	discagem PPP por demanda, suporte DHCP integrado, um subsistema
	SCSI aperfei&ccedil;oado, suporte ISDN, suporte ATM, FDDI, adaptadores
	de rede <foreignphrase>Fast Ethernet</foreignphrase> e
	<foreignphrase>Gigabit Ethernet</foreignphrase> (1000&nbsp;Mbit),
	suporte aperfei&ccedil;oado &agrave;s adaptadoras Adaptec mais recentes, e 
	muitos milhares de corre&ccedil;&otilde;es de problemas.</para>

      <para>Al&eacute;m da distribui&ccedil;&atilde;o base, o FreeBSD oferece ainda
	uma cole&ccedil;&atilde;o de aplica&ccedil;&otilde;es ( <foreignphrase>ports</foreignphrase> ) 
	 composta de milhares de programas populares.  No momento da prepara&ccedil;&atilde;o
	deste documento, haviam mais de &os.numports; <literal>
	ports</literal> !  A lista de <literal>ports</literal> varia
	de servidores http (WWW) &agrave; jogos, linguagens de programa&ccedil;&atilde;o,
	editores de texto e praticamente tudo o mais que se
	encaixe entre eles.  A cole&ccedil;&atilde;o de <literal>ports</literal>
	inteira requer aproximadamente &ports.size; de espa&ccedil;o
	para armazenamento, sendo todos <literal>ports</literal>
	identificados como <quote>deltas</quote> &agrave; seus fontes
	originais.  Isto torna o processo de atualiza&ccedil;&atilde;o dos
	<literal>ports</literal> consider&aacute;velmente mais f&aacute;cil
	para n&oacute;s, e reduz muito a demanda por espa&ccedil;o em disco, 
	especialmente quando comparado &agrave; vers&atilde;o 1.0 da <emphasis>
	Cole&ccedil;&atilde;o de <literal>Ports</literal></emphasis>.  Para
	compilar uma aplica&ccedil;&atilde;o basta entrar no diret&oacute;rio
	do <literal>port</literal> que voc&ecirc; deseja instalar,
	digitar <command>make install</command> e deixar o sistema
	cuidar do resto.  A distribui&ccedil;&atilde;o original para cada 
	aplica&ccedil;&atilde;o &eacute; obtida din&acirc;micamente do CDROM ou de um s&iacute;tio
	FTP, portanto tudo que voc&ecirc; precisa &eacute; ter espa&ccedil;o em disco
	o bastante para compilar os programas desejados.  Quase
	todos os programas tamb&eacute;m est&atilde;o dispon&iacute;veis como <quote>
	pacotes</quote> pr&eacute;-compilados, que podem ser instalados
	com um simples comando (<command>pkg_add</command>) por aqueles
	que preferem n&atilde;o compilar suas pr&oacute;prias aplica&ccedil;&ograve;es &agrave; partir
	dos fontes.  Mais informa&ccedil;&otilde;es sobre pacotes e sobre
	<literal>ports</literal> podem ser encontradas no <xref
	linkend="ports">.</para>

      <para>Uma s&eacute;rie de documentos adicionais que eventualmente
	voc&ecirc; pode jugar muito &uacute;teis durante o processo de 
	instala&ccedil;&atilde;o e utiliza&ccedil;&atilde;o do FreeBSD podem ser encontrados
	tamb&eacute;m no diret&oacute;rio <filename>/usr/share/doc</filename>
	em qualquer esta&ccedil;&atilde;o FreeBSD recente.  Voc&ecirc; pode visualizar
	os manuais instalados localmente com qualquer navegador
	HTML, utilizando as seguintes URLs:</para>

      <variablelist>
        <varlistentry>
	  <term>O FreeBSD Handbook</term>

	  <listitem>
	    <para><ulink type="html"
	      url="file://localhost/usr/share/doc/handbook/index.html"><filename>/usr/share/doc/handbook/index.html</filename></ulink></para>
	  </listitem>
        </varlistentry>
      
        <varlistentry>
	  <term>As FreeBSD FAQ</term>

	  <listitem>
	    <para><ulink type="html"
	      url="file://localhost/usr/share/doc/faq/index.html"><filename>/usr/share/doc/faq/index.html</filename></ulink></para>
	  </listitem>
        </varlistentry>
      </variablelist>
    
      <para>Voc&ecirc; ainda pode acessar as c&oacute;pias mestre (e frequentemente
	mais atualizadas) em <ulink
	url="../../../../index.html">http://www.FreeBSD.org/</ulink>.</para>
    </sect2>
  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
