<!--
     The FreeBSD Documentation Project

     $FreeBSD: doc/en_US.ISO8859-1/books/handbook/printing/chapter.sgml,v 1.82 2003/11/13 22:01:54 wes Exp $
-->

<chapter id="printing">
  <chapterinfo>
    <authorgroup>
      <author>
	<firstname>Sean</firstname>
	<surname>Kelly</surname>
	<contrib>Contributed by </contrib>
      </author>
      <!-- 30 Sept 1995 -->
    </authorgroup>
    <authorgroup>
      <author>
	<firstname>Jim</firstname>
	<surname>Mock</surname>
	<contrib>Reestruturado e atualizado por </contrib>
	<!-- Mar 2000 -->
      </author>
    </authorgroup>
  </chapterinfo>

  <title>Impress&atilde;o</title>

  <sect1 id="printing-synopsis">
    <title>Sinopse</title>
    <indexterm><primary>Sistema de <foreignphrase>spool</foreignphrase> LPD </primary></indexterm>
    <indexterm><primary>Impress&atilde;o</primary></indexterm>

    <para>
	O FreeBSD pode ser usado para imprimir em uma grande variedade de impressoras, deste as antigas impressoras matricias at&eacute; as modernas laser, permitindo produzir trabalhos de alta qualidade em seus aplicativos preferido.
    </para>

    <para>
	O FreeBSD pode tamb&eacute;m ser utilizado como servidor fr impress&atilde;o em uma rede; Com isso, o FreeBSD pode receber trabalhos de impress&atilde;o de uma grande variedade de outros computadores, inclusive de outros FreeBSD, &windows; e &macos;, FreeBSD assegura que apenas um pedido ser&aacute; impresso por vez, e mant&eacute;m a estat&iacute;sticas de cada usu&aacute;rio e de cada m&aacute;quina que fez uso do recurso de impress&atilde;o, produzindo p&aacute;ginas de <quote>banner</quote>, mostrando de quem &eacute; a impress&atilde;o na impressora.
    </para>

    <para>
	Ap&oacute;s a leitura deste cap&iacute;tulo, voc&ecirc; estar&aacute; sabendo:
    </para>

    <itemizedlist>
      <listitem>
	<para>
		Como configurar o FreeBSD como um servidor de impress&atilde;o
	</para>
      </listitem>

      <listitem>
	<para>
		Como Instalar filtros de impress&atilde;o, para gerenciar trabalhos de impress&atilde;o especiais diferentemente, incluindo conversores de formatos para o formato padr&atilde;o da sua impressora.
	</para>
      </listitem>

      <listitem>
	<para>
		Como habilitar cabe&ccedil;alhos ou p&aacute;gina de banner &agrave; sua impress&atilde;o.
	</para>
      </listitem>

      <listitem>
	<para>
	Como imprimir em impressoras conectadas em outros computadores.
	</para>
      </listitem>

      <listitem>
	<para>
	Como imprimir em impressoras conectadas diretamente na rede
	</para>
      </listitem>

      <listitem>
	<para>
	Como controlar restri&ccedil;&otilde;es para impressora, incluindo limita&ccedil;&atilde;o de tamanho dos trabalhos de impress&atilde;o e impedindo certos usu&aacute;rios de utilizarem a(s) impressora(s).
	</para>
      </listitem>

      <listitem>
	<para>
	Como mater estat&iacute;sticas de impress&atilde; e de usu&aacute;rios
	</para>
      </listitem>

      <listitem>
	<para>
	Como resolver problemas de impress&atilde;o
	</para>
      </listitem>
    </itemizedlist>

    <para>
	Antes de se aventurar na leituta do cap&iacute;tulo, voc&ecirc; deve:
	</para>

    <itemizedlist>
      <listitem>
	<para>
	Saber como confingurar e instalar um novo kernel
	  (<xref linkend="kernelconfig">).
	</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="printing-intro-spooler">
    <title>Introdu&ccedil;&atilde;o</title>

    <para>
		Para usar impressoras no FreeBSD, voc&eacute; ir&aacute; precisar 
	configurar-lo para trabalhar com o sistema de impress&atilde;o da 
	Barkeley, tamb&eacute; conhecido como sistema de 
	<foreignphrase>spool</foreignphrase> <application>LPD</application>.
	Ele tamb&eacute;m &eacute; o sistema padr&atilde;o de controle do FreeBSD.  
	Esse cap&iacute;tulo introduz ao sistema de spooling 
	<application>LPD</application>, frequentemente chamado de 
	<application>LPD</application>, e ir&aacute; guia-lo atrav&eacute;s de 
	sua configura&ccedil;&atilde;o.
		</para>

		<para>
			Se voc&ecirc; j&aacute; est&aacute; familiarizado com o
		<application>LPD</application> ou com outro sistema de impress&atilde;o, 
		voc&ecirc; poder&aacute; pular esta se&ccedil;&atilde;o <link
      linkend="printing-intro-setup">Configurando o sistema de spooling
      </link>.
		</para>

		<para>
			O <application>LPD</application> controla tudo sobre o servidor 
		de impress&atilde;o.  &Eacute; respons&aacute;vel por um grande 
		n&uacute;mero de coisas:
      </para>

    <itemizedlist>
      <listitem>
	<para>
	Ele controla o acesso as impressoras locais e impressoras
	remotas em outras m&aacute;quinas e impressoras conectadas diretamente
	&agrave; rede.
	</para>
      </listitem>

      <indexterm><primary>Trabalho de Impress&atilde;o</primary></indexterm>
      <listitem>
	<para>
		Ele abilita os usu&aacute;rios a enviar arquivos para serem 
	impressos; Esses envios s&atilde;o chamados de 
	<emphasis><foreignphrase>jobs</foreignphrase></emphasis> ( trabalhos de
	impress&atilde;o ).
	</para>
      </listitem>

      <listitem>
	<para>
		Ele permite v&aacute;rios usu&aacute;rios acessando uma &uacute;nica
	impressora ao mesmo tempo, mantendo uma <emphasis>queue</emphasis> 
	(fila de impress&atilde;o) para cada impressora.
	</para>
      </listitem>

      <listitem>
	<para>
		Ele pode imprimir <emphasis>cabe&ccedil;alhos</emphasis> (tamb&eacute;m
		conechido como <emphasis>banner</emphasis> ou 
		<emphasis>burst</emphasis> ent&atilde;o os usu&aacute;rios
		podem com facilidade encontrar seus trabalhos de impress&atilde;o
		 na pilha de impressos.
	  </para>
      </listitem>

      <listitem>
	<para>
		Ele se encarrega dos par&acirc;metros das conex&otilde;es
	de impressoras seriais.
	  </para>
      </listitem>

      <listitem>
	<para>
		Ele pode enviar trabalhos de impress&atilde;o atrav&eacute;s da 
	rede para outro <foreignphrase>spooler</foreignphrase> 
	<application>LPD</application> em um outro servidor.
	</para>
      </listitem>

      <listitem>
	<para>
	Ele pode executar filtros especiais para formatar trabalhos de 
	impress&atilde;o para serem impressos em v&aacute;rias linguagens de 
	impressora ou para compatibilizar as impressoras.
	</para>
      </listitem>

      <listitem>
	<para>Ele pode gerenciar o uso da impressora.
	</para>
      </listitem>
    </itemizedlist>

    <para>Atrav&eacute;s do arquivo de configura&ccedil;&atilde;o
      (<filename>/etc/printcap</filename>), e por providenciar
	programas especiais de filtro, voc&ecirc; pode abilitar o
	sistema <application>LPD</application> para fazer tudo ou
	alguma parte do conjunto das fun&ccedil;&atilde;o de uma grande 
	variedade de impressoras.
	</para>

    <sect2 id="printing-intro-why">
      <title>Como Voc&ecirc; Deve Utilizar o Spooler</title>

      <para>
	Se voc&ecirc; &eacute; um usu&aacute;rio &uacute;nico do sistema
	voc&ecirc; deve se surpreender. 
	Porque voc&ecirc; deveria se preocupar com o 
	<foreignphrase>spooler</foreignphrase> quando voc&eacute; n&atilde;o 
	necessita de controle de acesso, cabe&ccedil;alho de p&aacute;ginas
	ou controle de impress&atilde;o.  Mesmo que fosse possivel habilitar
	o acesso direto a impressora, voc&ecirc; dever&aacute; usar o 
	<foreignphrase>spooler</foreignphrase>
	de qualquer maneira.
	</para>

      <itemizedlist>
	<listitem>
		<para>
			O <application>LPD</application> imprime o trabalho de 
	impress&atilde;o em segundo plano, voc&ecirc; n&atilde;o precisa aguardar 
	os dados serem enviados para a impressora.
	    </para>
	</listitem>

	<indexterm><primary>&tex;</primary></indexterm>
	<listitem>
		<para>
			O <application>LPD</application> pode convenientemente executar 
		um trabalho de impress&atilde;o para ser impresso atrav&eacute;s
		de filtros para adicionar cabe&ccedil;alhos com data/hota ou 
		converter formatos especiais de arquivo ( como o arquivos &tex; DVI )
		em formatos que as impressoras poder&atilde;o entender.
		  Voc&ecirc; n&atilde;o precisar&aacute; fazer manualmente.
	    </para>
	</listitem>

	<listitem>
	  <para>
		Muitos programas gratuitos e comercias preveem a impress&atilde;o 
	    atravatraveseacute;s da funcionalidade de conversar com o <foreignphrase>spooler</foreignphrase> do seu
	    sistema.  Pela configura&ccedil;&atilde;o do sistema de <foreignphrase>spooler</foreignphrase>,
	    voc&ecirc; ir&aacute; mais facilmente suportar outros programas 
	    que voc&ecirc; poder&aacute; adcionar ou j&aacute; ter.
	    </para>
	</listitem>
      </itemizedlist>
    </sect2>
  </sect1>

  <sect1 id="printing-intro-setup">
    <title>Configura&ccedil;&atilde;o B&aacute;sica</title>

    <para>Para usar as impressoras com o  sistema <application>LPD</application>       de spooling, voc&ecirc; ir&aacute; precisar de configurar
	tanto a impressora quanto o programa  
      <application>LPD</application>.  Esse documento descreve dois n&iacute;
	de configura&ccedil;&atilde;:

      </para>
    <itemizedlist>
      <listitem>
	<para>
		Veja a se&ccedil;&atilde;o <link linkend="printing-simple">
	Configura&ccedil;&atilde;o Simples de Impressora</link> para aprender 
	como conectar a impressora, informar ao <application>LPD</application> 
	como se comunicar com as impressoras, e imprimir arquivo em texto 
	puro nelas.
	</para>
      </listitem>

      <listitem>
	<para>Veja a se&ccedil;&atilde;o <link linkend="printing-advanced">
	Configura&ccedil;&atilde;o Avan&ccedil;ada de Impressora
	  </link> para encontrar como imprimir uma variedade de formatos
	especiais de arquivo, para imprimir cabe&ccedil;alhos nas p&aacute;ginas
	para imprimir atravatraveseacute;s da rede, para controlar o acesso &agrave; 
	impressoras, e fazer o balan&ccedil;o de utiliza&ccedil;&atilde;o
	da impressora.
	  </para>
      </listitem>
    </itemizedlist>

    <sect2 id="printing-simple">
    <title>Configura&ccedil;&atilde;o B&aacute;sica</title>

      <para>Essa se&ccedil;&atilde;o mostra como configurar a impressora
	e o programa <application>LPD</application> para usar a
	impressora.
	Ele ir&aacute; ensinar o b&aacute;sico:
	</para>

      <itemizedlist>
	<listitem>
	  <para>Se&ccedil;&atilde;o 
		<link linkend="printing-hardware">
			Configura&ccedil;&atilde;o de Hardware
	    	</link> 
		<para>
		D&aacute; algumas dicas na conex&atilde;o da impressora
	com a porta do seu computador.
	    </para>
	</listitem>

	<listitem>
		<para>
			Se&ccedil;&atilde;o <link linkend="printing-software">
	Configura&ccedil;&atilde;o de Programa</link> mostra como configurar 
	o arquivo de configura&ccedil;&atilde;o 
	(<filename>/etc/printcap</filename>) do <application>LPD</application> 
	<foreignphrase>spooler</foreignphrase> 
		</para>
	</listitem>
      </itemizedlist>

      <para>
	Se voc&ecirc; estiver configurando a impressora para usar o
	protocolo de rede para aceitar dados para imprimir ao inv&eacute;s
	de uma porta paralela ou serial, veja
	<link linkend="printing-advanced-network-net-if">
	Impressoras com Interfaces de Dados Atrav&eacute;s da Rede
	</link>.</para>

      <para>
	Apesar desta se&ccedil;&atilde;o ser chamada de
	<quote>Configura&ccedil;&atilde;o Simples de Impressora
	</quote>, ela &eacute; um pouco complexa.
	Fazer com que a impressora funcione com seu computador e o
	 <application>LPD</application> <foreignphrase>spooler</foreignphrase>
	&eacute; uma parte dificil da configura&ccedil;&atilde;o.
	As op&ccedil;&otilde;s avan&ccedil;adas como cabe&ccedil;alhos de 
	p&aacute;ginas e gerenciamento s&atilde;o facilmente  configu&aacute;
	veis para funcionar na impressora.
	</para> 

      <sect3 id="printing-hardware">
	<title>Configura&ccedil;&atilde;o de Hardware</title>

	<para>
	Esta se&ccedil;&atilde;o mostra v&aacute;rios meios para voc&ecirc;
	conectar a impressora no seu PC.  Fala sobre portas de 
	comuni&ccedil;&atilde;o e cabos, e tamb&eacute;m sobre 
	configura&ccedil;&atilde;o do kernel que ser&aacute; necess&aacute;ria
	habilitar para que o FreeBSD possa comunicar-se com a impressora.
	</para>

	<para>
	Se voc&ecirc; j&aacute; tem uma impressora conectada e obteve 
	sucesso em imprimir em outro sistema operacional, voc&ecirc;
	provavelmente poder&aacute; pular para a se&ccedil;&atilde;o 
		<link linkend="printing-software">
			Configura&ccedil;&atilde;o do Programa
		</link>.
	</para>

	<sect4 id="printing-ports">
	  <title>Portas e Cabos</title>

	<para>
	A grande maioria de impressoras que voc&egrave; pode ter
	para usar em um PC possui suporte a pelo menos uma das interfaces
	abaixo:
	</para>

	  <itemizedlist>
	    <indexterm>
        <primary>printers</primary>
        <secondary>serial</secondary>
      </indexterm>
	    <listitem>
	      <para>
		Interface <emphasis>serial</emphasis> usa a porta serial
		do seu computador para enviar dados para a impressora.  
		A interface serial s&atilde;o encontradas comumente em 
		computadores industriais e os cabos estao dispon&iacute;veis e 
		tamb&eacute;m s&atilde;o de f&aacute;cil 
		constru&ccedil;&atilde;o.  Interfaces serial algumas vezes 
		necessitam de cabos especiais e normalmente requer que 
		voc&ecirc; configure algumas op&ccedil;&otilde;es complexas 
		da comunica&ccedil;&atilde;o.
		</para>
	    </listitem>

	    <indexterm>
        <primary>printers</primary>
        <secondary>parallel</secondary>
      </indexterm>
	    <listitem>
	      <para>
		Interface <emphasis>paralela</emphasis> usa a porta paralela
		do seu computador para enviar dados para a impressora.
		Interface paralela &eacute; mais comum em PC.  Os cabos 
		s&atilde;o disponibilizados mais facilmente, mas s&atilde;o 
		mais dif&iacute;ceis de serem montados manualmente.  
		Normalmente n&atilde;o existem op&ccedil;&otilde;es para
		serem configuradas nas interfaces paralela, tornado a 
		configura&ccedil;&atilde;o extremamente mais simples.
	      </para>
	      <indexterm>
	        <primary>centronics</primary>
		<see>parallel printers</see>
	      </indexterm>
	      <para>
		Interfaces paralela s&atilde;o normalmente conhecidas como
	interface <quote>Centronics</quote>, nome este dado por causa do
	tipo de conector utilizado na impressora.
	</para>
	    </listitem>
	  </itemizedlist>

	  <para>
		Em geral, as interfaces serial s&atilde;o mais lentas
	que as paralelas.  Interfaces paralelas normalmente s&atilde;o 
	disponibilizadas em uma &uacute;nica dire&ccedil;&atilde;o para
	comunica&ccedil;&atilde;o ( do computador para a impresora)
	enquanto que a serial proporciona uma comunica&ccedil;&atilde;o
	bi-direcional.  As novas portas paralelas (EPP e ECP) e as
	impressoras podendo comunicar em ambas as dire&ccedil;&otilde;es sob
	o FreeBSD quando um cabo padr&atilde;o IEEE1284 estiver sendo usado.
	</para>

	  <indexterm><primary>PostScript</primary></indexterm>
	  <para>
		Usualmente, ivoc&ecirc; somente precisar&aacute; da 
		comunica&ccedil;&atilde;o bi-direcional se sua impressora 
		<foreignphrase>reconhe&ccedil;a</foreignphrase> 	
		&postscript;.  Impressora &postscript; pode ser muito 
		<foreignphrase>verbose</foreignphrase>.  De fato 
		<foreignphrase>jobs</foreignphrase> &postscript; 
		s&atilde;o as sa&iacute;das atuais que os programas enviam 
		para as impressoras; 
		<foreignphrase>Eles n&atilde;o precis&atilde;o 
		produzir papel como um todo actually programs sent to 
		the printer; they need not produce paper at all </foreignphrase>
		e pode retornar resultados diretamente para o computador.
	    	&postscript; Tamb&eacute;m usa comunica&ccedil;&atilde;o
		bi-direcional para informar ao computador sobre problemas 
		ocorridos, tais como erros em progrmas &postscript; ou
		papel embaralhado (paper jam).  Seus usu&aacute;rios podem
		ficar agradecidos com essas inform&ccedil;&otilde;ess.
		Entretanto, o melhor meio para fazer o accounting efetivo 
		com uma impressora &postscript; requer que a 
		cominuca&ccedil;&atilde;o seja bi-direcional: voc&ecirc; 
		pergunta a impressora sobre a contagem de p&aacute;ginas
		(quantas p&aacute;gians ela j&aacute; imprimiu durante
		seu uso, vida &uacute;til), ent&atilde;o envia o 
		<foreignphrase>job</foreignphrase> do usu&aacute;rio
		faz novamente a pergunta &agrave; impressora sobre
		o total de p&aacute;gians impressas e ent&atilde;o faz
		a subtra&ccedil;ao dos valores para saber o valor exato
		de p&aacute;ginas impressa pelo usu&aacute;rio.
	    </para>
	</sect4>
	  
	<sect4 id="printing-parallel">
	  <title>Porta Paralela</title>

	  <para>
		Para conectar a impressora usando a interface paralela, 
		utilize o cabo Centronics entre a impressora e o computador.
		As instru&ccedil;&otilde;es que vem no manual da impressora
		e/ou do computador, devem dar a voc&ecirc; um passo-a-passo
		completo.
	    </para>

	  <para>
		Lembre-se qual porta paralela voc&ecirc; est&aacute;
	usando no computador.  A primeira porta paralela &eacute; 
	<filename>/dev/ppc0</filename> Para o FreeBSD; a segunda &eacute;
	<filename>/dev/ppc1</filename>, e assim por diante.  Os dispositivos
	de impressora usam o seguinte esquema de nomes:
	
	    <filename>/dev/lpt0</filename> Para a impressora conectada
	na primeira porta paralela etc.
	    </para>
	</sect4>

	<sect4 id="printing-serial">
	  <title>Porta Serial</title>

	  <para>
		Para conectar a impressora em uma porta serial, voc&ecirc;
	dever&aacute; possuir o cabo serial apropriado para interligar o
	computador com a impressora.  As instru&ccedil;&otilde;es que vem
	com a impressora e/ou com o computador, dever&aacute; dar &agrave;
	voc&ecirc; um completo passo-a-passo.
	</para>

	  <para>
		Se voc&ecirc; n&atilde;o est&aacute; seguro sobre qual o tipo
	de <quote>cabo serial</quote> que est&aacute; usando, voc&ecirc; pode 
	tentar uma dessas alternativas:
	</para>
	  <itemizedlist>
	    <listitem>
	      <para>O cabo tipo <emphasis>modem</emphasis> conecta cada pino
	do conector de um lado ao correspondente do outro conector.  Esse tipo
	de cabo tamb&eacute;m &eacute; conhecido como cabo
		<quote>DTE-to-DCE</quote>.</para>
	    </listitem>

	    <indexterm><primary>null-modem cable</primary></indexterm>
	    <listitem>
	      <para>
			O cabo tipo  <emphasis>null-modem</emphasis> conecta 
		alguns dos pinos diretamente e troca outros ( como por
		exemplo os pinos respons&aacute;veis por enviar e receber
		dados ), curta-circuita outros (liga-os entre si) internamente
		em cada conector. Esse tipo de cabo &eacute; tamb&eacute;m 
		conechido como cabo <quote>DTE-to-DTE</quote>
	     </para>
	    </listitem>

	    <listitem>
	      <para>O cabo de <emphasis>impressora serial</emphasis>, &eacute;
	necess&aacute;rio para algumas impressoras n&atilde;o comuns,
	&eacute; semelhante ao cabo null-modem, mas envia alguns sinais
	que est&aacute;o curto-circuitados internamente.
		</para>
	    </listitem>
	  </itemizedlist>

	  <indexterm><primary>baud rate</primary></indexterm>
	  <indexterm><primary>parity</primary></indexterm>
	  <indexterm><primary>flow control protocol</primary></indexterm>
	  <para>
		Voc&ecirc; dever&aacute; configurar alguns parametros
	da comunica&ccedil;&atilde;o da impressora, que usualmente s&atilde;o 
	feitos no painel frontal ou nas mini chaves (DIP switchs).  Altere
	o valor de <literal>bps</literal> (bits por segundos, chamado
	frequentemente de <emphasis>baud rate</emphasis>) que &eacute; a 
	taxa de transfer&ecirc;ncia entre o computador e a impressora,
	ambos devem ter a mesma taxa de transfer&egrave;ncia.
	Selecione entre 7 e 8 bits; paridade, par, &iacute;mpar, nenhuma;
	ou 1 ou 2 <foreignphrase>stop bits</foreignphrase>.  Tamb&eacute;m
	o protocolo de controle de fluxo; nenhum ou XON/XOFF ( tamb&eacute;m
	conhecido como controle de fluxo por <quote>hardware</quote> 
	(<quote><foreignphrase>in-band</foreignphrase></quote>) ou por 
	<quote>software</quote>.
		Lembre-se dessa configura&ccedil;&otilde;es para poder
	aplica-las na configura&ccedil;&atilde;o dos programas, como vamos
	verificar a seguir.
	    </para>
	</sect4>
      </sect3>

      <sect3 id="printing-software">
	<title>
		Configura&ccedil;&atilde;o de Programa
	</title>

	<para>
		Essa se&ccedil;&atilde;o descreve as 
	configura&ccedil;&otilde;es necess&aacute;rias para imprimir com 
	o sistema de <foreignphrase>spooling</foreignphrase> no FreeBSD.
	</para>

	<para>
		Um resumo do que ser&aacute; visto neste passo:
	</para>

	<procedure>
	  <step>
		<para>
		Configure o seu kernel, se necess&aacute;rio, para
	utilizar a porta que voc&ecirc; deseja conectar a sua impressora.
	A se&ccedil;&atilde;o <link linkend="printing-kernel">
		Configura&ccedil;&atilde;o do Kernel</link> informa
	&agrave; voc&ecirc; o que &eacute; necess&aacute;rio fazer.
		</para>
	  </step>

	  <step>

		<para>
		Configure o modo de comunica&ccedil;&atilde;o da porta
	paralela, se voc&ecirc; est&aacute; usando a porta paralela
	se&ccedil;&atilde;o
	<link linkend="printing-parallel-port-mode"> Configure o Modo de 
		Comunica&ccedil;&atilde;o para a Porta Paralela
	</link> para ter mais detalhes.
		</para>

	  </step>

	  <step>
	    <para>
		Teste se o sistema operacional pode enviar dados para a 
	impressora.  A se&ccedil;&atilde;o 
	<link linkend="printing-testing">
		Verificando a Comunica&ccedil;&atilde;o com a Impressora
	</link> d&aacute; algumas sugest&otilde;es de como fazer iso.
	      </para>
	  </step>

	  <step>
		<para>
		Configure o <application>LPD</application> para a
	utiliza&ccedil;&atilde;o da impressora, modificando o arquivo
	<filename>/etc/printcap</filename>.  Voc&ecirc; ir&aacute; 
	o que fazer mais tarde neste cap&iacute;tulo.
		</para>
	  </step>
	</procedure>

	<sect4 id="printing-kernel">
	<title>
		Configura&ccedil;&atilde;o do Kernel
	</title>

	<para>
		O kernel do sistema operacional &eacute; compilado para
	trabalhar com um determinado conjunto de dispositivos.  As interfaces
	serial e paralela para a utiliza&ccedil;&atilde;o da impressora 
	fazem parte deste conjunto.  Entrtanto, pode ser necess&aacute;rio
	adcionar o suporte para uma porta serial ou paralela caso o seu
	kernel n&atilde;o esteja configurado.
	</para>

	<para>
		Para saber se seu kernel j&aacute; possui o suporte
	para interface serial, digite:
	</para>

	  <screen>&prompt.root; <userinput>grep sio<replaceable>N</replaceable> /var/run/dmesg.boot</userinput></screen>

	<para>
		Onde <replaceable>N</replaceable> &eacute; o n&uacute;mero
	da porta serial, iniciando do zero.  Se voc&ecirc; ver algo 
	semelhante &agrave;:
	</para>

	  <screen>
		sio2 at port 0x3e8-0x3ef irq 5 on isa
		sio2: type 16550A
	</screen>

	<para>
		Ent&atilde;o o kernel suporta a porta.
	</para>

	<para>
		Para saber se seu kernel j&aacute; possui o suporte
	para interface paralela, digite:
	</para>

	  <screen>&prompt.root; <userinput>grep ppc<replaceable>N</replaceable> /var/run/dmesg.boot</userinput></screen>

	<para>
		Onde <replaceable>N</replaceable> &eacute; o n&uacute;mero
	da porta paralela, iniciando do zero.  Se voc&ecirc; ver algo 
	semelhante &agrave;:
	</para>
	    
	    <screen>
		ppc0: &lt;Parallel port&gt; at port 0x378-0x37f irq 7 on isa0
		ppc0: SMC-like chipset (ECP/EPP/PS2/NIBBLE) in COMPATIBLE mode
		ppc0: FIFO with 16/16/8 bytes threshold</screen>
	    
	<para>
		Ent&atilde;o o kernel suporta a porta.
	</para>

	<para>
		Voc&ecirc; pode ter que reconfigurar o seu kernel para
	que o sistema operacional possa reconhecer e usar as portas
	paralela e/ou serial, para que voc&ecirc; possa utilizar a
	impressora.
	</para>

	<para>
		Para adcionar suporte a porta serial, consulte a 
	se&ccedil;&atilde;o de configura&ccedil;&atilde;o do kernel.  Para
	adcionar suporte a porta paralela consulte esta se&ccedil;&atilde;o
	<emphasis>e</emphasis> a se&ccedil;&atilde;o a seguir.
	</para>

	</sect4>
      </sect3>

      <sect3 id="printing-dev-ports">
	<title>
		Adcionando Entradas para as Portas no <filename>/dev</filename> 
	  </title>

	<note><para>FreeBSD&nbsp;5.0 inclui o sistema de arquivos
	 <literal>devfs</literal>, o qual automaticamente cria
	os nos dos dispositivos necess&aacute;rios.  Se voc&ecirc; est&aacute;
	executando a vers&atilde;o do FreeBSD com <literal>devfs</literal>
	habilitado, voc&ecirc; pode pular com seguran&ccedil;a esta
	se&ccedil;&atilde;o.
	  </para></note>

	<para>
	Uma vez que o kernel j&aacute; suporta a comunica&ccedil;&atilde;o
	ou pela porta paralela ou porta serial, voc&ecirc; ainda precisa
	da interface de programa atrav&eacute;s da qual voc&ecirc; ir&aacute;
	enviar e receber dados.
		&Eacute; para isso que server a entrada no diret&oacute;rio
	  <filename>/dev</filename> server.
	</para>

	<para><emphasis>Para adcionar uma entrada para a porta no
	diret&oacute;rio <filename>/dev</filename> siga os passos:
	  </emphasis></para>

	<procedure>
	  <step>
	    <para>
		Torne-se o usu&aacute;rio  <username>root</username> 
	com o comando &man.su.1; .
		Entre com a senha do usu&aacute;rio <username>root</username>
	quando for solicitado.
		</para>
	  </step>

	  <step>
	    <para>
			Mude para o diret&oacute;rio <filename>/dev</filename>
		</para>

	    <screen>&prompt.root; <userinput>cd /dev</userinput></screen>
	  </step>

	  <step>
	    <para>Digite:</para>

	    <screen>
		&prompt.root; <userinput>./MAKEDEV <replaceable>porta</replaceable></userinput>
	</screen>

	    <para>Onde a <replaceable>porta</replaceable> &eacute; a 
	entrada para o dispositivo para a porta que voc&ecirc; quer
	criar.  Use <literal>lpt0</literal> para a impressora conectada
	na primeira porta paralela, <literal>lpt1</literal> para a segunda
	porta paralela, e assim consecutivamente; use <literal>ttyd0</literal>
	para a primeira porta serial, <literal>ttyd1</literal> para a segunda
	e assim consecutivamente.
		</para>
	  </step>

	  <step>
	    <para>Digite:</para>

	    <screen>&prompt.root; <userinput>ls -l <replaceable>porta</replaceable></userinput></screen>

	    <para>Para ter certeza de que a entrada do dispositivo foi criada.
		</para>
	  </step>
	</procedure>

	<sect4 id="printing-parallel-port-mode">
	  <title>
		Configurando o Modo de Comunica&ccedil;&atilde;o para
	a Porta Paralela
	 </title>

	  <para>
		Quando voc&ecirc; for usar a interface paralela, voc&ecirc;
	deve escolher entre o modo utilizando interrup&ccedil;&atilde;o
	ou por <foreignphrase>polling</foreignphrase>.  Driver para o
	dispositivo gen&eacute;rico de impressora (&man.lpt.4;) para
	 FreeBSD&nbsp;4.X e 5.X usa o sistema &man.ppbus.4;, o qual 
	controla a porta do chipset com o driver &man.ppc.4; driver.
	</para>

	  <itemizedlist>
	    <listitem>
	      <para>
		O m&eacute;todo de 
		<emphasis>interrup&ccedil;&atilde;o</emphasis> &eacute; o
	padr&atilde;o com o kernel GENERIC.  Com esse m&eacute;todo
	o sistema operacional sua uma linha de interrup&ccedil;&atilde;o
	IRQ para determinar se a impressora est&aacute; pronta para
	receber os dados.
		</para>
	    </listitem>

	    <listitem>
	      <para>O m&eacute;todo de <emphasis>polled</emphasis> 
	direciona o sistema operacional para perguntar repetidamente se
	a impressora est&aacute; pronta para receber dados.  Quando
	a resposta &eacute; afirmativa, o sistema envia os dados.
		</para>
	    </listitem>
	  </itemizedlist>

	  <para>
	O m&eacute;todo de interrup&ccedil;&atilde;o &eacute; normalmente
	mais r&aacute;pido mas usa uma linha de IRQ preciosa.  Algumas
	das novas impressoras HP n&atilde;o funcionam corretamente neste
	modo, aparentemente &eacute; um problema de temporiza&ccedil;&atilde;o
	( ainda n&atilde;o completamente compreedido ).  Essas impressoras
	necessitam do modo de <foreignphrase>polling</foreignphrase>.
	Voc&ecirc; deve utilizar um dos dois m&eacute;todos para
	trabalhar.  Algumas impressoras ir&atilde;o trabalhar em ambos os
	modos, mas ficaram sensivelmente mais lentas no mode de 
	interrup&ccedil;&atilde;o
	</para>
	  <para>
		Voc&ecirc; pode configurar o modo de comuni&ccedil;&atilde;oca
	de duas maneiras: pela concifgura&ccedil;&atilde;o do kernel ou 
	usando o programa &man.lptcontrol.8;
	    </para>

	  <para><emphasis>
		Para configurar o mode de comunica&ccedil;&atilde;o pelo
	kernel:
	    </emphasis></para>

	  <procedure>
	    <step>
	      <para>
		Voc&ecirc; deve editar o arquivo de configura&ccedil;&atilde;o
	do kernel.  Procure pela entrada <literal>ppc0</literal>.  Se 
	voc&ecirc; for configurar a segunda porta paralela, use 
	<literal>ppc1</literal>.  Use <literal>ppc2</literal> para a terceira
	porta, e assim consecutivamente.
		</para>

	      <itemizedlist>
		<listitem>
		  <para>
		Se voc&ecirc; preferir o modo de interrrup&ccedil;&atilde;o,
	para FreeBSD&nbsp;4.X inclua a especifica&ccedil;&atilde;o da
		    <literal>irq</literal>:</para>

		  <programlisting>device ppc0 at isa? irq <replaceable>N</replaceable></programlisting>

		<para>
			Onde <replaceable>N</replaceable> &eacute; a
	IRQ para a porta paralela do seu computador.
		</para>

		<para> Para o FreeBSD&nbsp;5.X, edite a seguinte linha: </para>

		  <programlisting>hint.ppc.0.irq="<replaceable>N</replaceable>"</programlisting>

		  <para>
		No arquivo <filename>/boot/device.hints</filename> e troque 
	<replaceable>N</replaceable> pelo n&uacute;mero correto da IRQ.  
	O arquivo de configura&ccedil;&atilde;o do kernel tamb&eacute;m 
	deve conter o driver &man.ppc.4; 
		</para>

		  <screen>device ppc</screen>

		</listitem>

		<listitem>
		  <para>
			Se voc&ecirc; for utilizar o modo
	de <foreignphrase>polling</foreignphrase>, n&atilde;o adcione a 
	especifica&ccedil;&atilde;o da <literal>irq</literal>:
		</para>

		  <para>
			Para o FreeBSD&nbsp;4.X, use a seguinte linha
	no arquivo de configura&ccedil;&atilde;o do kernel:
		    </para>

		  <programlisting>device ppc0 at isa?</programlisting>

		  <para>
			Para o FreeBSD&nbsp;5.X, simplesmente remova
	em seu arquivo <filename>/boot/device.hints</filename>  a 
	seguinte linha:
		    <para>

		  <programlisting>hint.ppc.0.irq="<replaceable>N</replaceable>"</programlisting>

		  <para>
			Em alguns casos, isso n&atilde;o ser&aacute;
	suficiente para colocar a porta em modo de 
	<foreignphrase>polling</foreignphrase> no FreeBSD&nbsp;5.X.  
	Na maior parte das vezes, isso &eacute; devido ao driver 
	&man.acpi.4;, mas tarde habilita para detec&ccedil;&atilde;o e
	<foreignphrase>atacha</foreignphrase> os dispositivos, e ent&atilde;o
	controla o modo de acesso &agrave; porta da impressora.
		Voc&ecirc; deve checar sua configuta&ccedil;&atilde;o
   	&man.acpi.4; para corrigir esse problema.
		    </para>
		</listitem>
	      </itemizedlist>
	    </step>

	    <step>
	      <para>
		Salve o arquivo.  Ent&atilde;o configure, compile
	e instale o novo kernel, e aseguir reboot o seu sistema.
	Veja <link 
	linkend="kernelconfig">Configura&ccedil;&atilde;o do Kernel</link>
	para maiores detalhes.
		</para>
	    </step>
	  </procedure>

	  <para><emphasis>Para configurar o modo de comunica&ccedil;&atilde;o
	com </emphasis> &man.lptcontrol.8;:</para>

	  <procedure>
	    <step>
	      <para>Digite:</para>

	      <screen>&prompt.root; <userinput>lptcontrol -i -d /dev/lpt<replaceable>N</replaceable></userinput></screen>

	      <para>
		para configurar o modo de interrup&ccedil;&atilde;o
	para a <literal>lpt<replaceable>N</replaceable></literal>.
		</para>
	    </step>

	    <step>
	      <para>Digite:</para>

	      <screen>&prompt.root; <userinput>lptcontrol -p -d /dev/lpt<replaceable>N</replaceable></userinput></screen>

	      <para>
		Para configurar o modo de 
			<foreignphrase>polling</foreignphrase> para
		<literal>lpt<replaceable>N</replaceable></literal>.</para>
	    </step>
	  </procedure>

	  <para>
		Voc&ecirc; pode colocar esses comandos no arquivo 
	<filename>/etc/rc.local</filename> para configurar automaticamente
	na hora da inicializa&ccedil;&atilde;o do seu sistema.  Veja 
	&man.lptcontrol.8; para maiores detalhes.</para>
	</sect4>

	<sect4 id="printing-testing">
	  <title>
		Testanto a Comunica&ccedil;&atilde;o com a Impressora
	</title>

	<para>
		Antes de procequir com a configura&ccedil;&atilde;o do 
	sistema	<foreignphrase>spooling</foreignphrase>, voc&egrave;
	deve ter certeza que o seu sistema operaional teve sucesso
	em enviar dados para a impressora.  &Eacute; muito mais f&aacute;cil
	depurar a conex&atilde;o com a impressora e o systema de 
	<foreignphrase>spooling</foreignphrase> separadamente.
	</para>

	<para>
		Para fazer o teste da impressora, nos precisamos enviar
	algum testo para a impressora.  Para impressoras que podem imprimir
	caracteres diretamente, o programa &man.lptest.1; &eacute; perfeito: 
	ele gera todos os 96 caracteres imprim&iacute;veis da tabela ASCII 
	em 96 linhas.
	</para>

	<indexterm><primary>PostScript</primary></indexterm>
	<para>
		Para a impressora &postscript; (ou outra linguagem )
	nos iremos precisar de algo mais sofisticado para testar.  Um 
	pequeno programa &postscript; como o que segue, &eacute; o 
	sufuciente
	</para>

	  <programlisting>%!PS
100 100 moveto 300 300 lineto stroke
310 310 moveto /Helvetica findfont 12 scalefont setfont
(Is this thing working?) show
showpage</programlisting>

	<para>
		O c&oacute;digo &postscript; acima pode ser colocado
	em um arquivo e usado como mostra os exemplos nas sec&ccedil;&otilde;es
	a seguir.
	</para>

	  <indexterm><primary>PCL</primary></indexterm>
	  <note>
		<para>
		Quando esse documento refere-se a linguagem da
	impressora,  &eacute; assumido que a linguagem &eacute; 
	semelhante ao &postscript;,  e n&atilde;o o PCL da Hewlett 
	PackardL.  Ainda que a linguagem PCL tenha grande funcionalidade,
	voc&ecirc; pode mesclar texto puro com seguencias de controle
	com caracteres ESC.  &postscript; n&atilde;o pode ser impresso
	diretamente em impressoras de texto puro, e para impressoras que
	necessitem de outra linguagem para imprimir, ser&aacute; 
	necess&aacute;rio acomoda&ccedil;&otilde;es.
		</para>
	  </note>

	  <sect5 id="printing-checking-parallel">
		<title>
			Verificando a Impressora Paralela
		</title>

	    <indexterm>
        <primary>printers</primary>
        <secondary>parallel</secondary>
      </indexterm>
	<para>
		Essa se&ccedil;&atilde;o informa &agrave; voc&ecirc;
	como verificar se o FreeBSD pode comunicar-se com a impressora
	conectata na porta paralela.
	</para>

	<para>
		<emphasis>Para testa a impressora na porta paralela:
	</emphasis>
	</para>

	    <procedure>
	      <step>
		<para>
			Torne-se <username>root</username> com  &man.su.1;.
		</para>
	      </step>

	      <step>
		<para>
			Envie Dados para a impressora.
		</para>

		<itemizedlist>
		  <listitem>
			<para>
			Se a impressora poder imprimir texto puro, use
	&man.lptest.1;.  Digite:
			</para>

		    <screen>&prompt.root; <userinput>lptest &gt; /dev/lpt<replaceable>N</replaceable></userinput></screen>

			<para>
			Onde <replaceable>N</replaceable> &eacute; o 
	n&uacute;mero da porta paralela, iniciando em 0
			</para>
		  </listitem>

		  <listitem>
		    <para>Se a impressora entender &postscript; ou outra
	linguagem de impressora, ent&atilde;o envie um pequeno programa
	para a impressora.  Digite:</para>

		    <screen>&prompt.root; <userinput>cat &gt; /dev/lpt<replaceable>N</replaceable></userinput></screen>

		    <para>
			Ent&atilde;o a linha por linha, digite o programa
	<emphasis>cuidadosamente</emphasis> como voc&ecirc; n&atilde;o
	poder&aacute; editar a linha caso tenha pressionado a tecla
	<literal>RETURN</literal> ou <literal>ENTER</literal>.  Quando 
	voc&ecirc; terminar de digitar o programa, pressione as teclas
	<literal>CONTROL+D</literal>, ou tecla que for fim-de-arquivo.
		      </para>

		    <para>Alternativamente, voc&ecirc; pode colocar o programa
	em um arquivo e digitar:
		      </para>
		    <screen>&prompt.root; <userinput>cat <replaceable>arquivo</replaceable> &gt; /dev/lpt<replaceable>N</replaceable></userinput></screen>

		    <para>Onde  <replaceable>arquivo</replaceable> &eacute;
	o nome do arquivo a ser digitado, que contenha o programa que
	voc&ecirc; envia para a impressora.
		      </para>
		  </listitem>
		</itemizedlist>
	      </step>
	    </procedure>

	    <para>Voc&ecirc; dever&aacute; ver algo semelhante impresso.  
	N&atilde;o se preocupe se o texto n&atilde;o sair como esperado; nos
	iremos consertar algumas coisas mais tarde.
	      </para>
	  </sect5>

	  <sect5 id="printing-checking-serial">
	    <title>Verificando a Impressora Serial
		</title>

	    <indexterm>
        <primary>printers</primary>
        <secondary>serial</secondary>
      </indexterm>
	    <para>Essa se&ccedil;&atilde;o informa &agrave; voc&ecirc;
	como verificar se o FreeBSD pode comunicar com a impressora pela
	porta serial.</para>

	    <para><emphasis>Para testa a impressora na porta serial:
	      </emphasis></para>

	    <procedure>
	      <step>
		<para>Torne-se <username>root</username> com &man.su.1;.</para>
	      </step>

	      <step>
		<para>Edite o arquivo <filename>/etc/remote</filename>.  
	Adicione a seguinte entrada:</para>

		<programlisting>printer:dv=/dev/<replaceable>porta</replaceable>:br#<replaceable>bps-rate</replaceable>:pa=<replaceable>paridade</replaceable></programlisting>

		<indexterm><primary>bits-per-second</primary></indexterm>
		<indexterm><primary>serial port</primary></indexterm>
		<indexterm><primary>parity</primary></indexterm>
		<para>Onde <replaceable>porta</replaceable> &eacute; o
	dispositivo para a porta serial (<literal>ttyd0</literal>,
		  <literal>ttyd1</literal>, etc.),
		  <replaceable>bps-rate</replaceable> &eacute; a taxa em
		  bits-por-segundo pela qual a impressora ir&aacute;
	se comunuicar, e <replaceable>paridade</replaceable> &eacute; a 
	paridade requierida pela impressora ( deve ser uma dessas, a seguir:
  	<literal>par</literal>, <literal>&iacute;mpar</literal>, 
	<literal>nenhum</literal>, ou <literal>zero</literal>).</para>

		<para>
		Aqui tem um exemplo de uma impressora conectada via terceira 
	porta seria a uma taxa de 19200&nbsp;bps sem paridade:
		  </para>

		<programlisting>printer:dv=/dev/ttyd2:br#19200:pa=none</programlisting>
	      </step>

	      <step>
		<para>Conectando a impressora com &man.tip.1;.  Digite:</para>

		<screen>&prompt.root; <userinput>tip printer</userinput></screen>

		<para>
			Se esse passo n&atilde;o funcionar, edite o arquivo
	<filename>/etc/remote</filename> e tente usando
		  <filename>/dev/cuaa<replaceable>N</replaceable></filename>
		  ao inv&eacute;s de 
		  <filename>/dev/ttyd<replaceable>N</replaceable></filename>.</para>
	      </step>

	      <step>
		<para>Envie dados para a impressora.  </para>

		<itemizedlist>
		  <listitem>
		    <para>Se a Impressora pode imprimir texto puro, use
		      &man.lptest.1;.  Digite:</para>

		    <screen>&prompt.user; <userinput>$lptest</userinput></screen>
		  </listitem>

		  <listitem>
		    <para>Se a impressora entende &postscript; ou outra
	liguagem, envie um pequeno programa para a impressora.  Digite o 
	programa linha-a-linha <emphasis>muito cuidadosamente</emphasis> 
	porque as teclas de edi&ccedil;&atilde;o podem ter significado 
	para a impressora.  Voc&ecirc; tamb&eacute;m pode precisar 
	digitar o caracter especial de fim-de-arquivo para a impressora
	reconhecer que recebeu todo o programa.  Para a impressora
	&postscript;, pressione <literal>CONTROL+D</literal>.</para>

		    <para>
		Alternativamente, voc&ecirc; pode colocar o programa 
	em um arquivo e digitar:
		    </para>

		    <screen>&prompt.user; <userinput>&gt;<replaceable>arquivo</replaceable></userinput></screen>

		    <para>Onde <replaceable>arquivo</replaceable> &eacute;
	o nome do arquivo que cont&eacute;m o programa.  Apos
	&man.tip.1; envia o arquivo, pressione a seguencia fim-de-arquivo.
		      </para>
		  </listitem>
		</itemizedlist>
	      </step>
	    </procedure>

	    <para>
		Voc&ecirc; deve ver algo impresso.  N&atilde;o se preocupe 
	se o texto n&atilde;o se parecer correto;  nos iremos consertar 
	isso mais tarde.
	      </para>
	  </sect5>
	</sect4>
      </sect3>

      <sect3 id="printing-printcap">
	<title>
		Habilitando o <foreignphrase>Spooler</foreignphrase>: 
		O Arquivo <filename>/etc/printcap</filename>
	  </title>

	<para>
		Nesse ponto, sua impressora deve estar conectada, seu kernel
	configurado e comunicando com a impressora, e voc&ecirc; teve sucesso
	ao enviar dados para a impressora.  Agora, nos estamos prontos para 
	configurar <application>LPD</application> para controlar o acesso
	a sua impressora.
	  </para>

	<para>
		Voc&ecirc; configura o <application>LPD</application> pela 
	edi&ccedil;&atilde;o do arquivo <filename>/etc/printcap</filename>.  
	  O sistema de <foreignphrase>spooling</foreignphrase> 
	<application>LPD</application> l&ecirc; este arquivo a cada vez que
	o <foreignphrase>spooler</foreignphrase> &eacute; necess&aacute;rio
	ent&atilde;o a atualiza&ccedil;&atilde;o do arquivo se reflete
	imediatamente na aplica&ccedil;&atilde;o.
	  </para>

	<indexterm>
    <primary>printers</primary>
    <secondary>capabilities</secondary>
  </indexterm>
	<para>
		O formato do arquivo &man.printcap.5; &eacute; direto.
	  Use o seu editor de texto favorito para realizar as mudan&ccedil;as
	no arquivo <filename>/etc/printcap</filename>.  O formato &eacute;
	identico ao outros arquivos de compatibilidades como os 
	  <filename>/usr/share/misc/termcap</filename> e
	  <filename>/etc/remote</filename>.  Para completa 
	informa&ccedil;&atilde;o sobre o formato, veja &man.cgetent.3;.</para>

	<para>
		A simples configura&ccedil;&atilde;o do 
	<foreignphrase>spooler</foreignphrase> consiste com em
	seguir os seguintes passos:
	  </para>

	<procedure>
	  <step>
	    <para>
		Escolha um nome (e algum apelido conveniente) para a sua
	impressora, e coloque-o no arquivo <filename>/etc/printcap</filename> 
	Veja a se&ccedil;&atilde;o 
	      <link linkend="printing-naming">Naming the Printer</link>
	para maiores informa&ccedil;&otilde;es sobre dar nomes.</para>
	  </step>
	  <indexterm><primary>header pages</primary></indexterm>
	  <step>
	    <para>
		Para desligar o cabe&ccedil;alho de p&aacute;ginas ( ele
	&eacute; habilitado por padr&atilde;o ) inserindo a chave
	<literal>sh</literal>; veja a se&ccedil;&atilde;o
	      <link linkend="printing-no-header-pages">
	Suprimindo o Cabe&ccedil;alho de P&aacute;ginas</link> para
	maiores informa&ccedil;&otilde;es.</para>
	  </step>

	  <step>
	    <para>
		Criando o diret&oacute;rio de 
	<foreignphrase>spooling</foreignphrase>, e especificando a sua 
	posi&ccedil;&atilde;o com a chave <literal>sd</literal>; veja a
	se&ccedil;&atilde;o <link linkend="printing-spooldir">
	Criando o Diret&oacute;rio de <foreignphrase>Spooling</foreignphrase>
	</link> para maiores informa&ccedil;&otilde;es
	</para>
	  </step>

	  <step>
	    <para>Veja a entrada <filename>/dev</filename> para usar
	a sua impressora, e coloque ela dentro do arquivo 
	<filename>/etc/printcap</filename> na chave <literal>lp</literal>;
	veja a se&ccedil;&atilde;o <link linkend="printing-device">
	Identifica&ccedil;&atilde;o do Dispositivo de Impress&atilde;o
	</link> para maiores informa&ccedil;&otilde;es.  Se a impressora
	estiver na porta serial, configure os parametros de 
	comunica&ccedil;&atilde;o use a chave the <literal>ms#</literal> 
	o qual &eacute; discutido na se&ccedil;&atilde;o 
	<link linkend="printing-commparam">
		Configurando os Parametros Comuni&ccedil;&atilde;o 
		do <foreignphrase>Spooler</foreignphrase> </link>.</para>
	  </step>

	  <step>
	    <para>
		Instalar um filtro de entrada para texto puro; veja
	a se&ccedil;&atilde;o <link linkend="printing-textfilter">
	Instalando o Filtro de Texto </link> para mais detalhes:
		</para>
	  </step>

	  <step>
	    <para>Testanto a configura&ccedil;&atilde;o, imprimindo alguma
	coisa com o comando &man.lpr.1;.  Mais detalhes est&aacute;o 
	dispon&iacute;veis em 
		<link linkend="printing-trying">
			<foreignphrase>Trying It Out</foreignphrase>
		</link> e
	      <link linkend="printing-troubleshooting">
			Localiza&ccedil;&atilde;o de Defeitos
		</link>
	      </para>
	  </step>
	</procedure>

	<note>
	  <para>Impressora baseada em linguagem, como impressoras 
	&postscript;, n&atilde;o podem imprimir diretamente texto puro.
	A simples configura&ccedil;&atilde;o descrita acima e descrita
	nas se&ccedil;&otilde;es seguintes assume que se voc&ecirc; 
	est&aacute; instalando uma impressora que voc&ecirc; s&oacute;
	ir&aacute; imprimir arquivos que ela possa entender.</para>
	</note>

	<para>
	Usu&aacute;rios geralmente tem espectativa que eles podem imprimir
	texto puro para qualquer impressora instaladas em seu sistema.  
	Programas que faz interface entre o <application>LPD</application> 
	e a impressora.
	Se voc&ecirc; est&aacute; instalando a impressora e gostaria de 
	habilitar os <foreignphrase>jobs</foreignphrase> na linguagem da 
	impressora <emphasis>e</emphasis> texto puro, voc&ecirc; ser&aacute;
	fortemente encorajado a adicionar mais um passo ao esquema acima;
	instalar um programa de convers&atilde;o de textopuro para &postscript;
	( ou outra linguagem de impressora ).  A se&ccedil;&atilde;o 
	entitulada como <link linkend="printing-advanced-if-conversion">
	Acomodando <foreignphrase>Jobs</foreignphrase> de Texto Puro
	em impressoras &postscript;</&ccedil;</link> mostra como faze-lo.
	</para>

	<sect4 id="printing-naming">
	  <title>Nomeando a Impressora</title>
	<para>
		O primeiro e mais simples passo &eacute; escolher o nome
	para a sua impressora.  Isso &eacute;; voc&ecirc; deve escolher um
	nome funcional e cuidadosamente escolhido, deve tamb&eacute;m escolher
	apelidos para a sua impressora.
	</para>

	<para>
		Pelo menos uma das impressoras especificadas no arquivo
	<filename>/etc/printcap</filename> deve ser um apelido para 
	<literal>lp</literal>.  Essa &eacute; o nome padr&atilde;o para
	a impressora.  Se o usu&aacute;rio n&atilde;o a vari&aacute;vel
	do ambiente <envar>PRINTER</envar> definida ou n&atilde;o 
	especificar o nome da impressora na linha de comando de qualquer
	aplicativo que use <application>LPD</application>, ent&atilde;o
	a impressora <literal>lp</literal>  ser&aacute; usada como
	padr&atilde;o.
	</para>

	<para>
		Tamb&eacute;m &eacute; uma pr&aacute;tica comum fazer
	um apelido para um nome que define completamente a impressora, 
	incluindo a marca e o modelo.
	</para>

	<para>
		Uma vez que voc&ecirc; j&aacute; tenha escolhido um nome e
	alguns apelidos, coloque eles no arquivo 
	<filename>/etc/printcap</filename>.  O nome da impressora deve estar 
	na columa mais a esquerda.  Separando cada apelido com uma barra 
	vertical (pipe) e terminar com o caracter : (dois pontos)
	</para>

	<para>
		O exemplo a seguir &eacute; um esqueleto para o arquivo 
	<filename>/etc/printcap</filename>  que define duas impressoras
	( uma Diablo 630 matricial e uma Panasonic KX-P4455 &postscript;
	que &eacute; uma impressora &agrave; laser):
	</para>

	  <programlisting>#
#  /etc/printcap for host rose
#
rattan|line|diablo|lp|Diablo 630 Line Printer:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:
	</programlisting>

	  <para>
		Nesse exemplo, a primeira impressora &eacute; chamada de 
	<literal>rattan</literal> e possui como apelido <literal>line</literal>,
	<literal>diablo</literal>, <literal>lp</literal>, e 
	<literal>Diablo 630 Line Printer</literal>.  Como ela tem como 
	apelido <literal>lp</literal>, ela &eacute; a impressora padr&atilde;o
	para o sistema.  E a segfunda e chamada de <literal>bamboo</literal>, 
	e tem como apelidos <literal>ps</literal>, <literal>PS</literal>,
	<literal>S</literal>, <literal>panasonic</literal>, e
	<literal>Panasonic KX-P4455 PostScript v51.4</literal>.</para>
	</sect4>

	<sect4 id="printing-no-header-pages">
	  <title>Suprimindo a P&aacute;gina de Cabe&ccedil;alho </title>
	  <indexterm>
      <primary>printing</primary>
      <secondary>header pages</secondary>
    </indexterm>

	  <para>para o sistema de spooling <application>LPD</application>
	por padr&atilde;o imprime uma 
	<emphasis>p&aacute;gina de cabe&ccedil;alho</emphasis> para cada
	<foreignphrase>job</foreignphrase>.  A p&aacute;gina de 
	cabe&ccedil;alho cont&eacute;m o nome do usu&aacute;rio que pediu
	o servi&ccedil;o, a m&aacute;quina de onde o pedido originou, e o
	nome do <foreignphrase>job</foreignphrase>, em letras grandes.  
	Para testes iremos desativar a p&aacute;gina de cabe&ccedil;alho.
	</para>
	 <para>
		Para desabilitar a p&aacute;gina de cabe&ccedil;alho, 
	adicione a entrada <literal>sh</literal> no arquivo
	<filename>/etc/printcap</filename>.  Segue um exemplo do arquivo
	<filename>/etc/printcap</filename> com essa op&ccedil;&atilde;o 
	<literal>sh</literal> desabilitada.
	</para>

	  <programlisting>#
#  /etc/printcap for host rose - no header pages anywhere
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:</programlisting>

	  <para>
		Note como usamos o correto formato: A primeira linha inicia
	na columa mais &agrave; esquerda, e as linhas subseguentes s&atilde;o
	alinhadas com uma caracter TAB simples.  Cada linha, exceto a 
	ultima, termina com uma barra invertida (\).
	</para>
	</sect4>

	<sect4 id="printing-spooldir">
	  <title>Criando o Diret&oacute;rio de Spooling</title>
	  <indexterm><primary>printer spool</primary></indexterm>
	  <indexterm><primary>print <foreignphrase>jobs</foreignphrase></primary></indexterm>

	  <para>
		O pr&oacute;ximo passo na configura&ccedil;&atilde;o
	simples do <foreignphrase>spooler</foreignphrase>  &eacute; criar
	o <emphasis>diret&oacute;rio de 
	<foreignphrase>spooling</foreignphrase></emphasis>, &eacute; o
	diret&oacute;rio onde o <foreignphrase>jobs</foreignphrase> 
	mant&eacute;m o que ser&aacute; impresso, e outros arquivos de
	suporte do <foreignphrase>spooler</foreignphrase>.
	</para>

	  <para>
		Por causa da varia&ccedil;&atilde;o natural do 
	diret&oacute;rio de <foreignphrase>spooling</foreignphrase>, ele 
	&eacute; colocado sob o diret&oacute;rio 
	<filename>/var/spool</filename>.  N&atilde;o &eacute; 
	necess&aacute;rio realizar <foreignphrase>backups</foreignphrase>
	do conte&uacute;ido deste diret&oacute;rio.  Voc&ecirc; pode
	recria-lo com o comando &man.mkdir.1;.</para>

	  <para>Ele tamb&eacute;m cria o diret&oacute;rio com o nome 
	identico da impressora, como &eacute; mostrado abaixo:
	    </para>

	  <screen>&prompt.root; <userinput>mkdir /var/spool/<replaceable>printer-name</replaceable></userinput></screen>

	  <para>
		Entretando, se voc&ecirc; possui uma grande quantidade de
	impressoras na sua rede, voc&ecirc; gostaria de colocar o 
	diret&oacute;rio de <foreignphrase>spooling</foreignphrase> em 
	um &uacute;nico diret&oacute;rio que voc&ecirc; reservou para a 
	impress&atilde;o com <application>LPD</application>.  N&oacute;s 
	iremos fazer isso com exemplo de duas impressoras
	<literal>rattan</literal> e <literal>bamboo</literal>:</para>

	  <screen>&prompt.root; <userinput>mkdir /var/spool/lpd</userinput>
&prompt.root; <userinput>mkdir /var/spool/lpd/rattan</userinput>
&prompt.root; <userinput>mkdir /var/spool/lpd/bamboo</userinput></screen>

	  <note>
	    <para>
		Se est&aacute; preocupado com a privacidade dos 
	<foreignphrase>jobs</foreignphrase> que seus usuarios es&atilde;o 
	imprimindo, voc&ecirc; talvez queira proteger o diret&oacute;rio
	de <foreignphrase>spooling</foreignphrase> que n&atilde;o teria
	acesso p&uacute;blico.  O diret&oacute;rio de 
	<foreignphrase>spooling</foreignphrase> deve ter como dono o
	usu&aacute;rio e grupo deamon e dever&aacute; ser acessivel para 
	leitura, escrita e execu&ccedil;&atilde;o e para mais ninguem.
	  Veja o pr&oacute;ximo exemplo onde ser&aacute; feito isso:
	</para>

	    <screen>&prompt.root; <userinput>chown daemon:daemon /var/spool/lpd/rattan</userinput>
&prompt.root; <userinput>chown daemon:daemon /var/spool/lpd/bamboo</userinput>
&prompt.root; <userinput>chmod 770 /var/spool/lpd/rattan</userinput>
&prompt.root; <userinput>chmod 770 /var/spool/lpd/bamboo</userinput></screen>
	  </note>

	  <para>
		Finalmnente, voc&ecirc; dever&aacute; informar ao
	<application>LPD</application> sobre este diretorio, usando
	o arquivo <filename>/etc/printcap</filename>.  Voc&ecirc; especifica
	o nome do diret&oacute;rio de <foreignphrase>spooling</foreignphrase>
	com a op&ccedil;&atilde;o <literal>sd</literal>:
	</para>

	  <programlisting>#
#  /etc/printcap for host rose - added spooling directories
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:</programlisting>

	  <para>
		Note que o nome da impressora inicia na primeira coluna 
	mas as outras entradas dever&aacute; ser alinhada com um caracter
	TAB e cada linha dever&aacute; terminar com uma barra invertida (\)
	</para>

	  <para>
		Se voc&ecirc; n&atilde;o especificar o diret&oacute;rio de 
	<foreignphrase>spooling</foreignphrase> com <literal>sd</literal>, 
	o sistema de <foreignphrase>spooling</foreignphrase> ir&aacute;
	usar o diret&oacute;rio padr&atilde;o
	<filename>/var/spool/lpd</filename>
	</para>
	</sect4>

	<sect4 id="printing-device">
	<title>Identificando o Dispositivo de Impress&atilde;o </title>

	  <para>
		Na se&ccedil;&atilde;o 
	<link linkend="printing-dev-ports">Adicionando Entradas no
	<filename>/dev</filename>Para Portas</link>, nos identificamos qual
	entrada no diret&oacute;rio <filename>/dev</filename> o FreeBSD 
	ir&aacute; usar para comunicar com a impressora.  Agora, n&oacute;s
	iremos informar ao <application>LPD</application> qual porta
	usar.  Quando o sistema de <foreignphrase>spooling</foreignphrase>
	tem um <foreignphrase>job</foreignphrase> para imprimir, ele 
	ir&aacute; abrir o dispositivo especificado no suporte do 
	programa de filtro ( o qual &eacute; respons&aacute;vel por
	passar os dados para a impressora).
	</para>

	  <para>
		Listar as entradas do diret&oacute;rio
	 <filename>/dev</filename>  no arquivo 
	<filename>/etc/printcap</filename> usando a op&ccedil;&atilde;o
	<literal>lp</literal>.</para>

	  <para>
		Em nosso exemplo executado, n&oacute;s assumimos que a 
	impressora <literal>rattan</literal> est&aacute; na primeira 
	porta paralela e a impressora <literal>bamboo</literal> est&aacute;
	na sexta porta serial; Segue aqui as adi&ccedil;&otilde;es ao 
	arquivo <filename>/etc/printcap</filename>:</para>

	  <programlisting>#
#  /etc/printcap for host rose - identified what devices to use
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:\
        :lp=/dev/lpt0:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:\
        :lp=/dev/ttyd5:
	</programlisting>

	  <para>
		Se voc&ecirc;  n&atilde;o especificar a op&ccedil;&atilde;o
	<literal>lp</literal> para a impressora em seu arquivo
	<filename>/etc/printcap</filename>, o <application>LPD</application> 
	ir&aacute; utilizar <filename>/dev/lp</filename> como padr&atilde;o.
	A entrada <filename>/dev/lp</filename> n&atilde;o mais existe no
	FreeBSD.
	</para>

	<para>
		Se a impressora que voc&ecirc; est&aacute; instalando &eacute;
	conectada na porta paralela, pule para a se&ccedil;&atilde;o
	entitulada como <link linkend="printing-textfilter">INstalando
	o Filtro de exto </link>.  Caso contr&aacute;rio, siga as 
	instru&ccedil;&otilde;es na pr&oacute;xima se&ccedil;&atilde;o
	</para>
	</sect4>

	<sect4 id="printing-commparam">
	<title>
		Configurando Parametros de Comunica&ccedil;&atilde;o do 
		<foreignphrase>spooling</foreignphrase>
	</title>
	<indexterm>
		<primary>printers</primary>
		<secondary>serial</secondary>
	</indexterm>

	<para>
		Para impressoras na porta serial, no 
	<application>LPD</application> podemos ajustar a taxa de bps,
	a paridade, e outros parametros da porta serial com o apoio do 
	programa de filtro que envia dados para a impressora.  Isso pode 
	ser uma grande vantagem deste que:
	</para>

	  <itemizedlist>
	    <listitem>
		<para>
			Permite tentar diferentes configura&ccedil;&otilde;es
	de parametros para a comunica&ccedil;&atilde;o, simplesmente 
	editando o arquivo <filename>/etc/printcap</filename>; voc&ecirc; 
	n&atilde;o precisa recompilar o programa de filtro.
		</para>
	    </listitem>

	    <listitem>
	      <para>
			Ele habilita o sistema de 
	<foreignphrase>spooling</foreignphrase> para usar o mesmo programa
	de filtro para multiplas impressoras, as quais t&ecirc;m diferentes
	configura&ccedil;&otilde;es de comunica&ccedil;&atilde;o serial.
		</para>
	    </listitem>
	  </itemizedlist>

	<para>
		O seguinte arquivo <filename>/etc/printcap</filename>
	habilidade de controlar os par&acirc;metro da comunica&ccedil;&atilde;o
	serial do dispositivos listados na habilidade <literal>lp</literal>:
	</para>
	  <variablelist>
	    <varlistentry>
	      <term><literal>br#<replaceable>bps-rate</replaceable></literal></term>

	      <listitem>
		<para>
			Configura a velocidade de comunica&ccedil;&atilde;o
	com o dispositivo para <replaceable>bps-rate</replaceable>, onde
	<replaceable>bps-rate</replaceable> pode ser 50, 75, 110, 134, 150, 
	200, 300, 600, 1200, 1800, 2400, 4800, 9600, 19200, 38400, 57600, 
	ou 115200 bits-per-second.
		</para>
	      </listitem>
	    </varlistentry>

	    <varlistentry>
		<term>
		<literal>ms#<replaceable>stty-mode</replaceable></literal>
		</term>

	      <listitem>
		<para>
			Configura a op&ccedil;&atilde;o do dispositivo
	terminal depois de aberto o dispositivo.  &man.stty.1; explica
	a op&ccedil;&otilde;es dispon&iacute;veis
		</para>
	      </listitem>
	    </varlistentry>
	  </variablelist>

	  <para>Quando o  <application>LPD</application> abre o dispositivo
	especificado pela op&ccedil;&atilde;o <literal>lp</literal>, ele
	configuira as caracter&iacute;sticas do dispositivos para
	aquelas especificadas na op&ccedil;&atilde;o <literal>ms#</literal>.
	De particular interesse podemos destacar os seguintes 
	modos <literal>parenb</literal>, <literal>parodd</literal>, 
	<literal>cs5</literal>, <literal>cs6</literal>, <literal>cs7</literal>,
	<literal>cs8</literal>, <literal>cstopb</literal>,
	 <literal>crtscts</literal>, e <literal>ixon</literal> os quais 
	ser&atilde;o explicados na p&aacute;gina do manual &man.stty.1;
	</para>

	<para>
		Vamos mostra um exemplo de configura&ccedil;&atilde;o de
	uma impressora serial conectada na sexta porta serial.  Nos iremos
	configurar com a taxa de bps para 38400.  Para o modo n&oacute;s
	iremos configurar sem paridade com a op&ccedil;&atilde;o
	<literal>-parenb</literal>, caracteres de 8-bit <literal>cs8</literal>,
	sem controle de modem <literal>clocal</literal> e <foreignphrase>
	hardware flow control</foreignphrase> <literal>crtscts</literal>:
	</para>

	  <programlisting>bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:</programlisting>
	</sect4>

	<sect4 id="printing-textfilter">
	  <title>Instalando um Filtro de Texto</title>
	  <indexterm>
	    <primary>printing</primary>
	    <secondary>filters</secondary>
	  </indexterm>

	<para>
		N&oacute;s j&aacute; estamos prontos para informar ao
	<application>LPD</application> qual o filtro de texto que queremos
	utilizar para enviar <foreignphrase>jobs</foreignphrase> para a
	impressora.  Um <emphasis>filtro de texto</emphasis>, tamb&eacute;m
	conhecido como <emphasis>filtro de entrada</emphasis>, &eacute; um
	programam que &eacute; execudado pelo <application>LPD</application> 
	quando um tem <foreignphrase>job</foreignphrase> para ser impresso.
	Quando <application>LPD</application> executa o filtro de texto para
	a impressora,  ele configura a entrada padr&atilde;o do filtro para
	<foreignphrase>job</foreignphrase> a ser impresso, e a sua sa&iacute;da
	padr&atilde;o &eacute; enviada para a impressora especificada em 
	<literal>lp</literal>.  O filtro est&aacute; pronto para receber
	o <foreignphrase>job</foreignphrase> pela entrada padr&atilde;o, 
	executando a necess&aacute;ria tradu&ccedil;&atilde;o para a 
	impressora, e escrevendo o resultado na sa&iacute;da padr&atilde;o,
	a qual ser&aacute; enviada &agrave; impressora.  Para maiores 
	informa&ccedil;&otilde;es, consulte a se&ccedil;&atilde;o de 
	<link linkend="printing-advanced-filters">Filters</link>
	</para>
	<para>
		Para essa configura&ccedil;&atilde;o simples, o filtro pode ser
	um pequeno <foreignphrase>shell script</foreignphrase> que execute 
	o comando <command>/bin/cat</command> para enviar o
	<foreignphrase>job</foreignphrase> para a impressora.  O FreeBSD
	vem com um outro filtro chamado de <filename>lpf</filename> 
	pega os caracteres de <foreignphrase>backspacing</foreignphrase>
	e sublinhados que algumas imporessoras n&atilde;o conseguem 
	manipula-los, voc&ecirc; pode ent&atilde;o utilizar outro
	programa de filtro que desejar.  O filtro <command>lpf</command>
	e descrito em detalhes na sec&ccedil;&atilde;o entitulada como
	<link linkend="printing-advanced-lpf">lpf: Um Filtro de Texto</link>.
	</para>

	  <para>
		Primeiro, iremos criar um 
	<foreignphrase>shell script</foreignphrase> chamado de 
	<filename>/usr/local/libexec/if-simple</filename> para ser um 
	filtro de texto simples.  Coloque o seguinte texto dentro dele,
	utilizando o seu editor de texto favorito:
	</para>

	  <programlisting>#!/bin/sh
#
# if-simple - Simple text input filter for lpd
# Installed in /usr/local/libexec/if-simple
#
# Simply copies stdin to stdout.  Ignores all filter arguments.

/bin/cat &amp;&amp; exit 0
exit 2</programlisting>

	<para>
		Deixe o arquivo com permiss&atilde;o de execu&ccedil;&atilde;o
	</para>

	  <screen>&prompt.root; <userinput>chmod 555 /usr/local/libexec/if-simple</userinput></screen>

	<para>
		E ent&atilde;o diga ao <application>LPD</application>
	que utilize esse filtro, especificando a op&ccedil;&atilde;o
	<literal>if</literal> dentro do arquivo
	<filename>/etc/printcap</filename>.  N&oacute;s iremos adicionar
	duas impressoras como no exemplo do
	<filename>/etc/printcap</filename>:</para>

	  <programlisting>#
#  /etc/printcap for host rose - added text filter
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:\ :lp=/dev/lpt0:\
        :if=/usr/local/libexec/if-simple:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:\
        :if=/usr/local/libexec/if-simple:</programlisting>
	</sect4>

	<sect4>
	  <title>Ligando o <application>LPD</application></title>

	<para>
		&man.lpd.8; Ele &eacute; executado atravatraveseacute;s do arquivo
	<filename>/etc/rc</filename>, controlado pela vari&aacute;vel
	<literal>lpd_enable</literal>.  O valor padr&atilde;o para esta
	vari&aacute;vel &eacute; <literal>NO</literal>.  Se voc&ecirc; ainda
	n&atilde;o o fez, adicione a linha
	</para>

	  <programlisting>lpd_enable="YES"</programlisting>

	<para>
		ao arquivo <filename>/etc/rc.conf</filename>, e ent&atilde;o
	reinicie a sua m&aacute;quina, ou et&atilde;o execute simplesmente
	&man.lpd.8;.
	</para>

	  <screen>&prompt.root; <userinput>lpd</userinput></screen>
	</sect4>
	
	<sect4 id="printing-trying">
	  <title>Tente Isso</title>

	<para>
		voc&ecirc; chegou ao fim da configura&ccedil;&atilde;o
	simples do <application>LPD</application>.  Infelismente, ainda
	n&atilde;o &eacute; hora de <foreignphrase>cantar vit&oacute;ria
	</foreignphrase>, uma vez que ainda n&atilde;o testamos a 
	configura&ccedil;&atilde;o e corre&ccedil;&atilde;o de algum
	problema.  Para testar a configura&ccedil;&atilde;o, tente
	imprimir algo.  Para imprimir com o sistema 
	<application>LPD</application>, voc&ecirc; usa o comando
	&man.lpr.1;, o oqual envia o <foreignphrase>job</foreignphrase>
	para a impressora.
	</para>
	<para>
		Voc&ecirc; pode combinar &man.lpr.1; com o programa
	&man.lptest.1;, introduzido na sec&ccedil;&atilde;o
	<link linkend="printing-testing">Verificando a 
	comunica&ccedil;&atilde;o com a Impressora </link> para gerar 
	texto para texte.
	</para>
	<para>
		<emphasis>
		Para testar a configura&ccedil;&atilde;o simples do
	<application>LPD</application>
		</emphasis>
	</para>

	<para>Digite:</para>

	  <screen>&prompt.root; <userinput>lptest 20 5 | lpr -P<replaceable>Nome-da-impressora</replaceable></userinput></screen>
	  
	<para>
		Onde <replaceable>Nome-da-impressora</replaceable> &eacute; 
	o nome dado &agrave; impressora (ou um de seus apelidos) no arquivo
	<filename>/etc/printcap</filename>.  Para testar a impressora
	padr&atilde;o do sistema, digite &man.lpr.1; sem op&ccedil;&otilde;es
	<option>-P</option>.  Novamente, se voc&ecirc; est&aacute; testando
	a impressora que espera &postscript;, utilize um programa que
	gere uma sa&iacute;da &postscript; ao inv&eacute;s de utilizar
	o &man.lptest.1;.  Voc&ecirc; pode colocar um c&oacute;digo 
	&postscript; dentro de um arquivo e digitar <command>lpr 
	    <replaceable>nome do arquivo</replaceable></command>.
	</para>

	<para>
		Para uma impressora &postscript;, voc&ecirc; deve saber
	qual foi os dados enviados do programa para a impressora, para saber
	se este foi impressor corretamente.  Se voc&ecirc; estiver usando
	o &man.lptest.1;, voc&ecirc; deve ter como resultado algo
	semelhante &agrave;:
	</para>

	  <programlisting>!"#$%&amp;'()*+,-./01234
"#$%&amp;'()*+,-./012345
#$%&amp;'()*+,-./0123456
$%&amp;'()*+,-./01234567
%&amp;'()*+,-./012345678</programlisting>

	<para>
		Para facilitar o teste de impress&atilde;o, tente fazer a
	transfer&ecirc;ncia de um arquivo grande ( para a linguagem
	da impressora ) ou executar &man.lptest.1; com diferentes argumentos.
	  Por exemplo, <command>lptest 80 60</command> ir&aacute; produzir
	60 linhas com 80 caracteres cada.
	</para>

	<para>
		Se a impressora n&atilde;o funcionar, veja a 
	se&ccedil;&atilde;o entitulada 
	<link 
		linkend="printing-troubleshooting">
		Localiza&ccedil;&atilde;o de  Defeitos
	</link>
	</para>
	</sect4>
      </sect3>
    </sect2>
  </sect1>
  
  <sect1 id="printing-advanced">
	<title>
		Configura&ccedil;&atilde;o Avan&ccedil;ada de Impressora
	</title>
    
	<para>
		Essa se&ccedil;&atilde;o descreve filtros para formatos
	especiais de impress&atilde;o de arquivos, p&aacute;ginas de 
	cabe&ccedil;a&ccedil;lho, impress&atilde;o atravatraveseacute;s da rede, e 
	restringir acesso ao uso da impressora.
	</para>

    <sect2 id="printing-advanced-filter-intro">
      <title>Filtros</title>
      <indexterm>
	<primary>printing</primary>
	<secondary>filters</secondary>
      </indexterm>
      
	<para>
		Atraves do <application>LPD</application> podemos acessar
	o protocolos de rede, filas, acesso de controle, e outros aspectos
	da impres&atilde;o, a maioria dos trabalhos <emphasis>reais</emphasis>
        ocorre nos <emphasis>filters</emphasis>.  Os filtros s&atilde;o
	programas que se comunicam com a impressora e manipula as 
	dependencias do dispositivo e necessidades especiais.  Na 
	se&ccedil;&atilde;o configira&ccedil;&atilde;o simples da impressora, 
	n&oacute;s instalamos um filtro&mdash;an texto puro extremamente
	simples que deve funcionar na maioria das impressoras 
	( se&ccedil;&atilde;o <link
          linkend="printing-textfilter">Instalando o Filtro de Texto
          </link>).
	</para>
          
	<para>
		Entretando, se quizermos tirar vantagens de convers&atilde;o
	de formatos, relat&oacute;rio de uso da impressora, especificar
	uma configura&ccedil;&atilde;o especial da impressora, entre outras 
	coisas, vo&ecirc; dever&aacute; compreender como funciona os filtros.
	  Ultimamente a responsabidade do filtro &eacute; tratar desses
	aspectos.  E a m&aacute; not&iacute;cia &eacute; que a maior
	parte do tempo <emphasis>voc&ecirc;</emphasis> ter&aacute; que 
	providenciar os seus pr&oacute;prios filtros.  A boa not&iacute;cia
	&eacute; que muitos j&aacute; es&atilde;o dispon&iacute;veis; e se
	n&atilde;o encontrar, voc&ecirc; facilmente poder&aacute; escreve-los.
	</para>
          
	<para>
		Tamb&eacute;m, o FreeBSD vem com um 
	<filename>/usr/libexec/lpr/lpf</filename>, que funciona com a maioria
	das impressoras que podem imprimir texto puro.  (Ele manipula caraceteres
	de retorno <foreignphrase>backspaces</foreignphrase> e 
	tabula&ccedil;&otilde;es no arquivo, e faz a contabilidade, mas isso
	&eacute; tudo que ele faz).
	Existem v&aacute;rios filtros e componentes de filtro na 
	Cole&ccedil;&atilde;o de Ports do FreeBSD.
	</para>
          
	<para>
		Aqui est&aacute; o que voc&ecirc; ir&aacute; encontrar
	nessa se&ccedil;&atilde;o:
	</para>
      
      <itemizedlist>
        <listitem>
		<para>
			Se&ccedil;&atilde;o
	 <link linkend="printing-advanced-filters">Como os Filtros 
	funcionam</link>, tenta dar um panorama geral da fun&ccedil;&atilde;o
	de um filtro no processo de impress&atilde;o.  Voc&ecirc; devera ler 
	esta se&ccedil;&atilde;opara compreender o que acontece <quote>
	por baixo dos panos</quote> quando <application>LPD</application> 
	utiliza os filtros.  Esse conhecimento poder&aacute; ajuda-lo
	antecipadamente e livra-lo dos defeitos que poderam encontrar 
	na instala&ccedil;&atilde;o de v&aacute;rios filtros para suas
	impressoras.
		</para>
        </listitem>
              
        <listitem>
		<para>
			<application>LPD</application> Espera que cada
	impressora esteja habilidada para imprimir texto puro por 
	padr&atilde;o.  &Eacute; um problema presente para impressoras
	&postscript; ( ou outra impressora baseada em liguagem) a qual 
	n&atilde;o pode imprimir diretamente texto puro.  A se&ccedil;&atilde;o
	<link linkend="printing-advanced-if-conversion">
	Acomodando Impress&atilde;o em Texto Puro em Impressoras
	&postscript;</link> mostra &agrave; voc&ecirc; como proceder
	para resolver este problema.  Voc&ecirc; deve ler essa 
	se&ccedil;&atilde;o caso voc&ecirc; tenha uma impressora &postscript;
		</para>
        </listitem>

        <listitem>
		<para>
			&postscript; &eacute; o formato mais comum para a
	maioria dos programas.  Mesmo que algumas pessoas (incluindo eu
	mesmo) escreve c&oacute;digo &postscript; diretamente, mas impressoras
	&postscript; s&atilde;o caras.  Na se&ccedil;&atilde;o
        <link linkend="printing-advanced-ps">Simulando &postscript; em 
	impressora n&atilde;o &postscript;</link> informa como voc&ecirc;
	pode modificar os filtros para aceitar e imprimir dados &postscript;
	em uma impressora <emphasis>n&atilde;o &postscript;</emphasis>.  
	voc&ecirc; dever&aacute; ler essa se&ccedil;&atilde;o se voc&ecirc; 
	n&atilde;o possiuir uma impressora &postscript;.
		</para>
        </listitem>
              
        <listitem>
          <para>A se&ccedil;&atilde;o <link
              linkend="printing-advanced-convfilters">Filtro de 
	Convers&atilde;o </link> informa sobre o meio que voc&ecirc; pode
	automatizar a convers&atilde;o especificando o formato do arquivo,
	tais como gr&aacute;fico ou dados de <foreignphrase>typesetting
	</foreignphrase>, para formatos que a impressora possa endenter.
	  Depos de lida esta se&ccedil;&atilde;o, voc&ecirc; est&aacute; 
	apto a configurar sua impressora para que os usu&aacute;rios 
	possam digitar <command>lpr -t</command> para imprimit dados
	de troff, ou <command>lpr -d</command> para imprimir dados &tex; 
	DVI data, ou <command>lpr -v</command> para imprimir dados de 
	imagem rasterisadas, e por ai vai, recomendamos a leitura
	desta se&ccedil;&atilde;o.
		</para>
        </listitem>
              
        <listitem>
		<para>
			A se&ccedil;&atilde;o 
	<link linkend="printing-advanced-of"> Filtros de sa&iacute;da </link> 
	Informa sobre o uso n&atilde;o comum dos filtros de sa&iacute;da
	do <application>LPD</application>. A menos que voc&ecirc; esteja
	imprimindo p&aacute;ginas de cabe&ccedil;alho ( veja <link
	linkend="printing-advanced-header-pages">P&aacute;ginas de
	cabe&ccedil;alho</link>), voc&ecirc; provavelmente poder&aacute;
	pular toda esta se&ccedil;&atilde;o.
		</para>
        </listitem>

        <listitem>
		<para>
		A Se&ccedil;&atilde;o 
	<link linkend="printing-advanced-lpf">lpf: um filtro de texto </link> 
	descreve o <command>lpf</command>, De maneira completa se o filtro
	de texto simples para impressoras matriciais ( e impressoras laser
	que funcionam como matriciais) que vem com o FreeBSD.  Se voc&ecirc;
	necessita de um meio r&aacute;pido para fazer a impressora 
	funcionar com texto puro, ou se voce tem uma impressora a qual emite
	fuma&ccedil;a quando ela imprime caracteres <foreignphrase>
	backspace</foreignphrase>, voc&ecirc; deve definitivamente considerar
	<command>lpf</command>.
		</para>
        </listitem>
      </itemizedlist>
      
      <sect3 id="printing-advanced-filters">
        <title>Como os Filtros Funcionam</title>

        <para>
		Como mencionado antes, o filtro &eacute; um programa 
	execut&aacute;vel inicializado pelo <application>LPD</application> 
	para manipular a comunica&ccedil;&atilde;o dependente da impressora.
	</para>
            
        <para>
		Quando o <application>LPD</application> precisa imprimir um
	arquivo no <foreignphrase>job</foreignphrase>, ele inicializa o filtro.
	Ele configura a entrada padr&atilde;o do filtro para o arquivo a ser 
	impresso, e a sa&iacute;da padr&atilde;o do filtro e redireciona as 
	sa&iacute;das padr&atilde;o e a sa&iacute;da padr&atilde;o de erro para
	o arquivo de log de erros ( especificado na op&ccedil;&atilde;o
        <literal>lf</literal> no arquivo <filename>/etc/printcap</filename>, ou
          <filename>/dev/console</filename> por padr&atilde;o).
	</para>
            
        <indexterm>
          <primary><command>troff</command></primary>
        </indexterm>
        <para>
		A escolha do filtro inicializado pelo <application>LPD</application> 
	depende do arquimento utilizado no arquivo <filename>/etc/printcap</filename> 
	e qual foi o argumento que o usu&aacute;rio especificou no comando
	de linha &man.lpr.1;.  Por exemplo, se o usu&aacute;rio digita o seguinte 
	comando: <command>lpr -t</command>, o <application>LPD</application> ir&aacute;
	inicializar o filtro troff, que &eacute; o argumento da op&ccedil;&atilde;o
        <literal>tf</literal> para a impressora padr&atilde;o.
	Se o usu&aacute;rio quizer impreimir um texto puro, ele dever&aacute; 
	inicializar o filtro <literal>if</literal> ( isso &eacute; muito comum,
	veja em <link
            linkend="printing-advanced-of">Output Filters</link> para maiores 
	detalhes).
	</para>

        <para>
		Existem tres tipos de filtros que voc&ecirc; pode especificar
	no arquivo <filename>/etc/printcap</filename>:
	</para>

        <itemizedlist>
          <listitem>
            	<para>
		O <emphasis>filtro de texto</emphasis>, erradamente chamado de 
   <emphasis>filtro de entrada</emphasis> na documenta&ccedil;&atilde;o 
	do <application>LPD</application>, ele manipula a impress&atilde;o de 
	texto puro. pense nele como um filtro padr&atilde;o para o
	<application>LPD</application>, ele espera que todas as impressoras, por 
	padr&atilde;o, estejam habilitadas a imprimir texto puro, e ela
	<foreignphrase>tabs</foreignphrase>, 
	em um ambiente aonde tem estat&iacute;sticas do uso da impressora,
	o filtro de texto tamb&eacute;m deve gerar a estat&iacute;stica sobre
	o que foi impresso, geralmente isto &eacute; feito contando o 
	n&uacute;mero de linhas impressas e comparando-as com o 
	n&uacute;mero de linhas que a impressora suporta.  O filtro de 
	texto &eacute; inicializado com a seguinte lista de argumentos:
		</para>

      <cmdsynopsis>
        	<command>nome-do-filtro</command>
				<arg>-c</arg>
				<arg choice="plain">-w<replaceable>largura</replaceable></arg>
				<arg choice="plain">-l<replaceable>comprimento</replaceable></arg>
				<arg choice="plain">-i<replaceable>indent</replaceable></arg>
				<arg choice="plain">-n <replaceable>login</replaceable></arg>
				<arg choice="plain">-h <replaceable>host</replaceable></arg>
				<arg choice="plain"><replaceable>arquivo-estatistica</replaceable>
				</arg>
		</cmdsynopsis>

			<para>
              onde
			</para>
              
              <variablelist>
                <varlistentry>
                  <term><option>-c</option></term>

                  <listitem>
							<para>
								&Eacute; usado quando o 
								<foreignphrase>job</foreignphrase> &eacute; enviado
								com o comando
								<command>lpr -l</command>
							</para>
                  </listitem>
                </varlistentry>
                
                <varlistentry>
                  <term><replaceable>largura</replaceable></term>
                  
                  <listitem>
                    <para>
							&Eacute; o valor da op&ccedil;&atilde;o
							<literal>pw</literal> (largura da p&aacute;gina)
							especificado no arquivo
                     <filename>/etc/printcap</filename>, O padr&atilde;o
							&eacute;  132</para>
                  </listitem>
                </varlistentry>
                
                <varlistentry>
                  <term><replaceable>comprimento</replaceable></term>
                  
                  <listitem>
                    <para>
								&Eacute; o valor da op&ccedil;&atilde;o
							<literal>pl</literal> ( comprimento da p&aacute;gina),
							o padr&atilde;o &eacute; 66
							</para>
                  </listitem>
                </varlistentry>
                
                <varlistentry>
                  <term><replaceable>indent</replaceable></term>
                  
                  <listitem>
                    <para>
								&Eacute; a quantidade de 
							<foreignphrase>identa&ccedil;&atilde;o</foreignphrase>
							fornecido pelo comando <command>lpr -i</command>, 
							o padr&atilde;o &eacute; 0
							</para>
                  </listitem>
                </varlistentry>
                
                <varlistentry>
                  <term><replaceable>login</replaceable></term>
                  
                  <listitem>
                    <para>
								&Eacute; o nome da conta de usu&aacute;rio para 
							pode imprimir o arquivo
							</para>
                  </listitem>
                </varlistentry>
                
                <varlistentry>
                  <term><replaceable>host</replaceable></term>
                  
                  <listitem>
                    <para>
								&Eacute; o nome do computador para onde a 
							impress&atilde;o ser&aacute; envida.
							</para>
                  </listitem>
                </varlistentry>
                
                <varlistentry>
                  <term><replaceable>arquivo_estatistica</replaceable></term>
                  
                  <listitem>
							<para>
								&Eacute; o nome do arquivo onde ser&aacute; armazenada
							a estat&iacute;stica da impress&atilde;o, este valor 
							&eacute; atribuido &agrave; op&ccedil;&atilde;o
                    <literal>af</literal>.
							</para>
                  </listitem>
                </varlistentry>
              </variablelist>
          </listitem>

	  <indexterm>
      <primary>printing</primary>
      <secondary>filters</secondary>
    </indexterm>          
          <listitem>
            <para>
					Um <emphasis>filtro de convers&atilde;o</emphasis> 
				converte um fromato especifico do arquivo em outro que a impressora
				pode compreender e tranformar em p&aacute;ginas impresas.  Por
				exemplo, o formato ditroff typesetting n&atilde;o pode ser 
				impresso diretamento, mas voc&ecirc; pode instalar um filtro
				conversor para o formato que a impressora possa imprimir
				corretamente.  A se&ccedil;&atilde;o <link
				linkend="printing-advanced-convfilters">Filtros Conversores
				</link> mostra como faze-los.  Filtros de convers&atilde;o que 
				tamb&eacute;m necessite de estat&iacute;sticas, voc&ecirc; 
				precisa habilitar a estat&iacute;stica na impressora.
				Filtros de convers&atilde;o s&atilde;o inicializados
				com os seguintes argumentos:

				<cmdsynopsis>
					<command>nome-do-filtro</command>
						<arg
							choice="plain">-x
								<replaceable>largura do pixel</replaceable>
						</arg>
						<arg 
							choice="plain">-y
								<replaceable>altura do pixel</replaceable>
						</arg>
						<arg 
							choice="plain">-n <replaceable>login</replaceable>
						</arg>
						<arg 
							choice="plain">-h <replaceable>host</replaceable>
						</arg>
						<arg 
							choice="plain"><replaceable>arquivo-estatistca</replaceable>
						</arg>
				</cmdsynopsis>

            Onde <replaceable>largura do pixel</replaceable> &eacute; o 
				valor da op&ccedil;&atilde;o 
				<literal>px</literal> (valor padr&atilde;o &eacute; 0) e 
				<replaceable>altura do pixel</replaceable> &eacute; o valor 
				da op&ccedil;&atilde;o
				<literal>py</literal> ( o valor padr&atilde;o &eacute; 0).
			</para>
          </listitem>
          
          <listitem>
            <para>
					O <emphasis>filtro de sa&iacute;da</emphasis> &eacute; usado
				somente se n&atilde;o existir um filtro de texto, ou se o 
				cabe&ccedil;alho das p&aacute;ginas estiver habilitador.  Em
				minha experi&ecirc;ncia, o filtro de sa&iacute;da s&atilde;o
				raramente utilizado.  Na se&ccedil;&atilde;o
              <link
                linkend="printing-advanced-of">Filtros de Sa&iacute;da</link> 
				mostra mais detalhes.  Existem somente dois argumentos para
				os filtros de sa&iacute;da,. s&atilde;o eles:

              <cmdsynopsis>
                <command>nome do filtro</command>
					<arg 
						choice="plain">-w<replaceable>largura</replaceable>
					</arg>
					<arg 
						choice="plain">-l<replaceable>comprimento</replaceable>
					</arg>
              </cmdsynopsis>

              os quais s&atilde;o identicos aos argumetos dos filtros
					de texto <option>-w</option> e <option>-l</option>.
				</para>
          </listitem>
        </itemizedlist>

			<para>
				Os filtros devem tamb&eacute;m <emphasis>sair</emphasis> com
			os seguintes status:
			</para>
            
        <variablelist>
          <varlistentry>
            <term>exit 0</term>

            <listitem>
              <para>
						Se o filtro obteve sucesso ao imprimir o arquivo.
					</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term>exit 1</term>
            
            <listitem>
					<para>
						Se o filtro falhou ao imprimir o arquivo, mas aguarda o
				<application>LPD</application> para tentar imprimir outra
				vez.
            <application>LPD</application> ir&aacute; reiniciar o filtro
				se ele sair com esse status.
					</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term>exit 2</term>
            
            <listitem>
              <para>
						Se o filtro falhar na impress&atilde;o do arquivo e 
					n&atilde;o ir&aacute; aguardar o
					<application>LPD</application> para tentar denovo.  
					O <application>LPD</application> ir&aacute; jogar fora
					o arquivo.
					</para>
            </listitem>
          </varlistentry>
        </variablelist>

        <para>
				O filtro de texto que vem com a vers&atilde;o do FreeBSD,
          <filename>/usr/libexec/lpr/lpf</filename>, tira vantagens dos
			argumentos de largura e comprimento para determinar quando enviar
			um caracter de alimenta&ccedil;&atilde;o de folha (
			<foreignphrase>form feed</foreignphrase>)
			e como gerar estat&iacute;sticas do uso da impressora.  Ele usa o
			<foreignphrase>login</foreignphrase>, 
			<foreignphrase>host</foreignphrase>, e o arquivo para armazenar as 
			estat&iacute;sticas para fazer as estat&iacute;sticas.
			</para>

        <para>
				Se voc&ecirc; deseja comprar filtros, veja se s&atilde;o 
			compat&iacute;veis co o LPD.  Se eles forem, eles devem suportar
			a lista de argumentos descrita acima.  Se voc&ecirc; planeja 
			escrever seu pr&oacute;prio filtro para uso geral, eles 
			tamb&eacute;m devem suportar a lista de argumentose deve utilizar
			os c&oacute;digos descritos acima.
			</para>
      </sect3>
      
      <sect3 id="printing-advanced-if-conversion">
        <title>Acomodando Texto Puro em Impressoras &postscript;</title>
        <indexterm>
				<primary>print <foreignphrase>jobs</foreignphrase>
				</primary>
			</indexterm>

        <para>
				Se s&oacute; voc&ecirc; &eacute; o usu&aacute;rio do seu computador
			sua impressora suporta &postscript; ( ou outra linguagem ), e 
			voc&ecirc; prometeu nunca enviar texto puro para a sua impressora e
			nunca usar&aacute; as vantagens que v&aacute;rios programas que
			gostariam de enviar testo puro para a sua impressora, ent&atilde;o 
			voc&ecirc; n&atilde;o precisa se preocupar com esta 
			se&ccedil;&atilde;o
			</para>
            
			<para>
				Mas, se voc&ecirc; gostaria de enviar tanto &postscript; e 
			texto puro para a sua impresssora, ent&atilde;o voc&ecirc; 
          you are urged to augment configura&ccedil;&atilde;o da impressora.
			Para fazer isso, nos temos que ter um filtro para detectar se o texto
			&eacute; texto puro ou &postscript;.  Todas as impress&otilde;es em
			&postscript; devem iniciar com <literal>%!</literal> ( para outra
			linguagem de impressora, veja a documenta&ccedil;&atilde;o da 
			sua impressora ).  Se estes dois primeiros caracteres aparecerem
			no arquivo de impress&atilde;om nos temos &postscript;, e podemos
			passar o resto da impress&atilde;o diretamente para a impressora.
			Se nos n&atilde;o temos os dois primeiros caracteres no arquivo de
			impress&atilde;o, ent&atilde;o o filtro deve converte-lo em
			&postscript; e imprimir o resultado.
			</para>
            
        	<para>Como nos faremos isso:
			</para>

        <indexterm>
          <primary>printers</primary>
          <secondary>serial</secondary>
        </indexterm>
        <para>
				Se nos temos uma impressora serial, o melhor caminha &eacute; 
			instalando o <command>lprps</command>.  O <command>lprps</command> &eacute;
			um filtro de impressora &postscript;, o qual habilita a 
			comunica&ccedil;&atilde;o bi-direcional com a impressora.  Ele 
			atualiza o arquivo de status da impressora com informa&ccedil;&atilde;o 
			recebida da impressora, ent&atilde;o os usu&aacute;rios e administradores
			podem ver exatamente o estado da impressora ( tais como
         <errorname>toner baixo</errorname> ou <errorname>paper jam</errorname>).
			mas o mais importante, &eacute; incluir um programa chamado de
         <command>psif</command>, o qual detecta quando um 
			<foreignphrase>job</foreignphrase> &eacute; em texto puro e ent&atilde;o
			executa o comando <command>textps</command> ( outro pragama que vem
			com o <command>lprps</command>) para converte-lo em &postscript;.  
			Ele pode usar <command>lprps</command>  para enviar um 
			<foreignphrase>job</foreignphrase> para a impressora.
			</para>
            
			<para>
				O <command>lprps</command> &eacute; parte da cole&ccedil;&atilde;o de 
	programas do FreeBSD (see 
	<link linkend="ports">A Cole&ccedil;&atilde;o de Programas</link>).  voc&ecirc;
	pode procurar, construir e instalar, por voc&ecirc; mesmo.  Depois da
	instala&ccedil;&atilde;o do <command>lprps</command>, Especifique o 
	diret&oacute;rio para o programa <command>psif</command> que faz parte do
   <command>lprps</command>.  Se voc&ecirc; instalou o <command>lprps</command>
	atrav&eacute;s dos <foreignphrase>ports</foreignphrase>, use a seguinte em
	uma impressora serial e &postscript; configurada no arquivo
   <filename>/etc/printcap</filename>:
			</para>
              
        <programlisting>:if=/usr/local/libexec/psif:</programlisting>

		<para>
			Voc&ecirc; tamb&eacute;m deve especificar a opo&ccedil;&atilde;o
		<literal>rw</literal>; que informa ao <application>LPD</application> 
		para abrir a cminica&ccedil;&atilde;o com a impressora como apenas
		leitura.
		</para>
            
		<para>
			Se voc&ecirc; tem uma impressora &postscript; ( e n&atilde;o 
		utiliza o modo bi-direcional, como necessita o <command>lprps</command>),
		voc&ecirc; pode utilizar o seguinte script como um filtro texto:
		</para>

		<programlisting>#!/bin/sh
#
#  psif - Print PostScript or plain text on a PostScript printer
#  Script version; NOT the version that comes with lprps
#  Installed in /usr/local/libexec/psif
#

IFS="" read -r first_line
first_two_chars=`expr "$first_line" : '\(..\)'`

if [ "$first_two_chars" = "%!" ]; then
    #
    #  PostScript job, print it.
    #
    echo "$first_line" &amp;&amp; cat &amp;&amp; printf "\004" &amp;&amp; exit 0
    exit 2
else
    #
    #  Plain text, convert it, then print it.
    #
    ( echo "$first_line"; cat ) | /usr/local/bin/textps &amp;&amp; printf "\004" &amp;&amp; exit 0
    exit 2
fi</programlisting>
            
		<para>
			No script acima, <command>textps</command> &eacute; um programa
		que nos instalamos separadamente para converter texto puro em 
		&postscript;.  Voc&ecirc; pode usar qualquer conversor de texto para
		&postscript; que voc&ecirc; desejar.  A cole&ccedil;&atilde;o de 
		programas do FreeBSD ( <foreignphrase>prots</foreignphrase>, veja em
      <link linkend="ports">Cole&ccedil;&atilde;o de Programas</link> )
		inclui um programa conversor de texto para &postscript; com facilidades
		chamado <literal>a2ps</literal> que voc&ecirc; deveria considerar.
		</para>
      </sect3>
          
      <sect3 id="printing-advanced-ps">
			<title>
					Simulando &postscript; em Impressoras N&atilde;o 
					&postscript; 
			</title>
        <indexterm>
          <primary>PostScript</primary>
          <secondary>emulating</secondary>
        </indexterm>
        <indexterm>
          <primary>Ghostscript</primary></indexterm>
			<para>
				&postscript; &eacute; <emphasis>de facto</emphasis> padr&atilde;o
			para impress&atilde;o de alta qualidade.  &postscript; &eacute;
			entretanto, um padr&atilde;o <emphasis>caro</emphasis>.  Ficamos
			gratos &agrave; Aladdin Enterprises que possui um programa chamado
			<application>Ghostscript</application> que pode trabalhar com a 
			maioria dos arquivos &postscript; e pode mostrar suas p&aacute;gianas
			em uma variedade de dispositivos, incluindo um grande n&uacute;mero 
			de impressoras n&atilde;o &postscript;.  Com a 
			instala&ccedil;&atilde;o do Ghostscript e usando filtros especiais
			de texto para a sua impressora, voc&ecirc; pode fazer uma impressora
			n&atilde;o &postscript; funcionar como uma impressora &postscript;
			real.
			</para>
            
			<para>
				Ghostscript eest&aacute; nos 
			<foreignphrase>ports</foreignphrase> do FreeBSD, se voc&ecirc; 
			poder&aacute; instala-lo de l&aacute;.  Voc&ecirc; deve buscar,
			compilar e instala-lo muito facilmente.
			</para>
            
			<para>
				Para simular &postscript;, nos devemos que ter no filtro um 
			detector para verificar se estamos imprimindo em &postscript; ou 
			texto puro.  Se for o caso de texto puro, ent&atilde;o o filtro 
			dever&aacute; repassar as informa&ccedil;&otilde;es diretamente
			para a impressora, caso contr&aacute;rio, ele dever&aacute;
			utilizar o Ghostscript antes para converter &postscript; para o
			formato reconhecido pela a impressora.
			</para>
            
			<para>
				Aqui tem um exemplo: o exemplo a seguir &eacute; um filtro texto 
			para uma impressora da Hewlett Packard, a Deskjet 500.  Para outras
			impressoras, voc&ecirc; deve substituir o argumento da 
			op&ccedil;&atilde;o <option>-sDEVICE</option> do comando
         <command>gs</command> (Ghostscript).  Digitando <command>gs
            -h</command> voc&ecirc; ter&aacute; a lista dos dispositivos
			suportados pela vers&atilde;o instalada do Ghostscript.
			</para>

        <programlisting>#!/bin/sh
#
#  ifhp - Print Ghostscript-simulated PostScript on a DeskJet 500
#  Installed in /usr/local/libexec/ifhp

#
#  Treat LF as CR+LF:
#
printf "\033&amp;k2G" || exit 2

#
#  Read first two characters of the file
#
IFS="" read -r first_line
first_two_chars=`expr "$first_line" : '\(..\)'`

if [ "$first_two_chars" = "%!" ]; then
    #
    #  It is PostScript; use Ghostscript to scan-convert and print it.
    #
    #  Note that PostScript files are actually interpreted programs,
    #  and those programs are allowed to write to stdout, which will
    #  mes up the printed output.  So, we redirect stdout to stderr
    #  and then make descriptor 3 go to stdout, and have Ghostscript
    #  write its output there.  Exercise for the clever reader:
    #  capture the stderr output from Ghostscript and mail it back to
    #  the user originating the print job.
    #
    exec 3&gt;&amp;1 1&gt;&amp;2
    /usr/local/bin/gs -dSAFER -dNOPAUSE -q -sDEVICE=djet500 \
        -sOutputFile=/dev/fd/3 - &amp;&amp; exit 0
else
    #
    #  Plain text or HP/PCL, so just print it directly; print a form feed
    #  at the end to eject the last page.
    #
    echo "$first_line" &amp;&amp; cat &amp;&amp; printf "\033&amp;l0H" &amp;&amp; 
exit 0
fi

exit 2</programlisting>

			<para>
				Finalmente, voc&ecirc; deve notificar o 
			<application>LPD</application> do filtro atrav&eacute;s da 
			op&ccedil;&atilde;o <literal>if</literal>
			</para>
            
        <programlisting>:if=/usr/local/libexec/ifhp:</programlisting>

			<para>
				Feito isso, voc&ecirc; poder&aacute; digitar 
			<command>lpr texto.puro</command> e
          <filename>lpr qualquer-coisa.ps</filename> e ambos dever&atilde;o
			ser impressos corretamente na impressora.
			</para>
      </sect3>
      
      <sect3 id="printing-advanced-convfilters">
        <title>Filtros Conversores</title>

			<para>
				Apos ter completamente configurado como descreve a 
			se&ccedil;&atilde;o 
			<link linkend="printing-simple">
				Configura&ccedil;&atilde;o Simples da Impressora
			</link>, a primeira coisa que voc&ecirc; provavelmente pensa &eacute; 
			instalar filtros conversores para seus formatos favoritos de
			arquivo.
			</para>
            
        <sect4>
          <title>
					Porque Instalar Filtros Conversores?
			</title>
          <indexterm>
            <primary>&tex;</primary>
            <secondary>printing dvi files</secondary>
          </indexterm>
          
			<para>
				Filtros conversores podem imprimir uma variedade de tipos de
			arquivo facilmente.  Como por exemplo, suponha que tenhamos que 
			fazer um grande trabalho com o sistema &tex;, e nos temos uma 
			impressora &postscript;.  Cada vez que nos geramos um arquivo DVI
			atrav&eacute;s do &tex;, nos n&atilde;o podemos imprimi-lo 
			diretamente, pos precisamos converte-lo em &postscript;.  A 
			sequ&ecirc;ncia de comandos sera algo semelhante a:
			</para>
                
          <screen>&prompt.user; <userinput>dvips seaweed-analysis.dvi</userinput>
&prompt.user; <userinput>lpr seaweed-analysis.ps</userinput></screen>
                
			<para>
				Instalando um filtro para converter os aquivos DVI em &postscript;,
			poder&iacute;amos pular um passo a cada vez que tivessemos que 
			imprimir.  O <application>LPD</application> poder&aacute; realizar
			esse passo para nos.
			</para>
              
          <screen>&prompt.user; <userinput>lpr -d seaweed-analysis.dvi</userinput></screen>
                
			<para>
				Nos informamos o <application>LPD</application> para converter 
			o arquivo DVI atravatraveseacute;s da op&ccedil;&atilde;o <option>-d</option>. 
				Veja a se&ccedil;&atilde;o <link
			linkend="printing-lpr-options-format">
			Op&ccedil;&otilde;es de Formata&ccedil;&atilde;o e Convers&atilde;o
			</link> mostra uma listar de op&ccedil;&otilde;es de convers&atilde;o
			</para>
              
			<para>
				Para Cada op&ccedil;&atilde;o de convers&atilde;o que voc&ecirc;
			deseja que sua impressora suporte, deve instalar um 
			<emphasis>Filtro Conversor</emphasis> e especificar o diret&oacute;rio
			no arquivo <filename>/etc/printcap</filename>.  Um filtro conversor
			&eacute; um filtro texto como foi definido na se&ccedil;&atilde;o 
			Configura&ccedil;&atilde;o Simples de Impressora ( veja a 
			se&ccedil;&atilde;o
			<link linkend="printing-textfilter">Instalando um Filtro de Texto
			</link>) Exceto pelo fato imprimir arquivos de texto puro, os filtros 
			convertem os arquivos em um formato que a impressora pode entender.
			</para>
        </sect4>

        <sect4>
          <title>
				Qual o Filtro Conversor Devo Instalar?
			</title>
          
			<para>
				Voc&ecirc; deve instalar o filtro conversor que voc&ecirc; espera
			utilizar.  Se voc&ecirc; imprime uma grande quantidade de dados
			no formato DVI, ent&atilde;o voc&ecirc; deve term um filtro para 
			converte-lo.  Se voc&ecirc; deseja imprimir saidas atrav&eacute;s de 
			troff, ent&atilde;o provavelmente voc&ecirc; ter&aacute; um filtro
			troff.
			</para>
              
			<para>
				A seguinte tabela sumariza os filtros que o 
			<application>LPD</application> pode trabalhar, e suas 
			op&ccedil;&atilde;o est&atilde;o no arquivo 
			<filename>/etc/printcap</filename>, e como devem ser chamados com
			o comando <command>lpr</command>:</para>

          <informaltable frame="none">
            <tgroup cols="3">
              <thead>
                <row>
                  <entry>Tipo de Arquivo type</entry>
                  <entry>Op&ccedil;&atilde;o no 
							<filename>/etc/printcap</filename>
						</entry>
                  <entry>Op&ccedil;&otilde;es do <command>lpr</command>
						</entry>
                </row>
              </thead>
              
              <tbody>
                <row>
                  <entry>cifplot</entry>
                  <entry><literal>cf</literal></entry>
                  <entry><option>-c</option></entry>
                </row>
                
                <row>
                  <entry>DVI</entry>
                  <entry><literal>df</literal></entry>
                  <entry><option>-d</option></entry>
                </row>
                
                <row>
                  <entry>plot</entry>
                  <entry><literal>gf</literal></entry>
                  <entry><option>-g</option></entry>
                </row>
                
                <row>
                  <entry>ditroff</entry>
                  <entry><literal>nf</literal></entry>
                  <entry><option>-n</option></entry>
                </row>
                
                <row>
                  <entry>texto em FORTRAN</entry>
                  <entry><literal>rf</literal></entry>
                  <entry><option>-f</option></entry>
                </row>
                
                <row>
                  <entry>troff</entry>
                  <entry><literal>tf</literal></entry>
                  <entry><option>-f</option></entry>
                </row>
                
                <row>
                  <entry>raster</entry>
                  <entry><literal>vf</literal></entry>
                  <entry><option>-v</option></entry>
                </row>
                
                <row>
                  <entry>Texto Puro</entry>
                  <entry><literal>if</literal></entry>
                  <entry>none, <option>-p</option>, or
                    <option>-l</option></entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
          
			<para>
				No nosso exemplo, usamos o comando <command>lpr -d</command> 
			que significa dizer que precisamos da op&ccedil;&atilde;o
         <literal>df</literal> dentro do arquivo 
			<filename>/etc/printcap</filename>.
			</para>
              
          <indexterm><primary>FORTRAN</primary></indexterm>
			<para>
				Apesar de algumas pessoas possam pensar, formatos como o 
			FORTRAN e plot s&atilde;o provavelmente obsoleto.  No seu 
			s&iacute;tio, voc&ecirc; pode dar novas op&ccedil;&otilde;es de 
			formata&ccedil;&atilde;o para esses ou qualquer outra 
			formata&ccedil;&atilde;o apenas instalando novos filtros ajustados
			para o seu uso.  Por exemplo, suponhamos que seja necess&aacute;rio
			imprimir diretamente arquivos Printerleaf ( arquivos vindos do
			do programa de pubica&ccedil;&atilde;o Interleaf ), mas voc&ecirc; 
			nunca ir&aacute; imprimir arquivos de plot.  Voc&ecirc; poder&aacute;
			instalar um filtro para converter esse formato utilizando a 
			op&ccedil;&atilde;o <literal>gf</literal> e educar os seus 
			usu&aacute;rios a utilizarem o comando <command>lpr -g</command> 
			quando forem imprimir arquivos do tipo <quote>Printerleaf</quote>.
			</para>
        </sect4>

        <sect4>
			<title>
				Instalando Filtros Conversores
			</title>
          
			<para>
				Deste que os filtros de convers&atilde;o s&atilde;o programas
			instalados por fora da instala&ccedil;&atilde;o padr&atilde;o do
			FreeBSD, eles devem, provavelmente, ficar no diret&oacute;rio
			<filename>/usr/local</filename>.  O diret&oacute;rio
			<filename>/usr/local/libexec</filename> &eacute; a 
			localiza&ccedil;&atilde;o mais indicado, uma vez que s&atilde;o 
			programas especializados que somente o <application>LPD</application>
			ir&aacute; usar; usu&aacute;rios regulares do sistema,
			n&atilde;o dever&atilde;o ter necessidade de execut&aacute;-los.
			</para>
              
			<para>
				Para habilitar dum filtro conversor, especifique o diret&oacute;rio
			no qual ele se encontra, na op&ccedil;&atilde;o espec&iacute;fica
			do arquivo <filename>/etc/printcap</filename>.
			</para>
              
			<para>
				Um outro exemplo, nos iremos adicionar um filtro conversor DVI
			na impressora chamada <literal>bamboo</literal>.  Aqui um exemplo
			de um arquivo <filename>/etc/printcap</filename>, com a nova
			op&ccedil;&atilde;o <literal>df</literal> para a impressora
			<literal>bamboo</literal>.
			</para>

          <programlisting>#
#  /etc/printcap for host rose - added df filter for bamboo
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:\
        :lp=/dev/lpt0:\
        :if=/usr/local/libexec/if-simple:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:rw:\
        :if=/usr/local/libexec/psif:\
        :df=/usr/local/libexec/psdf:</programlisting>

			<para>
				O filtro DVI &eacute; um script para o shell chamado de
			<filename>/usr/local/libexec/psdf</filename>.  aqui est&aacute; o
			script
			</para>

          <programlisting>#!/bin/sh
#
#  psdf - DVI to PostScript printer filter
#  Installed in /usr/local/libexec/psdf
#
# Invoked by lpd when user runs lpr -d
#
exec /usr/local/bin/dvips -f | /usr/local/libexec/lprps "$@"</programlisting>

			<para>
				Esse script executa <command>dvips</command> no modo de filtro
			( o argumento <option>-f</option> ) na entrada padr&atilde;o, na qual
			o job ser&aacute; impresso.  Ele inicia o filtro &postscript; da
			impressora <command>lprps</command> ( veja a se&ccedil;&atilde;o
			<link linkend="printing-advanced-if-conversion">
			Acomodando Trabalhgos de Impress&atilde;o em Texto Puro em 
			Impressoras &postscript;
			</link> ) com os argumentos do <application>LPD</application> passado 
			pelo script.  O comando <command>lprps</command> ir&aacute; ser usado
			como argumento para a contabilidade de p&aacute;ginas impressas.
			</para>

        </sect4>
            
        <sect4>
          <title>
				Mais Exemplos de Filtros Conversores
			</title>
              
			<para>
				Deste que n&atilde;o existe um conjunto de passos para a 
			instala&ccedil;&atilde;o de filtros conversores, Nos iremos 
			providenciar mais exempemplos.  Use-os como guia para fazer os
			seus pr&oacute;prios filtros.  Use-os diretamente se forem 
			apropriados.
			</para>
              
			<para>
				Esse exemplo de script &eacute; um filtro conversor
			<foreignphrase>raster</foreignphrase> ( com arquivos GIF atualmente )
			para as impressoras Hewlett Packard LaserJet III-Si:
			</para>

          <programlisting>#!/bin/sh
#
#  hpvf - Convert GIF files into HP/PCL, then print
#  Installed in /usr/local/libexec/hpvf
                  
PATH=/usr/X11R6/bin:$PATH; export PATH
giftopnm | ppmtopgm | pgmtopbm | pbmtolj -resolution 300 \
    &amp;&amp; exit 0 \
    || exit 2</programlisting>

			<para>
				Ele converte um arquivo GIF em um formato
			<foreignphrase>anymap</foreignphrase> port&aacute;vel, convertendo
			em um mapa de cinza port&aacute;vel, convertento em um formato
			bitmap port&aacute;vel, e eet&atilde;o convertendo em dados
			compat&iacute;vel PCL.
			</para>
              
			<para>
				Um exemplo de arquivo <filename>/etc/printcap</filename> com
			uma entrada para uma impressora usando o filtro acima.
			</para>

          <programlisting>#
#  /etc/printcap for host orchid
#
teak|hp|laserjet|Hewlett Packard LaserJet 3Si:\
        :lp=/dev/lpt0:sh:sd=/var/spool/lpd/teak:mx#0:\
        :if=/usr/local/libexec/hpif:\
        :vf=/usr/local/libexec/hpvf:</programlisting>
              
			<para>
				O pr&oacute;ximo script converte dados troff vindos de um 
			sistema groff para uma impressora &postscript; chamada 
         <literal>bamboo</literal>:
			</para>

          <programlisting>#!/bin/sh
#
#  pstf - Convert groff's troff data into PS, then print.
#  Installed in /usr/local/libexec/pstf
#
exec grops | /usr/local/libexec/lprps "$@"</programlisting>
              
			<para>
				O script acima, faz uso novamente do comando 
			<command>lprps</command> para manipular a comunica&ccedil;&atilde;o
			com a impressora.  Se a impressora estiver na porta paralela,
			nos devemos usar este script:
			</para>

          <programlisting>#!/bin/sh
#
#  pstf - Convert groff's troff data into PS, then print.
#  Installed in /usr/local/libexec/pstf
#
exec grops</programlisting>
          
			<para>
				Aqui est&aacute; a entrada que precisamos adicionar no arquivo
			<filename>/etc/printcap</filename> para habilitar o filtro:
			</para>
                
          <programlisting>:tf=/usr/local/libexec/pstf:</programlisting>
              
			<para>
				Aqui est&aacute; um filtro para texto em FORRAN para qualquer
			impressora diretamente em texto puro.  Nos iremos instalar isso
			para a impressora chamada <literal>teak</literal>:
			</para>

          <programlisting>#!/bin/sh
#
# hprf - FORTRAN text filter for LaserJet 3si:
# Installed in /usr/local/libexec/hprf
#

printf "\033&amp;k2G" &amp;&amp; fpr &amp;&amp; printf "\033&amp;l0H" &amp;&amp;
 exit 0
exit 2</programlisting>
              
			<para>
				E nos adicionamos esta linha no arquivo
			<filename>/etc/printcap</filename> para a impressora
			<literal>teak</literal> para habilitar esse filtro:
			</para>
              
          <programlisting>:rf=/usr/local/libexec/hprf:</programlisting>
              
			<para>
				Aqui &eacute; o fim desse exemplo complexo.  Nos iremos adicionar
			o filtro DVI para a impressora LaserJet <literal>teak</literal>
			indrotuzido recentemente.  Primeiro, a parte mais f&aacute;cil; 
			atualize o arquivo <filename>/etc/printcap</filename> com a 
			localiza&ccedil;&atilde;o do filtro DVI:
			</para>
              
          <programlisting>:df=/usr/local/libexec/hpdf:</programlisting>
              
				<para>
					Agora, a parte mais dif&iacute;cil: fazendo o filtro.
			Para tanto, nos iremos necessitar de um programa conversor de DVI
			para LaserJet/PCL.  Na cole&ccedil;&atilde;o de programas do
			FreeBSD ( veja em 
			<link linkend="ports">A Cole&ccedil;&atilde;o de Programas</link>)
			possui um: <command>dvi2xx</command> &eacute; o nome do pacote.
			Instalando esse pacote, nos teremos o programa necess&aacute;rio,
			<command>dvilj2p</command>, o qual converte DVI em arquivos 
			LaserJet IIp, LaserJet III, e LaserJet 2000 compat&iacute;veis.
				</para>
              
				<para>
					O comando <command>dvilj2p</command> deixa o filtro 
			<command>hpdf</command> pouco complexo uma vez que o comando
			<command>dvilj2p</command> n&atilde;o pode ler da entrada 
			padr&atilde;o.  Ele necessita trabalhar com o nome do arquivo.
			Isso &eacute; rium, o nome do arquivo deve ter no final
			<filename>.dvi</filename> ent&atilde;o usando o
			<filename>/dev/fd/0</filename> para a entrada padr&atilde;o 
			seria problem&aacute;tico.  Nos podemos contornar o problema 
			linkando ( simbolicamente ) um nome tempor&aacute;rio de arquivo 
			( um que terminaria em <filename>.dvi</filename> ) para o
			<filename>/dev/fd/0</filename>, for&ccedil;ando assim o
			<command>dvilj2p</command> ler da entrada padr&atilde;o.
				</para>
              
			<para>
				Outro ponto importante &eacute; que n&atilde;o podemos utilizar
			o diret&oacute;rio <filename>/tmp</filename> para um link 
			tempor&aacute;rio.  Links simb&oacute;licos s&atilde;o propriedade do
			usu&aacute;rio e grupo <username>bin</username>.  O filtro executa
			como o usu&aacute;rio <username>daemon</username>.  E o filtro 
			n&atilde;o conseguir&aacute; criar o link, mas tamb&eacute;m ele
			n&atilde;o estar&aacute; apto quando terminar, de remove-lo como
			um usu&aacute;rio diferente.
			</para>
              
			<para>
				Uma vez que o filtro ir&aacute; criar um link simb&oacute;lico 
			no diret&oacute;rio de trabalho corrente, que &eacute; o 
			diret&oacute;rio de spooling ( especificado na op&ccedil;&atilde;o
			<literal>sd</literal> no arquivo <filename>/etc/printcap</filename>).
			  Este &eacute; um lugar perfeito par os filtros realizarem o seu
			trabalho, especialmente porque na maioraia das vezes possui mais 
			espa&ccedil;o do que o diret&oacute;rio <filename>/tmp</filename>.
			</para>
              
			<para>
				Aqui, finalmente, o filtro:
			</para>

          <programlisting>#!/bin/sh
#
#  hpdf - Print DVI data on HP/PCL printer
#  Installed in /usr/local/libexec/hpdf

PATH=/usr/local/bin:$PATH; export PATH

#
#  Define a function to clean up our temporary files.  These exist
#  in the current directory, which will be the spooling directory
#  for the printer.
#
cleanup() {
   rm -f hpdf$$.dvi
}

#
#  Define a function to handle fatal errors: print the given message
#  and exit 2.  Exiting with 2 tells LPD to do not try to reprint the
#  job.
#
fatal() {
    echo "$@" 1&gt;&amp;2
    cleanup
    exit 2
}

#
#  If user removes the job, LPD will send SIGINT, so trap SIGINT
#  (and a few other signals) to clean up after ourselves.
#
trap cleanup 1 2 15 

#
#  Make sure we are not colliding with any existing files.
#
cleanup

#
#  Link the DVI input file to standard input (the file to print).
#
ln -s /dev/fd/0 hpdf$$.dvi || fatal "Cannot symlink /dev/fd/0"

#
#  Make LF = CR+LF
#
printf "\033&amp;k2G" || fatal "Cannot initialize printer"

# 
#  Convert and print.  Return value from dvilj2p does not seem to be
#  reliable, so we ignore it.
#
dvilj2p -M1 -q -e- dfhp$$.dvi

#
#  Clean up and exit
#
cleanup
exit 0</programlisting>
        </sect4>

        <sect4 id="printing-advanced-autoconv">
          <title>
				Convers&atilde;o Autom&aacute;tica: Uma Alternatica aos Filtros 
				de Convers&atilde;o
            </title>
              
			<para>
				Todos esses filtros de convers&atilde;o completam o seu ambiente 
			de impress&atilde;o, mas a um custo de for&ccedil;ar seu 
			usua&aacute;rio a especificar ( no comando de linha &man.lpr.1; )
			Qual ele ir&acute; usar.
				Se seus usu&aacute;rios n&atilde;o est&atilde;o familiarizados, ou
			n&atilde;o tiverem uma literatura particular, eles acharam isso 
			muito chato.  O que &eacute; ruim, entretanto, &eacute; a escolha
			de uma op&ccedil;&atilde;o errada, que poder&aacute; gerar muitas
			p&aacute;ginas de lixo.
			</para>
              
			<para>
				De prefer&ecirc;ncia quando for instalar um filtro de 
			convers&atilde;o, voc&ecirc; poder&aacute; tentar deixar como 
			padr&atilde;o um filtro texto, que detecte o tipo de arquivo e 
			execute o filtro adequado para convers&atilde;o.  ferramentas como
			<command>file</command> poder&aacute; ajuda-lo a resolver isto.
			  Claro que voc&ecirc; ter&aacute; dificultades de diferenciar entre
			<emphasis>alguns</emphasis> tipos de arquivos e &eacute; claro que 
			voc&ecirc; estar&aacute; providenciando o filtro correto para 
			converte-lo.
			</para>
              
          <indexterm><primary>apsfilter</primary></indexterm>
          <indexterm>
            <primary>printing</primary>
            <secondary>filters</secondary>
            <tertiary>apsfilter</tertiary>
          </indexterm>

			<para>
				A Cole&ccedil;&atilde;o de Programas do FreeBSD tem um 
			filtro de texto capz de realizar automaticamente a convers&atilde;o
			definida <command>apsfilter</command>.  Ele tamb&eacute;m pode
			detectar texto puro, &postscript, e DVI, executa as 
			convers&otilde;es necess&aacute;rias, e a seguir imprime o 
			resultado.
			</para>
        </sect4>
      </sect3>
      
      <sect3 id="printing-advanced-of">
        <title>Filtros de Sa&iacute;da</title>

		<para>
			O sistema de spooling <application>LPD</application> suporta um
		outro tipo de filtro que ainda n&atilde;o foi explorado: o filtro 
		de sa&iacute;da.  Um filtro de sa&iacute;da tem apenas o objetivo
		de imprimir texto puro, como outros filtros de texto, mas com muitas
		simplifica&ccedil;&otilde;es.  Se voc&ecirc; estiver utilizando um
		filtro de sa&iacute;da mas n&atilde;o um filtro texto, ent&atilde;o:
		</para>

        <itemizedlist>
          <listitem>
			<para>
				O <application>LPD</application> inicia o filtro de 
			sa&iacute;da apenas uma unica vez para o trabalho de 
			impress&atilde;o ao invez de uma vez para cada arquivo no 
			trabalho de impress&atilde;o.
			</para>
          </listitem>
          
          <listitem>
			<para>
				O sistema <application>LPD</application> n&atilde;o faz nenhuma
			previs&atilde;o para identificar o inc&iacute;cio ou o final de 
			arquivos dentro do trabalho de impress&atilde;o para o filtro de
			sa&iacute;da.
			</para>
          </listitem>
          
          <listitem>
			<para>
				O sistema <application>LPD</application> n&atilde;o repassa o
			nome do usu&aacute;rio ou a m&aacute;quina para o filtro, ent&atilde;o
			n&atilde;o conseque fazer a contabiliza&ccedil;&atilde;o do uso.  de
			fato, ele s&oacute; utiliza dois argumentos:
			</para>
                    
            <cmdsynopsis>
              <command>nome do filtro</command>
              <arg choice="plain">-w<replaceable>largura</replaceable></arg>
              <arg choice="plain">-l<replaceable>comprimento</replaceable></arg>
            </cmdsynopsis>
            
			<para>
				Onde <replaceable>largura</replaceable> &eacute; retirado
			da op&ccedil;&atilde;o <literal>pw</literal> e o
			<replaceable>comprimento</replaceable> &eacute; retirado da 
			op&ccedil;&atilde;o <literal>pl</literal> referente a impressora
			utilizada
			</para>
          </listitem>
        </itemizedlist>

			<para>
				N&atilde;o fique seduzido pela facilidade do uso dos filtros
			de sa&iacute;da.  Se voc&ecirc; gostaria de ter cada arquivo do
			trabalho de impress&atilde;o iniciando em diferente p&aacute;ginas
			um filtro de sa&iacute;da <emphasis>n&atilde;o iria funcionar
			</emphasis>.  Use um filtro de texto (tamb&eacute;m conhecido como
			filtro de entrada); veja a se&ccedil;&atilde;o <link
            linkend="printing-textfilter">Instalando um Filtro Texto</link>.
			  Al&eacute;m disso, um filtro de sa&iacute;da &eacute; atualmente
         <emphasis>mais complexo</emphasis> porque ele examina um
			<foreignphrase>stream</foreignphrase> de bytes iniciamente enviado
			para ele com um <foreignphrase>flag</foreignphrase> especial e deve
			ser enviado sinais para ele pr&oacute;rio em benef&iacute;cio do
			sistema <application>LPD</application>.
			</para>
            
			<para>
				Entretanto, um filtro de sa&iacute;da &eacute; 
			<emphasis>necessario</emphasis> se voc&ecirc; quizer 
			cabe&ccedil;alho de p&aacute; e precisa enviar segu&ecirc;ncias de
			caracteres escape ou outro conjunto de caracteres 
			inicializa&ccedil;&atilde;o para abilitar o cabe&ccedil;alho das
			p&aacute;ginas.  (mas isso &eacute; tamb&eacute;m
         <emphasis>f&uacute;til</emphasis> se voc&ecirc; deseja carregar
			cabe&ccedil;alhos de p&aacute;gina para a contabilidade do 
			usu&aacute;rio uma vez que o sistema <application>LPD</application> 
			n&atilde;o fornece nenhuma informa&ccedil;&atilde;o do usu&aacute;rio
			ou do computador para o filtro de sa&iacute;da).
			</para>
            
			<para>
				Para uma &uacute;nica impressora, o sistema 
			<application>LPD</application> permite tanto filtros de sa&iacute;da
			e de texto ou de outro tipo.  Na maioria dos casos o sistema
	  		<application>LPD</application> ir&aacute; iniciar o filtro de 
			sa&iacute;da para imprimir a p&aacute;gina de cabe&ccedil;alho (
			veja a se&ccedil;&atilde;o <link
            linkend="printing-advanced-header-pages">P&aacute;ginas de
			Cabe&ccedil;alho</link>) somente.  O sistema 
         <application>LPD</application> ent&atilde;o agurada o filtro de
			sa&iacute;da <emphasis>terminar</emphasis> pelo envio de uma 
			sequ&ecirc;ncia de dois bytes para o filtro: os caracterres ASCII
			031 seguido pelo 001.  Quando ofiltro ve esses dois bytes (031, 001),
			ele deve parar com um envio do sinal <literal>SIGSTOP</literal> para
			si mesmo.  Quando o sistema <application>LPD</application> termina a
			execu&ccedil;&atilde;o de outros filtros, ele ir&aacute; reinicializar
			o filtro de sa&iacute;da pelo envio do sinal 
			<literal>SIGCONT</literal> para ele.
			</para>
            
			<para>
				Se existir um filtro de sa&iacute;da mas
			 <emphasis>n&atilde;o</emphasis> um filtro texto e o
          <application>LPD</application> estiver trabalhando em um trabalho 
			de impress&atilde;o de texto puro, o <application>LPD</application> 
			utiliza o filtro de sa&iacute;da para realizar a tarefa de 
			impress&atilde;o.  Como dito antes, o filtro de sa&iacute;da 
			ir&aacute; imprimir cada arquivo do trabalho de impress&atilde;o
			na sequ&ecirc;ncia sem o intervalo de alimenta&ccedil;&atilde;o
			de folha ou outro avan&ccedil;o de papel, e isso voc&ecirc;
			provavelmente <emphasis>n&atilde;o</emphasis> deseja.  Na maioria dos
			casos voc&ecirc; necessitara de um filtro de texto.
			</para>
            
			<para>
				O programa <command>lpf</command>, o qual nos introduzimos 
			recentemente como um filtro texto, pode tamb&eacute;m ser executado
			como um filtro de sa&iacute;da.  Se voc&ecirc; necessitar de um 
			filtro de sa&iacute;da r&aacute;pido e sem muita qualidade, mas 
			n&atilde;o quer ter o trabalho de escrever um detector de byte e
			um c&oacute;digo para enviar sinais, tente o <command>lpf</command>.  
			Voc&ecirc; tamb&eacute;m pode colocar o <command>lpf</command> dentro
			de um script em shell para manipular os c&oacute;digos de 
			inicializa&ccedil;&atilde;o que a impressora pode necessitar.
			</para>
      </sect3>
      
      <sect3 id="printing-advanced-lpf">
        <title><command>lpf</command>: Um Filtro de Texto</title>

			<para>
				O programa <filename>/usr/libexec/lpr/lpf</filename>  que 
			vem com a distribui&ccedil;&atilde;o do FreeBSD &eacute; um 
			filtro de texto ( filtro de entrada )e pode identar a sa&iacute;da 
			( o trabalho de impress&atilde;o enviado com o comando <command>lpr
          -i</command>), permitindo que caracteres literais possam ser 
			enviados (trabalho de impress&atilde;o enviado com o comando
         <command>lpr -l</command>), ajustar a posi&ccedil;&atilde;o de 
			impress&atilde;o para caracteres de retorno (backspace) e 
			tabula&ccedil;&otilde;es no trabalho de imress&atilde;o, e fazer 
			a contabilidade das p&aacute;ginas impressas.  Tamb&eacute;m pode
			agir como um filtro de sa&iacute;da.
			</para>
            
			<para>
				O comando <command>lpf</command> &eacute; adequado para a 
			maioria dos ambientes de impress&atilde;o.  E ainda que n&atilde;o
			possua capacidade para enviar sequ&ecirc;ncias de
			inicializa&ccedil;&atilde;o para as impressoras, isto &eacute; 
			f&aacute;cil ser escrito em  script de shell para fazer as 
			inicializa&ccedil;&otilde;es necess&aacute;rias e ent&atilde;o
			executar o <command>lpf</command>.
			</para>
            
        <indexterm><primary>page accounting</primary></indexterm>
        <indexterm>
          <primary>accounting</primary>
          <secondary>printer</secondary>
        </indexterm>
			<para>
				Para que o <command>lpf</command> fa&ccedil;a a estatistica
			corretamente, ele necessita dos valores preencidos corretamente nas
			op&ccedil;&otilde;es <literal>pw</literal> e <literal>pl</literal>
			no arquivo <filename>/etc/printcap</filename>.  Ele utiliza esses
			valores para determinar como o texto poder&aacute; caber na 
			p&aacute;gina que quantas p&aacute;ginas estar&atilde;o no 
			trabalho de impress&atilde;o do usu&aacute;rio.  Para mais 
			informa&ccedil;&otilde;es, veja a se&ccedil;&atilde;o
         <link linkend="printing-advanced-acct">
				Estatisticas do Uso da Impressora
			</link>.
			</para>
      </sect3>
    </sect2>
    
    <sect2 id="printing-advanced-header-pages">
      <title>P&aacute;ginas de Cabe&ccedil;alhos</title>
      
		<para>
			Se voc&ecirc; tiver <emphasis>muitos</emphasis> usu&aacute;rios,
		todos eles usuando v&aacute;rias impressoras, voc&ecirc; provavelmente
		dever&aacute; considerar as <emphasis>p&aacute;gians de 
		cabe&ccedil;alho</emphasis> como um mal necess&aacute;rio.
		</para>
          
      <indexterm>
        <primary>banner pages</primary>
	<see>header pages</see>
      </indexterm>
      <indexterm><primary>header pages</primary></indexterm>
		<para>
			P&aacute;ginas de Cabe&ccedil;alho, tamb&eacute;m conhecida como
		<emphasis>banner</emphasis> ou <emphasis>burst pages</emphasis> 
		identifica de quem &eacute; o trabalho de impress&atilde;o depois dele
		ser impresso.  Ela &eacute; geralmente impressa grande, com letras
		em negrito, e as vezes com bordas decorativas, para que em um pilha
		de impress&atilde;o eles possam ser identificados e entregues ao
		usu&aacute;rio correto.
			As p&aacute;ginas de cabe&ccedil;alho s&atilde;o impressas uma
		por trabalho de impress&atilde;o e n&atilde;o uma por arquivo impresso.
		</para>
          
      <para>
			O sistema <application>LPD</application> pode providenciar 
		automaticamente p&aacute;ginas de cabe&ccedil;alho para suas 
		sa&iacute;das <emphasis>se</emphasis> sua impressora puder imprimir
		texto puro.  Se voc&ecirc; tiver uma impressora &postscript;, voc&ecirc;
		necessitara de um programa externo para gerar essas p&aacute;ginas;
		veja a se&ccedil;&atilde;o <link
          linkend="printing-advanced-header-pages-ps">
				P&aacute;ginas de Cabe&ccedil;alho em Impressoras
          &postscript; </link>.
		</para>

          <sect3 id="printing-advanced-header-pages-enabling">
			<title>
				Habilitando P&aacute;ginas de Cabe&ccedil;alho
			</title>

		<para>
			Na se&ccedil;&atilde;o <link linkend="printing-simple">
				Configura&ccedil;&atilde;o Simples da Impressora
      </link>, nos desligamos a impress&atilde;o das p&aacute;ginas de 
		cabe&ccedil;alho, atrav&eacute;s da op&ccedil;&atilde;o
		<literal>sh</literal> ( que significa <quote>suppres header</quote>)
		no arquivo <filename>/etc/printcap</filename>.  Para habilitar a 
		impress&atilde;o, basta a remo&ccedil;&atilde;o da op&ccedil;&atilde;o
		<literal>sh</literal>.
		</para>

      <para>
			Isso parece t&atilde;o f&aacute;cil, correto?
		<para>

      <para>
			E voc&ecirc; esta certo.  Voc&ecirc; <emphasis>deve</emphasis> ter
		providenciado um filtro de sa&iacute;da para enviar os dados de 
		inicializa&ccedil;&atilde;o para a impressora.  Aqui um est&aacute;
		um exemplo de filtro de sa&iacute;da para uma impressora
      Hewlett Packard PCL-compat&iacute;vel:
		</para>

        <programlisting>#!/bin/sh
#
#  hpof - Output filter for Hewlett Packard PCL-compatible printers
#  Installed in /usr/local/libexec/hpof

printf "\033&amp;k2G" || exit 2
exec /usr/libexec/lpr/lpf</programlisting>
            
		<para>
			especificando odiret&oacute;rio para o filtro de sa&iacute;da na
		op&ccedil;&atilde; <literal>of</literal>.  veja na se&ccedil;&atilde;o
		<link linkend="printing-advanced-of">Filtros de Sa&iacute;da</link>
		para maiores informa&ccedil;&otilde;es.
		</para>
            
		<para>
			Aqui um exemplo do arquivo <filename>/etc/printcap</filename> para
		a impressora <literal>teak</literal> que foi introduzida recentemente;
		nos habilitamos a p&aacute;gina de cabe&ccedil;alho e adicionamos
		o filtro de sa&iacute;da descrito acima:
		</para>

        <programlisting>#
#  /etc/printcap for host orchid
#
teak|hp|laserjet|Hewlett Packard LaserJet 3Si:\
        :lp=/dev/lpt0:sd=/var/spool/lpd/teak:mx#0:\
        :if=/usr/local/libexec/hpif:\
        :vf=/usr/local/libexec/hpvf:\
        :of=/usr/local/libexec/hpof:</programlisting>
            
		<para>
			Agora, quando os usu&aacute;rios imprimirem os seus trabalhos para a
		impressora <literal>teak</literal>, eles ter&atilde;o uma 
		p&aacute;gina de cabe&ccedil;alho para cada job impresso.  Se os 
		usu&aacute;rios querem perder tempo procurando os seus trabalhos de
		impressora, eles podem suprimir essas p&aacute;gians com o comando
		<command>lpr -h</command>; veja a se&ccedil;&atilde;o <link
            linkend="printing-lpr-options-misc">
			Op&ccedil;&atilde;oes de P&aacute;ginas de Cabe&ccedil;alho
		</link> para outras op&ccedil;&otilde;es veja &man.lpr.1; .
		</para>

     <note>
		<para>
			O <application>LPD</application> imprime o caracter de
		alimenta&ccedil;&atilde;o de p&aacute;gina (form feed) logo apos a 
		p&aacute;gina de cabe&ccedil;alho.  Se sua impressora utiliza um 
		caracter diferente ou sequencia de caracteres para ejetar uma 
		p&aacute;gina, especifique-o na op&ccedil;&atilde;o
		<literal>ff</literal> no arquivo <filename>/etc/printcap</filename>.
			</para>
        </note>
      </sect3>
      
      <sect3 id="printing-advanced-header-pages-controlling">
        <title>Controlando P&aacute;ginas de Cabe&ccedil;alho</title>

			<para>
				Uma vez habilidada a p&aacute;gina de cabe&ccedil;alho, o
		<application>LPD</application> ir&aacute; produzir um 
		<emphasis>longo cabe&ccedil;alho</emphasis>, uma p&aacute;gina 
		completa com letras grandes identificando o usu&aacute;rio, 
		m&aacute;quina, e o trabalho de impress&atilde;o.  Aqui est&aacute;
		um exemplo (kelly imprimiu um trabalho de impress&atilde;oi entitulado
		de outline a partir da m&aacute;quina <hostid>rose</hostid>):
			</para>
            
        <programlisting>
      k                   ll       ll
      k                    l        l
      k                    l        l
      k   k     eeee       l        l     y    y
      k  k     e    e      l        l     y    y
      k k      eeeeee      l        l     y    y
      kk k     e           l        l     y    y
      k   k    e    e      l        l     y   yy
      k    k    eeee      lll      lll     yyy y
                                               y
                                          y    y
                                           yyyy


                                   ll
                          t         l        i
                          t         l
       oooo    u    u   ttttt       l       ii     n nnn     eeee
      o    o   u    u     t         l        i     nn   n   e    e
      o    o   u    u     t         l        i     n    n   eeeeee
      o    o   u    u     t         l        i     n    n   e
      o    o   u   uu     t  t      l        i     n    n   e    e
       oooo     uuu u      tt      lll      iii    n    n    eeee









      r rrr     oooo     sss      eeee
      rr   r   o    o   s    s   e    e
      r        o    o    s      eeeeee
      r        o    o      s    e
      r        o    o   s    s   e    e
      r         oooo     sss      eeee







                                              Job:  outline
                                              Date: Sun Sep 17 11:04:58 1995</programlisting>

			<para>
				O <application>LPD</application> adiciona uma 
			alimenta&ccedil;&atilde;o de p&aacute;gina logo apos o texto ser 
			impresso, ent&atilde;o inicia em uma nova p&aacute;gina o trabalho
			de impress&atilde;o ( a menos que se tenha definido a 
			op&ccedil;&atilde;o <literal>sf</literal> (suprimir a 
			alimenta&ccedil;&atilde;o de p&aacute;gina) na impressora destinada
			no arquivo <filename>/etc/printcap</filename>).
			</para>
            
			<para>
				Se voc&ecirc; preferir, o <application>LPD</application> pode
			fazer uma <emphasis>p&aacute;gina pequena</emphasis>; 
			especificando a op&ccedil;&atilde;o <literal>sb</literal> 
			(short banner) no arquivo <filename>/etc/printcap</filename>. 
			A p&aacute;gina de cabe&ccedil;alho ir&aacute; parecer como esta:
			</para>
            
        <programlisting>rose:kelly  Job: outline  Date: Sun Sep 17 11:07:51 1995</programlisting>

			<para>
				Tamb&eacute;m poe padr&atilde;o, o <application>LPD</application> 
			imprime a p&aacute;gina de cabe&ccedil;alho primeiro, e ent&atilde;o
			o trabalho de impress&atilde;o.
				Para reverter isso, especifique a op&ccedil;&atilde;o
         <literal>hl</literal> (header last) no arquivo 
          <filename>/etc/printcap</filename>.
			</para>
      </sect3>
      
      <sect3 id="printing-advanced-header-pages-accounting">
			<title>
				Estat&iacute;sticas para P&aacute;ginas de Cabe&ccedil;alho
			</title>

			<para>
				Usando o <application>LPD</application> para imprimir as 
			p&aacute;ginas de cabe&ccedil;alho, leva-nos a um paradigma,
			nos devemos contar as p&aacute;gians de cabe&ccedil;alho para fazer
			as estat&iacute;stica, ou devemos 
          <emphasis>deix-la de fora</emphasis>.
			</para>
            
        <para>Por que?</para>

			<para>
				Por que o filtro de sa&iacute;da &eacute; somente um programa 
		externo que ter&aacute; controle quando a p&aacute;gina de 
		cabe&ccedil;alho for impressa e n&atilde;o pode diferenciar isto
		do total para que possa fazer a estat&iacute;stica corretamente,
		e isso n&atilde;o &eacute; fornecido por qualquer 
		<emphasis>usu&aacute;rio ou m&aacute;quina</emphasis> ou qualquer 
		arquivo de estat&iacute;stica, ent&atilde;o ele n&atilde;o tem 
		ideia para quem contabilizar o uso da impressora.  E tamb&eacute;m
		n&atilde;o &eacute; justo <quote>adcionar uma p&aacute;gina</quote>
		para o filtro texto ou qualquer outro filtro de convers&atilde;o 
		( os quais t&ecirc;m informa&ccedil;&otilde;es sobre os 
		usu&aacute;rios e m&aacute;quinas) uma vez que os usu&aacute;rios 
		podem suprimir as p&aacute;ginas de cabe&ccedil;alho com o comando
		<command>lpr -h</command>.  &Agrave; eles ent&atilde;o seriam atribuidos
		os custros ( estat&iacute;sticas ) de p&aacute;ginas de 
		cabe&ccedil;alho que efetivamente n&atilde;o imprimiram.  Basicamente,
      o <command>lpr -h</command> ir&aacute; ser uma op&ccedil;&atilde;o
		preferiad no ambito dos usu&aacute;rios, mas voc&ecirc; n&atilde;o
		dever&aacute; incentivar o seu uso.
			</para>
            
			<para>
				Isso <emphasis>n&atilde;o &eacute; o sufuciente</emphasis> 
		para cada filtro gerar sua pr&oacute;priap&aacute;gina de
		cabe&ccedil;alho ( entretanto estar&aacute; apto a contabiliza-las).
		  Se os usu&aacute;rios quizerem a op&ccedil;&atilde;o de 
		supress&atilde;o de p&aacute;ginas de cabe&ccedil;alho com o 
		comando <command>lpr -h</command>, eles ainda teram e ser&atilde;o 
		contabilizado uma vez que o <application>LPD</application> n&atilde;o 
		tem conhecimento da <option>-h</option> para nenhum filtro.
			</para>

			<para>
				Ent&atilde;o, qual &eacute; a sua op&ccedil;&atilde;o?
			</para>

			<para>
				Voc&ecirc; pode:
			</para>

        <itemizedlist>
          <listitem>
            <para>
					Aceitando o paradigma do <application>LPD</application>
			e liberando as p&aacute;ginas de cabe&ccedil;alho.
				</para>
          </listitem>
          
          <listitem>
            <para>
					Instalando alternativas ao <application>LPD</application>,
			tais como:
		<application>LPRng</application>. Se&ccedil;&atilde;o
		<link linkend="printing-lpd-alternatives">
			Alternativas Ao Spooler Padr&atilde;o
		</link> diz mais sobre os programas que podem substituir o
              <application>LPD</application>.
	    </para>
          </listitem>
          
          <listitem>
				<para>
					Escrevendo um filtro de sa&iacute;da 
			<emphasis>inteligente</emphasis>.  Normalmente um filtro de
			sa&iacute;da n&atilde;o precisa de muita coisa a al&eacute;m de 
			inicializar a impressora ou fazer algumas convers&otilde;es de 
			caracteres.  Ele der&aacute; que se adaptar para p&aacute;gians de 
			cabe&ccedil;alho ou para trabalhos de impress&atilde;o em texto 
			puro ( quando ele n&atilde;o for um filtro de texto (entrada)).  Mas, 
			se existir um filtro de texto para trabalhos de impress&atilde;o
			em texto puro, ent&atilde;o <application>LPD</application> 
			ir&aacute; iniciar o filtro de sa&iacute;da somente para a 
			p&aacute;gina de cabe&ccedil;alho.  E o filtro de sa&iacute;da 
			poder&aacute; alanisar a p&aacute;gina de cabe&ccedil;alho que o
			<application>LPD</application> gerou para determinar qual 
			usu&aacute;rio e m&aacute;quina para poder contabiliza-la.  O 
			&uacute;nico problema com esse m&eacute;todo &eacute; que o filtro 
			de sa&iacute;da continua sem ter conhecimento do arquivo de 
			estat&iacute;stica ( isso n&atilde;o &eacute; passado pela 
			op&ccedil;&atilde;o <literal>af</literal>), mas se voc&ecirc;
			tem o conhecimento do arquivo de estat&iacute;stica, voce 
			poder&aacute; coloca-lo direto no c&oacute;digo do filtro de
			sa&iacute;da.  Para facilitar o passo de an&aacute;lise, use a
			op&ccedil;&atilde;o <literal>sh</literal> (p&aacute;gina curta)
			do arquivo <filename>/etc/printcap</filename>.  Ent&atilde;o 
			depois de tudo feito, os usu&aacute;rios ir&atilde;o apreciar
			o qu&atilde;o generoso o administrador do sistema &eacute;, 
			liberando das estat&iacute;sticas de utiliza&ccedil;&atilde;o a
			paina de cabe&ccedil;alho.
			</para>
          </listitem>
        </itemizedlist>
      </sect3>
      
      <sect3 id="printing-advanced-header-pages-ps">
			<title>
				P&aacute;ginas de Cabe&ccedil;alho em Impressoras &postscript;
			</title>

		<para>
			Como descrito acima, o <application>LPD</application> pode gerar
		as p&aacute;ginas de cabe&ccedil;alho em texto puro, funcional para
		a maioria das impressoras.  Claro que as impressoras &postscript;
		n&atilde;o podem imprimir diretamente texto puro, ent&atilde;o
		a vantagem do <application>LPD</application> poder imprimir as 
		p&aacute;ginas de cabe&ccedil;alho torna-se imprest&aacute;vel&mdash;.
		</para>
            
      <para>
			Uma maneira obvia de ter p&aacute;ginas de cabe&ccedil;alho &eacute; 
		gerar atrav&eacute;s de cada filtro de convers&atilde;o e de filtros de 
		texto, as p&aacute;ginas de cabe&ccedil;alho.  Os filtros devem usar 
		os argumentos de nome de usu&aacute;rio e da m&aacute;quina, para 
		gerar uma p&aacute;gina de cabe&ccedil;alhjo otimizada. a desvantagem
		deste m&eacute;todo &eacute; que o usu&aacute;rio sempre tera a
		p&aacute;gina de cabe&ccedil;alho mesmo que ele utilize o 
		comando <command>lpr -h</command> para imprimir seus trabalhos de
		impress&otilde;es.
		</para>
            
		<para>
			Iremos explorar este m&eacute;todo.  O 
		<foreignphrase>script</foreignphrase> abaixo manipula tr&ecirc;s
		argumentos ( nome do usu&aacute;rio (login), nome da m&aacute;quina,
		e o nome do trabalho de impress&atilde;o) e faz uma p&aacute;gina
		simples de cabe&ccedil;alho em &postscript;:
		</para>


        <programlisting>#!/bin/sh
#
#  make-ps-header - make a PostScript header page on stdout
#  Installed in /usr/local/libexec/make-ps-header
#

#
#  These are PostScript units (72 to the inch).  Modify for A4 or
#  whatever size paper you are using:
#
page_width=612
page_height=792
border=72

#
#  Check arguments
#
if [ $# -ne 3 ]; then
    echo "Usage: `basename $0` &lt;user&gt; &lt;host&gt; &lt;job&gt;" 1&gt;&amp;2
    exit 1
fi

#
#  Save these, mostly for readability in the PostScript, below.
#
user=$1
host=$2
job=$3
date=`date`

#
#  Send the PostScript code to stdout.
#
exec cat &lt;&lt;EOF
%!PS

%
%  Make sure we do not interfere with user's job that will follow
%
save

%
%  Make a thick, unpleasant border around the edge of the paper.
%
$border $border moveto
$page_width $border 2 mul sub 0 rlineto
0 $page_height $border 2 mul sub rlineto
currentscreen 3 -1 roll pop 100 3 1 roll setscreen
$border 2 mul $page_width sub 0 rlineto closepath
0.8 setgray 10 setlinewidth stroke 0 setgray

%
%  Display user's login name, nice and large and prominent
%
/Helvetica-Bold findfont 64 scalefont setfont
$page_width ($user) stringwidth pop sub 2 div $page_height 200 sub moveto
($user) show

%
%  Now show the boring particulars
%
/Helvetica findfont 14 scalefont setfont
/y 200 def
[ (Job:) (Host:) (Date:) ] {
200 y moveto show /y y 18 sub def }
forall

/Helvetica-Bold findfont 14 scalefont setfont
/y 200 def
[ ($job) ($host) ($date) ] {
        270 y moveto show /y y 18 sub def
} forall

%
% That is it
%
restore
showpage
EOF</programlisting>


		<para>
			Agora, cada chamada aos filtros de convers&atilde;o e aos filtros
		de texto, ir&aacute; ser gerada uma p&aacute;gina de cabe&ccedil;alho
		e ent&atilde;o ser&aacute; impresso o trabalho de impress&atilde;o do 
		usu&aacute;rio.  Segue um exemplo de um filtro de convers&atilde;o de 
		DVI, mostrado anteriormente neste documento, modificado para poder
		imprimir a p&aacute;gina de cabe&ccedil;alho.
		</para>

        <programlisting>#!/bin/sh
#
#  psdf - DVI to PostScript printer filter
#  Installed in /usr/local/libexec/psdf
#
#  Invoked by lpd when user runs lpr -d
#
                
orig_args="$@"

fail() {
    echo "$@" 1&gt;&amp;2
    exit 2
}

while getopts "x:y:n:h:" option; do
    case $option in
        x|y)  ;; # Ignore
        n)    login=$OPTARG ;;
        h)    host=$OPTARG ;;
        *)    echo "LPD started `basename $0` wrong." 1&gt;&amp;2
              exit 2
              ;;
    esac
done

[ "$login" ] || fail "No login name"
[ "$host" ] || fail "No host name"

( /usr/local/libexec/make-ps-header $login $host "DVI File"
  /usr/local/bin/dvips -f ) | eval /usr/local/libexec/lprps $orig_args</programlisting>

		<para>
			Observe como o filtro faz a an&aacute;lise da lista de argumentos
		para que possa determinar os nomes de m&aacute;quina e de
		usu&aacute;rio.  A an&aacute;lise para os outros filtros de 
		convers&atilde;o &eacute; identica.  O filtro de texto possui uma
		sutil diferen&ccedil;a no conjunte de argumentos passados ( veja
		a se&ccedil;&atilde;o <link
            linkend="printing-advanced-filters"> Como os filtros 
		funcionam </link>).
		</para>
            
		<para>
			Como foi mencionado, o esquema acima &eacute; muito simples, 
		desabilita a op&ccedil;&atilde;o <quote>supress&atilde;o da 
		p&aacute;gina de cabe&ccedil;alho</quote> ( a op&ccedil;&atilde;o
		<option>-h</option> ) para o comando <command>lpr</command>.  Se os
		usu&aacute;rios quizerem econimizar &aacute;rvores ( ou dinheiro,
		caso seja cobrada a impress&atilde;o da p&aacute;ginas de 
		cabe&ccedil;alho). ele n&atilde;o poderam faze-lo, uma vez que os
		pr&oacute;rpios filtros se encarregam deste servi&ccedil;o.
		</para>
            
		<para>
			Para permitir os usu&aacute;rios desligarem as p&aacute;ginas de 
		cabe&ccedil;alho, voc&ecirc; dever&aacute; usar o truque mostrado na
		se&ccedil;&atilde;o <link
		linkend="printing-advanced-header-pages-accounting">
			Contabilizando as P&aacute;ginas de Cabe&ccedil;alho
      </link>: para escrever um filtro de sa&iacute;da que analise a 
		p&aacute;gina de cabe&ccedil;alho gerada pelo LPD e produzir uma
		vers&atilde;o em &postscript;.  Se o usu&aacute;rio enviar o trabalho
		de impress&atilde;o com o comando <command>lpr -h</command>, ent&atilde;o
		o  <application>LPD</application> n&atilde;o ir&aacute; gerar a 
		p&aacute;gina de cabe&ccedil;alho, e nada ira para o seu filtro de 
		sa&iacute;da.  Caso contrario, seu filtro de sa&iacute;da ira ler o 
		texto que o <application>LPD</application> gerou e ir&aacute; enviar
		a p&aacute;gina de cabe&ccedil;alho apropriada em c&oacute;digo
		&postscript;.
		</para>
            
		<para>
			Se voce tiver uma impressora &postscript; na porta serial, voc&ecirc;
		pode utilizar o comando <command>lprps</command>, o qual vem com um
		filtro da sa&iacute;da, <command>psof</command>,  Note que o
		<command>psof</command> n&atilde;o contabiliza as p&aacute;ginas de
		cabe&ccedil;alho
		</para>
      </sect3>
    </sect2>
    
    <sect2 id="printing-advanced-network-printers">
			<title>
				Impress&atilde;o em Rede
			</title>
      
      <indexterm>
        <primary>printers</primary>
        <secondary>network</secondary>
      </indexterm>
      <indexterm><primary>network printing</primary></indexterm>
      <para>
			O FreeBSD suporta impress&atilde;o via rede; enviando trabalhos
		de impress&atilde;o para impressoras remotas.  Impress&atilde;o em rede 
		geralmente nos conduz a duas coisas diferentes:
		</para>
      
      <itemizedlist>
        <listitem>
			<para>
				Acessando a impressora conectada a uma m&aacute;quina remota.  
		Voc&ecirc; instala a impressora normalmente como se fosse uma 
		impressora serial ou paralela na m&aacute;quina.  Ent&atilde;o, 
		voc&ecirc; configura o <application>LPD</application> para habilitar
		o acesso a impressora de outras m&aacute;quinas na rede.  Veja a 
		se&ccedil;&atilde;o <link
		linkend="printing-advanced-network-rm">Impressoras Instaladas
		em M&aacute;quinas Remotas
              </link> mostra como faze-lo.
			</para>
        </listitem>

        <listitem>
			<para>
				Acessando a impressora conectada diretamente a rede.  A impressora
		possui uma interface de rede, al&eacute;m da porta paralela ou serial.
				Como a impressora que iremos utilizar a seguir:
			</para>
          
          <itemizedlist>
            <listitem>
              <para>
						Ela deve entender o protocolo <application>LPD</application>
		e possa manipular filas de trabalhos de impress&atilde;o de uma 
		m&aacute;quina remota.  Nesse caso, Ela age como uma m&aacute;quina
		remota comum rodando <application>LPD</application>.  Seguindo os 
		mesmos passos na se&ccedil;&atilde;o <link 
		linkend="printing-advanced-network-rm">
			Instalando Impressoras em M&aacute;quinas Remotas
      </link> para configurar a impressora.
					</para>
            </listitem>
            
            <listitem>
              <para>
						Ela deve suportar conex&atilde;o de rede do tipo 
		<foreignphrase>stream</foreignphrase>.  Nesse caso, voc&ecirc; 
		conecta a impressora em uma m&aacute;quina na rede que ficar&aacute;
		respons&aacute;vel pelo <foreignphrase>spooling</foreignphrase>
		dos trabalhos de impress&atilde;o e envia-los para a impressora.  Na
		se&ccedil;&atilde;o <link
		linkend="printing-advanced-network-net-if">
			Impressoras com Interfaces de Rede do Tipo Data Stream
		</link> D&aacute; suges&otilde;es de como instalar essas 
		impressoras.
				</para>
            </listitem>
          </itemizedlist>
        </listitem>
      </itemizedlist>
          
      <sect3 id="printing-advanced-network-rm">
			<title>
				Impressoras Intaladas em um Computador Remoto
			</title>

			<para>
				O sistema <application>LPD</application> foi construido com
		suporte para enviar trabalhos de impress&atilde;o para outras 
		m&aacute;quinas na rede, rodando <application>LPD</application> ( ou
		um algo compat&iacute;vel com ele ).  Essa caracteistica possibilita
		a instala&ccedil;&atilde;o de impressoraqs em uma m&aacute;quina que
		possa ser acessada por outras.  Isso tamb&eacute;m funciona para
		impressora que possuem intefaces de rede capaz de compreender o 
		protocolo <application>LPD</application>.
			</para>

			<para>
				Para habilitar essa impressora remota, primeiro devemos instalar
		a impressora em uma m&aacute;quina, que ser&aacute; o
      <emphasis>servidor de Impress&atilde;o</emphasis>, usando os passos
		descritos na se&ccedil;&atilde;o
		<link linkend="printing-simple">
		Simples Configura&ccedil;&atilde;o de Impressora
		</link>.  Para configura&ccedil;&atilde;o avan&ccedil;ada veja a 
		se&ccedil;&atilde;o
		<link linkend="printing-advanced">
			Configura&ccedil;&atilde;o Avan&ccedil;ada de Impressora
		</link>.  Tenha certeza que o teste de imoress&atilde;o funcionou 
		corretamente para esta impressora.  Tenha certeza que o 
		<emphasis>computador local</emphasis> tenha autoriza&ccedil;&atilde;o
		para acessar a <emphasis>m&aacute;quina remota</emphasis> e o 
		servi&ccedil;o do <application>LPD</application>, veja a 
		se&ccedil;&atilde;o <link
            linkend="printing-advanced-restricting-remote">
			Restringindo os Trabalhos de Impress&atilde;o para
			M&aacute;quinas Remotas
            </link>).
		</para>
            
        <indexterm>
          <primary>printers</primary>
          <secondary>network</secondary>
        </indexterm>
        <indexterm><primary>network printing</primary></indexterm>
			<para>
				Se estiver utilizando uma impressora com interface de rede
		compat&iacute;vel com <application>LPD</application>, ent&atilde;o
	   <emphasis>servidor de imporess&atilde;o</emphasis> ser&aacute; a 
		propria impressora, e o <emphasis>nome da impressora</emphasis> 
		ser&aacute; o nome que voc&ecirc; configurou para a impressora.
		Veja a documenta&ccedil;&atilde;o que acompanha a sua impressora e/ou
		a interface de rede dela.
			</para>

			<tip>
				<para>
					Se voc&ecirc; esta utulizando uma Hewlett Packard Laserjet 
		ent&atilde;o o nome da impressora far&aacute; automaticamente a 
		convers&atilde;o do LF para o CRLF para voc&ecirc;, e ent&atilde;o 
		voc&ecirc; n&atilde;o necessitar&aacute; do filtro de texto
		<filename>hpif</filename> para isso.
				</para>
			</tip>
            
			<para>
				Ent&atilde;o, em outros servidores que voc&ecirc; quizer 
		ter acesso, dever&aacute; adicionar uma entrada no arquivo
		<filename>/etc/printcap</filename> como segue:
			</para>

        <orderedlist>
          <listitem>
            <para>
					Nomeia a entrada como quiser.  Por simplicidade, voc&ecirc;
			usar&aacute; o mesmo nome/apelido que estiver no servidor da 
			impressra.
				</para>
          </listitem>
          
          <listitem>
            <para>Deixe a op&ccedil;&atilde;o <literal>lp</literal>
			em branco, fa&ccedil;a isso explicitamente 
			(<literal>:lp=:</literal>).
				</para>
          </listitem>
          
          <listitem>
            <para>
					Crie um diret&oacute;rio de spool e especifique a sua
			localiza&ccedil;&atilde;o com a op&ccedil;&atilde;o 
         <literal>sd</literal>.  O <application>LPD</application>
	      ir&aacute; armazenar os trabalhos de impress&atilde;o l&aacute;
         antes de entregar ao servidor de impress&atilde;o
				</para>
          </listitem>
          
          <listitem>
            <para>
					Coloque o nome do servidor da impressora na op&ccedil;&atilde;o
			<literal>rm</literal>.
				</para>
          </listitem>
          
          <listitem>
            <para>
					Coloque o nome a impressora que est&aacute; no servidor
			de impress&atilde;o n&atilde;o op&ccedil;&atilde;o
			<literal>rp</literal>
        		</para>
          </listitem>
        </orderedlist>

        <para>
				Feito isso, voc&ecirc; n&atilde;o precisar&aacute; de filtros
		de entrada, dimesionamento de p&aacute;ginas, ou outra coisa qualquer
		no arquivo <filename>/etc/printcap</filename>.
			</para>

		<para>
			Aqui est&aacute; um exemplo.  O servidor <hostid>rose</hostid> 
		possui duas imopressoras,  <literal>bamboo</literal> e 
		<literal>rattan</literal>.  Nos iremos permitir que os usu&aacute;rios
		da m&aacute;quina <hostid>orchid</hostid> possa imprimir nessas
		impressoras.
          Aqui est&aacute; o arquivo <filename>/etc/printcap</filename> 
		para a m&aacute;quina <hostid>orchid</hostid> (veja a 
		se&ccedil;&atilde;o anteriro
			<link linkend="printing-advanced-header-pages-enabling">
				Habilitando P&aacute;ginas de Cabe&ccedil;alho
         </link>).  Ele j&aacute; possui a entrada para a impressora
		<literal>teak</literal>; nos iremos adicionar a entrada para as 
		duas impressoras no servidor <hostid>rose</hostid>:
		</para>

        <programlisting>#
#  /etc/printcap for host orchid - added (remote) printers on rose
#

#
#  teak is local; it is connected directly to orchid:
#
teak|hp|laserjet|Hewlett Packard LaserJet 3Si:\
        :lp=/dev/lpt0:sd=/var/spool/lpd/teak:mx#0:\
        :if=/usr/local/libexec/ifhp:\
        :vf=/usr/local/libexec/vfhp:\
        :of=/usr/local/libexec/ofhp:

#
#  rattan is connected to rose; send <foreignphrase>jobs</foreignphrase> for rattan to rose:
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :lp=:rm=rose:rp=rattan:sd=/var/spool/lpd/rattan:

#
#  bamboo is connected to rose as well:
#
bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :lp=:rm=rose:rp=bamboo:sd=/var/spool/lpd/bamboo:</programlisting>

        <para>
				Ent&atilde;o, nos apenas criamos o diret&oacute;rio de
		<foreignphrase>spool</foreignphrase> na m&aacute;quina 
		<hostid>orchid</hostid>:
			</para>
              
        <screen>&prompt.root; <userinput>mkdir -p /var/spool/lpd/rattan /var/spool/lpd/bamboo</userinput>
&prompt.root; <userinput>chmod 770 /var/spool/lpd/rattan /var/spool/lpd/bamboo</userinput>
&prompt.root; <userinput>chown daemon:daemon /var/spool/lpd/rattan /var/spool/lpd/bamboo</userinput></screen>
              
			<para>
				Agora, os usu&aacute;rios na m&aacute;quina <hostid>orchid</hostid>
		podem imprimir para as impressoras <literal>rattan</literal> e
		<literal>bamboo</literal>.  Se, por exemplo, o usu&aacute;rio na 
		m&aacute;quina <hostid>orchid</hostid> digitar:
              
          <screen>&prompt.user; <userinput>lpr -P bamboo -d sushi-review.dvi</userinput></screen>

          O siatema <application>LPD</application> na m&aacute;quina
		<hostid>orchid</hostid> ir&aacute; copiar o trabalho de impress&atilde;o
		do diret&oacute;rio de <foreignphrase>spool</foreignphrase>
		<filename>/var/spool/lpd/bamboo</filename> e ir&aacute; notar que 
		&eacute; uma impress&atilde;o em DVI.  T&atilde;o logo o 
		servidor <hostid>rose</hostid> tiver espa&ccedil;o no 
		diret&oacute;rio de <foreignphrase>spool</foreignphrase> da
		impressora <literal>bamboo</literal> os dois sistemas 
	  	<application>LPDs</application> ir&atilde;o transferir o arquivo
		para o servidor <hostid>rose</hostid>.  O arquivo ficar&aacute;
		aguardando na fila do servidor <hostid>rose</hostid> at&eacute;
		ser finalmente impresso.  Ele ent&atilde;o ir&aacute; converter
		do formato DVI para &postscript; deste que a impressora
		<literal>bamboo</literal> consiga interpretar &postscript;
			</para>
      </sect3>
      
      <sect3 id="printing-advanced-network-net-if">
			<title>
				Impressoras com Interfaces de Rede 
				<foreignphrase>Data Stream</foreignphrase>
			</title>

			<para>
				Geralmente, quando voc&ecirc; compra uma interface de rede para
		a sua impressora, voc&ecirc; pode ter duas vers&otilde;es: uma que 
		emula um <foreignphrase>spooler</foreignphrase> ( a vers&atilde;o
		mais cara), ou uma que permita que voc&ecirc; envie dados para
		ela como se voc&ecirc; estivesse utilizando uma porta paralela ou
		serial ( a vers&atilde;o mais barata).  Essa se&ccedil;&atilde;o mostra 
		como voc&ecirc; ir&aacute; utilizar essa vers&atilde;o mais
		barata.  Para a vers&atilde;o mais cara, veja a se&ccedil;&atilde;o 
		anterior <link
            linkend="printing-advanced-network-rm">
				Impressoras Instaladas em uma M&aacute;quina Remota
            </link>.
			</para>
            
			<para>
				O formato do arquivo <filename>/etc/printcap</filename> 
		permite que voc&ecirc; especifique qual a interface, seria ou
		paralela, a ser usada e ( se voc&ecirc; estiver usando uma 
		interface serial), qual a taxa de transferencia (
		<foreignphrase>baud rate</foreignphrase>), Se est&aacute; usando
		controle de fluxo, expans&atilde;o de tabula&ccedil;&atilde;o,
		convers&atilde;o de novas linhas, e mais.  Mas existe um meio de 
		especificar a conex&atilde;o com a impressora que e ouvir sobre
		TCP/IP ou outra porta da rede.
			</para>
            
			<para>
				Para enviar dados para uma impressora na rede, voc&ecirc; 
		dever&aacute; desenvolver um programa de comunica&ccedil;&atilde;o
		que possa ser chamado pelo filtro de texto e/ou de convers&atilde;o.
		  Aqui est&aacute; um exemplo: O script <command>netprint</command> 
		pega todos os dados da entrada padr&atilde;o e envia para a
		impressora de rede.  Nos especificamos o nome da m&aacute;quina 
		onde a impressora est&aacute; conectada como o primeiro argumento
		e o n&uacute;mero da porta para a conex&atilde;o como o segundo
		argumento para o <command>netprint</command>.  Note que esse suporte
		&eacute; de uma &uacute;nica dire&ccedil;&atilde;o ( Impressoras para
		o FreeBSD ); muitas impressoras de rede suportam 
		comunica&ccedil;&atilde;o bidirecional, voc&ecirc; pode ter vantagem
		em utilizar essa comunica&ccedil;&atilde;o para obter status da
		impressora, fazer contabilidade, etc.
			</para>

        <programlisting>#!/usr/bin/perl
#
#  netprint - Text filter for printer attached to network
#  Installed in /usr/local/libexec/netprint
#
$#ARGV eq 1 || die "Usage: $0 &lt;printer-hostname&gt; &lt;port-number&gt;";

$printer_host = $ARGV[0];
$printer_port = $ARGV[1];

require 'sys/socket.ph';

($ignore, $ignore, $protocol) = getprotobyname('tcp');
($ignore, $ignore, $ignore, $ignore, $address)
    = gethostbyname($printer_host);

$sockaddr = pack('S n a4 x8', &amp;AF_INET, $printer_port, $address);

socket(PRINTER, &amp;PF_INET, &amp;SOCK_STREAM, $protocol)
    || die "Can't create TCP/IP stream socket: $!";
connect(PRINTER, $sockaddr) || die "Can't contact $printer_host: $!";
while (&lt;STDIN&gt;) { print PRINTER; }
exit 0;</programlisting>
            
			<para>
				Nos podemos utilizar este script em v&aacute;rios filtros. 
		Supondo que temos uma impressora Diablo 750-N conectada &agrave; rede.
		A impressora aceita dados para impress&atilde;o na porta de 
		n&uacute;mero 5100.  O nome da m&aacute;quina &eacute; scrivener.
		Aqui est&aacute; um filtro de texto para a impressora.
			</para>

        <programlisting>#!/bin/sh
#
#  diablo-if-net - Text filter for Diablo printer `scrivener' listening
#  on port 5100.   Installed in /usr/local/libexec/diablo-if-net
#
exec /usr/libexec/lpr/lpf "$@" | /usr/local/libexec/netprint scrivener 5100</programlisting>
      </sect3>
    </sect2>
    
    <sect2 id="printing-advanced-restricting">
			<title>
				Restingindo o Uso da Impressora
			</title>
      
      <indexterm>
        <primary>printers</primary>
        <secondary>restricting acces to</secondary>
      </indexterm>

		<para>
			Essa se&ccedil;&atilde;o d&aacute; informa&ccedil;&otilde;es de 
		como restringir o uso da impressora.  O sistema 
		<application>LPD</application> permite que voc&ecirc; controle quem
		pode acessar a impressor localmente ( direto na m&aacute;quina) ou 
		remotamente, eles podem imprimir multiplas c&oacute;pias, 
		t&atilde;o grandes quando se queira os trabalhos de impress&atilde;o,
		t&atilde;o grandes que podem ser as filas de impress&atilde;o.
		</para>
      
      <sect3 id="printing-advanced-restricting-copies">
			<title>
				Restringindo Multiplas C&oacute;pias
			</title>

			<para>
				O sistema <application>LPD</application> faz isso com facilidade
		para os usu&aacute;rios poderem imprimir multiplas c&oacute;pias de
		um arquivo.  Os usu&aacute;rios podem imprimir trabalhos de 
		impress&atilde;o com o comando <command>lpr -#5</command>, por 
		exemplo e ter cinco c&oacute;pias de um mesmo arquivo em um 
		trabalho de impres&atilde;o.  Isso ser&aacute; um boa ideia
		se estiver habilidado.
			</para>
            
			<para>
				Se voc&ecirc; perceber que isso pode causar um desgaste 
		desnecess&aacute;rio da impressora, voc&ecirc; poder&aacute; 
		desabilitar a op&ccedil;&atilde;o <option>-#</option> para 
		&man.lpr.1;  apenas adicionando a op&ccedil;&atilde;o 
		<literal>sc</literal> no arquivo <filename>/etc/printcap</filename>.
		Quando os usu&aacute;rios utilizarem o comando com a op&ccedil;&atilde;o
      <option>-#</option> para imprimir seus trabalhos de imopress&atilde;o,
		ele ver&aacute;:
			</para>
              
        <screen>lpr: multiple copies are not allowed</screen>


			<para>
				Note que se voc&egrave; tem configurado o acesso a 
		impressora remota ( veja a se&ccedil;&atilde;o <link 
		linkend="printing-advanced-network-rm">
				Impressora Instaladas em M&aacute;quinas Remotas
      </link>), voc&ecirc; necessitar&aacute; da op&ccedil;&atilde;o 
		<literal>sc</literal> no arquivo <filename>/etc/printcap</filename> 
		da m&aacute;quina remota, caso contr&aacute;rio, os usu&aacute;rios
		poderiam enviar trabalhos de impress&atilde;o com multiplas
		c&oacute;pias, usando uma outra m&aacute;quina na rede.
			</para>

			<para>
				Aqui tem um exemplo.  Esse &eacute; um arquivo 
		<filename>/etc/printcap</filename> para a m&aacute;quina
		<hostid>rose</hostid>.  A impressora <literal>rattan</literal> 
		parruda, que aguenta multiplas c&oacute;pias, mas a impressora &agrave; 
		laser <literal>bamboo</literal> &eacute; um pouco mais delicada
		,que n&atilde;o, ent&atilde;o ser&aacute; desabilidada a multiplas
		c&oacute;pias, adicionando a op&ccedil;&atilde;o <literal>sc</literal> :
			</para>

        <programlisting>#
#  /etc/printcap for host rose - restrict multiple copies on bamboo
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:\
        :lp=/dev/lpt0:\
        :if=/usr/local/libexec/if-simple:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:sc:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:rw:\
        :if=/usr/local/libexec/psif:\
        :df=/usr/local/libexec/psdf:</programlisting>
            
			<para>
				Agora, n&oacute;s necessitaremos de adicionar a 
		op&ccedil;&atilde;o <literal>sc</literal> no 
		arquivo <filename>/etc/printcap</filename> na m&aacute;quina
		<hostid>orchid</hostid> para dessabilitar as c&oacute;pias
		multiplas para a impressora <literal>teak</literal>):
			</para>

        <programlisting>#
#  /etc/printcap for host orchid - no multiple copies for local
#  printer teak or remote printer bamboo
teak|hp|laserjet|Hewlett Packard LaserJet 3Si:\
        :lp=/dev/lpt0:sd=/var/spool/lpd/teak:mx#0:sc:\
        :if=/usr/local/libexec/ifhp:\
        :vf=/usr/local/libexec/vfhp:\
        :of=/usr/local/libexec/ofhp:

rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :lp=:rm=rose:rp=rattan:sd=/var/spool/lpd/rattan:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :lp=:rm=rose:rp=bamboo:sd=/var/spool/lpd/bamboo:sc:</programlisting>
            

			<para>
				Usando a op&ccedil;&atilde;o <literal>sc</literal>, nos 
		podemos prever o uso do comando <command>lpr -#</command>, mas isso
		n&atilde;o prev&ecirc; usu&aacute;rios utilizando &man.lpr.1; 
		v&aacute;rias vezes, ou de enviar o mesmo arquivo v&aacute;rias vezes
		em um &uacute;nico trabalho de impress&atilde;o, como segue:
			</para>
              
        <screen>&prompt.user; <userinput>lpr forsale.sign forsale.sign forsale.sign forsale.sign forsale.sign</userinput></screen>
              
			<para>
				Existem v&aacute;rias maneiras de se prever esse abuso ( 
		incluisive ignorando ele) que voc&ecirc; pode explorar livremente.
			</para>
      </sect3>
      
      <sect3 id="printing-advanced-restricting-access">
			<title>
				Restringindo o Acesso as Impressoras
			</title>

        <para>
				Voc&ecirc; pode controlar quem pode imprimir em qual impressora
		utilizando o mecanismo de grupos do &unix; e a op&ccedil;&atilde;o
		<literal>rg</literal> no <filename>/etc/printcap</filename>.  Apenas
		colocando os usu&aacute;rios que voc&ecirc; quer que tenham acesso
		a impressora diferentes grupos, e ent&atilde;o definindo na 
		op&ccedil;&atilde;o <literal>rg</literal> o grupo desejado.
			</para>
            
			<para>
				Os usu&aacute;rios fora do grupo ( inmcluindo o 
		<username>root</username>) ir&atilde;o receber a seguinte mensagem:
          
          <errorname>lpr: Not a member of the restricted group</errorname>
          
          Se eles tentarem imprimir em uma impressora controlada.
			</para>

			<para>
				Como a op&ccedil;&atilde;o <literal>sc</literal> ( suprime
			multiplas c&oacute;pias), voc&ecirc; precisasr&aacute; de 
			especificar a op&ccedil;&atilde;o <literal>rg</literal> na 
			m&aacute;quina remota (servidor) para ter tamb&eacute;m o acesso 
			&agrave; impressora, veja a se&ccedil;&atilde;o
          <link linkend="printing-advanced-network-rm">
					Impressoras Instaladas em Servidores Remotos
            </link>).
			</para>
            
			<para>
				Por exemplo, n&oacute;s iremos permitir o acesso de todos a
			impressora <literal>rattan</literal>, mas somente os 
			usu&aacute;rios do grupo <literal>artists</literal> poder&atilde;o
			utilizar a impressora <literal>bamboo</literal>.  Novamente
			o arquivo <filename>/etc/printcap</filename> &eacute; semelhante
			ao da m&aacute;quina <hostid>rose</hostid>:
			</para>

        <programlisting>#
#  /etc/printcap for host rose - restricted group for bamboo
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:\
        :lp=/dev/lpt0:\
        :if=/usr/local/libexec/if-simple:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:sc:rg=artists:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:rw:\
        :if=/usr/local/libexec/psif:\
        :df=/usr/local/libexec/psdf:</programlisting>

			<para>
				Permita-nos mostrar um outro exemplo do arquivo
		<filename>/etc/printcap</filename> (para a m&aacute;quina
      <hostid>orchid</hostid>) sozinha.  Claro, qualquer um na m&aacute;quina
		<hostid>orchid</hostid> pode imprimir para a impressora 
		<literal>bamboo</literal>.  Neste caso, nos deveremos permitir acesso
		&agrave; apenas de alguns usu&aacute;rios na m&aacute;quina
		<hostid>orchid</hostid>, de qualquer maneira, nos estamos controlondo
		o acesso a impressora.
			<para>

        <note>
				<para>
				S&oacute; podemos restringir apenas um grupo por impressora
				</para>
        </note>
      </sect3>
      
      <sect3 id="printing-advanced-restricting-sizes">
			<title>
				Controlando o Tamanho do Arquivos Enviados
			</title>

        <indexterm><primary>print jobs</primary></indexterm>

			<para>
				Se voc&ecirc; possui muitos usu&aacute;rios acessando a sua
		impressora, voc&ecirc; provavelmente necessitar&aacute; de limitar
		o tamanho m&aacute;ximo dos arquivos enviados para a impressora.
				Al&eacute;m de que, o espa&ccedil;o livre em disco &eacute;
		limitado, voc&ecirc; dever&aacute; prever o envio de v&aacute;rios
		trabalhos de impress&atilde;o simultaneos, que poder&atilde;o 
		consumir uma grande quantidade de espa&ccedil;o em disco.
			</para>
            
        <indexterm>
          <primary>print jobs</primary>
          <secondary>controlling</secondary>
        </indexterm>

			<para>
				O sistema <application>LPD</application> permite que voc&ecirc;
		limite o tamanho m&aacute;ximo de um trabalho de impress&atilde;o
		atrav&eacute;s da op&ccedil;&atilde;o <literal>mx</literal>.  A 
		unidade padr&atilde;o &eacute; em blocos de  <literal>BUFSIZ</literal>,
		que s&atilde;o 1024 bytes.  Se voc&ecirc; colocar o valor como zero
		para esta op&ccedil;&atilde;o, voc&ecirc; n&atilde;o estar&aacute; 
		limitando o tamanho do arquivo, entretanto se voc&ecirc; 
		n&atilde;o especificar valor, o padr&atilde;o ser&aacute; utilizado, 
		que &eacute; de : 1000 blocos.
			</para>


        <note>
			<para>
				O limite &eacute; aplicado para os <emphasis>arquivos</emphasis> 
		dentro de um trabalho de impress&atilde;o, e 
		<emphasis>n&atilde;o</emphasis> ao tamanho total do trabalho de 
		impress&atilde;o
			</para>
        </note>

			<para>
				O sistema <application>LPD</application> n&atilde;o ir&aacute;
		recusar o arquivo que estiver acima do limite imposto por voc&ecirc;.
		  Ele colocara na fila de impress&atilde;o apenas a quantidade de bytes
		at&eacute; o limite.  O resto ser&aacute; descartado.  Ser&aacute;
		esse o comportamento correto.
			</para>
            
			<para>
				Iremos utilizar outro exemplo de limites para as 
			impressoras <literal>rattan</literal> e <literal>bamboo</literal>.  
			Uma vez que arquivos art&iacute;sticos em &postscript; tentem a
			ser muito grande, n&oacute;s iremos limitar-los a 5 megabytes.
			  N&oacute;s iremos deixar sem limite a impressora de texto
			puro (matricial):
			</para>

        <programlisting>#
#  /etc/printcap for host rose
#

#
#  No limit on job size:
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:mx#0:sd=/var/spool/lpd/rattan:\
        :lp=/dev/lpt0:\
        :if=/usr/local/libexec/if-simple:

#
#  Limit of five megabytes:
#
bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:sc:rg=artists:mx#5000:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:rw:\
        :if=/usr/local/libexec/psif:\
        :df=/usr/local/libexec/psdf:</programlisting>

			<para>
				Relembrando, os limites s&atilde;o aplicados somente aos
		usu&aacute;rios locais.  Se voc&ecirc; permite acesso remoto, 
		usu&aacute;rios remotos n&atilde;o ter&atilde;o este limite.  
		Voc&ecirc; dever&aacute; especificar na op&ccedil;&atilde;o
		<literal>mx</literal> no arquivo remoto 
		<filename>/etc/printcap</filename>.  Veja a se&ccedil;&atilde;o
		<link linkend="printing-advanced-network-rm">
			Impressoras Instaladas em Servidores Remotas
		</link> para mais detalhes.
			</para>
            

			<para>
				Existem outros meios especializados para limitar o tamanho dos 
	trabalhos de impress&atilde;o de impress&atilde;o remota; veja a 
	se&ccedil;&atilde;o <link linkend="printing-advanced-restricting-remote">
		Restrigindo Impress&atilde;o Remota 
	</link>.
			</para>
      </sect3>
      
      <sect3 id="printing-advanced-restricting-remote">
			<title>
				Restringindo a Impress&atilde;o Remota
			</title>

			<para>
				O sistema de spooling <application>LPD</application> possui 
	v&aacute;rios meios de restringir o acesso dos trabalhos de 
	impress&atilde;o enviados de uma m&aacute;quina remota:
			</para>
            
        <variablelist>
          <varlistentry>
            <term>Restri&ccedil;&atilde;o &agrave; M&aacute;quina</term>

            <listitem>
					<para>
						Voc&ecirc; pode controlar de qual m&aacute;quina remota
	o servidor local <application>LPD</application> aceitar&aacute; pedidos
	de impress&atilde;o com a ajuda dos arquivos 
                <filename>/etc/hosts.equiv</filename> e
                <filename>/etc/hosts.lpd</filename>. O
		<application>LPD</application> verifica esses arquivos 
	para saber se o pedido foi feito por uma das m&aacute;quinas listada
	em um dos arquivos.  Se n&atilde;o estiver em nenhum deles o 
	<application>LPD</application> recusar&aacute; o pedido
					</para>
                    
					<para>
						O formato desses arquivos e muito simples: o nome 
	da m&aacute;quina remota, um por linha.  Note que o arquivo 
	<filename>/etc/hosts.equiv</filename> &eacute; tamb&eacute;m utilizado
	pelo protocolo &man.ruserok.3;, e afeta programas como
	&man.rsh.1; e &man.rcp.1;, ent&atilde;o, seja cuidadoso.
					</para>
              
					<para>
						Por exemplo, aqui est&aacute; um arquivo 
	<filename>/etc/hosts.lpd</filename> para a m&aacute;quina
                <hostid>rose</hostid>:
					</para>

              <programlisting>orchid
violet
madrigal.fishbaum.de</programlisting>

					<para>
						Isso significa que a m&aacute;quina <hostid>rose</hostid> 
	ir&aacute; aceitar pedidos das m&aacute;quinas
	<hostid>orchid</hostid>, <hostid>violet</hostid>, e
	<hostid role="fqdn">madrigal.fishbaum.de</hostid>.  Se qualquer outra
	m&aacute;quina tentar acessar o <application>LPD</application> na 
	m&aacute;quina <hostid>rose</hostid>, esse trabalho de impress&atilde;o
	ser&aacute; rejeitado.
					</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term>Restri&ccedil;&atilde;o de Tamanho</term>
            
            <listitem>
					<para>
						Voc&ecirc; pode controlar o quanto de espaco livre &eacute;
	necess&aacute;rio n sistema de arquivo aonde o diret&oacute;rio de 
	spooling est&aacute;.  Crie um arquivo chamado de 
	<filename>minfree</filename> dentro do diret&oacute;rio do spooling para
	a impressora local. Insira no arquivo o n&uacute;mero representando
	quantos blocos ( 512 bytes ) de espa&ccedil;o livre deve ter o disco
	para que o trabalho de impress&atilde;o remoto seja aceito.
					</para>
                    
					<para>
						Isso permite que vov&ecirc; garanta que o seu sistema
	de arquivos n&atilde;o fique lotado pelos seus usu&aacute;rios remotos.  
	Voc&ecirc; tamb&eacute;m pode usar isso para dar uma certa prioridade
	aos usu&aacute;rios locais: Eles est&atilde;o aptos a enviar grandes 
	trabalhos de impress&atilde;o mesmo que o limite fique abaixo do 
	especificado no arquivo  <filename>minfree</filename>.
					</para>
                    
					<para>
						Por exemplo, vamos adicionar um arquivo 
	<filename>minfree</filename> para a impressora <literal>bamboo</literal>.  
	N&oacute;s examinaremos o arquivo <filename>/etc/printcap</filename> para
	encontrar o diret&oacute;rio de spooling para essa impressora; 
	aqui est&aacute; a entrada:
					</para>
<programlisting>bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:sc:rg=artists:mx#5000:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:rw:mx#5000:\
        :if=/usr/local/libexec/psif:\
        :df=/usr/local/libexec/psdf:</programlisting>

					<para>
						O diret&oacute;rio de spooling &eacute; dado na 
	op&ccedil;&atilde;o <literal>sd</literal>.  N&oacute;s iremos criar uma
	reserva de 3 megabytes ( que s&atilde;o 6144 blocos do disco ) para 
	o <application>LPD</application> poder aceitar pedidos de trabalhos
	de impress&atilde;o remotos:
					</para>
                  
              <screen>&prompt.root; <userinput>echo 6144 &gt; /var/spool/lpd/bamboo/minfree
              </userinput></screen>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term>Restri&ccedil;&otilde;ess de Usu&aacute;rios</term>
            
            <listitem>
					<para>
						Para que voc&ecirc; possa controlar qual o usu&aacute;rio
	remoto pode acesar a impressora local, voce deve utilizar a 
	op&ccedil;&atilde;o <literal>rs</literal> do arquivo 
	<filename>/etc/printcap</filename>.  Quando a opa&ccedil;&atilde;o 
	<literal>rs</literal> &eacute; utilizada localmente, o 
	<application>LPD</application> ir&aacute; somente aceitar os trabalhos 
	de impress&atilde;o das m&aacute;quinas remotas <emphasis>se</emphasis> 
	o usu&aacute;roi que o tiver enviando, tamb&eacute;m tiver conta com o
	mesmo <foreignphrase>login</foreignphrase> na m&aacute;quina local.  Caso
	contr&aacute;rio, o <application>LPD</application> ir&aacute; recusar
	o trabalho de impress&atilde;o.
					</para>
                    
					<para>
						Esssa op&ccedil;&atilde;o &eacute; particularmente poderosa
	para o ambiente onde existam, por exemplo, diferentes departamendos 
	compartilhando a rede, e alguns usu&aacute;rios trascendem os 
	limites departamentais.  Dando a eles contas em seus sistemas, eles 
	tamb&eacute;m poderam imprimir nas impressoras desses departamentos.  Se
	voc&ecirc; quizer que apenas a utiliza&ccedil;&atilde;o desses 
	usu&aacute;rios sejam restritas a utiliza&ccedil;&atilde;o das impressoras,
	voc&ecirc; deve utilizar contas do tipo <quote>token</quote>, sem 
	diret&oacute;rio de usu&aacute;rio e com um shell sem 
	utiliza&ccedil;&atilde;o como <filename>/usr/bin/false</filename>.
					</para>
            </listitem>
          </varlistentry>
        </variablelist>
      </sect3>
    </sect2>
    
    <sect2 id="printing-advanced-acct">
			<title>
				Contabilizando o Uso da Impressora
			</title>
          
      <indexterm>
        <primary>accounting</primary>
        <secondary>printer</secondary>
      </indexterm>
		<para>
			Ent&atilde;o, voc&ecirc; precisa contabilizar as impress&otilde;es.
		  Por que n&atilde;o?  Afinal papel e tinta custam dinheiro.  E 
		tamb&eacute;m o custo de manuten&ccedil;&atilde;o da impressora com as
		partes m&oacute;veis que podem quebrar.  Voc&ecirc; deve examinar suas
		impressoras, use um padr&atilde;o e uma taxa de manuten&ccedil;&atilde;o
		que deve conter o custo de uma p&aacute;gina ( ou por metro, por 
		p&eacute;s, ou qualquer outra coisa ).  Agora como voc&ecirc; ir&aacute;
		inicializar a contabilidade para as impress&otilde;es?
		</para>
          
      <para>
			Bem, a m&aacute; not&iacute;cia &eacute; que o sistema de spooling
		<application>LPD</application> n&atilde;o prov&ecirc; muita ajuda
		nesse departamento.  A contabilidade &eacute; altamente dependente
		da maneira de como a impressora &eacute; utilizadda, o formato que 
		&eacute; impresso, como <emphasis>voc&ecirc;</emphasis> necessita
		que a impressora seja contabilizada.
		</para>
      
      <para>
			Para implantar a contabilidade, voc&ecirc; deve modificar o filtro 
	para texto puro ( para contabilizar trabalhos de impress&atilde;o em 
	texto puro) e os filtros de convers&atilde;o ( para contabilizar outros
	formatos de impress&atilde;o), para contar as p&aacute;ginas ou as 
	requisi&ccedil;&otilde;es para a impressora das p&aacute;ginas impressas.
	  Voc&ecirc; n&atilde;o deve utilizar filtros simples, pos eles n&atilde;o
	fornecem dados para a contabilidade.  Veja a se&ccedil;&atilde;o
   <link linkend="printing-advanced-filter-intro">Filtros</link>.
		</para>
          
      <para>
			Geralmente, existe duas maneiras para realizar a contabilidade:
		</para>
      
      <itemizedlist>
        <listitem>
			<para>
				<emphasis>Contabilidade Peri&oacute;dica</emphasis> &eacute;
	feita pela maneira mais simples.  A toda hora &eacute; impresso algo, e
	o filtro armazena o usu&aacute;rio, a m&aacute;quina, e o n&uacute;mero de
	p&aacute;gians impressas no arquivo de contabilidade.  A cada mes,
	semestre, ano ou a qualquer per&oacute;do que voc&ecirc; preferir,
	voc&ecirc; pode coletar a contagem de p&aacute;ginas, atrav&eacute;s
	do arquivo de contabilidade para v&aacute;rias impressoras.  Ent&atilde;o
	voc&ecirc; poder&aacute; zerar o arquivo de contabilidade para que se
	fa&ccedil;a novo per&iacute;odo de  contabilidade.
			</para>
        </listitem>
              
        <listitem>
          <para>
				<emphasis>Contabilidade temporizada</emphasis> &eacute; menos
	comum, provavelmente porque &eacute; mais dif&iacute;cil.  Esse 
	m&eacute;todo tem filtros que contabilizam as impress&otilde;es
	t&atilde;o logo que se use as impressoras.  Como a limita&ccedil;&atilde;o
	de disco, a contabilidade &eacute; imetiada.  Voc&ecirc; pode
	impedir que os usu&aacute;rios imprimam quando suas cotas cheguem ao
	vermelho, e devam providenciar outro meio para os usu&aacute;rios 
	verificarem e ajustar suas <quote>cotas de impress&atilde;o</quote>.  
	Mas esse m&eacute;todo requer algum c&oacute;digo de banco de 
	dados para rastrear os usu&aacute;rios e suas cotas.
			</para>
        </listitem>
      </itemizedlist>
      
      <para>
			O sistema de spool <application>LPD</application> suporta ambos os
	m&eacute;todos facilmente: deste que voc&ecirc; providencie os filtros (
	na maioria das vezes ), voc&ecirc; tamb&eacute;m deve providenciar o
	c&oacute;digo para a contabilidade.  Mas existe o lado bom: voc&ecirc;
	ter&aacute; uma enorme flexibilidade em seus m&eacute;todos de 
	contabilidade.  Por exemplo, voc&ecirc; escolhe como ir&aacute; fazer a
	contabilidade, periodicamente ou em determinado tempo.  Voc&ecirc; 
	escolhe qual a informa&ccedil;&atilde;o que ir&aacute; armazenar:
	nome do usu&aacute;rio, nome da m&aacute;quina, tipo do trabalho de 
	impress&atilde;o, p&aacute;ginas impressas, metragem quadrada do papel
	utilizado, quanto tempo a impressora foi utilizada para a impress&atilde;o
	em muito mais.  E voc&ecirc; s&oacute; ter&aacute; que modificar o filtro
	para armazenar essas informa&ccedil;&otilde;es.
		</para>
          
      <sect3>
			<title>
				Uma Comtabilidade R&aacute;pida e Rasteira
			</title>

			<para>
				O FreeBSD vem com dos programas que podem ajuda-lo com uma 
		contabilidade simples e periodica.  Eles s&atilde;o filtros texto
		(<command>lpf</command>), descrito na se&ccedil;&atilde;o 
		<link linkend="printing-advanced-lpf">lpf: um Filtro Texto</link>,
		e  &man.pac.8;, um programa para recolher e totalizar as entradas do
		arquivo de contabilidade das impressoras.
			</para>

			<para>
				Como mencionado na se&ccedil;&atilde;o sobre filtros 
		(<link linkend="printing-advanced-filters">Filtros</link>), O
		<application>LPD</application> inicia os filtros de texto e de 
		convers&atilde;o com o nome do arquivo de contabilidade para ser 
		utilizado na linha de comando do filtro.  Os filtros podem usar esse
		argumento para saber onde escrever os dados da contabilidade.  O nome
		desse arquivo deve ser colocado na op&ccedil;&atilde;o
		<literal>af</literal> no arquivo <filename>/etc/printcap</filename>, e
		se n&atilde;o estiver especificado com o diret&oacute;rio absoluto,
		ser&aacute; utilizado de forma relativa ao diret&oacute;rio de 
		spooling.
			</para>

			<para>
				O <application>LPD</application> inicia o <command>lpf</command>
		com a largura e o comprimento da p&aacute;gina como os argumentos (
		da op&ccedil;&atilde;&otilde;es <literal>pw</literal> e 
		<literal>pl</literal>).  O <command>lpf</command> usa esses argumentos
		para determinar quanto de papel ser&aacute; utiizado.  Depois do
		envio do arquivo para impressora, ele ent&atilde;o escreve a entrada
		da contabilidade para o arquivo de contabilidade.  Uma entrada seria
		semelhante a essa:
			</para>

        <programlisting>2.00 rose:andy
3.00 rose:kelly
3.00 orchid:mary
5.00 orchid:mary
2.00 orchid:zhang</programlisting>
            
        <para>You should use a separate accounting file for each printer, as
          <command>lpf</command> has no file locking logic built into it, and
          two <command>lpf</command>s might corrupt each other's entries if
          they were to write to the same file at the same time.  An easy way
          to insure a separate accounting file for each printer is to use
          <literal>af=acct</literal> in <filename>/etc/printcap</filename>.
          Then, each accounting file will be in the spooling directory for a
          printer, in a file named <filename>acct</filename>.</para>
            
        <para>When you are ready to charge users for printouts, run the
            &man.pac.8; program.  Just change to the spooling directory for
          the printer you want to collect on and type <literal>pac</literal>.
          You will get a dollar-centric summary like the following:</para>
            
        <screen>  Login               pages/feet   runs    price
orchid:kelly                5.00    1   $  0.10
orchid:mary                31.00    3   $  0.62
orchid:zhang                9.00    1   $  0.18
rose:andy                   2.00    1   $  0.04
rose:kelly                177.00  104   $  3.54
rose:mary                  87.00   32   $  1.74
rose:root                  26.00   12   $  0.52

total                     337.00  154   $  6.74</screen>
              
        <para>These are the arguments &man.pac.8; expects:</para>

        <variablelist>
          <varlistentry>
            <term><option>-P<replaceable>printer</replaceable></option></term>

            <listitem>
              <para>Which <replaceable>printer</replaceable> to summarize.
                This option works only if there is an absolute path in the
                <literal>af</literal> capability in
                <filename>/etc/printcap</filename>.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term><option>-c</option></term>
            
            <listitem>
              <para>Sort the output by cost instead of alphabetically by user
                name.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term><option>-m</option></term>
            
            <listitem>
              <para>Ignore host name in the accounting files.  With this
                option, user <username>smith</username> on host
                <hostid>alpha</hostid> is the same user
                <username>smith</username> on host <hostid>gamma</hostid>.
                Without, they are different users.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term><option>-p<replaceable>price</replaceable></option></term>
            
            <listitem>
              <para>Compute charges with <replaceable>price</replaceable>
                dollars per page or per foot instead of the price from the
                <literal>pc</literal> capability in
                <filename>/etc/printcap</filename>, or two cents (the
                default).  You can specify <replaceable>price</replaceable> as
                a floating point number.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term><option>-r</option></term>
            
            <listitem>
              <para>Reverse the sort order.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term><option>-s</option></term>
            
            <listitem>
              <para>Make an accounting summary file and truncate the
                accounting file.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term><replaceable>name</replaceable>
              <replaceable>&hellip;</replaceable></term>
            
            <listitem>
              <para>Print accounting information for the given user
                <replaceable>names</replaceable> only.</para>
            </listitem>
          </varlistentry>
        </variablelist>

        <para>In the default summary that &man.pac.8; produces, you see the
          number of pages printed by each user from various hosts.  If, at
          your site, host does not matter (because users can use any host),
          run <command>pac -m</command>, to produce the following
          summary:</para>
              
        <screen>  Login               pages/feet   runs    price
andy                        2.00    1   $  0.04
kelly                     182.00  105   $  3.64
mary                      118.00   35   $  2.36
root                       26.00   12   $  0.52
zhang                       9.00    1   $  0.18

total                     337.00  154   $  6.74</screen>
              

        <para>To compute the dollar amount due,
            &man.pac.8; uses the <literal>pc</literal> capability in the
          <filename>/etc/printcap</filename> file (default of 200, or 2 cents
          per page).  Specify, in hundredths of cents, the price per page or
          per foot you want to charge for printouts in this capability.  You
          can override this value when you run &man.pac.8; with the
          <option>-p</option> option.  The units for the <option>-p</option>
          option are in dollars, though, not hundredths of cents.  For
          example,
              
          <screen>&prompt.root; <userinput>pac -p1.50</userinput></screen>
              
          makes each page cost one dollar and fifty cents.  You can really
          rake in the profits by using this option.</para>

        <para>Finally, running <command>pac -s</command> will save the summary
          information in a summary accounting file, which is named the same as
          the printer's accounting file, but with <literal>_sum</literal>
          appended to the name.  It then truncates the accounting file.  When
          you run &man.pac.8; again, it rereads the
          summary file to get starting totals, then adds information from the
          regular accounting file.</para>
      </sect3>
      
      <sect3>
			<title>
				Como Contar P&aacute;gians Impressas?
			</title>

        <para>In order to perform even remotely accurate accounting, you need
          to be able to determine how much paper a job uses.  This is the
          essential problem of printer accounting.</para>
            
        <para>For plain text <foreignphrase>jobs</foreignphrase>, the problem is not that hard to solve: you
          count how many lines are in a job and compare it to how many lines
          per page your printer supports.  Do not forget to take into account
          backspaces in the file which overprint lines, or long logical lines
          that wrap onto one or more additional physical lines.</para>
            
        <para>The text filter <command>lpf</command> (introduced in <link
            linkend="printing-advanced-lpf">lpf: a Text Filter</link>) takes
          into account these things when it does accounting.  If you are
          writing a text filter which needs to do accounting, you might want
          to examine <command>lpf</command>'s source code.</para>
            
        <para>How do you handle other file formats, though?</para>

        <para>Well, for DVI-to-LaserJet or DVI-to-&postscript; conversion, you
          can have your filter parse the diagnostic output of
          <command>dvilj</command> or <command>dvips</command> and look to see
          how many pages were converted.  You might be able to do similar
          things with other file formats and conversion programs.</para>

        <para>But these methods suffer from the fact that the printer may not
          actually print all those pages.  For example, it could jam, run out
          of toner, or explode&mdash;and the user would still get
          charged.</para>
            
			<para>
				Ent&atilde;o, o que voc&ecirc; pode fazer?
			</para>

        <para>
				Existe somente uma meio <emphasis>correto</emphasis> para 
	fazer uma contabilidade <emphasis>precisa</emphasis>.  Deixe a impressora
	dizer para voc&ecirc; quanto de papel ela usou, e a conecte via porta
	serialou a uma conex&atilde;o de rede.  Quase todas as impressoras 
	&postscript; suportam essa manipula&ccedil;&atilde;o.  Outras marcas
	e modelos tamb&eacute;m podem, por exemplo, impressora Imagen
	Laser.  Modifique os diltros para essas impressoras para pegar a 
	utiliza&ccedil;&atilde;o das p&aacute;ginasapos a impress&atilde;o de 
	cada trabalho de impress&atilde;o, para ent&atilde;o poder armazenar
	as informa&ccedil;&otilde;es da contabilidade baseado apenas neste 
	valor.  N&atilde;o existe contagem de linha e nem exame de erross no
	arquivo.
			</para>
            
			<para>
				Claro, voc&ecirc; pode ser generoso e deixar as 
	impress&otilde;es gratuitas.
			</para>
      </sect3>
    </sect2>
  </sect1>

  <sect1 id="printing-using">
    <title>Usando as Impessoras</title>
    
    <indexterm>
      <primary>printers</primary>
      <secondary>usage</secondary>
   </indexterm>
		<para>
			Essa se&ccedil;&atilde;o mostra &agrave; voc&ecirc; como utilizar 
		as impressoras que voc&ecirc; configurou com o FreeBSD.  Aqui tem
		uma vis&atilde;o geral dos comandos a n&iacute;vel de usu&aacute;rio:
		</para>

    <variablelist>
      <varlistentry>
	<term>&man.lpr.1;</term>

	<listitem>
	  <para>Imprime os trabalhos de impress&atilde;o
		</para>
	</listitem>
      </varlistentry>
      
      <varlistentry>
	<term>&man.lpq.1;</term>

	<listitem>
	  <para>Verifica a fila da impressora</para>
	</listitem>
      </varlistentry>
      
      <varlistentry>
	<term>&man.lprm.1;</term>

	<listitem>
	  <para>
			Remove os trabalhos de impress&atilde;o da fila da impressora
		</para>
	</listitem>
      </varlistentry>
    </variablelist>
    
		<para>
			Existe tamb&eacute;m o comando administrativo, &man.lpc.8;, 
		descrito na se&ccedil;&atilde;o 
      <link linkend="printing-lpc">
			Administrando o Sistema de Spooler <application>LPD</application>
		</link>, usado para controlar as impressoras e suas filas.
		</para>


		<para>
			Todos esses tr&ecirc;s comandos &man.lpr.1;, &man.lprm.1;, e
		 &man.lpq.1; aceitam a op&ccedil;&atilde;o <option>-P
	<replaceable>Nome-da-Impressora</replaceable></option> para especificar
	qual a impressora/fila ir&aacute; operar, como listado no arquivo
	<filename>/etc/printcap</filename>.  Ele habilita que voc&ecirc; possa
	enviar, remover e checar os trabalhos de impress&atilde;o para 
	v&aacute;rias impressoras.  Se voc&ecirc; n&atilde;o usa a 
	op&ccedil;&atilde;o <option>-P</option>, ent&atilde;o esses comandos
	usam a impressoras especificada na vari&aacute;vel de ambiente
   <envar>PRINTER</envar>.  Finalmente se voc&ecirc; n&atilde;o tiver 
	a vari&aacute;vel de ambiente <envar>PRINTER</envar>, esses comandos
	por padr&atilde;o usam a impressora <literal>lp</literal>.
		</para>

		<para>
			No futuro, a terminologia <emphasis>impressora 
	padr&atilde;o</emphasis> ser&aacute; o nome que estiver na vari&aacute;vel
	de ambiente <envar>PRINTER</envar>, ou a impressora chamada de
   <literal>lp</literal> quando n&atilde;o existir a vari&aacute;vel
	de ambiente <envar>PRINTER</envar>.
		</para>
    
    <sect2 id="printing-lpr">
			<title>
				Tabalhos de Impress&atilde;o
			</title>
      
			<para>
				Para imprimir arquivos, digite:
			</para>
      
      <screen>&prompt.user; <userinput>lpr <replaceable>filename</replaceable> <replaceable>...</replaceable></userinput></screen>
	    
      <indexterm><primary>printing</primary></indexterm>
			<para>
				Ele imprime cada arquivo listado na impressora padr&atilde;o.  Se
		sua lista n&atilde;o cont&eacute;m, &man.lpr.1; l&ecirc; os dados
		para serem impressos da entrada padr&atilde;o.  Por exemplo, esse
		comando imprime alguns importantes arquivos do sistema:
			</para>

      <screen>&prompt.user; <userinput>lpr /etc/host.conf /etc/hosts.equiv</userinput></screen>
	    
			<para>
				Para selecionar uma impressora espec&iacute;fica, digite:
			</para>
		    
      <screen>&prompt.user; <userinput>lpr -P <replaceable>nome-da-impressora</replaceable> <replaceable>nome-do-arquivo</replaceable> <replaceable>...</replaceable></userinput></screen>

			<para>
				Esse exemplo imprime uma listagem do diret&oacute;rio
		corrente para a impressora <literal>rattan</literal>:
			</para>
	    
      <screen>&prompt.user; <userinput>ls -l | lpr -P rattan</userinput></screen>
	    
			<para>
				Como n&atilde;o h&aacute; arquivos a serem impressos pelo comando
	&man.lpr.1;, O comando <command>lpr</command> ir&aacute; ler da
	entrada padr&atilde;o, a qual &eacute; sa&iacute;da do comando
	<command>ls -l</command>.
			</para>
      
			<para>
				O comando &man.lpr.1; tamb&eacute;m pode aceitar uma grande
	variedade de op&ccedil;&otilde;es para controlar a formata&ccedil;&atilde;o,
	aplicando convers&atilde;o de arquivos, gerando multiplas c&oacute;pias,
	e muito mais.  Para mais informa&ccedil;&atilde;o, veja a 
	se&ccedil;&atilde;o <link linkend="printing-lpr-options">
			Op&ccedil;&otilde;es de Impress&atilde;o</link>.
			</para>
    </sect2>
    
    <sect2 id="printing-lpq">
		<title>Verificando a Impress&atilde;o</title>
      
      <indexterm><primary>print jobs</primary></indexterm>
		<para>
			Quando voc&ecirc; imprime com o comando &man.lpr.1;, os dados
	que voc&ecirc; gostaria que saissem juntos em um pacote chamado de
	<quote>trabalho de impress&atilde;o</quote>, o qual &eacute; enviado
	para o sistema de spooling <application>LPD</application>.  Cada 
	impressora tem sua pr&oacute;pria fila de impress&atilde;o para os 
	trabalhos de impress&atilde;o, e seus trabalhos de impress&atilde;o
	aguardam na fila a impress&atilde;o de outros trabalhos seus ou de outros
	usu&aacute;rios.  A impressora imprime esses trabalhos de impress&atilde;o
	na seguinte ordem (FIFO) primeiro a chegar &eacute; o primeiro a ser
	impresso.
		</para>

		<para>
			Para visualizar a fila para a impressora padr&atilde;o, digite:
	&man.lpq.1;.
	Para especificar a impressora, use a op&ccedil;&atilde;o 
	<option>-P</option>. option.  Por exemplo, o comando

	<screen>&prompt.user; <userinput>lpq -P bamboo</userinput></screen>

	mostrar&aacute; a fila da impressora chamada de <literal>bamboo</literal>.
	Aqui est&aacute; um exemplo da sa&iacute;da do comando 
	<command>lpq</command>:
		</para>
	    
      <screen>bamboo is ready and printing
Rank   Owner    Job  Files                              Total Size
active kelly    9    /etc/host.conf, /etc/hosts.equiv   88 bytes
2nd    kelly    10   (standard input)                   1635 bytes
3rd    mary     11   ...                                78519 bytes</screen>
	    
		<para>
			Ele mostra tr&ecirc;s trabalhos de impress&atilde;o na fila
	da impressora <literal>bamboo</literal>.  O primeiro trabalho,
	enviado pela usu&aacute;ria kelly, tem atribuido um <quote>n&uacute;mero de 
	fila</quote> 9.  Cada trabalho de impress&atilde;o tem um n&uacute;mero
	&uacute;nico.  A maioria das vezes voc&ecirc; pode ignorar este 
	n&uacute;mero, mas voc&ecirc; ir&aacute; precisar dele se quizer cancelar 
	o trabalho de impress&atilde;o; veja na se&ccedil;&atilde;o
	<link linkend="printing-lprm">
		Removendo Trabalhos de Impress&atilde;o
	</link> para mais detalhes.
		</para>
	  
		<para>
			O n&uacute;mero de trabalho de Impress&atilde;o 9 consiste em
	dois arquivos; multiplos arquivos dado em um comando &man.lpr.1; &eacute;
	tratado como parte de um simples trabalho de impress&atilde;o.  Ele 
	&eacute; o trabalho de impress&atilde;o atual ( note a palavra 
	<literal>active</literal> na coluna <quote>Rank</quote>), a qual diz
	qual deve ser o trabalho de impress&atilde;o ativo.  O segundo 
	trabalho de impress&atilde;o consiste de dados passados pela entrada 
	padr&atilde;o para o comando &man.lpr.1;.  O terceiro vem do 
	usu&aacute;rio <username>mary</username>; o qual &eacute; um trabalho de 
	impress&atilde;o muito grande.  O nome do diret&oacute;rio do seu
	arquivo &eacute; t&atilde;o grande que n&atilde;o cabe, ent&atilde;o
	o comando &man.lpq.1; mostra os pontos da &aacute;rvore.
		</para>
      <para>
			A primeira linha da sa&iacute;da do comando &man.lpq.1; &eacute;
	igualmente importante: ela informa o que a impressora est&aacute;
	fazendo ( ou o que o <application>LPD</application> pensa que ela 
	fazendo em &uacute;ltima inst&acirc;ncia ).
		</para>

      <para>
			O comando &man.lpq.1; suporta tamb&eacute;m a op&ccedil;&atilde;o
	<option>-l</option> para gerar uma longa lista detalhada.  Aqui 
	est&aacute; um exemplo
	<command>lpq -l</command>:</para>
	    
      <screen>waiting for bamboo to become ready (offline ?)
kelly: 1st				 [job 009rose]
       /etc/host.conf                    73 bytes
       /etc/hosts.equiv                  15 bytes

kelly: 2nd				 [job 010rose]
       (standard input)                  1635 bytes

mary: 3rd                                [job 011rose]
      /home/orchid/mary/research/venus/alpha-regio/mapping 78519 bytes</screen>
    </sect2>

    <sect2 id="printing-lprm">
		<title>
			Removendo a Trabalhso de Impress&atilde;o 
		</title>
      
		<para>
			Voc&ecirc; pode remover um trabalho de impress&atilde;o da 
	fila com o comando &man.lprm.1;.  Frequentemente, voc&ecirc; ir&aacute;
	utilizar o comando &man.lprm.1; para remover o trabalho de 
	impress&atilde;o ativo, mas muitas das vezes ou todas as vezes, a 
	impress&atilde;o continua.
		</para>
	  
      <para>
			Para remover o trabalho de impress&atilde;o da impressora 
	padr&atilde;o, voc&egrave; dever&aacute; primeiro encontrar o n&uacute;mero
	do trabalho de impress&atilde;o com o comando &man.lpq.1;, ent&atilde;o
	digite:
		</para>
	  
      <screen>&prompt.user; <userinput>lprm <replaceable>job-number</replaceable></userinput></screen>
	    
      <para>
			Para remover o trabalho de impress&atilde;o de uma impressora
	especifica, voc&ecirc; deve utilizar a op&ccedil;&atilde;o
	<option>-P</option>.  O comando &agrave; seguir remove o trabalho de 
	impress&atilde;o de n&uacute;mero 10 da fila de impress&atilde;o da 
	imrpessora <literal>bamboo</literal>:
		</para>
	    
      <screen>&prompt.user; <userinput>lprm -P bamboo 10</userinput></screen>
      
      <para>
			O comando &man.lprm.1; possui alguns atalhos:
		</para>
      
      <variablelist>
	<varlistentry>
	  <term>lprm -</term>

	  <listitem>
		<para>
			Remove todos os trabalhos de impress&atilde;o ( para a impressora
	padr&atilde;o ) pertencente a voc&ecirc;.
		</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>lprm <replaceable>usu&aacute;rio</replaceable></term>
	  
	  <listitem>
		<para>
			Remove todos os trabalhos de impress&atilde;o ( para a impressora
	padr&atilde;o ) pertencentes ao usu&aacute;rio 
	<replaceable>usu&aacute;rio</replaceable>.  Somente o super-usu&aacute;rio
	pode remover os trabalhos de impress&atilde;o de outros usu&aacute;rios,
	e voc&ecirc; s&otilde; pode remover os seus pr&oacute;prios.
		</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>lprm</term>
	  
	  <listitem>
		<para>
			Sem o n&uacute;mero do trabalho de impress&atilde;o, ou com a
	op&ccedil;&atilde;o <option>-</option> aparecendo na linha de comando,
	&man.lprm.1; ir&aacute; remover o trabalho de impress&atilde;o ativo
	( corrente ) da impressora padr&atilde;o se este for pertencente a 
	voc&ecirc;, caso contr&aacute;rio s&oacute; o super-usu&aacute;rio
	poder&aacute; remove-lo.
		</para>
	  </listitem>
	</varlistentry>
      </variablelist>
      
		<para>
			Utilize a op&ccedil;&atilde;o <option>-P</option> para poder
	especificar a impressora sem ser a padr&atilde;o.  Por exemplo, o
	seguinte comando remove todos os trabalhos de impress&atilde;o para o
	usu&aacute;rio corrente na fila da impressora chamada de
	<literal>rattan</literal>:
		</para>
	  
      <screen>&prompt.user; <userinput>lprm -P rattan -</userinput></screen>
	  
      <note>
		<para>
			Se voc&ecirc; esta trabalhando em um ambiente de rede, o 
	comando &man.lprm.1; permitir&aacute; &agrave; voc&ecirc; remover os
	trabalhos de impress&atilde;o apenas enviados pela m&aacute;quina que
	os enviou.  Veja a sequ&ecirc;ncia de comandos abaixo para demosntrar 
	isso:
		</para>

	<screen>&prompt.user; <userinput>lpr -P rattan myfile</userinput>
&prompt.user; <userinput>rlogin orchid</userinput>
&prompt.user; <userinput>lpq -P rattan</userinput>
Rank   Owner	  Job  Files                          Total Size
active seeyan	  12	...                           49123 bytes
2nd    kelly      13   myfile                         12 bytes
&prompt.user; <userinput>lprm -P rattan 13</userinput>
rose: Permission denied
&prompt.user; <userinput>logout</userinput>
&prompt.user; <userinput>lprm -P rattan 13</userinput>
dfA013rose dequeued
cfA013rose dequeued
	</screen>
      </note>
    </sect2>
    
    <sect2 id="printing-lpr-options">
		<title>
			Al&eacute;m do Texto Puro: Op&ccedil;&otilde;ess de 
			Impress&atilde;o
		</title>
      
		<para>
			O comando &man.lpr.1; suporta um n&uacute;mero de 
	op&ccedil;&otilde;es que controla a formata&ccedil;&atilde;o do texto,
	converte graphico e outros formatos de arquivos, produzindo 
	multiplas c&oacute;pias, manipulando o trabalho de impress&atilde;o, e
	muito mais.  Essa se&ccedil;&atilde;o descreve as op&ccedil;&otilde;es.
		</para>
	  
      <sect3 id="printing-lpr-options-format">
	<title>
		Op&ccedil;&otilde;es de Formata&ccedil;&atilde;o e Convers&atilde;o
	</title>

		<para>
			As seguintes op&ccedil;&otilde;es do comando &man.lpr.1 controla a
	formata&ccedil;&atilde;o dos arquivos no trabalho de imrpess&atilde;o.
	  Use essas op&ccedil;&otilde;es se o trabalho de impress&atilde;o 
	n&atilde;o contiver texto puro ou se voc&ecirc; quizer uma sa&iacute;da
	formatada de texto puro atrav&eacute;s do utilit&aacute;rio
	&man.pr.1;.
		</para>
	    
        <indexterm><primary>&tex;</primary></indexterm>
		<para>
			Por exemplo, o comando a seguir imprime um arquivo DVI ( de um 
	systema &tex;) chamado de <filename>fish-report.dvi</filename> para 
	a impressora chamada de  <literal>bamboo</literal>:
		</para>
	      
	<screen>&prompt.user; <userinput>lpr -P bamboo -d fish-report.dvi</userinput></screen>
	      
		<para>
			Essas op&ccedil;&otilde;es &eacute; aplicada em cada arquivo do 
	trabalho de impress&atilde;o, voc&ecirc; n&atilde;o pode misturar (digamos)
	arquivos nos formatos DVI e ditroff no mesmo trabalho de impress&atilde;o.
	  Sendo assim envie separadamente os arquivos, usando op&ccedil;&otilde;es
	de convers&atilde;o diferentes para cada um deles.
		</para>

	<note>
		<para>
			Para todas essas op&ccedil;&otilde;ess, exceto as 
	<option>-p</option> e <option>-T</option>, requerem um filtro conversor
	instalado para a impressora de destino.  Por exemplo, a op&ccedil;&atilde;o
	<option>-d</option> precisa do filtro de convers&atilde;o para DVI.  A
	se&ccedil;&atilde;o
		<link linkend="printing-advanced-convfilters">
			Filtros Conversores
		</link> d&aacute; mais detalhes.
		</para>
	</note>

	<variablelist>
	  <varlistentry>
	    <term><option>-c</option></term>

	    <listitem>
	      <para>imprime arquivos do tipo cifplot.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-d</option></term>
	    
	    <listitem>
	      <para>Imprime arquivos do tipo DVI.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-f</option></term>
	    
	    <listitem>
	      <para>Imprime arquivos do tipo FORTRAN.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-g</option></term>
	    
	    <listitem>
	      <para>Imprime arquivos do tipo plot.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-i <replaceable>n&uacute;mero</replaceable></option></term>
		  
	    <listitem>
			<para>
				Para alinhar a sa&iacute;da por um 
		<replaceable>n&uacute;mero</replaceable> de colunas; se voc&ecirc; 
		omitir <replaceable>n&uacute;mero</replaceable>, o alinhamento
		ser&aacute; de 8 colunas.  Essa op&ccedil;&atilde;o trabalha
		somente com alguns filtros conversores.
			</para>

	      <note>
				<para>
					N&atilde;o coloque nenhum espa&ccedil;o entre a 
	op&ccedil;&atilde;o <option>-i</option> e o n&uacute;mero.
				</para>
	      </note>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-l</option></term>
	    
	    <listitem>
	      <para>Imprime arquivo do tipo literal, incluindo caracteres
	de controle.
			</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-n</option></term>
	    
	    <listitem>
	      <para>Imprime arquivo do tipo ditroff (troff independente do 
	dispositivo).
			</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term>-p</term>
	    
	    <listitem>
			<para>
				Formata o texto puro com o comando &man.pr.1; antes da 
	impress&atilde;o.  Veja &man.pr.1; para maiores informa&ccedil;&otilde;es.
			</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-T <replaceable>t&iacute;tulo</replaceable></option></term>
	    
	    <listitem>
			<para>
				Usa o <replaceable>t&iacute;tulo</replaceable> no 
		cabe&ccedil;alho do comando &man.pr.1; ao invez do nome do arquivo.
		  Essa op&ccedil;&atilde;o afeta somente quando usado em conjunto com
		a op&ccedil;&atilde;o <option>-p</option>.
			</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-t</option></term>
	    
	    <listitem>
	      <para>Imprime arquivo do tipo troff.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-v</option></term>
	    
	    <listitem>
	      <para>Imprime arquivo do Tipo raster.</para>
	    </listitem>
	  </varlistentry>
	</variablelist>
		    
	<para>
		Aqui um exemplo:  Esse comando imprime uma vers&atilde;o da 
	p&aacute;gina de manual do comando &man.ls.1; na impressora padr&atilde;o:
	</para>
	    
	<screen>&prompt.user; <userinput>zcat /usr/share/man/man1/ls.1.gz | troff -t -man | lpr -t</userinput></screen>
	      
	<para>
		O comando &man.zcat.1; descompacta o c&oacute;digo fonte da 
	p&aacute;gina do manual &man.ls.1; e transfere para o comando &man.troff.1;,
	o qual formata o c&oacute;digo a faz a sa&iacute;da do GNU troff ir para
	&man.lpr.1;, o qual envia o trabalho de impress&atilde;o para o 
	<foreignphrase>spooler</foreignphrase> do<application>LPD</application>.
	  Por causa do uso da op&ccedil;&atilde;o <option>-t</option> para o
	comando &man.lpr.1;, o spooler ir&aacute; converter a sa&iacute;da do 
	GNU troff em um formato que a impressora possa compreender e et&atilde;o
	ser&aacute; impresso o trabalho de impress&atilde;o.
	</para>
      </sect3>
      
      <sect3 id="printing-lpr-options-job-handling">
	<title>
		Op&ccedil;&otilde;es de Manipula&ccedil;&atilde;o de Impress&atilde;o
	</title>

	<para>
		As op&ccedil;&otilde;ess a seguir para o comando &man.lpr.1;
	informa ao <application>LPD</application> como manipular os 
	trabalhos de impress&atilde;o:
	</para>
      
	<variablelist>
	  <varlistentry>
	    <term>-# <replaceable>c&oacute;pias</replaceable></term>

	    <listitem>
			<para>
				Produz o n&uacute;mero de <replaceable>c&oacute;pias</replaceable>
		de cada arquivo no trabalho de impress&atilde;o ao inves de uma 
		&uacute;nica c&oacute;pia.  O administrador pode desabilitar essa 
		op&ccedil;&atilde;o para reduzir o desgaste da impressora e insentivar
		a fotoc&oacute;pia.  Veja a se&ccedil;&atilde;o
		<link linkend="printing-advanced-restricting-copies">
			Restringindo o N&uacute;mero de C&oacute;pias
		</link>.
			</para>

			<para>
				Esse exemplo imprime tres c&oacute;pias do arquivo
		<filename>parser.c</filename> seguido de tres c&oacute;pias do
		arquivo <filename>parser.h</filename> na impressora padr&atilde;o:
			</para>
		      
	      <screen>&prompt.user; <userinput>lpr -#3 parser.c parser.h</userinput></screen>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term>-m</term>
	    
	    <listitem>
			<para>
				Envia um e-mail apos o t&eacute;rmino da impress&atilde;o do
		trabalho de impress&atilde;o.  Com essa op&ccedil;&atilde;o, o
		sistema <application>LPD</application> ir&aacute; enviar um e-mal para 
		a sua conta quando ele terminar de gerenciar seu trabalho de 
		impress&atilde;o.  Na mensagem, ele ira informar &agrave; voc&ecirc;
		se a impress&atilde;o terminou com sucesso ou com falhas e,
		geralmente, qual foi o erro ocorrido.
			</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term>-s</term>
	    
	    <listitem>
			<para>
				N&atilde;o faz c&oacute;pias de os arquivos para o 
	diret&oacute;rio de spooling, mas ao inves disso, ele cria um link 
	simb&oacute;lico.
	</para>
		    
	      <para>
				Se voc&ecirc; est&aacute; imprimindo um trabalho de 
	impress&atilde;o grande, provavelmente essa op&ccedil;&atilde;o ir&aacute;
	ajuda-lo.  Isso economiza espa&ccedil;o no diret&oacute;rio de 
	spooling, voc&ecirc; pode ter um consumo maior que o seu espa&ccedil;o 
	dispon&iacute;vel no sistema do arquivo onde fica esse diret&oacute;rio.
	  Isso economiza tempo porque o <application>LPD</application> n&atilde;o
	precisa copiar o arquivo cada vez que o seu trabalho de impress&atilde;o
	for impresso.
		</para>
		    
		<para>
			Entretanto, existe um custo: deste que o 
	<application>LPD</application> ir&aacute; acessar o arquivo 
	original diretamente, voc&ecirc; n&atilde;o poder&aacute; modifica-lo
	ou remove-lo at&eacute; que tenha terminado a sua impress&atilde;o.
		</para>
	      
	      <note>
		<para>
			Se voc&ecirc; est&aacute; imprimindo para uma impressora
	remota, o <application>LPD</application> ir&aacute; eventualmeten que 
	copiar os arquivos da m&aacute;quina local para a m&aacute;quina
	remota, ent&atilde;o a op&ccedil;&atilde;o <option>-s</option> 
	ir&aacute; apenas economizar espa&ccedil;o na m&aacute;quina local,
	n&atilde;o na m&aacute;quina remota.  Ainda assim &eacute; uma
	op&ccedil;&atilde;o muito &uacute;til.
		</para>
	      </note>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term>-r</term>
	    
	    <listitem>
	      <para>
				Remove os arquivos do trabalho de Impress&atilde;o apos terem
	sido copiados para o diret&oacute;rio de spool, ou apos a impress&atilde;o
	deles com a op&ccedil;&atilde;o <option>-s</option>.  Seja cuidadoso com
	essa op&ccedil;&atilde;o!
		</para>
	    </listitem>
	  </varlistentry>
	</variablelist>
      </sect3>
	  
      <sect3 id="printing-lpr-options-misc">
	<title>
		Op&ccedil;&otilde;es de P&aacute;ginas de Cabe&ccedil;alho
	</title>

	<para>
		Essa op&ccedil;&atilde;o do &man.lpr.1; ajusta o texto que normalmente 
	aparece no cabe&ccedil;alho do trabalho de impress&atilde;o.  Se o
	cabe&ccedil;alho for suprimido para a impressora de destino, essa 
	op&ccedil;&atilde;o n&atilde;o ter&aacute; efeito algum.  Veja a 
	se&ccedil;&atilde;o
	<link linkend="printing-advanced-header-pages">
	P&aacute;ginas de Cabe&ccedil;alho
	</link> para informar-se sobre a configura&ccedil;&atilde;o.
	</para>
	    
	<variablelist>
	  <varlistentry>
	    <term>-C <replaceable>texto</replaceable></term>

	    <listitem>
	      <para>
				Troca o nome da m&aacute;quina na p&aacute;gina de 
	cabe&ccedil;alho pelo <replaceable>texto</replaceable>.  O nome da
	m&aacute;quina &eacute; normalmente o da m&aacute;quina que enviou o
	trabalho de impress&atilde;o.
			</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term>-J <replaceable>texto</replaceable></term>
	    
	    <listitem>
			<para>
				Troca o nome do trabalho de impress&atilde;o na p&aacute;gina de 
	cabe&ccedil;alho pelo <replaceable>texto</replaceable>.  O nome do 
	trabalho de impress&atilde;o normalmente &eacute; o nome do primeiro
	arquivo do trabalho de impress&atilde;o, ou <filename>stdin</filename> se
	voc&ecirc; estiver imprimindo da entrada padr&atilde;o.
			</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term>-h</term>
	    
	    <listitem>
	      <para>
				N&atilde;o imprime a p&aacute;gina de cabe&ccedil;alho.
			</para>
	      
	      <note>
				<para>
					Em alguns locais, essa op&ccedil;&atilde;o pode n&atilde;o
	ter efeito algum, uma vez que a p&aacute;ginas de cabe&ccedil;alho 
	s&atilde;o sempre gerada.  Veja a se&ccedil;&atilde;o
	<link linkend="printing-advanced-header-pages">
		P&aacute;ginas de Cabe&ccedil;alho
	</link> para maiores detalhes.
				</para>
	      </note>
	    </listitem>
	  </varlistentry>
	</variablelist>
      </sect3>
    </sect2>
    
    <sect2 id="printing-lpc">
		<title>
			Administrando Impressoras
		</title>
      
		<para>
			Como um administrador para suas impressoras, voc&ecirc; deve te-las
	instaladas, configuradas e testadas.  Usando o comando &man.lpc.8;,
	voc&ecirc; pode interagir com suas impressoras de v&aacute;rios meios,
	com o comando &man.lpc.8;, voc&ecirc; pode
		</para>
      
      <itemizedlist>
	<listitem>
	  <para>Iniciar ou parar a impressora</para>
	</listitem>

	<listitem>
	  <para>Abilitar ou desabilitar as filas de impress&atilde;o</para>
	</listitem>

	<listitem>
	  <para>
			Rearrumar a ordem dos trabalhos de impress&atilde;o em cada
		fila.
		</para>
	</listitem>
      </itemizedlist>
      
		<para>
			Primeiro, uma nota sobre a terminologia:  se a impressora estiver
	<emphasis>parada</emphasis>, Ela n&atilde;o poder&aacute; imprimir
	nada que estiver na fila.  Usu&aacute;rios poder&atilde;o enviar os seus 
	trabalhos de impress&atilde;o, os quais aguardar&atilde;o na fila 
	at&eacute; que a impressora seja <emphasis>inicializada</emphasis>
	ou a fila seja limpa.
		</para>
	  
		<para>
			Se a fila estiver <emphasis>disabilidada</emphasis>, nenhum
	usu&aacute;rio ( exceto o <username>root</username>) poder&aacute; enviar
	os trabalhos de impress&atilde;o para a impress&atilde;o.  Quando
	a fila for <emphasis>abilitada</emphasis> permitir&aacute; que os 
	usu&aacute;rios possam enviar seus trabalhso de impress&atilde;o.
	  A impressora pode ser <emphasis>inicializada</emphasis> para que a 
	fila seja desabilidada, nesse caso ela continuar&aacute; imprimindo o
	trabalho de impress&atilde;o at&eacute; que a fila esteja vazia.
		</para>

      <para>
			Em geral, voc&ecirc; deve ter privil&eacute;gios de 
	<username>root</username> para usar o comando &man.lpc.8;.  
	Usu&aacute;rios normais podem utilizar o comando &man.lpc.8; somente
	para pegar o status da impressora e para reinicializar uma impressora
	travada.
		</para>

      <para>
			Aqui est&aacute; um resumo do comando &man.lpc.8;.  A maioria dos 
	comandos tem o <replaceable>nome da impressora</replaceable> como
	argumentopara informar qual &eacute; a impressora que queremos 
	operar.  Voc&ecirc; pode usar <literal>all</literal> para o 
	<replaceable>nome da impressora</replaceable> para ver/operar em
	todas as impressoras descritas no arquivo 
	<filename>/etc/printcap</filename>.
		</para>
      
      <variablelist>
	<varlistentry>
	  <term><command>abort
	      <replaceable>nome da impressora</replaceable></command></term>

	  <listitem>
			<para>
				Cancela o trabalho corrente e para a impressora.  Usu&aacute;rios
	podem enviar trabalhos de impress&atilde;o se a fila estiver abilitada.
			</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>clean
	      <replaceable>nome da impressora</replaceable></command></term>
	  
	  <listitem>
	    <para>
			Remove arquivos antigos que fazem parte de um trabalho de 
	impress&atilde;o que n&atilde;o foi removido corretamente pelo 
	<application>LPD</application>, particularmente se existir erros durante
	a imoress&atilde;o ou uma grande atividade de administra&ccedil;&atilde;o.
	  Esse comando encontra arquivos que n&atilde;o residem mais no 
	diret&oacute;rio de spool e os removem.
		</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>disable
	      <replaceable>nome da impressora</replaceable></command></term>
	  
	  <listitem>
	    <para>
			Desabilita a fila de impress&atilde;o para novos trabalhos de
	impress&atilde;o.  Se a impressora estiver em funcionamento, ela 
	ir&aacute; continuar a imprimir at&eacute; que a fila fique vazia.
	  O superusu&aacute;rio (<username>root</username>) sempre pode enviar
	trabalhos para a impressora, mesmo com a fila dessabilidada.
		</para>
		  
		<para>
			Esse comando &eacute; muito &uacute;til quando voc&ecirc; est&aacute;
	testando uma nova impressora ou a instala&ccedil;&atilde;o de um
	filtro: desabilita a fila e envia os trabalhos de impress&atilde;o como
	<username>root</username>.  Outros usu&aacute;rios n&atilde;o 
	poder&atilde;o enviar trabalhos de impress&atilde;o at&eacute; que 
	voc&ecirc; complete seus testes e re- abilite a fila com o 
	comando <command>enable</command>.
		</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>down <replaceable>nome da impressora</replaceable>
	      <replaceable>mesagem</replaceable></command></term>
		
	  <listitem>
	    <para>
			Coloca a impressora inativa.  Equivalente ao comando
	<command>disable</command> seguido do comando  <command>stop</command>.
	  A <replaceable>mesagem</replaceable> aparece como o status da 
	impressora quando o usu&aacute;rio checar a fila da impressora com o
	comando &man.lpq.1; ou o status com o comando 
	<command>lpc status</command>.
		</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>enable
	      <replaceable>nome da impressora</replaceable></command></term>
		
	  <listitem>
			<para>
				Abilita a fila para a impressora.  Os usu&aacute;rios 
	poder&atilde;o enviar trabalhos de impress&atilde;o, mas a 
	impressora n&atilde;o ir&aacute; imprimir nada at&eacute; que ela seja
	inicializada.
			</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>help
	      <replaceable>nome do comando</replaceable></command></term>
		
	  <listitem>
		<para>
			MOstra um texto de ajuda sobre o comando 
	      <replaceable>nome do comando</replaceable>.  Sem o 
	      <replaceable>nome do comando</replaceable>, mostra um resumo
	dos comandos dispon&iacute;veis.
		</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>restart
	      <replaceable>nome da impressora</replaceable></command></term>
	  
	  <listitem>
		<para>
			Inicializa a impressora.  Usu&aacute;rios comuns podem usar este 
	comando se alguma circunst&acirc;ncia extraordin&aacute;ria trave o
	<application>LPD</application>, mas ele n&atilde;o pode iniciar a 
	impressora parada pelos comandos <command>stop</command> ou
	<command>down</command>.  O comando 
	<command>restart</command> &eacute; equivalente aos comandos
	<command>abort</command> seguido por 
	<command>start</command>.
		</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>start
	      <replaceable>nome da impressora</replaceable></command></term>
		
	  <listitem>
		<para>
			Inicializa a impressora.  A impressora ir&aacute; imprimir os
	trabalhos de impress&atilde;ona que estiverem na fila.
		</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>stop
	      <replaceable>nome da impressora</replaceable></command></term>
	  
	  <listitem>
		<para>
			Para a impressora.  A impressora ir&aacute; terminar a 
	impress&atilde;o do trabalho de impress&atilde;o atual e n&atilde;o 
	ir&aacute; imprimir mais nada que estiver na fila.   Mesmo que ela 
	esteja parada, os usu&aacute;rios podem enviar seus trabalhos de 
	impress&atilde;o.
		</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>topq <replaceable>nome da impressora</replaceable>
	      <replaceable>
				trabalho de impress&atilde;o ou nome do usu&aacute;rio
			</replaceable></command></term>
		
	  <listitem>
			<para>
				Reoeganiza a fila para 
	<replaceable>nome da impressora</replaceable> por colocar o
	trabalho de impress&atilde;o com o n&uacute;mero de 
	<replaceable>trabalho de impress&atilde;o</replaceable> ou o
	trabalho de impress&atilde;o do 
	<replaceable>nome do usu&aacute;rio</replaceable> no topo da fila.
	  Para esse comando voc&ecirc; n&atilde;o pode utilizar 
	<literal>all</literal> como o 
	<replaceable>nome da impressora</replaceable>.
			</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>up
	      <replaceable>nome da impressora</replaceable></command></term>
		
	  <listitem>
			<para>
				Coloca a impressora no ar; oposto ao comando 
		<command>down</command>.  Equivale aos comandos 
		<command>start</command> seguido por
		<command>enable</command>.
			</para>
	  </listitem>
	</varlistentry>
      </variablelist>
      
		<para>
			o comando &man.lpc.8; aceita os comandos acima na linha de comando.
	Se voc&ecirc; n&atilde;o colocar comandos como argumentos, o 
	&man.lpc.8; entrar&aacute; no modo interativo, onde voc&ecirc; 
	poder&aacute; entrar com os comandos at&eacute; voc&ecirc; digitar 
	<command>exit</command>, <command>quit</command>, ou fim de arquivo 
	( EOF ).
		</para>
    </sect2>
  </sect1>
  
  <sect1 id="printing-lpd-alternatives">
	<title>
		Alternativas para o <foreignphrase>Spooler</foreignphrase> 
		Padr&atilde;o
	</title>
    
		<para>
			Se voc&ecirc; estiver lendo este manual todo, voc&ecirc; deve ter 
		aprendido tudo sobre o sistema de impress&atilde;o 
		<application>LPD</application> que vem com o FreeBSD.  E voc&ecirc;
		provalvelmente ir&aacute; ter em mente uma pergunta:
      <quote>
			Quais s&atilde;o os outros sistemas de impress&atilde;o 
			dispon&iacute;veis e que funcionem no FreeBSD?
      </quote>
		</para>

    <variablelist>
      <varlistentry>
	<term>LPRng</term>

 	<indexterm><primary>LPRng</primary></indexterm>	  
	<listitem>
		<para>
			O <application>LPRng</application>, que significa simplesmente
		<quote>LPR: a pr&oacute;xima Gera&ccedil;&atilde;o (Next
	   Generation)</quote> &eacute; uma completamente reescri&ccedil;&atilde;o
		do PLP.  Patrick Powell e Justin Mason (o principal mantendedor do PLP)
		colaboraram para fazer o <application>LPRng</application>.  O 
		s&iacute;tio principal dele &eacute; 
	   <ulink url="http://www.lprng.org/"></ulink>.
		</para>
	</listitem>
      </varlistentry>
      <varlistentry>
	<term>CUPS</term>

 	<indexterm><primary>CUPS</primary></indexterm>	  
	<listitem>
		<para>
			O <application>CUPS</application>, Sistema Comum de 
		impress&atilde;o para o UNIX (the Common UNIX Printing System), 
		prov&ecirc; um n&iacute;vel (camada) prot&aacute;vel de impress&atilde;o
		para os sistemas operacionas baseados em 
		&unix;.  Ele foi desenvolvido pela Easy Software Products para 
		promover uma solu&ccedil;&atilde;o padr&atilde;o para todo e qualquer
		usu&aacute;rio e vendedor de &unix;.
		</para>

		<para>
			O <application>CUPS</application> utliza o protocolo de 
		impress&atilde;o via internet (<acronym>IPP</acronym>) como base para
		o gerenciamento dos trabalhos de impress&atilde;o e filas.  O 
		processo de impressora de linha ( Line Printer Deamon 
		<acronym>LPD</acronym>), o Servidor de Bloco de Mensagens
		(<acronym>SMB</acronym>), e o protocolo AppSocket (a.k.a. JetDirect)
		tam&eacute;m s&atilde;o suportados com funcionalidades redizidas.  O
		CUPS adiciona visualiza&ccedil;&atilde;o de impressoras na rede e a
		descri&ccedil;&atilde;o de impressoras PostScript
	   (<acronym>PPD</acronym>) e d&aacute; suporte para a impress&atilde;o
		do mundo real sob o &unix;.
		</para>

		<para>
			O s&iacute;tio principal para o <application>CUPS</application> 
		&eacute; <ulink url="http://www.cups.org/"></ulink>.
		</para>
	</listitem>
      </varlistentry>
    </variablelist>
  </sect1>

  <sect1 id="printing-troubleshooting">
	<title>
		Corre&ccedil;&atilde;o de Erros
	</title>

	<para>
		Apos realizar um teste simples com o comando &man.lptest.1;, voc&ecirc;
	pode ter obtido um desses resultados ao inv&eacute;s do funcionmamento
	correto da sa&iacute;da:
	</para>

    <variablelist>
      <varlistentry>
			<term>
				Ela funciona por um tempo e para; ou n&atilde;o ejeta a folha
			toda.
	  		</term>

	<listitem>
		<para>
			A impressora parece imprimir, mas voc&ecirc; aguarda e ela n&atilde;o
		faz nada.  De fato, voc&ecirc; deve pressionar o bot&atilde;o de 
		PRINT REMAINING ou ALIMENTA&Ccedil;&Atilde;O de folha para obter
		algum resultado.
		</para>

		<para>
			Se esse &eacute; o caso, a impressora provalvelmente est&aacute;
		aguardando para ver ser recebe mais algum dado para seu trabalho de
		impress&atilde;o antes de imprimir qualquer outra coisa.  Para corrigir
		este problema, voc&ecirc; deve term um filtro de texto para enviar o
		caracter FORM FEED ( alimenta&ccedil;&atilde;o de folha ) ou 
		qualquer outro necess&aacute;rio para a impressora.  Isso &eacute; 
		sufuciente para a maioria dos casos, pos faz com que a impressora
		imprima o restante das informa&ccedil;&otilde;es presentes no buffer
		interno.  Isso tamb&eacute;m &eacute; &uacute;til para ser ter certeza
		que o trabalho de impress&atilde;o terminou e o pr&oacute;ximo ir&aacute;
		iniciar em uma nova folha, e n&atilde;o colado com o anterior.
		</para>

		<para>
			O shell script a seguir imprime o caracter de alimenta&ccedil;&atilde;o
		de folha na impressora; o arquivo &eacute;:
		<filename>/usr/local/libexec/if-simple</filename>
		</para>

	  <programlisting>#!/bin/sh
#
# if-simple - Simple text input filter for lpd
# Installed in /usr/local/libexec/if-simple
#
# Simply copies stdin to stdout.  Ignores all filter arguments.
# Writes a form feed character (\f) after printing job.

/bin/cat &amp;&amp; printf "\f" &amp;&amp; exit 0
exit 2</programlisting>
	</listitem>
      </varlistentry>

      <varlistentry>
			<term>
				Ela produz o efeito <quote>escada.</quote>
			</term>

	<listitem>
		<para>
			Voc&ecirc; pode ter o seguinte resultado:
		</para>

	  <programlisting>!"#$%&amp;'()*+,-./01234
                "#$%&amp;'()*+,-./012345
                                 #$%&amp;'()*+,-./0123456</programlisting>

	  <indexterm><primary>MS-DOS</primary></indexterm>
 	  <indexterm><primary>OS/2</primary></indexterm>
 	  <indexterm><primary>ASCII</primary></indexterm>
	  <para>
			Voc&ecirc; pode vir ser mais uma v&iacute;tima do 
		<emphasis>efeito escada</emphasis>, que &eacute; causado pelo 
		conflito de interpreta&ccedil;&atilde;o dos caracteres que deveriam
		indicar uma nova linha.  O estilo dos sistemas operacionas &unix; 
		utilizam um &uacute;nico caracter para representar uma nova linha:
		o caracter ASCII c&oacute;digo 10, o alimenta&ccedil;&atilde;o de linha
		(LF - line feed).  O &ms-dos;, &os2;, e outros sistemas operacionais
		usam o par de caracteres com os c&oacute;digos ASCII 10 
	    <emphasis>e</emphasis> 13 ( o caracter de retorno de carro (CR)).  
		Muitas impressoras usam a conves&atilde;o do &ms-dos; para representrar
		uma nova linha.
		</para>

		<para>
			Quando voc&ecirc; imprimir com o FreeBSD, voc&ecirc; dever&aacute; 
		usar em seu texto o caracter de alimenta&ccedil;&atilde;o de linha,
		que avan&ccedil;a o papel para pr&oacute;xima linha, mas mant&eacute;m 
		a mesma posi&ccedil;&atilde;o horizontal na p&aacute;gina para a 
		impress&atilde;o do pr&oacute;ximo caracter.  &Eacute; isso que o 
		caracter de retorno de carro faz (CR); move para o canto esquerdo a 
		posi&ccedil;&atilde;o da pr&oacute;xima impress&atilde;o do caracter.
		</para>

		<para>
			Aqui est&aacute; o que o FreeBSD espera que sua impressora
		fa&ccedil;a:
		</para>

	  <informaltable frame="none">
	    <tgroup cols="2">
	      <tbody>
		<row>
		  <entry>A impressora Recebeu CR</entry>
		  <entry>A impressora Imprimiu CR</entry>
		</row>

		<row>
		  <entry>A impressora Recebeu LF</entry>
		  <entry>A impressora imprimiu CR + LF</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </informaltable>

		<para>
			Aqui, algumas maneiras para solucionar isto:
		</para>

	  <itemizedlist>
	    <listitem>
			<para>
				Use as chaves de configura&ccedil;&atilde;o, no painel de controle
		da impressora para alterar a interpreta&ccedil;&atilde;o desses 
		caracteres.  Verifique o manual da sua impressora para encontrar como
		fazer isso.
			</para>

	      <note>
	        <para>
					Se voc&ecirc; utiliza um outro sistema operacional al&eacute;m
		do FreeBSD, voc&ecirc; deve <emphasis>reconfigurar</emphasis> a 
		impressora parausar a interpreta&ccedil;&atilde;o dos caracteres CR e
		LF desse sistema.  Voc&ecirc; deve dar preferencia a outras 
		solu&ccedil;&otilde;es, como mostrada abaixo.
				</para>
	      </note>
	    </listitem>

	    <listitem>
			<para>
				Ter um driver serial para FreeBSD converter o caracter LF em
		CRLF.  Claro, ele trabalha <emphasis>somente</emphasis> com impressoras 
		na porta serial.  Para habilitar essa fun&ccedil;&atilde;o, use a 
		op&ccedil;&atilde;o <literal>ms#</literal> e coloque o modo 
		<literal>onlcr</literal> no arquivo <filename>/etc/printcap</filename>. 
			</para>
	    </listitem>

	    <listitem>
			<para>
				Enviar um <emphasis>c&oacute;digo escape</emphasis> para a 
		impressora para term um tratamento tempor&aacute;rio diferente do
		caracter LF.  Condulte o manual de sua impressora para conhecer as
		sequ&ecirc;ncias escape que sua impressora pode suportar.  
		Quando voc&ecirc; encontrar o c&oacute;digo correto, modifique o
		filtro texto para enviar este c&oacute;digo inicialmente, para apos
		enviar o arquivo a ser impresso.
			</para>

	      <indexterm><primary>PCL</primary></indexterm>
		<para>
			Aqui tem um exemplo de filtro texto para as impressoras que 
		reconhecem os c&oacute;digos da linguagem PCL da Hewlett Packard.  Esse
		filtro faz a impressora tratar os caracteres LF como sendo uma 
		sequ&ecirc;ncia de LF + CR; entao ele envia o arquivo; 
		ent&atilde;o ele envia um caracter FF ( alimenta&ccedil;&atilde;o de
		formul&aacute;rio ) para ejetar a &uacute;ltima p&aacute;gina do 
		arquivo.  Ele deve funcionar com todas as impressoras da Hewlett Packard.
		</para>

	      <programlisting>#!/bin/sh
#
# hpif - Simple text input filter for lpd for HP-PCL based printers
# Installed in /usr/local/libexec/hpif
#
# Simply copies stdin to stdout.  Ignores all filter arguments.
# Tells printer to treat LF as CR+LF.  Ejects the page when done.

printf "\033&amp;k2G" &amp;&amp; cat &amp;&amp; printf "\033&amp;l0H" &amp;&amp; exit 0
exit 2</programlisting>

		<para>
			Aqui um exemplo do <filename>/etc/printcap</filename> de um
		computador chamado <hostid>orchid</hostid>.  Ele tem uma &uacute;nica
		impressora ligada a ele na primeira porta paralela, uma Hewlett Packard
		LaserJet 3Si, chamada de <literal>teak</literal>.  Ele esta usando o
		script acima como um filtro de texto:
		</para>

	      <programlisting>#
#  /etc/printcap for host orchid
#
teak|hp|laserjet|Hewlett Packard LaserJet 3Si:\
        :lp=/dev/lpt0:sh:sd=/var/spool/lpd/teak:mx#0:\
        :if=/usr/local/libexec/hpif:</programlisting>
	    </listitem>
          </itemizedlist>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>A Impressora Sobreescreve as linhas.</term>

	<listitem>
		<para>
			A impressora nunca avan&ccedil;a para linha abaixo.  Todas as linhas
	do texto s&atilde;o impressas no topo da p&aacute;gina e uma sobre as
	outras.
		</para>

		<para>
			Esse problema &eacute; o <quote>oposto</quote> do efeito escada,
		descrito acima, e muito mais raro.  Em algum lugar, o caracter LF
		que &eacute; usado pelo FreeBSD como final de linha, &eacute; tratado 
		como o caracter CR, que retorna a cabe&ccedil;a de impress&atilde;o
		para o inicio da linha, mas n&atilde;o move uma linha para baixo,
		como deveria ser.
		</para>

	  <para>
			Use as chaves de configura&ccedil;&atilde;o da impressora ou o painel 
	de controle para for&ccedil;ar a seguinte interpreta&ccedil;&atilde;o dos 
	carateres LF e CR.
		</para>

	  <informaltable frame="none">
	    <tgroup cols="2">
	      <thead>
		<row>
		  <entry>Impressora Recebe</entry>
		  <entry>Impressora Imprime</entry>
		</row>
	      </thead>

	      <tbody>
		<row>
		  <entry>CR</entry>
		  <entry>CR</entry>
		</row>

		<row>
		  <entry>LF</entry>
		  <entry>CR + LF</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </informaltable>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>A Impressora Perde Caracteres.</term>

	<listitem>
	  <para>
		Enquanto est&aacute; imprimindo, a impressora n&atilde;o imprime alguns
	caracteres po linha.  O problema pode estar na configura&ccedil;&atilde;o 
	<foreignphrase>raw</foreignphrase>, perdendo mais e mais caracteres.
		</para>

	  <para>
		O problema &eacute; que a impressora n&atilde;o pode manter
	a velociade a qual o computador est&aacute; usando para enviar
	os dados pela porta serial ( esse problema n&atilde;o deve ocorrer
	na porta paralela).  Existem duas maneiras de solucionar o problema:
	</para>

	  <itemizedlist>
	    <listitem>
	      <para>
		Se a impressora suportar o controle por XON/XOFF, o FreeeBSD
	ir&aacute; usa-lo se for especificado o modo <literal>ixon</literal> 
	na op&ccedil;&atilde;o <literal>ms#</literal>.
		</para>
	    </listitem>

	    <listitem>
		<para>
		Se a impressora suportar 
	<foreignphrase> carrier flow control</foreignphrase>,
	especifique o modo <literal>crtscts</literal> na op&ccedil;&atilde;o
	 <literal>ms#</literal>.
		Tenha certeza que o cabo que conecta a impressora ao 
	computador esteja corretamente feito para 
	<foreignphrase> carrier flow control</foreignphrase>,
		</para>
	    </listitem>
	  </itemizedlist>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>A Impressora Imprime Lixo.</term>

	<listitem>
	<para>
		A impressora aparentemente imprime lixo rand&ocirc;mico
	e n&atilde;o o texto solicitado.
	</para>

	<para>
		Esse &eacute; outro sintoma de par&acirc;metros
	incorretos da comunica&ccedil;&atilde;o com a impressora serial.
	Verifique novamente os valores nas op&ccedil;&otilde;es da taxa
	bps ( <literal>br</literal> ) e da paridade ( <literal>ms#</literal> );
	tenha certeza das configura&ccedil;&otilde;es especificadas no
	arquivo <filename>/etc/printcap</filename>.
	</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>Nada Acontece.</term>

	<listitem>
	<para>
		Se nada acontecer, o problema, provavelmente, est&aacute;
	dentro do FreeBSD e n&atilde;o no 
	<foreignphrase>hardware</foreignphrase>.  Adicione a 
	op&ccedil;&atilde;o (<literal>lf</literal>) no arquivo 
	<filename>/etc/printcap</filename> na impressora que voc&ecirc;
	est&aacute; verificando.  No nosso exemplo, estamos utilizando a 
	impressora <literal>rattan</literal>, com a op&ccedil;&atilde;o
	<literal>lf</literal>:
	</para>

	  <programlisting>rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:\
        :lp=/dev/lpt0:\
        :if=/usr/local/libexec/if-simple:\
        :lf=/var/log/rattan.log</programlisting>

	<para>
		Ent&atilde;o, tente novamente.  Verifique o arquivo de
	<foreignphrase>log</foreignphrase> ( no nosso exemplo,
	<filename>/var/log/rattan.log</filename>) para ver qualquer 
	mensagem de erro que possa aparecer.  Baseado nessas mensagens, 
	voc&ecirc; poder&aacute; corrigir o problema.
	</para>

	<para>
		Se voc&ecirc; n&atilde;o especificar a op&ccedil;&atilde;o
	<literal>lf</literal> o <application>LPD</application> usar&aacute; 
	<filename>/dev/console</filename> como padr&atilde;o.
	</para>
	</listitem>
      </varlistentry>
    </variablelist>
  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->


