<!--
     The FreeBSD Documentation Project

     $FreeBSD: doc/en_US.ISO8859-1/books/handbook/printing/chapter.sgml,v 1.82 2003/11/13 22:01:54 wes Exp $
-->

<chapter id="printing">
  <chapterinfo>
    <authorgroup>
      <author>
	<firstname>Sean</firstname>
	<surname>Kelly</surname>
	<contrib>Contributed by </contrib>
      </author>
      <!-- 30 Sept 1995 -->
    </authorgroup>
    <authorgroup>
      <author>
	<firstname>Jim</firstname>
	<surname>Mock</surname>
	<contrib>Reestruturado e atualizado por </contrib>
	<!-- Mar 2000 -->
      </author>
    </authorgroup>
  </chapterinfo>

  <title>Impress&atilde;o</title>

  <sect1 id="printing-synopsis">
    <title>Sinopse</title>
    <indexterm><primary>Sistema de <foreignphrase>spool</foreignphrase> LPD </primary></indexterm>
    <indexterm><primary>Impress&atilde;o</primary></indexterm>

    <para>
	O FreeBSD pode ser usado para imprimir em uma grande variedade de impressoras, deste as antigas impressoras matricias at&eacute; as modernas laser, permitindo produzir trabalhos de alta qualidade em seus aplicativos preferido.
    </para>

    <para>
	O FreeBSD pode tamb&eacute;m ser utilizado como servidor fr impress&atilde;o em uma rede; Com isso, o FreeBSD pode receber trabalhos de impress&atilde;o de uma grande variedade de outros computadores, inclusive de outros FreeBSD, &windows; e &macos;, FreeBSD assegura que apenas um pedido ser&aacute; impresso por vez, e mant&eacute;m a estat&iacute;sticas de cada usu&aacute;rio e de cada m&aacute;quina que fez uso do recurso de impress&atilde;o, produzindo p&aacute;ginas de <quote>banner</quote>, mostrando de quem &eacute; a impress&atilde;o na impressora.
    </para>

    <para>
	Ap&oacute;s a leitura deste cap&iacute;tulo, voc&ecirc; estar&aacute; sabendo:
    </para>

    <itemizedlist>
      <listitem>
	<para>
		Como configurar o FreeBSD como um servidor de impress&atilde;o
	</para>
      </listitem>

      <listitem>
	<para>
		Como Instalar filtros de impress&atilde;o, para gerenciar trabalhos de impress&atilde;o especiais diferentemente, incluindo conversores de formatos para o formato padr&atilde;o da sua impressora.
	</para>
      </listitem>

      <listitem>
	<para>
		Como habilitar cabe&ccedil;alhos ou p&aacute;gina de banner &agrave; sua impress&atilde;o.
	</para>
      </listitem>

      <listitem>
	<para>
	Como imprimir em impressoras conectadas em outros computadores.
	</para>
      </listitem>

      <listitem>
	<para>
	Como imprimir em impressoras conectadasdiretamente na rede
	</para>
      </listitem>

      <listitem>
	<para>
	Como controlar restri&ccedil;&otilde;es para impressora, incluindo limita&ccedil;&atilde;o de tamanho dos trabalhos de impress&atilde;o e impedindo certos usu&aacute;rios de utilizarem a(s) impressora(s).
	</para>
      </listitem>

      <listitem>
	<para>
	Como mater estat&iacute;sticas de impress&atilde; e de usu&aacute;rios
	</para>
      </listitem>

      <listitem>
	<para>
	Como resolver problemas de impress&atilde;o
	</para>
      </listitem>
    </itemizedlist>

    <para>
	Antes de se aventurar na leituta do cap&iacute;tulo, voc&ecirc; deve:
	</para>

    <itemizedlist>
      <listitem>
	<para>
	Saber como confingurar e instalaer um novo kernel
	  (<xref linkend="kernelconfig">).
	</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="printing-intro-spooler">
    <title>Introdu&ccedil;&atilde;o</title>

    <para>
	Para usar impressoras no FreeBSD, voc&eacute; ir&aacute; precisar configurar-lo para trabalhar com o sistema de impress&atilde;o da Barkeley, tamb&eacute; conhecido como sistema de <foreignphrase>spool</foreignphrase> <application>LPD</application>.
	Ele tamb&eacute;m &eacute; o sistema padr&atilde;o de controle do FreeBSD.  Esse cap&iacute;tulo introduz ao sistema de spooling <application>LPD</application>, frequentimente chamado de <application>LPD</application>, e ir&aacute; guia-lo atrav&eacute;s de sua configura&ccedil;&atilde;o.
	</para>

    <para>Se voc&ecirc; j&aacute; est&aacute; familiado com <application>LPD</application> ou com outro sistema de impress&atilde;o, voc&ecirc; poder&aacute; pular esta se&ccedil;&atilde;o <link
      linkend="printing-intro-setup">Configurando o sistema de spooling
      </link>.</para>

    <para><application>LPD</application> controla tudo sobre o servidor de impress&atilde;o.  &Eacute; respons&aacute;vel por um grande n&uacute;mero de coisas:
      </para>

    <itemizedlist>
      <listitem>
	<para>
	Ele controla o acesso as impressoras locais e impressoras
	remotas em outros servidores e impressoras conectadas diretamente
	&agrave; rede.
	</para>
      </listitem>

      <indexterm><primary>Trabalho de Impress&atilde;o</primary></indexterm>
      <listitem>
	<para>
		Ele abilita os usu&aacute;rios a enviar arquivos para serem 
	impressos; Esses envios s&atilde;o chamados de 
	<emphasis><foreignphrase>jobs</foreignphrase></emphasis>.
	</para>
      </listitem>

      <listitem>
	<para>
		Ele permite v&aacute; usu&aacute;rios acessando uma &uacute;nica
	impressora ao mesmo tempo, mantendo uma <emphasis>queue</emphasis> 
	(fila de impress&atilde;o) para cada impressora.
	</para>
      </listitem>

      <listitem>
	<para>
		Ele pode imprimir <emphasis>cabe&ccedil;alhos</emphasis> (tamb&eacute;m
		conechido como <emphasis>banner</emphasis> ou 
		<emphasis>burst</emphasis> ent&atilde;o os usu&aacute;rios
		podem com facilidade encontrar seus <foreignphrase>jobs</foreignphrase> que foram impressos
		na pilha de impressos.
	  </para>
      </listitem>

      <listitem>
	<para>
		Ele se encarrega dos par&acirc;metros das conex&otilde;es
	de impressoras seriais.
	  </para>
      </listitem>

      <listitem>
	<para>
		Ele pode enviar <foreignphrase>jobs</foreignphrase> atrav&eacute;s da rede para 
	outro <foreignphrase>spooler</foreignphrase> <application>LPD</application> em um outro
	servidor.
	</para>
      </listitem>

      <listitem>
	<para>
	Ele pode executar filtros especiais para formatar <foreignphrase>jobs</foreignphrase> para
	serem impressos em v&aacute;rias linguagens de impressora ou para
	compatibilizar as impressoras.
	</para>
      </listitem>

      <listitem>
	<para>Ele pode gerenciar o uso da impressora.
	</para>
      </listitem>
    </itemizedlist>

    <para>Atraves do arquivo de configura&ccedil;&atilde;o
      (<filename>/etc/printcap</filename>), e por providenciar
	programas especiais de filtro, voc&ecirc; pode abilitar o
	systema <application>LPD</application> para fazer tudo ou
	alguma parte do conjunto das fun&ccedil;&atilde;o de uma grande 
	variedade de impressoras.
	</para>

    <sect2 id="printing-intro-why">
      <title>Como Voc&ecirc; Deve Utilizar o Spooler</title>

      <para>
	Se voc&ecirc; &eacute; um usu&aacute;rio &uacute;nico do sistema
	 you may be wondering 
	Porque voc&ecirc; deveria should bother com o 
	<foreignphrase>spooler</foreignphrase> quando voc&eacute; nao 
	necessita de controle de acesso, cabe&ccedil;alho de p&aacute;ginas
	ou controle de impress&atilde;o.  Mesmo que fosse possivel habilitar
	o acesso direto a impressora, voc&ecirc; dever&aacute; usar o 
	<foreignphrase>spooler</foreignphrase>
	de qualquer maneira.
	</para>

      <itemizedlist>
	<listitem>
	  <para><application>LPD</application> imprime o <foreignphrase>jobs</foreignphrase> em segundo plano
	voc&ecirc; n&atilde;o precisa aguardar os dados serem enviados para
	a impressora.
	    </para>
	</listitem>

	<indexterm><primary>&tex;</primary></indexterm>
	<listitem>
	  <para><application>LPD</application> pode convinientemente executar 
		um job para ser impresso atraves de filtros para adicionar 
		cabe&ccedil;alhos com data/hota ou converter formatos
		especiais de arquivo ( como o arquivos &tex; DVI )
		em formatos que as impressoras poder&atilde;o entender.
		  Voc&ecirc; n&atilde;o precisar&aacute; fazer manualmente.
	    </para>
	</listitem>

	<listitem>
	  <para>
		Muitos programas gratuitos e comercias preve a impress&atilde;o 
	    atraves da funcionalidade de conversar com o <foreignphrase>spooler</foreignphrase> do seu
	    sistema.  Pela configura&ccedil;&atilde;o do sistema de <foreignphrase>spooler</foreignphrase>,
	    voc&ecirc; ir&aacute; mais facilmente suportar outros programas 
	    que voc&ecirc; poder&aacute; adcionar ou j&aacute; ter.
	    </para>
	</listitem>
      </itemizedlist>
    </sect2>
  </sect1>

  <sect1 id="printing-intro-setup">
    <title>Configura&ccedil;&atilde;o B&aacute;sica</title>

    <para>Para usar as impressoras com o  sistema <application>LPD</application>       de spooling, voc&ecirc; ir&aacute; precisar de configurar
	tanto a impressora quanto o programa  
      <application>LPD</application>.  Esse documento descreve dois n&iacute;
	de configura&ccedil;&atilde;:

      </para>
    <itemizedlist>
      <listitem>
	<para>
		Veja a se&ccedil;&atilde;o <link linkend="printing-simple">
	Configura&ccedil;&atilde;o Simples de Impressora</link> para aprender 
	como conectar a impressora, informar ao <application>LPD</application> 
	como se comunicar com as impressoras, e imprimir arquivo em texto 
	puro nelas.
	</para>
      </listitem>

      <listitem>
	<para>Veja a se&ccedil;&atilde;o <link linkend="printing-advanced">
	Configura&ccedil;&atilde;o Avan&ccedil;ada de Impressora
	  </link> para encontrar como imprimir uma variedade de formatos
	especiais de arquivo, para imprimir cabe&ccedil;alhos nas p&aacute;ginas
	para imprimir atraves da rede, para controlar o acesso &agrave; 
	impressoras, e fazer o balan&ccedil;o de utiliza&ccedil;&atilde;o
	da impressora.
	  </para>
      </listitem>
    </itemizedlist>

    <sect2 id="printing-simple">
    <title>Configura&ccedil;&atilde;o B&aacute;sica</title>

      <para>Essa se&ccedil;&atilde;o mostra como configurar a impressora
	e o programa <application>LPD</application> para usar a
	impressora.
	Ele ir&aacute; ensinar o b&aacute;sico:
	</para>

      <itemizedlist>
	<listitem>
	  <para>Se&ccedil;&atilde;o 
		<link linkend="printing-hardware">
			Configura&ccedil;&atilde;o de Hardware
	    	</link> 
		D&aacute; algumas dicas na conex&atilde;o da impressora
	com a porta do seu computador.
	    </para>
	</listitem>

	<listitem>
		<para>
			Se&ccedil;&atilde;o <link linkend="printing-software">
	Configura&ccedil;&atilde;o de Programa</link> mostra como configurar 
	o arquivo de configura&ccedil;&atilde;o 
	(<filename>/etc/printcap</filename>) do <application>LPD</application> 
	<foreignphrase>spooler</foreignphrase> 
		</para>
	</listitem>
      </itemizedlist>

      <para>
	Se voc&ecirc; estiver configurando a impressora para usar o
	protocolo de rede para aceitar dados para imprimir ao inv&eacute;s
	de uma porta paralela ou serial, veja
	<link linkend="printing-advanced-network-net-if">
	Impressoras com Interfaces de Dados Atrav&eacute;s da Rede
	</link>.</para>

      <para>
	Apesar desta se&ccedil;&atilde;o ser chamada de
	<quote>Configura&ccedil;&atilde;o Simples de Impressora
	</quote>, ela &eacute; um pouco complexa.
	Fazer com que a impressora funcione com seu computador e o
	 <application>LPD</application> <foreignphrase>spooler</foreignphrase>
	&eacute; uma parte dificil da configura&ccedil;&atilde;o.
	As op&ccedil;&otilde;s avan&ccedil;adas como cabe&ccedil;alhos de 
	p&aacute;ginas e gerenciamento s&atilde;o facilmente  configu&aacute;
	veis para funcionar na impressora.
	</para> 

      <sect3 id="printing-hardware">
	<title>Configura&ccedil;&atilde;o de Hardware</title>

	<para>
	Esta se&ccedil;&atilde;o mostra v&aacute;rios meios para voc&ecirc;
	conectar a impressora no seu PC.  Fala sobre portas de 
	comuni&ccedil;&atilde;o e cabos, e tamb&eacute;m sobre 
	configura&ccedil;&atilde;o do kernel que ser&aacute; necess&aacute;ria
	habilitar para que o FreeBSD possa comunicar-se com a impressora.
	</para>

	<para>
	Se voc&ecirc; j&aacute; tem uma impressora conectada e obteve 
	sucesso em imprimir em outro sistema operacional, voc&ecirc;
	provavelmente poder&aacute; pular para a se&ccedil;&atilde;o 
		<link linkend="printing-software">
			Configura&ccedil;&atilde;o do Programa
		</link>.
	</para>

	<sect4 id="printing-ports">
	  <title>Portas e Cabos</title>

	<para>
	A grande maioria de impressoras que voc&egrave; pode ter
	para usar em um PC possui suporte a pelo menos uma das interfaces
	abaixo:
	</para>

	  <itemizedlist>
	    <indexterm>
        <primary>printers</primary>
        <secondary>serial</secondary>
      </indexterm>
	    <listitem>
	      <para>
		Interface <emphasis>serial</emphasis> usa a porta serial
		do seu computador para enviar dados para a impressora.  
		A interface serial s&atilde;o encontradas comumente em 
		computadores industriais e os cabos estao dispon&iacute;veis e 
		tamb&eacute;m s&atilde;o de f&aacute;cil 
		constru&ccedil;&atilde;o.  Interfaces serial algumas vezes 
		necessitam de cabos especiais e normalmente requer que 
		voc&ecirc; configure algumas op&ccedil;&otilde;es complexas 
		da comunica&ccedil;&atilde;o.
		</para>
	    </listitem>

	    <indexterm>
        <primary>printers</primary>
        <secondary>parallel</secondary>
      </indexterm>
	    <listitem>
	      <para>
		Interface <emphasis>paralela</emphasis> usa a porta paralela
		do seu computador para enviar dados para a impressora.
		Interface paralela &eacute; mais comum em PC.  Os cabos 
		s&atilde;o disponibilizados mais facilmente, mas s&atilde;o 
		mais dif&iacute;ceis de serem montados manualmente.  
		Normalmente n&atilde;o existem op&ccedil;&otilde;es para
		serem configuradas nas interfaces paralela, tornado a 
		configura&ccedil;&atilde;o extremamente mais simples.
	      </para>
	      <indexterm>
	        <primary>centronics</primary>
		<see>parallel printers</see>
	      </indexterm>
	      <para>
		Interfaces paralela s&atilde;o normalmente conhecidas como
	interface <quote>Centronics</quote>, nome este dado por causa do
	tipo de conector utilizado na impressora.
	</para>
	    </listitem>
	  </itemizedlist>

	  <para>
		Em geral, as interfaces serial s&atilde;o mais lentas
	que as paralelas.  Interfaces paralelas normalmente s&atilde;o 
	disponibilizadas em uma &uacute;nica dire&ccedil;&atilde;o para
	comunica&ccedil;&atilde;o ( do computador para a impresora)
	enquanto que a serial proporciona uma comunica&ccedil;&atilde;o
	bi-direcional.  As novas portas paralelas (EPP e ECP) e as
	impressoras podendo comunicar em ambas as dire&ccedil;&otilde;es sob
	o FreeBSD quando um cabo padr&atilde;o IEEE1284 estiver sendo usado.
	</para>

	  <indexterm><primary>PostScript</primary></indexterm>
	  <para>
		Usualmente, ivoc&ecirc; somente precisar&aacute; da 
		comunica&ccedil;&atilde;o bi-direcional se sua impressora 
		<foreignphrase>reconhe&ccedil;a</foreignphrase> 	
		&postscript;.  Impressora &postscript; pode ser muito 
		<foreignphrase>verbose</foreignphrase>.  De fato 
		<foreignphrase>jobs</foreignphrase> &postscript; 
		s&atilde;o as sa&iacute;das atuais que os programas enviam 
		para as impressoras; 
		<foreignphrase>Eles n&atilde;o precis&atilde;o 
		produzir papel como um todo actually programs sent to 
		the printer; they need not produce paper at all </foreignphrase>
		e pode retornar resultados diretamente para o computador.
	    	&postscript; Tamb&eacute;m usa comunica&ccedil;&atilde;o
		bi-direcional para informar ao computador sobre problemas 
		ocorridos, tais como erros em progrmas &postscript; ou
		papel embaralhado (paper jam).  Seus usu&aacute;rios podem
		ficar agradecidos com essas inform&ccedil;&otilde;ess.
		Entretanto, o melhor meio para fazer o accounting efetivo 
		com uma impressora &postscript; requer que a 
		cominuca&ccedil;&atilde;o seja bi-direcional: voc&ecirc; 
		pergunta a impressora sobre a contagem de p&aacute;ginas
		(quantas p&aacute;gians ela j&aacute; imprimiu durante
		seu uso, vida &uacute;til), ent&atilde;o envia o 
		<foreignphrase>job</foreignphrase> do usu&aacute;rio
		faz novamente a pergunta &agrave; impressora sobre
		o total de p&aacute;gians impressas e ent&atilde;o faz
		a subtra&ccedil;ao dos valores para saber o valor exato
		de p&aacute;ginas impressa pelo usu&aacute;rio.
	    </para>
	</sect4>
	  
	<sect4 id="printing-parallel">
	  <title>Porta Paralela</title>

	  <para>
		Para conectar a impressora usando a interface paralela, 
		utilize o cabo Centronics entre a impressora e o computador.
		As instru&ccedil;&otilde;ess que vem no manual da impressora
		e/ou do computador, devem dar a voc&ecirc; um passo-a-passo
		completo.
	    </para>

	  <para>
		Lembre-se qual porta paralela voc&ecirc; est&aacute;
	usando no computador.  A primeira porta paralela &eacute; 
	<filename>/dev/ppc0</filename> Para o FreeBSD; a segunda &eacute;
	<filename>/dev/ppc1</filename>, e assim por diante.  Os dispositivos
	de impressora usam o seguinte esquema de nomes:
	
	    <filename>/dev/lpt0</filename> Para a impressora conectada
	na primeira porta paralela etc.
	    </para>
	</sect4>

	<sect4 id="printing-serial">
	  <title>Porta Serial</title>

	  <para>
		Para conectar a impressora em uma porta serial, voc&ecirc;
	dever&aacute; possuir o cabo serial apropriado para interligar o
	computador com a impressora.  As instru&ccedil;&otilde;ess que vem
	com a impressora e/ou com o computador, dever&aacute; dar &agrave;
	voc&ecirc; um completo passo-a-passo.
	</para>

	  <para>
		Se voc&ecirc; n&atilde;o est&aacute; seguro sobre qual o tipo
	de <quote>cabo serial</quote> que est&aacute; usando, voc&ecirc; pode 
	tentar uma dessas alternativas:
	</para>
	  <itemizedlist>
	    <listitem>
	      <para>O cabo tipo <emphasis>modem</emphasis> conecta cada pino
	do conector de um lado ao correspondente do outro conector.  Esse tipo
	de cabo tamb&eacute;m &eacute; conhecido como cabo
		<quote>DTE-to-DCE</quote>.</para>
	    </listitem>

	    <indexterm><primary>null-modem cable</primary></indexterm>
	    <listitem>
	      <para>
			O cabo tipo  <emphasis>null-modem</emphasis> conecta 
		alguns dos pinos diretamente e troca outros ( como por
		exemplo os pinos respons&aacute;veis por enviar e receber
		dados ), curta-circuita outros (liga-os entre si) internamente
		em cada conector. Esse tipo de cabo &eacute; tamb&eacute;m 
		conechido como cabo <quote>DTE-to-DTE</quote>
	     </para>
	    </listitem>

	    <listitem>
	      <para>O cabo de <emphasis>impressora serial</emphasis>, &eacute;
	necess&aacute;rio para algumas impressoras n&atilde;o comuns,
	&eacute; semelhante ao cabo null-modem, mas envia alguns sinais
	que est&aacute;o curto-circuitados internamente.
		</para>
	    </listitem>
	  </itemizedlist>

	  <indexterm><primary>baud rate</primary></indexterm>
	  <indexterm><primary>parity</primary></indexterm>
	  <indexterm><primary>flow control protocol</primary></indexterm>
	  <para>
		Voc&ecirc; dever&aacute; configurar alguns parametros
	da comunica&ccedil;&atilde;o da impressora, que usualmente s&atilde;o 
	feitos no painel frontal ou nas mini chaves (DIP switchs).  Altere
	o valor de <literal>bps</literal> (bits por segundos, chamado
	frequentemente de <emphasis>baud rate</emphasis>) que &eacute; a 
	taxa de transfer&ecirc;ncia entre o computador e a impressora,
	ambos devem ter a mesma taxa de transfer&egrave;ncia.
	Selecione entre 7 e 8 bits; paridade, par, &iacute;mpar, nenhuma;
	ou 1 ou 2 <foreignphrase>stop bits</foreignphrase>.  Tamb&eacute;m
	o protocolo de controle de fluxo; nenhum ou XON/XOFF ( tamb&eacute;m
	conhecido como controle de fluxo por <quote>hardware</quote> 
	(<quote><foreignphrase>in-band</foreignphrase></quote>) ou por 
	<quote>software</quote>.
		Lembre-se dessa configura&ccedil;&otilde;ess para poder
	aplica-las na configura&ccedil;&atilde;o dos programas, como vamos
	verificar a seguir.
	    </para>
	</sect4>
      </sect3>

      <sect3 id="printing-software">
	<title>
		Configura&ccedil;&atilde;o de Programa
	</title>

	<para>
		Essa se&ccedil;&atilde;o descreve as 
	configura&ccedil;&otilde;es necess&aacute;rias para imprimir com 
	o sistema de <foreignphrase>spooling</foreignphrase> no FreeBSD.
	</para>

	<para>
		Um resumo do que ser&aacute; visto neste passo:
	</para>

	<procedure>
	  <step>
		<para>
		Configure o seu kernel, se necess&aacute;rio, para
	utilizar a porta que voc&ecirc; deseja conectar a sua impressora.
	A se&ccedil;&atilde;o <link linkend="printing-kernel">
		Configura&ccedil;&atilde;o do Kernel</link> informa
	&agrave; voc&ecirc; o que &eacute; necess&aacute;rio fazer.
		</para>
	  </step>

	  <step>

		<para>
		Configure o modo de comunica&ccedil;&atilde;o da porta
	paralela, se voc&ecirc; est&aacute; usando a porta paralela
	se&ccedil;&atilde;o
	<link linkend="printing-parallel-port-mode"> Configure o Modo de 
		Comunica&ccedil;&atilde;o para a Porta Paralela
	</link> para ter mais detalhes.
		</para>

	  </step>

	  <step>
	    <para>
		Teste se o sistema operacional pode enviar dados para a 
	impressora.  A se&ccedil;&atilde;o 
	<link linkend="printing-testing">
		Verificando a Comunica&ccedil;&atilde;o com a Impressora
	</link> d&aacute; algumas sugest&otilde;es de como fazer iso.
	      </para>
	  </step>

	  <step>
		<para>
		Configure o <application>LPD</application> para a
	utiliza&ccedil;&atilde;o da impressora, modificando o arquivo
	<filename>/etc/printcap</filename>.  Voc&ecirc; ir&aacute; 
	o que fazer mais tarde neste cap&iacute;tulo.
		</para>
	  </step>
	</procedure>

	<sect4 id="printing-kernel">
	<title>
		Configura&ccedil;&atilde;o do Kernel
	</title>

	<para>
		O kernel do sistema operacional &eacute; compilado para
	trabalhar com um determinado conjunto de dispositivos.  As interfaces
	serial e paralela para a utiliza&ccedil;&atilde;o da impressora 
	fazem parte deste conjunto.  Entrtanto, pode ser necess&aacute;rio
	adcionar o suporte para uma porta serial ou paralela caso o seu
	kernel n&atilde;o esteja configurado.
	</para>

	<para>
		Para saber se seu kernel j&aacute; possui o suporte
	para interface serial, digite:
	</para>

	  <screen>&prompt.root; <userinput>grep sio<replaceable>N</replaceable> /var/run/dmesg.boot</userinput></screen>

	<para>
		Onde <replaceable>N</replaceable> &eacute; o n&uacute;mero
	da porta serial, iniciando do zero.  Se voc&ecirc; ver algo 
	semelhante &agrave;:
	</para>

	  <screen>
		sio2 at port 0x3e8-0x3ef irq 5 on isa
		sio2: type 16550A
	</screen>

	<para>
		Ent&atilde;o o kernel suporta a porta.
	</para>

	<para>
		Para saber se seu kernel j&aacute; possui o suporte
	para interface paralela, digite:
	</para>

	  <screen>&prompt.root; <userinput>grep ppc<replaceable>N</replaceable> /var/run/dmesg.boot</userinput></screen>

	<para>
		Onde <replaceable>N</replaceable> &eacute; o n&uacute;mero
	da porta paralela, iniciando do zero.  Se voc&ecirc; ver algo 
	semelhante &agrave;:
	</para>
	    
	    <screen>
		ppc0: &lt;Parallel port&gt; at port 0x378-0x37f irq 7 on isa0
		ppc0: SMC-like chipset (ECP/EPP/PS2/NIBBLE) in COMPATIBLE mode
		ppc0: FIFO with 16/16/8 bytes threshold</screen>
	    
	<para>
		Ent&atilde;o o kernel suporta a porta.
	</para>

	<para>
		Voc&ecirc; pode ter que reconfigurar o seu kernel para
	que o sistema operacional possa reconhecer e usar as portas
	paralela e/ou serial, para que voc&ecirc; possa utilizar a
	impressora.
	</para>

	<para>
		Para adcionar suporte a porta serial, consulte a 
	se&ccedil;&atilde;o de configura&ccedil;&atilde;o do kernel.  Para
	adcionar suporte a porta paralela consulte esta se&ccedil;&atilde;o
	<emphasis>e</emphasis> a se&ccedil;&atilde;o a seguir.
	</para>

	</sect4>
      </sect3>

      <sect3 id="printing-dev-ports">
	<title>
		Adcionando Entradas para as Portas no <filename>/dev</filename> 
	  </title>

	<note><para>FreeBSD&nbsp;5.0 inclui o sistema de arquivos
	 <literal>devfs</literal>, o qual automaticamente cria
	os nos dos dispositivos necess&aacute;rios.  Se voc&ecirc; est&aacute;
	executando a vers&atilde;o do FreeBSD com <literal>devfs</literal>
	habilitado, voc&ecirc; pode pular com seguran&ccedil;a esta
	se&ccedil;&atilde;o.
	  </para></note>

	<para>
	Uma vez que o kernel j&aacute; suporta a comunica&ccedil;&atilde;o
	ou pela porta paralela ou porta serial, voc&ecirc; ainda precisa
	da interface de programa atrav&eacute;s da qual voc&ecirc; ir&aacute;
	enviar e receber dados.
		&Eacute; para isso que a entrada no diret&oacute;rio
	  <filename>/dev</filename> server.
	</para>

	<para><emphasis>Para adcionar uma entrada para a porta no
	diret&oacute;rio <filename>/dev</filename> siga os passos:
	  </emphasis></para>

	<procedure>
	  <step>
	    <para>
		Torne-se o usu&aacute;rio  <username>root</username> 
	com o comando &man.su.1; .
		Entre com a senha do usu&aacute;rio <username>root</username>
	quando for solicitado.
		</para>
	  </step>

	  <step>
	    <para>Change to the <filename>/dev</filename>
	      directory:</para>

	    <screen>&prompt.root; <userinput>cd /dev</userinput></screen>
	  </step>

	  <step>
	    <para>Digite:</para>

	    <screen>
		&prompt.root; <userinput>./MAKEDEV <replaceable>porta</replaceable></userinput>
	</screen>

	    <para>Onde a <replaceable>porta</replaceable> &eacute; a 
	entrada para o dispositivo para a porta que voc&ecirc; quer
	criar.  Use <literal>lpt0</literal> para a impressora conectada
	na primeira porta paralela, <literal>lpt1</literal> para a segunda
	porta paralela, e assim consecutivamente; use <literal>ttyd0</literal>
	para a primeira porta serial, <literal>ttyd1</literal> para a segunda
	e assim consecutivamente.
		</para>
	  </step>

	  <step>
	    <para>Digite:</para>

	    <screen>&prompt.root; <userinput>ls -l <replaceable>porta</replaceable></userinput></screen>

	    <para>Para ter certeza do que a entrada do dispositivo foi criada.
		</para>
	  </step>
	</procedure>

	<sect4 id="printing-parallel-port-mode">
	  <title>
		Comfigurando o Modo de Comunica&ccedil;&atilde;o para
	a Porta Paralela
	 </title>

	  <para>
		Quando voc&ecirc; for usar a interface paralela, voc&ecirc;
	deve escolher entre o modo utilizando interrup&ccedil;&atilde;o
	ou por <foreignphrase>polling</foreignphrase>.  Driver para o
	dispositivo gen&eacute;rico de impressora (&man.lpt.4;) para
	 FreeBSD&nbsp;4.X e 5.X usa o sistema &man.ppbus.4;, o qual 
	controla a porta do chipset com o driver &man.ppc.4; driver.
	</para>

	  <itemizedlist>
	    <listitem>
	      <para>
		O m&eacute;todo de 
		<emphasis>interrup&ccedil;&atilde;o</emphasis> &eacute; o
	padr&atilde;o com o kernel GENERIC.  Com esse m&eacute;todo
	o sistema operacional sua uma linha de interrup&ccedil;&atilde;o
	IRQ para determinar se a impressora est&aacute; pronta para
	receber os dados.
		</para>
	    </listitem>

	    <listitem>
	      <para>O m&eacute;todo de <emphasis>polled</emphasis> 
	direciona o sistema operacional para perguntar repetidamente se
	a impressora est&aacute; pronta para receber dados.  Quando
	a resposta &eacute; afirmativa, o sistema envia os dados.
		</para>
	    </listitem>
	  </itemizedlist>

	  <para>
	O m&eacute;todo de interrup&ccedil;&atilde;o &eacute; normalmente
	mais r&aacute;pido mas usa uma linha de IRQ preciosa.  Algumas
	das novas impressoras HP n&atilde;o funcionam corretamente neste
	modo, aparentemente &eacute; um problema de temporiza&ccedil;&atilde;o
	( ainda n&atilde;o completamente compreedido ).  Essas impressoras
	necessitam do modo de <foreignphrase>polling</foreignphrase>.
	Voc&ecirc; deve utilizar um dos dois m&eacute;todos para
	trabalhar.  Algumas impressoras ir&atilde;o trabalhar em ambos os
	modos, mas ficaram sensivelmente mais lentas no mode de 
	interrup&ccedil;&atilde;o
	</para>
	  <para>
		Voc&ecirc; pode configurar o modo de comuni&ccedil;&atilde;oca
	de duas maneiras: pela concifgura&ccedil;&atilde;o do kernel ou 
	usando o programa &man.lptcontrol.8;
	    </para>

	  <para><emphasis>
		Para configurar o mode de comunica&ccedil;&atilde;o pelo
	kernel:
	    </emphasis></para>

	  <procedure>
	    <step>
	      <para>
		Voc&ecirc; deve editar o arquivo de configura&ccedil;&atilde;o
	do kernel.  Procure pela entrada <literal>ppc0</literal>.  Se 
	voc&ecirc; for configurar a segunda porta paralela, use 
	<literal>ppc1</literal>.  Use <literal>ppc2</literal> para a terceira
	porta, e assim consecutivamente.
		</para>

	      <itemizedlist>
		<listitem>
		  <para>
		Se voc&ecirc; preferir o modo de interrrup&ccedil;&atilde;o,
	para FreeBSD&nbsp;4.X inclua a especifica&ccedil;&atilde;o da
		    <literal>irq</literal>:</para>

		  <programlisting>device ppc0 at isa? irq <replaceable>N</replaceable></programlisting>

		<para>
			Onde <replaceable>N</replaceable> &eacute; a
	IRQ para a porta paralela do seu computador.
		</para>

		<para> Para o FreeBSD&nbsp;5.X, edite a seguinte linha: </para>

		  <programlisting>hint.ppc.0.irq="<replaceable>N</replaceable>"</programlisting>

		  <para>
		No arquivo <filename>/boot/device.hints</filename> e troque 
	<replaceable>N</replaceable> pelo n&uacute;mero correto da IRQ.  
	O arquivo de configura&ccedil;&atilde;o do kernel tamb&eacute;m 
	deve conter o driver &man.ppc.4; 
		</para>

		  <screen>device ppc</screen>

		</listitem>

		<listitem>
		  <para>
			Se voc&ecirc; for utilizar o modo
	de <foreignphrase>polling</foreignphrase>, n&atilde;o adcione a 
	especifica&ccedil;&atilde;o da <literal>irq</literal>:
		</para>

		  <para>
			Para o FreeBSD&nbsp;4.X, use a seguinte linha
	no arquivo de configura&ccedil;&atilde;o do kernel:
		    </para>

		  <programlisting>device ppc0 at isa?</programlisting>

		  <para>
			Para o FreeBSD&nbsp;5.X, simplesmente remova
	em seu arquivo <filename>/boot/device.hints</filename>  a 
	seguinte linha:
		    <para>

		  <programlisting>hint.ppc.0.irq="<replaceable>N</replaceable>"</programlisting>

		  <para>
			Em alguns casos, isso n&atilde;o ser&aacute;
	suficiente para colocar a porta em modo de 
	<foreignphrase>polling</foreignphrase> no FreeBSD&nbsp;5.X.  
	Na maior parte das vezes, isso &eacute; devido ao driver 
	&man.acpi.4;, mas tarde habilita para detec&ccedil;&atilde;o e
	<foreignphrase>atacha</foreignphrase> os dispositivos, e ent&atilde;o
	controla o modo de acesso &agrave; porta da impressora.
		Voc&ecirc; deve checar sua configuta&ccedil;&atilde;o
   	&man.acpi.4; para corrigir esse problema.
		    </para>
		</listitem>
	      </itemizedlist>
	    </step>

	    <step>
	      <para>
		Salve o arquivo.  Ent&atilde;o configure, compile
	e instale o novo kernel, e aseguir reboot o seu sistema.
	Veja <link 
	linkend="kernelconfig">Configura&ccedil;&atilde;o do Kernel</link>
	para maiores detalhes.
		</para>
	    </step>
	  </procedure>

	  <para><emphasis>Para configurar o modo de comunica&ccedil;&atilde;o
	com </emphasis> &man.lptcontrol.8;:</para>

	  <procedure>
	    <step>
	      <para>Digite:</para>

	      <screen>&prompt.root; <userinput>lptcontrol -i -d /dev/lpt<replaceable>N</replaceable></userinput></screen>

	      <para>
		para configurar o modo de interrup&ccedil;&atilde;o
	para a <literal>lpt<replaceable>N</replaceable></literal>.
		</para>
	    </step>

	    <step>
	      <para>Digite:</para>

	      <screen>&prompt.root; <userinput>lptcontrol -p -d /dev/lpt<replaceable>N</replaceable></userinput></screen>

	      <para>
		Para configurar o modo de 
			<foreignphrase>polling</foreignphrase> para
		<literal>lpt<replaceable>N</replaceable></literal>.</para>
	    </step>
	  </procedure>

	  <para>
		Voc&ecirc; pode colocar esses comandos no arquivo 
	<filename>/etc/rc.local</filename> para configurar automaticamente
	na hora da inicializa&ccedil;&atilde;o do seu sistema.  Veja 
	&man.lptcontrol.8; para maiores detalhes.</para>
	</sect4>

	<sect4 id="printing-testing">
	  <title>
		Testanto a Comunica&ccedil;&atilde;o com a Impressora
	</title>

	<para>
		Antes de procequir com a configura&ccedil;&atilde;o do 
	sistema	<foreignphrase>spooling</foreignphrase>, voc&egrave;
	deve ter certeza que o seu sistema operaional teve sucesso
	em enviar dados para a impressora.  &Eacute; muito mais f&aacute;cil
	depurar a conex&atilde;o com a impressora e o systema de 
	<foreignphrase>spooling</foreignphrase> separadamente.
	</para>

	<para>
		Para fazer o teste da impressora, nos precisamos enviar
	algum testo para a impressora.  Para impressoras que podem imprimir
	caracteres diretamente, o programa &man.lptest.1; &eacute; perfeito: 
	ele gera todos os 96 caracteres imprim&iacute;veis da tabela ASCII 
	em 96 linhas.
	</para>

	<indexterm><primary>PostScript</primary></indexterm>
	<para>
		Para a impressora &postscript; (ou outra linguagem )
	nos iremos precisar de algo mais sofisticado para testar.  Um 
	pequeno programa &postscript; como o que segue, &eacute; o 
	sufuciente
	</para>

	  <programlisting>%!PS
100 100 moveto 300 300 lineto stroke
310 310 moveto /Helvetica findfont 12 scalefont setfont
(Is this thing working?) show
showpage</programlisting>

	<para>
		O c&oacute;digo &postscript; acima pode ser colocado
	em um arquivo e usado como mostra os exemplos nas sec&ccedil;&otilde;es
	a seguir.
	</para>

	  <indexterm><primary>PCL</primary></indexterm>
	  <note>
		<para>
		Quando esse documento refere-se a linguagem da
	impressora,  &eacute; assumido que a linguagem &eacute; 
	semelhante ao &postscript;,  e n&atilde;o o PCL da Hewlett 
	PackardL.  Ainda que a linguagem PCL tenha grande funcionalidade,
	voc&ecirc; pode mesclar texto puro com seguencias de controle
	com caracteres ESC.  &postscript; n&atilde;o pode ser impresso
	diretamente em impressoras de texto puro, e para impressoras que
	necessitem de outra linguagem para imprimir, ser&aacute; 
	necess&aacute;rio acomoda&ccedil;&otilde;es.
		</para>
	  </note>

	  <sect5 id="printing-checking-parallel">
		<title>
			Verificando a Impressora Paralela
		</title>

	    <indexterm>
        <primary>printers</primary>
        <secondary>parallel</secondary>
      </indexterm>
	<para>
		Essa se&ccedil;&atilde;o informa &agrave; voc&ecirc;
	como verificar se o FreeBSD pode comunicar-se com a impressora
	conectata na porta paralela.
	</para>

	<para>
		<emphasis>Para testa a impressora na porta paralela:
	</emphasis>
	</para>

	    <procedure>
	      <step>
		<para>
			Torne-se <username>root</username> com  &man.su.1;.
		</para>
	      </step>

	      <step>
		<para>
			Envie Dados para a impressora.
		</para>

		<itemizedlist>
		  <listitem>
			<para>
			Se a impressora poder imprimir texto puro, use
	&man.lptest.1;.  Digite:
			</para>

		    <screen>&prompt.root; <userinput>lptest &gt; /dev/lpt<replaceable>N</replaceable></userinput></screen>

			<para>
			Onde <replaceable>N</replaceable> &eacute; o 
	n&uacute;mero da porta paralela, iniciando em 0
			</para>
		  </listitem>

		  <listitem>
		    <para>Se a impressora entender &postscript; ou outra
	linguagem de impressora, ent&atilde;o envie um pequeno programa
	para a impressora.  Digite:</para>

		    <screen>&prompt.root; <userinput>cat &gt; /dev/lpt<replaceable>N</replaceable></userinput></screen>

		    <para>
			Ent&atilde;o a linha por linha, digite o programa
	<emphasis>cuidadosamente</emphasis> como voc&ecirc; n&atilde;o
	poder&aacute; editar a linha caso tenha pressionado a tecla
	<literal>RETURN</literal> ou <literal>ENTER</literal>.  Quando 
	voc&ecirc; terminar de digitar o programa, pressione as teclas
	<literal>CONTROL+D</literal>, ou tecla que for fim-de-arquivo.
		      </para>

		    <para>Alternativamente, voc&ecirc; pode colocar o programa
	em um arquivo e digitar:
		      </para>
		    <screen>&prompt.root; <userinput>cat <replaceable>arquivo</replaceable> &gt; /dev/lpt<replaceable>N</replaceable></userinput></screen>

		    <para>Onde  <replaceable>arquivo</replaceable> &eacute;
	o nome do arquivo a ser digitado, que contenha o programa que
	voc&ecirc; envia para a impressora.
		      </para>
		  </listitem>
		</itemizedlist>
	      </step>
	    </procedure>

	    <para>Voc&ecirc; dever&aacute; ver algo semelhante impresso.  
	N&atilde;o se preocupe se o texto n&atilde;o sair como esperado; nos
	iremos consertar algumas coisas mais tarde.
	      </para>
	  </sect5>

	  <sect5 id="printing-checking-serial">
	    <title>Verificando a Impressora Serial
		</title>

	    <indexterm>
        <primary>printers</primary>
        <secondary>serial</secondary>
      </indexterm>
	    <para>Essa se&ccedil;&atilde;o informa &agrave; voc&ecirc;
	como verificar se o FreeBSD pode comunicar com a impressora pela
	porta serial.</para>

	    <para><emphasis>Para testa a impressora na porta serial:
	      </emphasis></para>

	    <procedure>
	      <step>
		<para>Torne-se <username>root</username> com &man.su.1;.</para>
	      </step>

	      <step>
		<para>Edite o arquivo <filename>/etc/remote</filename>.  
	Adicione a seguinte entrada:</para>

		<programlisting>printer:dv=/dev/<replaceable>porta</replaceable>:br#<replaceable>bps-rate</replaceable>:pa=<replaceable>paridade</replaceable></programlisting>

		<indexterm><primary>bits-per-second</primary></indexterm>
		<indexterm><primary>serial port</primary></indexterm>
		<indexterm><primary>parity</primary></indexterm>
		<para>Onde <replaceable>porta</replaceable> &eacute; o
	dispositivo para a porta serial (<literal>ttyd0</literal>,
		  <literal>ttyd1</literal>, etc.),
		  <replaceable>bps-rate</replaceable> &eacute; a taxa em
		  bits-por-segundo pela qual a impressora ir&aacute;
	se comunuicar, e <replaceable>paridade</replaceable> &eacute; a 
	paridade requierida pela impressora ( deve ser uma dessas, a seguir:
  	<literal>par</literal>, <literal>&iacute;mpar</literal>, 
	<literal>nenhum</literal>, ou <literal>zero</literal>).</para>

		<para>
		Aqui tem um exemplo de uma impressora conectada via terceira 
	porta seria a uma taxa de 19200&nbsp;bps sem paridade:
		  </para>

		<programlisting>printer:dv=/dev/ttyd2:br#19200:pa=none</programlisting>
	      </step>

	      <step>
		<para>Conectando a impressora com &man.tip.1;.  Digite:</para>

		<screen>&prompt.root; <userinput>tip printer</userinput></screen>

		<para>
			Se esse passo n&atilde;o funcionar, edite o arquivo
	<filename>/etc/remote</filename> e tente usando
		  <filename>/dev/cuaa<replaceable>N</replaceable></filename>
		  ao inv&eacute;s de 
		  <filename>/dev/ttyd<replaceable>N</replaceable></filename>.</para>
	      </step>

	      <step>
		<para>Envie dados para a impressora.  </para>

		<itemizedlist>
		  <listitem>
		    <para>Se a Impressora pode imprimir texto puro, use
		      &man.lptest.1;.  Digite:</para>

		    <screen>&prompt.user; <userinput>$lptest</userinput></screen>
		  </listitem>

		  <listitem>
		    <para>Se a impressora entende &postscript; ou outra
	liguagem, envie um pequeno programa para a impressora.  Digite o 
	programa linha-a-linha <emphasis>muito cuidadosamente</emphasis> 
	porque as teclas de edi&ccedil;&atilde;o podem ter significado 
	para a impressora.  Voc&ecirc; tamb&eacute;m pode precisar 
	digitar o caracter especial de fim-de-arquivo para a impressora
	reconhecer que recebeu todo o programa.  Para a impressora
	&postscript;, pressione <literal>CONTROL+D</literal>.</para>

		    <para>
		Alternativamente, voc&ecirc; pode colocar o programa 
	em um arquivo e digitar:
		    </para>

		    <screen>&prompt.user; <userinput>&gt;<replaceable>arquivo</replaceable></userinput></screen>

		    <para>Onde <replaceable>arquivo</replaceable> &eacute;
	o nome do arquivo que cont&eacute;m o programa.  Apos
	&man.tip.1; envia o arquivo, pressione a seguencia fim-de-arquivo.
		      </para>
		  </listitem>
		</itemizedlist>
	      </step>
	    </procedure>

	    <para>
		Voc&ecirc; deve ver algo impresso.  N&atilde;o se preocupe 
	se o texto n&atilde;o se parecer correto;  nos iremos consertar 
	isso mais tarde.
	      </para>
	  </sect5>
	</sect4>
      </sect3>

      <sect3 id="printing-printcap">
	<title>
		Habilitando o <foreignphrase>Spooler</foreignphrase>: 
		O Arquivo <filename>/etc/printcap</filename>
	  </title>

	<para>
		Nesse ponto, sua impressora deve estar conectada, seu kernel
	configurado e comunicando com a impressora, e voc&ecirc; teve sucesso
	ao enviar dados para a impressora.  Agora, nos estamos prontos para 
	configurar <application>LPD</application> para controlar o acesso
	a sua impressora.
	  </para>

	<para>
		Voc&ecirc; configura o <application>LPD</application> pela 
	edi&ccedil;&atilde;o do arquivo <filename>/etc/printcap</filename>.  
	  O sistema de <foreignphrase>spooling</foreignphrase> 
	<application>LPD</application> l&ecirc; este arquivo a cada vez que
	o <foreignphrase>spooler</foreignphrase> &eacute; necess&aacute;rio
	ent&atilde;o a atualiza&ccedil;&atilde;o do arquivo se reflete
	imediatamente na aplica&ccedil;&atilde;o.
	  </para>

	<indexterm>
    <primary>printers</primary>
    <secondary>capabilities</secondary>
  </indexterm>
	<para>
		O formato do arquivo &man.printcap.5; &eacute; direto.
	  Use o seu editor de texto favorito para realizar as mudan&ccedil;as
	no arquivo <filename>/etc/printcap</filename>.  O formato &eacute;
	identico ao outros arquivos de compatibilidades como os 
	  <filename>/usr/share/misc/termcap</filename> e
	  <filename>/etc/remote</filename>.  Para completa 
	informa&ccedil;&atilde;o sobre o formato, veja &man.cgetent.3;.</para>

	<para>
		A simples configura&ccedil;&atilde;o do 
	<foreignphrase>spooler</foreignphrase> consiste com em
	seguir os seguintes passos:
	  </para>

	<procedure>
	  <step>
	    <para>
		Escolha um nome (e algum apelido conveniente) para a sua
	impressora, e coloque-o no arquivo <filename>/etc/printcap</filename> 
	Veja a se&ccedil;&atilde;o 
	      <link linkend="printing-naming">Naming the Printer</link>
	para maiores informa&ccedil;&otilde;es sobre dar nomes.</para>
	  </step>
	  <indexterm><primary>header pages</primary></indexterm>
	  <step>
	    <para>
		Para desligar o cabe&ccedil;alho de p&aacute;ginas ( ele
	&eacute; habilitado por padr&atilde;o ) inserindo a chave
	<literal>sh</literal>; veja a se&ccedil;&atilde;o
	      <link linkend="printing-no-header-pages">
	Suprimindo o Cabe&ccedil;alho de P&aacute;ginas</link> para
	maiores informa&ccedil;&otilde;es.</para>
	  </step>

	  <step>
	    <para>
		Criando o diret&oacute;rio de 
	<foreignphrase>spooling</foreignphrase>, e especificando a sua 
	posi&ccedil;&atilde;o com a chave <literal>sd</literal>; veja a
	se&ccedil;&atilde;o <link linkend="printing-spooldir">
	Criando o Diret&oacute;rio de <foreignphrase>Spooling</foreignphrase>
	</link> para maiores informa&ccedil;&otilde;es
	</para>
	  </step>

	  <step>
	    <para>Veja a entrada <filename>/dev</filename> para usar
	a sua impressora, e coloque ela dentro do arquivo 
	<filename>/etc/printcap</filename> na chave <literal>lp</literal>;
	veja a se&ccedil;&atilde;o <link linkend="printing-device">
	Identifica&ccedil;&atilde;o do Dispositivo de Impress&atilde;o
	</link> para maiores informa&ccedil;&otilde;es.  Se a impressora
	estiver na porta serial, configure os parametros de 
	comunica&ccedil;&atilde;o use a chave the <literal>ms#</literal> 
	o qual &eacute; discutido na se&ccedil;&atilde;o 
	<link linkend="printing-commparam">
		Configurando os Parametros Comuni&ccedil;&atilde;o 
		do <foreignphrase>Spooler</foreignphrase> </link>.</para>
	  </step>

	  <step>
	    <para>
		Instalar um filtro de entrada para texto puro; veja
	a se&ccedil;&atilde;o <link linkend="printing-textfilter">
	Instalando o Filtro de Texto </link> para mais detalhes:
		</para>
	  </step>

	  <step>
	    <para>Testanto a configura&ccedil;&atilde;o, imprimindo alguma
	coisa com o comando &man.lpr.1;.  Mais detalhes est&aacute;o 
	dispon&iacute;veis em 
		<link linkend="printing-trying">
			<foreignphrase>Trying It Out</foreignphrase>
		</link> e
	      <link linkend="printing-troubleshooting">
			Localiza&ccedil;&atilde;o de Defeitos
		</link>
	      </para>
	  </step>
	</procedure>

	<note>
	  <para>Impressora baseada em linguagem, como impressoras 
	&postscript;, n&atilde;o podem imprimir diretamente texto puro.
	A simples configura&ccedil;&atilde;o descrita acima e descrita
	nas se&ccedil;&otilde;es seguintes assume que se voc&ecirc; 
	est&aacute; instalando uma impressora que voc&ecirc; s&oacute;
	ir&aacute; imprimir arquivos que ela possa entender.</para>
	</note>

	<para>
	Usu&aacute;rios geralmente tem espectativa que eles podem imprimir
	texto puro para qualquer impressora instaladas em seu sistema.  
	Programas que faz interface entre o <application>LPD</application> 
	e a impressora.
	Se voc&ecirc; est&aacute; instalando a impressora e gostaria de 
	habilitar os <foreignphrase>jobs</foreignphrase> na linguagem da 
	impressora <emphasis>e</emphasis> texto puro, voc&ecirc; ser&aacute;
	fortemente encorajado a adicionar mais um passo ao esquema acima;
	instalar um programa de convers&atilde;o de textopuro para &postscript;
	( ou outra linguagem de impressora ).  A se&ccedil;&atilde;o 
	entitulada como <link linkend="printing-advanced-if-conversion">
	Acomodando <foreignphrase>Jobs</foreignphrase> de Texto Puro
	em impressoras &postscript;</&ccedil;</link> mostra como faze-lo.
	</para>

	<sect4 id="printing-naming">
	  <title>Nomeando a Impressora</title>
	<para>
		O primeiro e mais simples passo &eacute; escolher o nome
	para a sua impressora.  Isso &eacute;; voc&ecirc; deve escolher um
	nome funcional e cuidadosamente escolhido, deve tamb&eacute;m escolher
	apelidos para a sua impressora.
	</para>

	<para>
		Pelo menos uma das impressoras especificadas no arquivo
	<filename>/etc/printcap</filename> deve ser um apelido para 
	<literal>lp</literal>.  Essa &eacute; o nome padr&atilde;o para
	a impressora.  Se o usu&aacute;rio n&atilde;o a vari&aacute;vel
	do ambiente <envar>PRINTER</envar> definida ou n&atilde;o 
	especificar o nome da impressora na linha de comando de qualquer
	aplicativo que use <application>LPD</application>, ent&atilde;o
	a impressora <literal>lp</literal>  ser&aacute; usada como
	padr&atilde;o.
	</para>

	<para>
		Tamb&eacute;m &eacute; uma pr&aacute;tica comum fazer
	um apelido para um nome que define completamente a impressora, 
	incluindo a marca e o modelo.
	</para>

	<para>
		Uma vez que voc&ecirc; j&aacute; tenha escolhido um nome e
	alguns apelidos, coloque eles no arquivo 
	<filename>/etc/printcap</filename>.  O nome da impressora deve estar 
	na columa mais a esquerda.  Separando cada apelido com uma barra 
	vertical (pipe) e terminar com o caracter : (dois pontos)
	</para>

	<para>
		O exemplo a seguir &eacute; um esqueleto para o arquivo 
	<filename>/etc/printcap</filename>  que define duas impressoras
	( uma Diablo 630 matricial e uma Panasonic KX-P4455 &postscript;
	que &eacute; uma impressora &agrave; laser):
	</para>

	  <programlisting>#
#  /etc/printcap for host rose
#
rattan|line|diablo|lp|Diablo 630 Line Printer:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:
	</programlisting>

	  <para>
		Nesse exemplo, a primeira impressora &eacute; chamada de 
	<literal>rattan</literal> e possui como apelido <literal>line</literal>,
	<literal>diablo</literal>, <literal>lp</literal>, e 
	<literal>Diablo 630 Line Printer</literal>.  Como ela tem como 
	apelido <literal>lp</literal>, ela &eacute; a impressora padr&atilde;o
	para o sistema.  E a segfunda e chamada de <literal>bamboo</literal>, 
	e tem como apelidos <literal>ps</literal>, <literal>PS</literal>,
	<literal>S</literal>, <literal>panasonic</literal>, e
	<literal>Panasonic KX-P4455 PostScript v51.4</literal>.</para>
	</sect4>

	<sect4 id="printing-no-header-pages">
	  <title>Suprimindo a P&aacute;gina de Cabe&ccedil;alho </title>
	  <indexterm>
      <primary>printing</primary>
      <secondary>header pages</secondary>
    </indexterm>

	  <para>para o sistema de spooling <application>LPD</application>
	por padr&atilde;o imprime uma 
	<emphasis>p&aacute;gina de cabe&ccedil;alho</emphasis> para cada
	<foreignphrase>job</foreignphrase>.  A p&aacute;gina de 
	cabe&ccedil;alho cont&eacute;m o nome do usu&aacute;rio que pediu
	o servi&ccedil;o, a m&aacute;quina de onde o pedido originou, e o
	nome do <foreignphrase>job</foreignphrase>, em letras grandes.  
	Para testes iremos desativar a p&aacute;gina de cabe&ccedil;alho.
	</para>
	 <para>
		Para desabilitar a p&aacute;gina de cabe&ccedil;alho, 
	adicione a entrada <literal>sh</literal> no arquivo
	<filename>/etc/printcap</filename>.  Segue um exemplo do arquivo
	<filename>/etc/printcap</filename> com essa op&ccedil;&atilde;o 
	<literal>sh</literal> desabilitada.
	</para>

	  <programlisting>#
#  /etc/printcap for host rose - no header pages anywhere
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:</programlisting>

	  <para>
		Note como usamos o correto formato: A primeira linha inicia
	na columa mais &agrave; esquerda, e as linhas subseguentes s&atilde;o
	alinhadas com uma caracter TAB simples.  Cada linha, exceto a 
	ultima, termina com uma barra invertida (\).
	</para>
	</sect4>

	<sect4 id="printing-spooldir">
	  <title>Criando o Diret&oacute;rio de Spooling</title>
	  <indexterm><primary>printer spool</primary></indexterm>
	  <indexterm><primary>print <foreignphrase>jobs</foreignphrase></primary></indexterm>

	  <para>
		O pr&oacute;ximo passo na configura&ccedil;&atilde;o
	simples do <foreignphrase>spooler</foreignphrase>  &eacute; criar
	o <emphasis>diret&oacute;rio de 
	<foreignphrase>spooling</foreignphrase></emphasis>, &eacute; o
	diret&oacute;rio onde o <foreignphrase>jobs</foreignphrase> 
	mant&eacute;m o que ser&aacute; impresso, e outros arquivos de
	suporte do <foreignphrase>spooler</foreignphrase>.
	</para>

	  <para>
		Por causa da varia&ccedil;&atilde;o natural do 
	diret&oacute;rio de <foreignphrase>spooling</foreignphrase>, ele 
	&eacute; colocado sob o diret&oacute;rio 
	<filename>/var/spool</filename>.  N&atilde;o &eacute; 
	necess&aacute;rio realizar <foreignphrase>backups</foreignphrase>
	do conte&uacute;ido deste diret&oacute;rio.  Voc&ecirc; pode
	recria-lo com o comando &man.mkdir.1;.</para>

	  <para>Ele tamb&eacute;m cria o diret&oacute;rio com o nome 
	identico da impressora, como &eacute; mostrado abaixo:
	    </para>

	  <screen>&prompt.root; <userinput>mkdir /var/spool/<replaceable>printer-name</replaceable></userinput></screen>

	  <para>
		Entretando, se voc&ecirc; possui uma grande quantidade de
	impressoras na sua rede, voc&ecirc; gostaria de colocar o 
	diret&oacute;rio de <foreignphrase>spooling</foreignphrase> em 
	um &uacute;nico diret&oacute;rio que voc&ecirc; reservou para a 
	impress&atilde;o com <application>LPD</application>.  N&oacute;s 
	iremos fazer isso com exemplo de duas impressoras
	<literal>rattan</literal> e <literal>bamboo</literal>:</para>

	  <screen>&prompt.root; <userinput>mkdir /var/spool/lpd</userinput>
&prompt.root; <userinput>mkdir /var/spool/lpd/rattan</userinput>
&prompt.root; <userinput>mkdir /var/spool/lpd/bamboo</userinput></screen>

	  <note>
	    <para>
		Se est&aacute; preocupado com a privacidade dos 
	<foreignphrase>jobs</foreignphrase> que seus usuarios es&atilde;o 
	imprimindo, voc&ecirc; talvez queira proteger o diret&oacute;rio
	de <foreignphrase>spooling</foreignphrase> que n&atilde;o teria
	acesso p&uacute;blico.  O diret&oacute;rio de 
	<foreignphrase>spooling</foreignphrase> deve ter como dono o
	usu&aacute;rio e grupo deamon e dever&aacute; ser acessivel para 
	leitura, escrita e execu&ccedil;&atilde;o e para mais ninguem.
	  Veja o pr&oacute;ximo exemplo onde ser&aacute; feito isso:
	</para>

	    <screen>&prompt.root; <userinput>chown daemon:daemon /var/spool/lpd/rattan</userinput>
&prompt.root; <userinput>chown daemon:daemon /var/spool/lpd/bamboo</userinput>
&prompt.root; <userinput>chmod 770 /var/spool/lpd/rattan</userinput>
&prompt.root; <userinput>chmod 770 /var/spool/lpd/bamboo</userinput></screen>
	  </note>

	  <para>
		Finalmnente, voc&ecirc; dever&aacute; informar ao
	<application>LPD</application> sobre este diretorio, usando
	o arquivo <filename>/etc/printcap</filename>.  Voc&ecirc; especifica
	o nome do diret&oacute;rio de <foreignphrase>spooling</foreignphrase>
	com a op&ccedil;&atilde;o <literal>sd</literal>:
	</para>

	  <programlisting>#
#  /etc/printcap for host rose - added spooling directories
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:</programlisting>

	  <para>
		Note que o nome da impressora inicia na primeira coluna 
	mas as outras entradas dever&aacute; ser alinhada com um caracter
	TAB e cada linha dever&aacute; terminar com uma barra invertida (\)
	</para>

	  <para>
		Se voc&ecirc; n&atilde;o especificar o diret&oacute;rio de 
	<foreignphrase>spooling</foreignphrase> com <literal>sd</literal>, 
	o sistema de <foreignphrase>spooling</foreignphrase> ir&aacute;
	usar o diret&oacute;rio padr&atilde;o
	<filename>/var/spool/lpd</filename>
	</para>
	</sect4>

	<sect4 id="printing-device">
	<title>Identificando o Dispositivo de Impress&atilde;o </title>

	  <para>
		Na se&ccedil;&atilde;o 
	<link linkend="printing-dev-ports">Adicionando Entradas no
	<filename>/dev</filename>Para Portas</link>, nos identificamos qual
	entrada no diret&oacute;rio <filename>/dev</filename> o FreeBSD 
	ir&aacute; usar para comunicar com a impressora.  Agora, n&oacute;s
	iremos informar ao <application>LPD</application> qual porta
	usar.  Quando o sistema de <foreignphrase>spooling</foreignphrase>
	tem um <foreignphrase>job</foreignphrase> para imprimir, ele 
	ir&aacute; abrir o dispositivo especificado no suporte do 
	programa de filtro ( o qual &eacute; respons&aacute;vel por
	passar os dados para a impressora).
	</para>

	  <para>
		Listar as entradas do diret&oacute;rio
	 <filename>/dev</filename>  no arquivo 
	<filename>/etc/printcap</filename> usando a op&ccedil;&atilde;o
	<literal>lp</literal>.</para>

	  <para>
		Em nosso exemplo executado, n&oacute;s assumimos que a 
	impressora <literal>rattan</literal> est&aacute; na primeira 
	porta paralela e a impressora <literal>bamboo</literal> est&aacute;
	na sexta porta serial; Segue aqui as adi&ccedil;&otilde;ess ao 
	arquivo <filename>/etc/printcap</filename>:</para>

	  <programlisting>#
#  /etc/printcap for host rose - identified what devices to use
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:\
        :lp=/dev/lpt0:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:\
        :lp=/dev/ttyd5:
	</programlisting>

	  <para>
		Se voc&ecirc;  n&atilde;o especificar a op&ccedil;&atilde;o
	<literal>lp</literal> para a impressora em seu arquivo
	<filename>/etc/printcap</filename>, o <application>LPD</application> 
	ir&aacute; utilizar <filename>/dev/lp</filename> como padr&atilde;o.
	A entrada <filename>/dev/lp</filename> n&atilde;o mais existe no
	FreeBSD.
	</para>

	<para>
		Se a impressora que voc&ecirc; est&aacute; instalando &eacute;
	conectada na porta paralela, pule para a se&ccedil;&atilde;o
	entitulada como <link linkend="printing-textfilter">INstalando
	o Filtro de exto </link>.  Caso contr&aacute;rio, siga as 
	instru&ccedil;&otilde;es na pr&oacute;xima se&ccedil;&atilde;o
	</para>
	</sect4>

	<sect4 id="printing-commparam">
	<title>
		Configurando Parametros de Comunica&ccedil;&atilde;o do 
		<foreignphrase>spooling</foreignphrase>
	</title>
	<indexterm>
		<primary>printers</primary>
		<secondary>serial</secondary>
	</indexterm>

	<para>
		Para impressoras na porta serial, no 
	<application>LPD</application> podemos ajustar a taxa de bps,
	a paridade, e outros parametros da porta serial com o apoio do 
	programa de filtro que envia dados para a impressora.  Isso pode 
	ser uma grande vantagem deste que:
	</para>

	  <itemizedlist>
	    <listitem>
		<para>
			Permite tentar diferentes configura&ccedil;&otilde;es
	de parametros para a comunica&ccedil;&atilde;o, simplesmente 
	editando o arquivo <filename>/etc/printcap</filename>; voc&ecirc; 
	n&atilde;o precisa recompilar o programa de filtro.
		</para>
	    </listitem>

	    <listitem>
	      <para>
			Ele habilita o sistema de 
	<foreignphrase>spooling</foreignphrase> para usar o mesmo programa
	de filtro para multiplas impressoras, as quais t&ecirc;m diferentes
	configura&ccedil;&otilde;ess de comunica&ccedil;&atilde;o serial.
		</para>
	    </listitem>
	  </itemizedlist>

	<para>
		O seguinte arquivo <filename>/etc/printcap</filename>
	habilidade de controlar os par&acirc;metro da comunica&ccedil;&atilde;o
	serial do dispositivos listados na habilidade <literal>lp</literal>:
	</para>
	  <variablelist>
	    <varlistentry>
	      <term><literal>br#<replaceable>bps-rate</replaceable></literal></term>

	      <listitem>
		<para>
			Configura a velocidade de comunica&ccedil;&atilde;o
	com o dispositivo para <replaceable>bps-rate</replaceable>, onde
	<replaceable>bps-rate</replaceable> pode ser 50, 75, 110, 134, 150, 
	200, 300, 600, 1200, 1800, 2400, 4800, 9600, 19200, 38400, 57600, 
	ou 115200 bits-per-second.
		</para>
	      </listitem>
	    </varlistentry>

	    <varlistentry>
		<term>
		<literal>ms#<replaceable>stty-mode</replaceable></literal>
		</term>

	      <listitem>
		<para>
			Configura a op&ccedil;&atilde;o do dispositivo
	terminal depois de aberto o dispositivo.  &man.stty.1; explica
	a op&ccedil;&otilde;es dispon&iacute;veis
		</para>
	      </listitem>
	    </varlistentry>
	  </variablelist>

	  <para>Quando o  <application>LPD</application> abre o dispositivo
	especificado pela op&ccedil;&atilde;o <literal>lp</literal>, ele
	configuira as caracter&iacute;sticas do dispositivos para
	aquelas especificadas na op&ccedil;&atilde;o <literal>ms#</literal>.
	De particular interesse podemos destacar os seguintes 
	modos <literal>parenb</literal>, <literal>parodd</literal>, 
	<literal>cs5</literal>, <literal>cs6</literal>, <literal>cs7</literal>,
	<literal>cs8</literal>, <literal>cstopb</literal>,
	 <literal>crtscts</literal>, e <literal>ixon</literal> os quais 
	ser&atilde;o explicados na p&aacute;gina do manual &man.stty.1;
	</para>

	<para>
		Vamos mostra um exemplo de configura&ccedil;&atilde;o de
	uma impressora serial conectada na sexta porta serial.  Nos iremos
	configurar com a taxa de bps para 38400.  Para o modo n&oacute;s
	iremos configurar sem paridade com a op&ccedil;&atilde;o
	<literal>-parenb</literal>, caracteres de 8-bit <literal>cs8</literal>,
	sem controle de modem <literal>clocal</literal> e <foreignphrase>
	hardware flow control</foreignphrase> <literal>crtscts</literal>:
	</para>

	  <programlisting>bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:</programlisting>
	</sect4>

	<sect4 id="printing-textfilter">
	  <title>Instalando um Filtro de Texto</title>
	  <indexterm>
	    <primary>printing</primary>
	    <secondary>filters</secondary>
	  </indexterm>

	<para>
		N&oacute;s j&aacute; estamos prontos para informar ao
	<application>LPD</application> qual o filtro de texto que queremos
	utilizar para enviar <foreignphrase>jobs</foreignphrase> para a
	impressora.  Um <emphasis>filtro de texto</emphasis>, tamb&eacute;m
	conhecido como <emphasis>filtro de entrada</emphasis>, &eacute; um
	programam que &eacute; execudado pelo <application>LPD</application> 
	quando um tem <foreignphrase>job</foreignphrase> para ser impresso.
	Quando <application>LPD</application> executa o filtro de texto para
	a impressora,  ele configura a entrada padr&atilde;o do filtro para
	<foreignphrase>job</foreignphrase> a ser impresso, e a sua sa&iacute;da
	padr&atilde;o &eacute; enviada para a impressora especificada em 
	<literal>lp</literal>.  O filtro est&aacute; pronto para receber
	o <foreignphrase>job</foreignphrase> pela entrada padr&atilde;o, 
	executando a necess&aacute;ria tradu&ccedil;&atilde;o para a 
	impressora, e escrevendo o resultado na sa&iacute;da padr&atilde;o,
	a qual ser&aacute; enviada &agrave; impressora.  Para maiores 
	informa&ccedil;&otilde;es, consulte a se&ccedil;&atilde;o de 
	<link linkend="printing-advanced-filters">Filters</link>
	</para>
	<para>
		Para essa configura&ccedil;&atilde;o simples, o filtro pode ser
	um pequeno <foreignphrase>shell script</foreignphrase> que execute 
	o comando <command>/bin/cat</command> para enviar o
	<foreignphrase>job</foreignphrase> para a impressora.  O FreeBSD
	vem com um outro filtro chamado de <filename>lpf</filename> 
	pega os caracteres de <foreignphrase>backspacing</foreignphrase>
	e sublinhados que algumas imporessoras n&atilde;o conseguem 
	manipula-los, voc&ecirc; pode ent&atilde;o utilizar outro
	programa de filtro que desejar.  O filtro <command>lpf</command>
	e descrito em detalhes na sec&ccedil;&atilde;o entitulada como
	<link linkend="printing-advanced-lpf">lpf: Um Filtro de Texto</link>.
	</para>

	  <para>
		Primeiro, iremos criar um 
	<foreignphrase>shell script</foreignphrase> chamado de 
	<filename>/usr/local/libexec/if-simple</filename> para ser um 
	filtro de texto simples.  Coloque o seguinte texto dentro dele,
	utilizando o seu editor de texto favorito:
	</para>

	  <programlisting>#!/bin/sh
#
# if-simple - Simple text input filter for lpd
# Installed in /usr/local/libexec/if-simple
#
# Simply copies stdin to stdout.  Ignores all filter arguments.

/bin/cat &amp;&amp; exit 0
exit 2</programlisting>

	<para>
		Deixe o arquivo com permiss&atilde;o de execu&ccedil;&atilde;o
	</para>

	  <screen>&prompt.root; <userinput>chmod 555 /usr/local/libexec/if-simple</userinput></screen>

	<para>
		E ent&atilde;o diga ao <application>LPD</application>
	que utilize esse filtro, especificando a op&ccedil;&atilde;o
	<literal>if</literal> dentro do arquivo
	<filename>/etc/printcap</filename>.  N&oacute;s iremos adicionar
	duas impressoras como no exemplo do
	<filename>/etc/printcap</filename>:</para>

	  <programlisting>#
#  /etc/printcap for host rose - added text filter
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:\ :lp=/dev/lpt0:\
        :if=/usr/local/libexec/if-simple:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:\
        :if=/usr/local/libexec/if-simple:</programlisting>
	</sect4>

	<sect4>
	  <title>Ligando o <application>LPD</application></title>

	<para>
		&man.lpd.8; Ele &eacute; executado atraves do arquivo
	<filename>/etc/rc</filename>, controlado pela vari&aacute;vel
	<literal>lpd_enable</literal>.  O valor padr&atilde;o para esta
	vari&aacute;vel &eacute; <literal>NO</literal>.  Se voc&ecirc; ainda
	n&atilde;o o fez, adicione a linha
	</para>

	  <programlisting>lpd_enable="YES"</programlisting>

	<para>
		ao arquivo <filename>/etc/rc.conf</filename>, e ent&atilde;o
	reinicie a sua m&aacute;quina, ou et&atilde;o execute simplesmente
	&man.lpd.8;.
	</para>

	  <screen>&prompt.root; <userinput>lpd</userinput></screen>
	</sect4>
	
	<sect4 id="printing-trying">
	  <title>Tente Isso</title>

	<para>
		voc&ecirc; chegou ao fim da configura&ccedil;&atilde;o
	simples do <application>LPD</application>.  Infelismente, ainda
	n&atilde;o &eacute; hora de <foreignphrase>cantar vit&oacute;ria
	</foreignphrase>, uma vez que ainda n&atilde;o testamos a 
	configura&ccedil;&atilde;o e corre&ccedil;&atilde;o de algum
	problema.  Para testar a configura&ccedil;&atilde;o, tente
	imprimir algo.  Para imprimir com o sistema 
	<application>LPD</application>, voc&ecirc; usa o comando
	&man.lpr.1;, o oqual envia o <foreignphrase>job</foreignphrase>
	para a impressora.
	</para>
	<para>
		Voc&ecirc; pode combinar &man.lpr.1; com o programa
	&man.lptest.1;, introduzido na sec&ccedil;&atilde;o
	<link linkend="printing-testing">Verificando a 
	comunica&ccedil;&atilde;o com a Impressora </link> para gerar 
	texto para texte.
	</para>
	<para>
		<emphasis>
		Para testar a configura&ccedil;&atilde;o simples do
	<application>LPD</application>
		</emphasis>
	</para>

	<para>Digite:</para>

	  <screen>&prompt.root; <userinput>lptest 20 5 | lpr -P<replaceable>Nome-da-impressora</replaceable></userinput></screen>
	  
	<para>
		Onde <replaceable>Nome-da-impressora</replaceable> &eacute; 
	o nome dado &agrave; impressora (ou um de seus apelidos) no arquivo
	<filename>/etc/printcap</filename>.  Para testar a impressora
	padr&atilde;o do sistema, digite &man.lpr.1; sem op&ccedil;&otilde;es
	<option>-P</option>.  Novamente, se voc&ecirc; est&aacute; testando
	a impressora que espera &postscript;, utilize um programa que
	gere uma sa&iacute;da &postscript; ao inv&eacute;s de utilizar
	o &man.lptest.1;.  Voc&ecirc; pode colocar um c&oacute;digo 
	&postscript; dentro de um arquivo e digitar <command>lpr 
	    <replaceable>nome do arquivo</replaceable></command>.
	</para>

	<para>
		Para uma impressora &postscript;, voc&ecirc; deve saber
	qual foi os dados enviados do programa para a impressora, para saber
	se este foi impressor corretamente.  Se voc&ecirc; estiver usando
	o &man.lptest.1;, voc&ecirc; deve ter como resultado algo
	semelhante &agrave;:
	</para>

	  <programlisting>!"#$%&amp;'()*+,-./01234
"#$%&amp;'()*+,-./012345
#$%&amp;'()*+,-./0123456
$%&amp;'()*+,-./01234567
%&amp;'()*+,-./012345678</programlisting>

	<para>
		Para facilitar o teste de impress&atilde;o, tente fazer a
	transfer&ecirc;ncia de um arquivo grande ( para a linguagem
	da impressora ) ou executar &man.lptest.1; com diferentes argumentos.
	  Por exemplo, <command>lptest 80 60</command> ir&aacute; produzir
	60 linhas com 80 caracteres cada.
	</para>

	<para>
		Se a impressora n&atilde;o funcionar, veja a 
	se&ccedil;&atilde;o entitulada 
	<link 
		linkend="printing-troubleshooting">
		Localiza&ccedil;&atilde;o de  Defeitos
	</link>
	</para>
	</sect4>
      </sect3>
    </sect2>
  </sect1>
  
  <sect1 id="printing-advanced">
	<title>
		Configura&ccedil;&atilde;o Avan&ccedil;ada de Impressora
	</title>
    
	<para>
		Essa se&ccedil;&atilde;o descreve filtros para formatos
	especiais de impress&atilde;o de arquivos, p&aacute;ginas de 
	cabe&ccedil;a&ccedil;lho, impress&atilde;o atraves da rede, e 
	restringir acesso ao uso da impressora.
	</para>

    <sect2 id="printing-advanced-filter-intro">
      <title>Filtros</title>
      <indexterm>
	<primary>printing</primary>
	<secondary>filters</secondary>
      </indexterm>
      
	<para>
		Atraves do <application>LPD</application> podemos acessar
	o protocolos de rede, filas, acesso de controle, e outros aspectos
	da impres&atilde;o, a maioria dos trabalhos <emphasis>reais</emphasis>
        ocorre nos <emphasis>filters</emphasis>.  Os filtros s&atilde;o
	programas que se comunicam com a impressora e manipula as 
	dependencias do dispositivo e necessidades especiais.  Na 
	se&ccedil;&atilde;o configira&ccedil;&atilde;o simples da impressora, 
	n&oacute;s instalamos um filtro&mdash;an texto puro extremamente
	simples que deve funcionar na maioria das impressoras 
	( se&ccedil;&atilde;o <link
          linkend="printing-textfilter">Instalando o Filtro de Texto
          </link>).
	</para>
          
	<para>
		Entretando, se quizermos tirar vantagens de convers&atilde;o
	de formatos, relat&oacute;rio de uso da impressora, especificar
	uma configura&ccedil;&atilde;o especial da impressora, entre outras 
	coisas, vo&ecirc; dever&aacute; compreender como funciona os filtros.
	  Ultimamente a responsabidade do filtro &eacute; tratar desses
	aspectos.  E a m&aacute; not&iacute;cia &eacute; que a maior
	parte do tempo <emphasis>voc&ecirc;</emphasis> ter&aacute; que 
	providenciar os seus pr&oacute;prios filtros.  A boa not&iacute;cia
	&eacute; que muitos j&aacute; es&atilde;o dispon&iacute;veis; e se
	n&atilde;o encontrar, voc&ecirc; facilmente poder&aacute; escreve-los.
	</para>
          
	<para>
		Tamb&eacute;m, o FreeBSD vem com um 
        <filename>/usr/libexec/lpr/lpf</filename>, que funciona com a maioria
	das impressoras que podem imprimir texto puro.  
		( Ele that works with many
        printers that can print plain text.  (It handles backspacing and tabs
        in the file, and does accounting, but that is about all it does.)
	Existem v&aacute;rios filtros e componentes de filtro na 
	cole&ccedil;&atilde;o de Ports do FessBSD.
	</para>
          
	<para>
		Aqui est&aacute; o que voc&ecirc; ir&aacute; encontrar
	nessa se&ccedil;&atilde;o:
	</para>
      
      <itemizedlist>
        <listitem>
		<para>
			Se&ccedil;&atilde;o
	 <link linkend="printing-advanced-filters">Como os Filtros 
	funcionam</link>, tenta dar um panorama geral da fun&ccedil;&atilde;o
	de um filtro no processo de impress&atilde;o.  Voc&ecirc; devera ler 
	esta se&ccedil;&atilde;opara compreender o que acontece <quote>
	por baixo dos panos</quote> quando <application>LPD</application> 
	utiliza os filtros.  Esse conhecimento poder&aacute; ajuda-lo
	antecipadamente e livra-lo dos defeitos que poderam encontrar 
	na instala&ccedil;&atilde;o de v&aacute;rios filtros para suas
	impressoras.
		</para>
        </listitem>
              
        <listitem>
		<para>
			<application>LPD</application> Espera que cada
	impressora esteja habilidada para imprimir texto puro por 
	padr&atilde;o.  &Eacute; um problema presente para impressoras
	&postscript; ( ou outra impressora baseada em liguagem) a qual 
	n&atilde;o pode imprimir diretamente texto puro.  A se&ccedil;&atilde;o
	<link linkend="printing-advanced-if-conversion">
	Acomodando Impress&atilde;o em Texto Puro em Impressoras
	&postscript;</link> mostra &agrave; voc&ecirc; como proceder
	para resolver este problema.  Voc&ecirc; deve ler essa 
	se&ccedil;&atilde;o caso voc&ecirc; tenha uma impressora &postscript;
		</para>
        </listitem>

        <listitem>
		<para>
			&postscript; &eacute; o formato mais comum para a
	maioria dos programas.  Mesmo que algumas pessoas (incluindo eu
	mesmo) escreve c&oacute;digo &postscript; diretamente, mas impressoras
	&postscript; s&atilde;o caras.  Na se&ccedil;&atilde;o
        <link linkend="printing-advanced-ps">Simulando &postscript; em 
	impressora n&atilde;o &postscript;</link> informa como voc&ecirc;
	pode modificar os filtros para aceitar e imprimir dados &postscript;
	em uma impressora <emphasis>n&atilde;o &postscript;</emphasis>.  
	voc&ecirc; dever&aacute; ler essa se&ccedil;&atilde;o se voc&ecirc; 
	n&atilde;o possiuir uma impressora &postscript;.
		</para>
        </listitem>
              
        <listitem>
          <para>A se&ccedil;&atilde;o <link
              linkend="printing-advanced-convfilters">Filtro de 
	Convers&atilde;o </link> informa sobre o meio que voc&ecirc; pode
	automatizar a convers&atilde;o especificando o formato do arquivo,
	tais como gr&aacute;fico ou dados de <foreignphrase>typesetting
	</foreignphrase>, para formatos que a impressora possa endenter.
	  Depos de lida esta se&ccedil;&atilde;o, voc&ecirc; est&aacute; 
	apto a configurar sua impressora para que os usu&aacute;rios 
	possam digitar <command>lpr -t</command> para imprimit dados
	de troff, ou <command>lpr -d</command> para imprimir dados &tex; 
	DVI data, ou <command>lpr -v</command> para imprimir dados de 
	imagem rasterisadas, e por ai vai, recomendamos a leitura
	desta se&ccedil;&atilde;o.
		</para>
        </listitem>
              
        <listitem>
		<para>
			A se&ccedil;&atilde;o 
	<link linkend="printing-advanced-of"> Filtros de sa&iacute;da </link> 
	Informa sobre o uso n&atilde;o comum dos filtros de sa&iacute;da
	do <application>LPD</application>. A menos que voc&ecirc; esteja
	imprimindo p&aacute;ginas de cabe&ccedil;alho ( veja <link
	linkend="printing-advanced-header-pages">P&aacute;ginas de
	cabe&ccedil;alho</link>), voc&ecirc; provavelmente poder&aacute;
	pular toda esta se&ccedil;&atilde;o.
		</para>
        </listitem>

        <listitem>
		<para>
		A Se&ccedil;&atilde;o 
	<link linkend="printing-advanced-lpf">lpf: um filtro de texto </link> 
	descreve o <command>lpf</command>, De maneira completa se o filtro
	de texto simples para impressoras matriciais ( e impressoras laser
	que funcionam como matriciais) que vem com o FreeBSD.  Se voc&ecirc;
	necessita de um meio r&aacute;pido para fazer a impressora 
	funcionar com texto puro, ou se voce tem uma impressora a qual emite
	fuma&ccedil;a quando ela imprime caracteres <foreignphrase>
	backspace</foreignphrase>, voc&ecirc; deve definitivamente considerar
	<command>lpf</command>.
		</para>
        </listitem>
      </itemizedlist>
      
      <sect3 id="printing-advanced-filters">
        <title>Como os Filtros Funcionam</title>

        <para>
		Como mencionado antes, o filtro &eacute; um programa 
	execut&aacute;vel inicializado pelo <application>LPD</application> 
	para manipular a comunica&ccedil;&atilde;o dependente da impressora.
	</para>
            
        <para>
		Quando o <application>LPD</application> precisa imprimir um
	arquivo no <foreignphrase>job</foreignphrase>, ele inicializa o filtro.
	Ele configura a entrada padr&atilde;o do filtro para o arquivo a ser 
	impresso, e a sa&iacute;da padr&atilde;o do filtro e redireciona as 
	sa&iacute;das padr&atilde;o e a sa&iacute;da padr&atilde;o de erro para
	o arquivo de log de erros ( especificado na op&ccedil;&atilde;o
        <literal>lf</literal> no arquivo <filename>/etc/printcap</filename>, ou
          <filename>/dev/console</filename> por padr&atilde;o).
	</para>
            
        <indexterm>
          <primary><command>troff</command></primary>
        </indexterm>
        <para>
		A escolha do filtro inicializado pelo <application>LPD</application> 
	depende do arquimento utilizado no arquivo <filename>/etc/printcap</filename> 
	e qual foi o argumento que o usu&aacute;rio especificou no comando
	de linha &man.lpr.1;.  Por exemplo, se o usu&aacute;rio digita o seguinte 
	comando: <command>lpr -t</command>, o <application>LPD</application> ir&aacute;
	inicializar o filtro troff, que &eacute; o argumento da op&ccedil;&atilde;o
        <literal>tf</literal> para a impressora padr&atilde;o.
	Se o usu&aacute;rio quizer impreimir um texto puro, ele dever&aacute; 
	inicializar o filtro <literal>if</literal> ( isso &eacute; muito comum,
	veja em <link
            linkend="printing-advanced-of">Output Filters</link> para maiores 
	detalhes).
	</para>

        <para>
		Existem tres tipos de filtros que voc&ecirc; pode especificar
	no arquivo <filename>/etc/printcap</filename>:
	</para>

        <itemizedlist>
          <listitem>
            	<para>
		O <emphasis>filtro de texto</emphasis>, erradamente chamado de 
   <emphasis>filtro de entrada</emphasis> na documenta&ccedil;&atilde;o 
	do <application>LPD</application>, ele manipula a impress&atilde;o de 
	texto puro. pense nele como um filtro padr&atilde;o para o
	<application>LPD</application>, ele espera que todas as impressoras, por 
	padr&atilde;o, estejam habilitadas a imprimir texto puro, e ela
	<foreignphrase>tabs</foreignphrase>, 
	em um ambiente aonde tem estat&iacute;sticas do uso da impressora,
	o filtro de texto tamb&eacute;m deve gerar a estat&iacute;stica sobre
	o que foi impresso, geralmente isto &eacute; feito contando o 
	n&uacute;mero de linhas impressas e comparando-as com o 
	n&uacute;mero de linhas que a impressora suporta.  O filtro de 
	texto &eacute; inicializado com a seguinte lista de argumentos:
		</para>

      <cmdsynopsis>
        	<command>nome-do-filtro</command>
				<arg>-c</arg>
				<arg choice="plain">-w<replaceable>largura</replaceable></arg>
				<arg choice="plain">-l<replaceable>comprimento</replaceable></arg>
				<arg choice="plain">-i<replaceable>indent</replaceable></arg>
				<arg choice="plain">-n <replaceable>login</replaceable></arg>
				<arg choice="plain">-h <replaceable>host</replaceable></arg>
				<arg choice="plain"><replaceable>arquivo-estatistica</replaceable>
				</arg>
		</cmdsynopsis>

              onde
              
              <variablelist>
                <varlistentry>
                  <term><option>-c</option></term>

                  <listitem>
							<para>
								&Eacute; usado quando o 
								<foreignphrase>job</foreignphrase> &eacute; enviado
								com o comando
								<command>lpr -l</command>
							</para>
                  </listitem>
                </varlistentry>
                
                <varlistentry>
                  <term><replaceable>largura</replaceable></term>
                  
                  <listitem>
                    <para>
							&Eacute; o valor da op&ccedil;&atilde;o
							<literal>pw</literal> (largura da p&aacute;gina)
							especificado no arquivo
                     <filename>/etc/printcap</filename>, O padr&atilde;o
							&eacute;  132</para>
                  </listitem>
                </varlistentry>
                
                <varlistentry>
                  <term><replaceable>comprimento</replaceable></term>
                  
                  <listitem>
                    <para>
								&Eacute; o valor da op&ccedil;&atilde;o
							<literal>pl</literal> ( comprimento da p&aacute;gina),
							o padr&atilde;o &eacute; 66
							</para>
                  </listitem>
                </varlistentry>
                
                <varlistentry>
                  <term><replaceable>indent</replaceable></term>
                  
                  <listitem>
                    <para>
								&Eacute; a quantidade de 
							<foreignphrase>identa&ccedil;&atilde;o</foreignphrase>
							fornecido pelo comando <command>lpr -i</command>, 
							o padr&atilde;o &eacute; 0
							</para>
                  </listitem>
                </varlistentry>
                
                <varlistentry>
                  <term><replaceable>login</replaceable></term>
                  
                  <listitem>
                    <para>
								&Eacute; o nome da conta de usu&aacute;rio para 
							pode imprimir o arquivo
							</para>
                  </listitem>
                </varlistentry>
                
                <varlistentry>
                  <term><replaceable>host</replaceable></term>
                  
                  <listitem>
                    <para>
								&Eacute; o nome do computador para onde a 
							impress&atilde;o ser&aacute; envida.
							</para>
                  </listitem>
                </varlistentry>
                
                <varlistentry>
                  <term><replaceable>arquivo-estatistica</replaceable></term>
                  
                  <listitem>
								&Eacute; o nome do arquivo onde ser&aacute; armazenada
							a estat&iacute;stica da impress&atilde;o, este valor 
							&eacute; atribuido &agrave; op&ccedil;&atilde;o
                    <literal>af</literal>.
							</para>
                  </listitem>
                </varlistentry>
              </variablelist>
            </para>
          </listitem>

	  <indexterm>
      <primary>printing</primary>
      <secondary>filters</secondary>
    </indexterm>          
          <listitem>
            <para>
					Um <emphasis>filtro de convers&atilde;o</emphasis> 
				converte um fromato especifico do arquivo em outro que a impressora
				pode compreender e tranformar em p&aacute;ginas impresas.  Por
				exemplo, o formato ditroff typesetting n&atilde;o pode ser 
				impresso diretamento, mas voc&ecirc; pode instalar um filtro
				conversor para o formato que a impressora possa imprimir
				corretamente.  A se&ccedil;&atilde;o <link
				linkend="printing-advanced-convfilters">Filtros Conversores
				</link> mostra como faze-los.  Filtros de convers&atilde;o que 
				tamb&eacute;m necessite de estat&iacute;sticas, voc&ecirc; 
				precisa habilitar a estat&iacute;stica na impressora.
				Filtros de convers&atilde;o s&atilde;o inicializados
				com os seguintes argumentos:

				<cmdsynopsis>
					<command>nome-do-filtro</command>
						<arg
							choice="plain">-x
								<replaceable>largura do pixel</replaceable>
						</arg>
						<arg 
							choice="plain">-y
								<replaceable>altura do pixel</replaceable>
						</arg>
						<arg 
							choice="plain">-n <replaceable>login</replaceable>
						</arg>
						<arg 
							choice="plain">-h <replaceable>host</replaceable>
						</arg>
						<arg 
							choice="plain"><replaceable>arquivo-estatistca</replaceable>
						</arg>
				</cmdsynopsis>

            Onde <replaceable>largura do pixel</replaceable> &eacute; o 
				valor da op&ccedil;&atilde;o 
				<literal>px</literal> (valor padr&atilde;o &eacute; 0) e 
				<replaceable>altura do pixel</replaceable> &eacute; o valor 
				da op&ccedil;&atilde;o
				<literal>py</literal> ( o valor padr&atilde;o &eacute; 0).
			</para>
          </listitem>
          
          <listitem>
            <para>
					O <emphasis>filtro de sa&iacute;da</emphasis> &eacute; usado
				somente se n&atilde;o existir um filtro de texto, ou se o 
				cabe&ccedil;alho das p&aacute;ginas estiver habilitador.  Em
				minha experi&ecirc;ncia, o filtro de sa&iacute;da s&atilde;o
				raramente utilizado.  Na se&ccedil;&atilde;o
              <link
                linkend="printing-advanced-of">Filtros de Sa&iacute;da</link> 
				mostra mais detalhes.  Existem somente dois argumentos para
				os filtros de sa&iacute;da,. s&atilde;o eles:

              <cmdsynopsis>
                <command>nome do filtro</command>
					<arg 
						choice="plain">-w<replaceable>largura</replaceable>
					</arg>
					<arg 
						choice="plain">-l<replaceable>comprimento</replaceable>
					</arg>
              </cmdsynopsis>

              os quais s&atilde;o identicos aos argumetos dos filtros
					de texto <option>-w</option> e <option>-l</option>.
				</para>
          </listitem>
        </itemizedlist>

			<para>
				Os filtros devem tamb&eacute;m <emphasis>sair</emphasis> com
			os seguintes status:
			</para>
            
        <variablelist>
          <varlistentry>
            <term>exit 0</term>

            <listitem>
              <para>
						Se o filtro obteve sucesso ao imprimir o arquivo.
					</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term>exit 1</term>
            
            <listitem>
					<para>
						Se o filtro falhou ao imprimir o arquivo, mas aguarda o
				<application>LPD</application> para tentar imprimir outra
				vez.
            <application>LPD</application> ir&aacute; reiniciar o filtro
				se ele sair com esse status.
					</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term>exit 2</term>
            
            <listitem>
              <para>
						Se o filtro falhar na impress&atilde;o do arquivo e 
					n&atilde;o ir&aacute; aguardar o
					<application>LPD</application> para tentar denovo.  
					O <application>LPD</application> ir&aacute; jogar fora
					o arquivo.
					</para>
            </listitem>
          </varlistentry>
        </variablelist>

        <para>
				O filtro de texto que vem com a vers&atilde;o do FreeBSD,
          <filename>/usr/libexec/lpr/lpf</filename>, tira vantagens dos
			argumentos de largura e comprimento para determinar quando enviar
			um caracter de alimenta&ccedil;&atilde;o de folha (
			<foreignphrase>form feed</foreignphrase>)
			e como gerar estat&iacute;sticas do uso da impressora.  Ele usa o
			<foreignphrase>login</foreignphrase>, 
			<foreignphrase>host</foreignphrase>, e o arquivo para armazenar as 
			estat&iacute;sticas para fazer as estat&iacute;sticas.
			</para>

        <para>
				Se voc&ecirc; deseja comprar filtros, veja se s&atilde;o 
			compat&iacute;veis co o LPD.  Se eles forem, eles devem suportar
			a lista de argumentos descrita acima.  Se voc&ecirc; planeja 
			escrever seu pr&oacute;prio filtro para uso geral, eles 
			tamb&eacute;m devem suportar a lista de argumentose deve utilizar
			os c&oacute;digos descritos acima.
			</para>
      </sect3>
      
      <sect3 id="printing-advanced-if-conversion">
        <title>Acomodando Texto Puro em Impressoras &postscript;</title>
        <indexterm>
				<primary>print <foreignphrase>jobs</foreignphrase>
				</primary>
			</indexterm>

        <para>
				Se s&oacute; voc&ecirc; &eacute; o usu&aacute;rio do seu computador
			sua impressora suporta &postscript; ( ou outra linguagem ), e 
			voc&ecirc; prometeu nunca enviar texto puro para a sua impressora e
			nunca usar&aacute; as vantagens que v&aacute;rios programas que
			gostariam de enviar testo puro para a sua impressora, ent&atilde;o 
			voc&ecirc; n&atilde;o precisa se preocupar com esta 
			se&ccedil;&atilde;o
			</para>
            
			<para>
				Mas, se voc&ecirc; gostaria de enviar tanto &postscript; e 
			texto puro para a sua impresssora, ent&atilde;o voc&ecirc; 
          you are urged to augment configura&ccedil;&atilde;o da impressora.
			Para fazer isso, nos temos que ter um filtro para detectar se o texto
			&eacute; texto puro ou &postscript;.  Todas as impress&otilde;es em
			&postscript; devem iniciar com <literal>%!</literal> ( para outra
			linguagem de impressora, veja a documenta&ccedil;&atilde;o da 
			sua impressora ).  Se estes dois primeiros caracteres aparecerem
			no arquivo de impress&atilde;om nos temos &postscript;, e podemos
			passar o resto da impress&atilde;o diretamente para a impressora.
			Se nos n&atilde;o temos os dois primeiros caracteres no arquivo de
			impress&atilde;o, ent&atilde;o o filtro deve converte-lo em
			&postscript; e imprimir o resultado.
			</para>
            
        	<para>Como nos faremos isso:
			</para>

        <indexterm>
          <primary>printers</primary>
          <secondary>serial</secondary>
        </indexterm>
        <para>
				Se nos temos uma impressora serial, o melhor caminha &eacute; 
			instalando o <command>lprps</command>.  O <command>lprps</command> &eacute;
			um filtro de impressora &postscript;, o qual habilita a 
			comunica&ccedil;&atilde;o bi-direcional com a impressora.  Ele 
			atualiza o arquivo de status da impressora com informa&ccedil;&atilde;o 
			recebida da impressora, ent&atilde;o os usu&aacute;rios e administradores
			podem ver exatamente o estado da impressora ( tais como
         <errorname>toner baixo</errorname> ou <errorname>paper jam</errorname>).
			mas o mais importante, &eacute; incluir um programa chamado de
         <command>psif</command>, o qual detecta quando um 
			<foreignphrase>job</foreignphrase> &eacute; em texto puro e ent&atilde;o
			executa o comando <command>textps</command> ( outro pragama que vem
			com o <command>lprps</command>) para converte-lo em &postscript;.  
			Ele pode usar <command>lprps</command>  para enviar um 
			<foreignphrase>job</foreignphrase> para a impressora.
			</para>
            
			<para>
				O <command>lprps</command> &eacute; parte da cole&ccedil;&atilde;o de 
	programas do FreeBSD (see 
	<link linkend="ports">A Cole&ccedil;&atilde;o de Programas</link>).  voc&ecirc;
	pode procurar, construir e instalar, por voc&ecirc; mesmo.  Depois da
	instala&ccedil;&atilde;o do <command>lprps</command>, Especifique o 
	diret&oacute;rio para o programa <command>psif</command> que faz parte do
   <command>lprps</command>.  Se voc&ecirc; instalou o <command>lprps</command>
	atrav&eacute;s dos <foreignphrase>ports</foreignphrase>, use a seguinte em
	uma impressora serial e &postscript; configurada no arquivo
   <filename>/etc/printcap</filename>:
			</para>
              
        <programlisting>:if=/usr/local/libexec/psif:</programlisting>

		<para>
			Voc&ecirc; tamb&eacute;m deve especificar a opo&ccedil;&atilde;o
		<literal>rw</literal>; que informa ao <application>LPD</application> 
		para abrir a cminica&ccedil;&atilde;o com a impressora como apenas
		leitura.
		</para>
            
		<para>
			Se voc&ecirc; tem uma impressora &postscript; ( e n&atilde;o 
		utiliza o modo bi-direcional, como necessita o <command>lprps</command>),
		voc&ecirc; pode utilizar o seguinte script como um filtro texto:
		</para>

		<programlisting>#!/bin/sh
#
#  psif - Print PostScript or plain text on a PostScript printer
#  Script version; NOT the version that comes with lprps
#  Installed in /usr/local/libexec/psif
#

IFS="" read -r first_line
first_two_chars=`expr "$first_line" : '\(..\)'`

if [ "$first_two_chars" = "%!" ]; then
    #
    #  PostScript job, print it.
    #
    echo "$first_line" &amp;&amp; cat &amp;&amp; printf "\004" &amp;&amp; exit 0
    exit 2
else
    #
    #  Plain text, convert it, then print it.
    #
    ( echo "$first_line"; cat ) | /usr/local/bin/textps &amp;&amp; printf "\004" &amp;&amp; exit 0
    exit 2
fi</programlisting>
            
		<para>
			No script acima, <command>textps</command> &eacute; um programa
		que nos instalamos separadamente para converter texto puro em 
		&postscript;.  Voc&ecirc; pode usar qualquer conversor de texto para
		&postscript; que voc&ecirc; desejar.  A cole&ccedil;&atilde;o de 
		programas do FreeBSD ( <foreignphrase>prots</foreignphrase>, veja em
      <link linkend="ports">Cole&ccedil;&atilde;o de Programas</link> )
		inclui um programa conversor de texto para &postscript; com facilidades
		chamado <literal>a2ps</literal> que voc&ecirc; deveria considerar.
		</para>
      </sect3>
          
      <sect3 id="printing-advanced-ps">
			<title>
					Simulando &postscript; em Impressoras N&atilde;o 
					&postscript; 
			</title>
        <indexterm>
          <primary>PostScript</primary>
          <secondary>emulating</secondary>
        </indexterm>
        <indexterm>
          <primary>Ghostscript</primary></indexterm>
			<para>
				&postscript; &eacute; <emphasis>de facto</emphasis> padr&atilde;o
			para impress&atilde;o de alta qualidade.  &postscript; &eacute;
			entretanto, um padr&atilde;o <emphasis>caro</emphasis>.  Ficamos
			gratos &agrave; Aladdin Enterprises que possui um programa chamado
			<application>Ghostscript</application> que pode trabalhar com a 
			maioria dos arquivos &postscript; e pode mostrar suas p&aacute;gianas
			em uma variedade de dispositivos, incluindo um grande n&uacute;mero 
			de impressoras n&atilde;o &postscript;.  Com a 
			instala&ccedil;&atilde;o do Ghostscript e usando filtros especiais
			de texto para a sua impressora, voc&ecirc; pode fazer uma impressora
			n&atilde;o &postscript; funcionar como uma impressora &postscript;
			real.
			</para>
            
			<para>
				Ghostscript eest&aacute; nos 
			<foreignphrase>ports</foreignphrase> do FreeBSD, se voc&ecirc; 
			poder&aacute; instala-lo de l&aacute;.  Voc&ecirc; deve buscar,
			compilar e instala-lo muito facilmente.
			</para>
            
			<para>
				Para simular &postscript;, nos devemos que ter no filtro um 
			detector para verificar se estamos imprimindo em &postscript; ou 
			texto puro.  Se for o caso de texto puro, ent&atilde;o o filtro 
			dever&aacute; repassar as informa&ccedil;&otilde;es diretamente
			para a impressora, caso contr&aacute;rio, ele dever&aacute;
			utilizar o Ghostscript antes para converter &postscript; para o
			formato reconhecido pela a impressora.
			</para>
            
			<para>
				Aqui tem um exemplo: o exemplo a seguir &eacute; um filtro texto 
			para uma impressora da Hewlett Packard, a Deskjet 500.  Para outras
			impressoras, voc&ecirc; deve substituir o argumento da 
			op&ccedil;&atilde;o <option>-sDEVICE</option> do comando
         <command>gs</command> (Ghostscript).  Digitando <command>gs
            -h</command> voc&ecirc; ter&aacute; a lista dos dispositivos
			suportados pela vers&atilde;o instalada do Ghostscript.
			</para>

        <programlisting>#!/bin/sh
#
#  ifhp - Print Ghostscript-simulated PostScript on a DeskJet 500
#  Installed in /usr/local/libexec/ifhp

#
#  Treat LF as CR+LF:
#
printf "\033&amp;k2G" || exit 2

#
#  Read first two characters of the file
#
IFS="" read -r first_line
first_two_chars=`expr "$first_line" : '\(..\)'`

if [ "$first_two_chars" = "%!" ]; then
    #
    #  It is PostScript; use Ghostscript to scan-convert and print it.
    #
    #  Note that PostScript files are actually interpreted programs,
    #  and those programs are allowed to write to stdout, which will
    #  mess up the printed output.  So, we redirect stdout to stderr
    #  and then make descriptor 3 go to stdout, and have Ghostscript
    #  write its output there.  Exercise for the clever reader:
    #  capture the stderr output from Ghostscript and mail it back to
    #  the user originating the print job.
    #
    exec 3&gt;&amp;1 1&gt;&amp;2
    /usr/local/bin/gs -dSAFER -dNOPAUSE -q -sDEVICE=djet500 \
        -sOutputFile=/dev/fd/3 - &amp;&amp; exit 0
else
    #
    #  Plain text or HP/PCL, so just print it directly; print a form feed
    #  at the end to eject the last page.
    #
    echo "$first_line" &amp;&amp; cat &amp;&amp; printf "\033&amp;l0H" &amp;&amp; 
exit 0
fi

exit 2</programlisting>

			<para>
				Finalmente, voc&ecirc; deve notificar o 
			<application>LPD</application> do filtro atrav&eacute;s da 
			op&ccedil;&atilde;o <literal>if</literal>
			</para>
            
        <programlisting>:if=/usr/local/libexec/ifhp:</programlisting>

			<para>
				Feito isso, voc&ecirc; poder&aacute; digitar 
			<command>lpr texto.puro</command> e
          <filename>lpr qualquer-coisa.ps</filename> e ambos dever&atilde;o
			ser impressos corretamente na impressora.
			</para>
      </sect3>
      
      <sect3 id="printing-advanced-convfilters">
        <title>Filtros Conversores</title>

			<para>
				Apos ter completamente configurado como descreve a 
			se&ccedil;&atilde;o 
			<link linkend="printing-simple">
				Configura&ccedil;&atilde;o Simples da Impressora
			</link>, a primeira coisa que voc&ecirc; provavelmente pensa &eacute; 
			instalar filtros conversores para seus formatos favoritos de
			arquivo.
			</para>
            
        <sect4>
          <title>
					Porque Instalar Filtros Conversores?
			</title>
          <indexterm>
            <primary>&tex;</primary>
            <secondary>printing dvi files</secondary>
          </indexterm>
          
			<para>
				Filtros conversores podem imprimir uma variedade de tipos de
			arquivo facilmente.  Como por exemplo, suponha que tenhamos que 
			fazer um grande trabalho com o sistema &tex;, e nos temos uma 
			impressora &postscript;.  Cada vez que nos geramos um arquivo DVI
			atrav&eacute;s do &tex;, nos n&atilde;o podemos imprimi-lo 
			diretamente, pos precisamos converte-lo em &postscript;.  A 
			seq&utrema;&ecirc;ncia de comandos sera algo semelhante a:
			</para>
                
          <screen>&prompt.user; <userinput>dvips seaweed-analysis.dvi</userinput>
&prompt.user; <userinput>lpr seaweed-analysis.ps</userinput></screen>
                
			<para>
				Instalando um filtro para converter os aquivos DVI em &postscript;,
			poder&iacute;amos pular um passo a cada vez que tivessemos que 
			imprimir.  O <application>LPD</application> poder&aacute; realizar
			esse passo para nos.
			</para>
              
          <screen>&prompt.user; <userinput>lpr -d seaweed-analysis.dvi</userinput></screen>
                
			<para>
				Nos informamos o <application>LPD</application> para converter 
			o arquivo DVI atraves da op&ccedil;&atilde;o <option>-d</option>. 
				Veja a se&ccedil;&atilde;o <link
			linkend="printing-lpr-options-format">
			Op&ccedil;&atilde;oes de Formata&ccedil;&atilde;o e Convers&atilde;o
			</link> mostra uma listar de op&ccedil;&otilde;es de convers&atilde;o
			</para>
              
			<para>
				Para Cada op&ccedil;&atilde;o de convers&atilde;o que voc&ecirc;
			deseja que sua impressora suporte, deve instalar um 
			<emphasis>Filtro Conversor</emphasis> e especificar o diret&oacute;rio
			no arquivo <filename>/etc/printcap</filename>.  Um filtro conversor
			&eacute; um filtro texto como foi definido na se&ccedil;&atilde;o 
			Configura&ccedil;&atilde;o Simples de Impressora ( veja a 
			se&ccedil;&atilde;o
			<link linkend="printing-textfilter">Instalando um Filtro de Texto
			</link>) Exceto pelo fato imprimir arquivos de texto puro, os filtros 
			convertem os arquivos em um formato que a impressora pode entender.
			</para>
        </sect4>

        <sect4>
          <title>
				Qual o Filtro Conversor Devo Instalar?
			</title>
          
			<para>
				Voc&ecirc; deve instalar o filtro conversor que voc&ecirc; espera
			utilizar.  Se voc&ecirc; imprime uma grande quantidade de dados
			no formato DVI, ent&atilde;o voc&ecirc; deve term um filtro para 
			converte-lo.  Se voc&ecirc; deseja imprimir saidas atrav&eacute;s de 
			troff, ent&atilde;o provavelmente voc&ecirc; ter&aacute; um filtro
			troff.
			</para>
              
			<para>
				A seguinte tabela sumariza os filtros que o 
			<application>LPD</application> pode trabalhar, e suas 
			op&ccedil;&atilde;o est&atilde;o no arquivo 
			<filename>/etc/printcap</filename>, e como devem ser chamados com
			o comando <command>lpr</command>:</para>

          <informaltable frame="none">
            <tgroup cols="3">
              <thead>
                <row>
                  <entry>Tipo de Arquivo type</entry>
                  <entry>Op&ccedil;&atilde;o no 
							<filename>/etc/printcap</filename>
						</entry>
                  <entry>Op&ccedil;&otilde;es do <command>lpr</command>
						</entry>
                </row>
              </thead>
              
              <tbody>
                <row>
                  <entry>cifplot</entry>
                  <entry><literal>cf</literal></entry>
                  <entry><option>-c</option></entry>
                </row>
                
                <row>
                  <entry>DVI</entry>
                  <entry><literal>df</literal></entry>
                  <entry><option>-d</option></entry>
                </row>
                
                <row>
                  <entry>plot</entry>
                  <entry><literal>gf</literal></entry>
                  <entry><option>-g</option></entry>
                </row>
                
                <row>
                  <entry>ditroff</entry>
                  <entry><literal>nf</literal></entry>
                  <entry><option>-n</option></entry>
                </row>
                
                <row>
                  <entry>texto em FORTRAN</entry>
                  <entry><literal>rf</literal></entry>
                  <entry><option>-f</option></entry>
                </row>
                
                <row>
                  <entry>troff</entry>
                  <entry><literal>tf</literal></entry>
                  <entry><option>-f</option></entry>
                </row>
                
                <row>
                  <entry>raster</entry>
                  <entry><literal>vf</literal></entry>
                  <entry><option>-v</option></entry>
                </row>
                
                <row>
                  <entry>Texto Puro</entry>
                  <entry><literal>if</literal></entry>
                  <entry>none, <option>-p</option>, or
                    <option>-l</option></entry>
                </row>
              </tbody>
            </tgroup>
          </informaltable>
          
			<para>
				No nosso exemplo, usamos o comando <command>lpr -d</command> 
			que significa dizer que precisamos da op&ccedil;&atilde;o
         <literal>df</literal> dentro do arquivo 
			<filename>/etc/printcap</filename>.
			</para>
              
          <indexterm><primary>FORTRAN</primary></indexterm>
			<para>
				Apesar de algumas pessoas possam pensar, formatos como o 
			FORTRAN e plot s&atilde;o provavelmente obsoleto.  No seu 
			s&iacute;tio, voc&ecirc; pode dar novas op&ccedil;&otilde;es de 
			formata&ccedil;&atilde;o para esses ou qualquer outra 
			formata&ccedil;&atilde;o apenas instalando novos filtros ajustados
			para o seu uso.  Por exemplo, suponhamos que seja necess&aacute;rio
			imprimir diretamente arquivos Printerleaf ( arquivos vindos do
			do programa de pubica&ccedil;&atilde;o Interleaf ), mas voc&ecirc; 
			nunca ir&aacute; imprimir arquivos de plot.  Voc&ecirc; poder&aacute;
			instalar um filtro para converter esse formato utilizando a 
			op&ccedil;&atilde;o <literal>gf</literal> e educar os seus 
			usu&aacute;rios a utilizarem o comando <command>lpr -g</command> 
			quando forem imprimir arquivos do tipo <quote>Printerleaf</quote>.
			</para>
        </sect4>

        <sect4>
			<title>
				Instalando Filtros Conversores
			</title>
          
			<para>
				Deste que os filtros de convers&atilde;o s&atilde;o programas
			instalados por fora da instala&ccedil;&atilde;o padr&atilde;o do
			FreeBSD, eles devem, provavelmente, ficar no diret&oacute;rio
			<filename>/usr/local</filename>.  O diret&oacute;rio
			<filename>/usr/local/libexec</filename> &eacute; a 
			localiza&ccedil;&atilde;o mais indicado, uma vez que s&atilde;o 
			programas especializados que somente o <application>LPD</application>
			ir&aacute; usar; usu&aacute;rios regulares do sistema,
			n&atilde;o dever&atilde;o ter necessidade de execut&aacute;-los.
			</para>
              
			<para>
				Para habilitar dum filtro conversor, especifique o diret&oacute;rio
			no qual ele se encontra, na op&ccedil;&atilde;o espec&iacute;fica
			do arquivo <filename>/etc/printcap</filename>.
			</para>
              
			<para>
				Um outro exemplo, nos iremos adicionar um filtro conversor DVI
			na impressora chamada <literal>bamboo</literal>.  Aqui um exemplo
			de um arquivo <filename>/etc/printcap</filename>, com a nova
			op&ccedil;&atilde;o <literal>df</literal> para a impressora
			<literal>bamboo</literal>.
			</para>

          <programlisting>#
#  /etc/printcap for host rose - added df filter for bamboo
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:\
        :lp=/dev/lpt0:\
        :if=/usr/local/libexec/if-simple:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:rw:\
        :if=/usr/local/libexec/psif:\
        :df=/usr/local/libexec/psdf:</programlisting>

			<para>
				O filtro DVI &eacute; um script para o shell chamado de
			<filename>/usr/local/libexec/psdf</filename>.  aqui est&aacute; o
			script
			</para>

          <programlisting>#!/bin/sh
#
#  psdf - DVI to PostScript printer filter
#  Installed in /usr/local/libexec/psdf
#
# Invoked by lpd when user runs lpr -d
#
exec /usr/local/bin/dvips -f | /usr/local/libexec/lprps "$@"</programlisting>

			<para>
				Esse script executa <command>dvips</command> no modo de filtro
			( o argumento <option>-f</option> ) na entrada padr&atilde;o, na qual
			o job ser&aacute; impresso.  Ele inicia o filtro &postscript; da
			impressora <command>lprps</command> ( veja a se&ccedil;&atilde;o
			<link linkend="printing-advanced-if-conversion">
			Acomodando Trabalhgos de Impress&atilde;o em Texto Puro em 
			Impressoras &postscript;
			</link> ) com os argumentos do <application>LPD</application> passado 
			pelo script.  O comando <command>lprps</command> ir&aacute; ser usado
			como argumento para a contabilidade de p&aacute;ginas impressas.
			</para>

        </sect4>
            
        <sect4>
          <title>
				Mais Exemplos de Filtros Conversores
			</title>
              
			<para>
				Deste que n&atilde;o existe um conjunto de passos para a 
			instala&ccedil;&atilde;o de filtros conversores, Nos iremos 
			providenciar mais exempemplos.  Use-os como guia para fazer os
			seus pr&oacute;prios filtros.  Use-os diretamente se forem 
			apropriados.
			</para>
              
			<para>
				Esse exemplo de script &eacute; um filtro conversor
			<foreignphrase>raster</foreignphrase> ( com arquivos GIF atualmente )
			para as impressoras Hewlett Packard LaserJet III-Si:
			</para>

          <programlisting>#!/bin/sh
#
#  hpvf - Convert GIF files into HP/PCL, then print
#  Installed in /usr/local/libexec/hpvf
                  
PATH=/usr/X11R6/bin:$PATH; export PATH
giftopnm | ppmtopgm | pgmtopbm | pbmtolj -resolution 300 \
    &amp;&amp; exit 0 \
    || exit 2</programlisting>

			<para>
				Ele converte um arquivo GIF em um formato
			<foreignphrase>anymap</foreignphrase> port&aacute;vel, convertendo
			em um mapa de cinza port&aacute;vel, convertento em um formato
			bitmap port&aacute;vel, e eet&atilde;o convertendo em dados
			compat&iacute;vel PCL.
			</para>
              
			<para>
				Um exemplo de arquivo <filename>/etc/printcap</filename> com
			uma entrada para uma impressora usando o filtro acima.
			</para>

          <programlisting>#
#  /etc/printcap for host orchid
#
teak|hp|laserjet|Hewlett Packard LaserJet 3Si:\
        :lp=/dev/lpt0:sh:sd=/var/spool/lpd/teak:mx#0:\
        :if=/usr/local/libexec/hpif:\
        :vf=/usr/local/libexec/hpvf:</programlisting>
              
			<para>
				O pr&oacute;ximo script converte dados troff vindos de um 
			sistema groff para uma impressora &postscript; chamada 
         <literal>bamboo</literal>:
			</para>

          <programlisting>#!/bin/sh
#
#  pstf - Convert groff's troff data into PS, then print.
#  Installed in /usr/local/libexec/pstf
#
exec grops | /usr/local/libexec/lprps "$@"</programlisting>
              
			<para>
				O script acima, faz uso novamente do comando 
			<command>lprps</command> para manipular a comunica&ccedil;&atilde;o
			com a impressora.  Se a impressora estiver na porta paralela,
			nos devemos usar este script:
			</para>

          <programlisting>#!/bin/sh
#
#  pstf - Convert groff's troff data into PS, then print.
#  Installed in /usr/local/libexec/pstf
#
exec grops</programlisting>
          
			<para>
				Aqui est&aacute; a entrada que precisamos adicionar no arquivo
			<filename>/etc/printcap</filename> para habilitar o filtro:
			</para>
                
          <programlisting>:tf=/usr/local/libexec/pstf:</programlisting>
              
			<para>
				Aqui est&aacute; um filtro para texto em FORRAN para qualquer
			impressora diretamente em texto puro.  Nos iremos instalar isso
			para a impressora chamada <literal>teak</literal>:
			</para>

          <programlisting>#!/bin/sh
#
# hprf - FORTRAN text filter for LaserJet 3si:
# Installed in /usr/local/libexec/hprf
#

printf "\033&amp;k2G" &amp;&amp; fpr &amp;&amp; printf "\033&amp;l0H" &amp;&amp;
 exit 0
exit 2</programlisting>
              
			<para>
				E nos adicionamos esta linha no arquivo
			<filename>/etc/printcap</filename> para a impressora
			<literal>teak</literal> para habilitar esse filtro:
			</para>
              
          <programlisting>:rf=/usr/local/libexec/hprf:</programlisting>
              
			<para>
				Aqui &eacute; o fim desse exemplo complexo.  Nos iremos adicionar
			o filtro DVI para a impressora LaserJet <literal>teak</literal>
			indrotuzido recentemente.  Primeiro, a parte mais f&aacute;cil; 
			atualize o arquivo <filename>/etc/printcap</filename> com a 
			localiza&ccedil;&atilde;o do filtro DVI:
			</para>
              
          <programlisting>:df=/usr/local/libexec/hpdf:</programlisting>
              
				<para>
					Agora, a parte mais dif&iacute;cil: fazendo o filtro.
			Para tanto, nos iremos necessitar de um programa conversor de DVI
			para LaserJet/PCL.  Na cole&ccedil;&atilde;o de programas do
			FreeBSD ( veja em 
			<link linkend="ports">A Cole&ccedil;&atilde;o de Programas</link>)
			possui um: <command>dvi2xx</command> &eacute; o nome do pacote.
			Instalando esse pacote, nos teremos o programa necess&aacute;rio,
			<command>dvilj2p</command>, o qual converte DVI em arquivos 
			LaserJet IIp, LaserJet III, e LaserJet 2000 compat&iacute;veis.
				</para>
              
				<para>
					O comando <command>dvilj2p</command> deixa o filtro 
			<command>hpdf</command> pouco complexo uma vez que o comando
			<command>dvilj2p</command> n&atilde;o pode ler da entrada 
			padr&atilde;o.  Ele necessita trabalhar com o nome do arquivo.
			Isso &eacute; rium, o nome do arquivo deve ter no final
			<filename>.dvi</filename> ent&atilde;o usando o
			<filename>/dev/fd/0</filename> para a entrada padr&atilde;o 
			seria problem&aacute;tico.  Nos podemos contornar o problema 
			linkando ( simbolicamente ) um nome tempor&aacute;rio de arquivo 
			( um que terminaria em <filename>.dvi</filename> ) para o
			<filename>/dev/fd/0</filename>, for&ccedil;ando assim o
			<command>dvilj2p</command> ler da entrada padr&atilde;o.
				</para>
              
---

          <para>The only other fly in the ointment is the fact that we cannot
            use <filename>/tmp</filename> for the temporary link. Symbolic
            links are owned by user and group <username>bin</username>.  The
            filter runs as user <username>daemon</username>.  And the
            <filename>/tmp</filename> directory has the sticky bit set. The
            filter can create the link, but it will not be able clean up when
            done and remove it since the link will belong to a different
            user.</para>
              
          <para>Instead, the filter will make the symbolic link in the current
            working directory, which is the spooling directory (specified by
            the <literal>sd</literal> capability in
            <filename>/etc/printcap</filename>).  This is a perfect place for
            filters to do their work, especially since there is (sometimes)
            more free disk space in the spooling directory than under
            <filename>/tmp</filename>.</para>
              
          <para>Here, finally, is the filter:</para>

          <programlisting>#!/bin/sh
#
#  hpdf - Print DVI data on HP/PCL printer
#  Installed in /usr/local/libexec/hpdf

PATH=/usr/local/bin:$PATH; export PATH

#
#  Define a function to clean up our temporary files.  These exist
#  in the current directory, which will be the spooling directory
#  for the printer.
#
cleanup() {
   rm -f hpdf$$.dvi
}

#
#  Define a function to handle fatal errors: print the given message
#  and exit 2.  Exiting with 2 tells LPD to do not try to reprint the
#  job.
#
fatal() {
    echo "$@" 1&gt;&amp;2
    cleanup
    exit 2
}

#
#  If user removes the job, LPD will send SIGINT, so trap SIGINT
#  (and a few other signals) to clean up after ourselves.
#
trap cleanup 1 2 15 

#
#  Make sure we are not colliding with any existing files.
#
cleanup

#
#  Link the DVI input file to standard input (the file to print).
#
ln -s /dev/fd/0 hpdf$$.dvi || fatal "Cannot symlink /dev/fd/0"

#
#  Make LF = CR+LF
#
printf "\033&amp;k2G" || fatal "Cannot initialize printer"

# 
#  Convert and print.  Return value from dvilj2p does not seem to be
#  reliable, so we ignore it.
#
dvilj2p -M1 -q -e- dfhp$$.dvi

#
#  Clean up and exit
#
cleanup
exit 0</programlisting>
        </sect4>

        <sect4 id="printing-advanced-autoconv">
          <title>
				Convers&atilde;o Autom&aacute;tica: Uma Alternatica aos Filtros 
				de Convers&atilde;o
            </title>
              
          <para>All these conversion filters accomplish a lot for your
            printing environment, but at the cost forcing the user to specify
            (on the &man.lpr.1; command line) which one to use.
            If your users are not particularly computer literate, having to
            specify a filter option will become annoying.  What is worse,
            though, is that an incorrectly specified filter option may run a
            filter on the wrong type of file and cause your printer to spew
            out hundreds of sheets of paper.</para>
              
          <para>Rather than install conversion filters at all, you might want
            to try having the text filter (since it is the default filter)
            detect the type of file it has been asked to print and then
            automatically run the right conversion filter.  Tools such as
            <command>file</command> can be of help here.  Of course, it will
            be hard to determine the differences between
            <emphasis>some</emphasis> file types&mdash;and, of course, you can
            still provide conversion filters just for them.</para>
              
          <indexterm><primary>apsfilter</primary></indexterm>
          <indexterm>
            <primary>printing</primary>
            <secondary>filters</secondary>
            <tertiary>apsfilter</tertiary>
          </indexterm>
          <para>The FreeBSD Ports Collection has a text filter that performs
            automatic conversion called <command>apsfilter</command>.  It can
            detect plain text, &postscript;, and DVI files, run the proper
            conversions, and print.</para>
        </sect4>
      </sect3>
      
      <sect3 id="printing-advanced-of">
        <title>Filtros de Sa&iacute;da</title>

        <para>The <application>LPD</application> spooling system supports one 
	  other type of filter that
          we have not yet explored: an output filter.  An output filter is
          intended for printing plain text only, like the text filter, but
          with many simplifications.  If you are using an output filter but no
          text filter, then:</para>

        <itemizedlist>
          <listitem>
            <para><application>LPD</application> starts an output filter once
	      for the entire job instead
              of once for each file in the job.</para>
          </listitem>
          
          <listitem>
            <para><application>LPD</application> does not make any provision
	      to identify the start or the
              end of files within the job for the output filter.</para>
          </listitem>
          
          <listitem>
            <para><application>LPD</application> does not pass the user's 
	      login or host to the filter, so
              it is not intended to do accounting.  In fact, it gets only two
              arguments:</para>
                    
            <cmdsynopsis>
              <command>filter-name</command>
              <arg choice="plain">-w<replaceable>width</replaceable></arg>
              <arg choice="plain">-l<replaceable>length</replaceable></arg>
            </cmdsynopsis>
            
            <para>Where <replaceable>width</replaceable> is from the
              <literal>pw</literal> capability and
              <replaceable>length</replaceable> is from the
              <literal>pl</literal> capability for the printer in
              question.</para>
          </listitem>
        </itemizedlist>

        <para>Do not be seduced by an output filter's simplicity.  If you
          would like each file in a job to start on a different page an output
          filter <emphasis>will not work</emphasis>.  Use a text filter (also
          known as an input filter); see section <link
            linkend="printing-textfilter">Installing the Text Filter</link>.
          Furthermore, an output filter is actually <emphasis>more
            complex</emphasis> in that it has to examine the byte stream being
          sent to it for special flag characters and must send signals to
          itself on behalf of <application>LPD</application>.</para>
            
        <para>However, an output filter is <emphasis>necessary</emphasis> if
          you want header pages and need to send escape sequences or other
          initialization strings to be able to print the header page.  (But it
          is also <emphasis>futile</emphasis> if you want to charge header
          pages to the requesting user's account, since 
	  <application>LPD</application> does not give any
          user or host information to the output filter.)</para>
            
        <para>On a single printer, <application>LPD</application>
	  allows both an output filter and text or other filters.  In
	  such cases, <application>LPD</application> will start the
	  output filter
          to print the header page (see section <link
            linkend="printing-advanced-header-pages">Header Pages</link>)
          only.  <application>LPD</application> then expects the
	  output filter to <emphasis>stop
            itself</emphasis> by sending two bytes to the filter: ASCII 031
          followed by ASCII 001.  When an output filter sees these two bytes
          (031, 001), it should stop by sending <literal>SIGSTOP</literal>
	  to itself.  When 
	  <application>LPD</application>'s
          done running other filters, it will restart the output filter by
          sending <literal>SIGCONT</literal> to it.</para>
            
        <para>If there is an output filter but <emphasis>no</emphasis> text
          filter and <application>LPD</application> is working on a plain
	  text job, <application>LPD</application> uses the output
          filter to do the job.  As stated before, the output filter will
          print each file of the job in sequence with no intervening form
          feeds or other paper advancement, and this is probably
          <emphasis>not</emphasis> what you want.  In almost all cases, you
          need a text filter.</para>
            
        <para>The program <command>lpf</command>, which we introduced earlier
          as a text filter, can also run as an output filter.  If you need a
          quick-and-dirty output filter but do not want to write the byte
          detection and signal sending code, try <command>lpf</command>.  You
          can also wrap <command>lpf</command> in a shell script to handle any
          initialization codes the printer might require.</para>
      </sect3>
      
      <sect3 id="printing-advanced-lpf">
        <title><command>lpf</command>: Um Filtro de Texto</title>

        <para>The program <filename>/usr/libexec/lpr/lpf</filename> that comes
          with FreeBSD binary distribution is a text filter (input filter)
          that can indent output (job submitted with <command>lpr
            -i</command>), allow literal characters to pass (job submitted
          with <command>lpr -l</command>), adjust the printing position for
          backspaces and tabs in the job, and account for pages printed.  It
          can also act like an output filter.</para>
            
        <para><command>lpf</command> is suitable for many printing
          environments.  And although it has no capability to send
          initialization sequences to a printer, it is easy to write a shell
          script to do the needed initialization and then execute
          <command>lpf</command>.</para>
            
        <indexterm><primary>page accounting</primary></indexterm>
        <indexterm>
          <primary>accounting</primary>
          <secondary>printer</secondary>
        </indexterm>
        <para>In order for <command>lpf</command> to do page accounting
          correctly, it needs correct values filled in for the
          <literal>pw</literal> and <literal>pl</literal> capabilities in the
          <filename>/etc/printcap</filename> file.  It uses these values to
          determine how much text can fit on a page and how many pages were in
          a user's job.  For more information on printer accounting, see <link
            linkend="printing-advanced-acct">Accounting for Printer
            Usage</link>.</para>
      </sect3>
    </sect2>
    
    <sect2 id="printing-advanced-header-pages">
      <title>P&aacute;ginas de Cabe&ccedil;alhos</title>
      
      <para>If you have <emphasis>lots</emphasis> of users, all of them using
        various printers, then you probably want to consider <emphasis>header
          pages</emphasis> as a necessary evil.</para>
          
      <indexterm>
        <primary>banner pages</primary>
	<see>header pages</see>
      </indexterm>
      <indexterm><primary>header pages</primary></indexterm>
      <para>Header pages, also known as <emphasis>banner</emphasis> or
        <emphasis>burst pages</emphasis> identify to whom <foreignphrase>jobs</foreignphrase> belong after
        they are printed.  They are usually printed in large, bold letters,
        perhaps with decorative borders, so that in a stack of printouts they
        stand out from the real documents that comprise users' <foreignphrase>jobs</foreignphrase>.  They
        enable users to locate their <foreignphrase>jobs</foreignphrase> quickly.  The obvious drawback to a
        header page is that it is yet one more sheet that has to be printed
        for every job, their ephemeral usefulness lasting not more than a few
        minutes, ultimately finding themselves in a recycling bin or rubbish
        heap.  (Note that header pages go with each job, not each file in a
        job, so the paper waste might not be that bad.)</para>
          
      <para>The <application>LPD</application> system can provide header
	pages automatically for your
        printouts <emphasis>if</emphasis> your printer can directly print
       plain text.  If you have a &postscript; printer, you will need an
        external program to generate the header page; see <link
          linkend="printing-advanced-header-pages-ps">Header Pages on
          &postscript; Printers</link>.</para>
      
          <sect3 id="printing-advanced-header-pages-enabling">
			<title>
				Habilitanto P&aacute;ginas de Cabe&ccedil;alho
			</title>

        <para>In the <link linkend="printing-simple">Simple Printer
            Setup</link> section, we turned off header pages by specifying
          <literal>sh</literal> (meaning <quote>suppress header</quote>) in the
          <filename>/etc/printcap</filename> file.  To enable header pages for
          a printer, just remove the <literal>sh</literal> capability.</para>

        <para>Sounds too easy, right?</para>

        <para>You are right.  You <emphasis>might</emphasis> have to provide
          an output filter to send initialization strings to the printer.
          Here is an example output filter for Hewlett Packard PCL-compatible
          printers:</para>

        <programlisting>#!/bin/sh
#
#  hpof - Output filter for Hewlett Packard PCL-compatible printers
#  Installed in /usr/local/libexec/hpof

printf "\033&amp;k2G" || exit 2
exec /usr/libexec/lpr/lpf</programlisting>
            
        <para>Specify the path to the output filter in the
          <literal>of</literal> capability.  See the <link
            linkend="printing-advanced-of">Output Filters</link> section for more
          information.</para>
            
        <para>Here is an example <filename>/etc/printcap</filename> file for
          the printer <literal>teak</literal> that we introduced earlier; we
          enabled header pages and added the above output filter:</para>

        <programlisting>#
#  /etc/printcap for host orchid
#
teak|hp|laserjet|Hewlett Packard LaserJet 3Si:\
        :lp=/dev/lpt0:sd=/var/spool/lpd/teak:mx#0:\
        :if=/usr/local/libexec/hpif:\
        :vf=/usr/local/libexec/hpvf:\
        :of=/usr/local/libexec/hpof:</programlisting>
            
        <para>Now, when users print <foreignphrase>jobs</foreignphrase> to <literal>teak</literal>, they get
          a header page with each job.  If users want to spend time searching
          for their printouts, they can suppress header pages by submitting
          the job with <command>lpr -h</command>; see the <link
            linkend="printing-lpr-options-misc">Header Page Options</link> section for
          more &man.lpr.1; options.</para>

        <note>
          <para><application>LPD</application> prints a form feed character
	    after the header page. If
            your printer uses a different character or sequence of characters
            to eject a page, specify them with the <literal>ff</literal>
            capability in <filename>/etc/printcap</filename>.</para>
        </note>
      </sect3>
      
      <sect3 id="printing-advanced-header-pages-controlling">
        <title>Controlando P&aacute;ginas de Cabe&ccedil;alho</title>

        <para>By enabling header pages, <application>LPD</application> will
	  produce a <emphasis>long
            header</emphasis>, a full page of large letters identifying the
          user, host, and job.  Here is an example (kelly printed the job
          named outline from host <hostid>rose</hostid>):</para>
            
        <programlisting>      k                   ll       ll
      k                    l        l
      k                    l        l
      k   k     eeee       l        l     y    y
      k  k     e    e      l        l     y    y
      k k      eeeeee      l        l     y    y
      kk k     e           l        l     y    y
      k   k    e    e      l        l     y   yy
      k    k    eeee      lll      lll     yyy y
                                               y
                                          y    y
                                           yyyy


                                   ll
                          t         l        i
                          t         l
       oooo    u    u   ttttt       l       ii     n nnn     eeee
      o    o   u    u     t         l        i     nn   n   e    e
      o    o   u    u     t         l        i     n    n   eeeeee
      o    o   u    u     t         l        i     n    n   e
      o    o   u   uu     t  t      l        i     n    n   e    e
       oooo     uuu u      tt      lll      iii    n    n    eeee









      r rrr     oooo     ssss     eeee
      rr   r   o    o   s    s   e    e
      r        o    o    ss      eeeeee
      r        o    o      ss    e
      r        o    o   s    s   e    e
      r         oooo     ssss     eeee







                                              Job:  outline
                                              Date: Sun Sep 17 11:04:58 1995</programlisting>

        <para><application>LPD</application> appends a form feed after this
	  text so the job starts on a
          new page (unless you have <literal>sf</literal> (suppress form
          feeds) in the destination printer's entry in
          <filename>/etc/printcap</filename>).</para>
            
        <para>If you prefer, <application>LPD</application> can make a 
	  <emphasis>short header</emphasis>;
          specify <literal>sb</literal> (short banner) in the
          <filename>/etc/printcap</filename> file. The header page will look
          like this:</para>
            
        <programlisting>rose:kelly  Job: outline  Date: Sun Sep 17 11:07:51 1995</programlisting>

        <para>Also by default, <application>LPD</application> prints the
	  header page first, then the job.
          To reverse that, specify <literal>hl</literal> (header last) in
          <filename>/etc/printcap</filename>.</para>
      </sect3>
      
      <sect3 id="printing-advanced-header-pages-accounting">
        <title>Accounting for Header Pages</title>

        <para>Using <application>LPD</application>'s built-in header pages
	  enforces a particular paradigm
          when it comes to printer accounting: header pages must be
          <emphasis>free of charge</emphasis>.</para>
            
        <para>Why?</para>

        <para>Because the output filter is the only external program that will
          have control when the header page is printed that could do
          accounting, and it is not provided with any <emphasis>user or
            host</emphasis> information or an accounting file, so it has no
          idea whom to charge for printer use.  It is also not enough to just
          <quote>add one page</quote> to the text filter or any of the
          conversion filters (which do have user and host information) since
          users can suppress header pages with <command>lpr -h</command>.
          They could still be charged for header pages they did not print.
          Basically, <command>lpr -h</command> will be the preferred option of
          environmentally-minded users, but you cannot offer any incentive to
          use it.</para>
            
        <para>It is <emphasis>still not enough</emphasis> to have each of the
          filters generate their own header pages (thereby being able to
          charge for them).  If users wanted the option of suppressing the
          header pages with <command>lpr -h</command>, they will still get
          them and be charged for them since <application>LPD</application>
	  does not pass any knowledge
          of the <option>-h</option> option to any of the filters.</para>

        <para>So, what are your options?</para>

        <para>You can:</para>

        <itemizedlist>
          <listitem>
            <para>Accept <application>LPD</application>'s paradigm and make
	      header pages free.</para>
          </listitem>
          
          <listitem>
            <para>Install an alternative to <application>LPD</application>,
	      such as 
		<application>LPRng</application>. Section
              <link linkend="printing-lpd-alternatives">Alternatives to the
                Standard Spooler</link> tells more about other spooling
              software you can substitute for <application>LPD</application>.
	    </para>
          </listitem>
          
          <listitem>
            <para>Write a <emphasis>smart</emphasis> output filter. Normally,
              an output filter is not meant to do anything more than
              initialize a printer or do some simple character conversion.  It
              is suited for header pages and plain text <foreignphrase>jobs</foreignphrase> (when there is no
              text (input) filter).  But, if there is a text filter for the
              plain text <foreignphrase>jobs</foreignphrase>, then <application>LPD</application> will start
	      the output filter only for
              the header pages.  And the output filter can parse the header
              page text that <application>LPD</application> generates to
	      determine what user and host to
              charge for the header page.  The only other problem with this
              method is that the output filter still does not know what
              accounting file to use (it is not passed the name of the file
              from the <literal>af</literal> capability), but if you have a
              well-known accounting file, you can hard-code that into the
              output filter.  To facilitate the parsing step, use the
              <literal>sh</literal> (short header) capability in
              <filename>/etc/printcap</filename>.  Then again, all that might
              be too much trouble, and users will certainly appreciate the
              more generous system administrator who makes header pages
              free.</para>
          </listitem>
        </itemizedlist>
      </sect3>
      
      <sect3 id="printing-advanced-header-pages-ps">
			<title>
				P&aacute;ginas de Cabe&ccedil;alho em Impressoras &postscript;
			</title>

        <para>As described above, <application>LPD</application> can generate
	  a plain text header page
          suitable for many printers.  Of course, &postscript; cannot directly
          print plain text, so the header page feature of 
	  <application>LPD</application> is
          useless&mdash;or mostly so.</para>
            
        <para>One obvious way to get header pages is to have every conversion
          filter and the text filter generate the header page. The filters
          should use the user and host arguments to generate a suitable
          header page.  The drawback of this method is that users will always
          get a header page, even if they submit <foreignphrase>jobs</foreignphrase> with <command>lpr
            -h</command>.</para>
            
        <para>Let us explore this method.  The following script takes three
          arguments (user login name, host name, and job name) and makes a
          simple &postscript; header page:</para>

        <programlisting>#!/bin/sh
#
#  make-ps-header - make a PostScript header page on stdout
#  Installed in /usr/local/libexec/make-ps-header
#

#
#  These are PostScript units (72 to the inch).  Modify for A4 or
#  whatever size paper you are using:
#
page_width=612
page_height=792
border=72

#
#  Check arguments
#
if [ $# -ne 3 ]; then
    echo "Usage: `basename $0` &lt;user&gt; &lt;host&gt; &lt;job&gt;" 1&gt;&amp;2
    exit 1
fi

#
#  Save these, mostly for readability in the PostScript, below.
#
user=$1
host=$2
job=$3
date=`date`

#
#  Send the PostScript code to stdout.
#
exec cat &lt;&lt;EOF
%!PS

%
%  Make sure we do not interfere with user's job that will follow
%
save

%
%  Make a thick, unpleasant border around the edge of the paper.
%
$border $border moveto
$page_width $border 2 mul sub 0 rlineto
0 $page_height $border 2 mul sub rlineto
currentscreen 3 -1 roll pop 100 3 1 roll setscreen
$border 2 mul $page_width sub 0 rlineto closepath
0.8 setgray 10 setlinewidth stroke 0 setgray

%
%  Display user's login name, nice and large and prominent
%
/Helvetica-Bold findfont 64 scalefont setfont
$page_width ($user) stringwidth pop sub 2 div $page_height 200 sub moveto
($user) show

%
%  Now show the boring particulars
%
/Helvetica findfont 14 scalefont setfont
/y 200 def
[ (Job:) (Host:) (Date:) ] {
200 y moveto show /y y 18 sub def }
forall

/Helvetica-Bold findfont 14 scalefont setfont
/y 200 def
[ ($job) ($host) ($date) ] {
        270 y moveto show /y y 18 sub def
} forall

%
% That is it
%
restore
showpage
EOF</programlisting>

        <para>Now, each of the conversion filters and the text filter can call
          this script to first generate the header page, and then print the
          user's job.  Here is the DVI conversion filter from earlier in this
          document, modified to make a header page:</para>

        <programlisting>#!/bin/sh
#
#  psdf - DVI to PostScript printer filter
#  Installed in /usr/local/libexec/psdf
#
#  Invoked by lpd when user runs lpr -d
#
                
orig_args="$@"

fail() {
    echo "$@" 1&gt;&amp;2
    exit 2
}

while getopts "x:y:n:h:" option; do
    case $option in
        x|y)  ;; # Ignore
        n)    login=$OPTARG ;;
        h)    host=$OPTARG ;;
        *)    echo "LPD started `basename $0` wrong." 1&gt;&amp;2
              exit 2
              ;;
    esac
done

[ "$login" ] || fail "No login name"
[ "$host" ] || fail "No host name"

( /usr/local/libexec/make-ps-header $login $host "DVI File"
  /usr/local/bin/dvips -f ) | eval /usr/local/libexec/lprps $orig_args</programlisting>

        <para>Notice how the filter has to parse the argument list in order to
          determine the user and host name.  The parsing for the other
          conversion filters is identical.  The text filter takes a slightly
          different set of arguments, though (see section <link
            linkend="printing-advanced-filters">How      Filters
            Work</link>).</para>
            
        <para>As we have mentioned before, the above scheme, though fairly
          simple, disables the <quote>suppress header page</quote> option (the
          <option>-h</option> option) to <command>lpr</command>.  If users
          wanted to save a tree (or a few pennies, if you charge for header
          pages), they would not be able to do so, since every filter's going
          to print a header page with every job.</para>
            
        <para>To allow users to shut off header pages on a per-job basis, you
          will need to use the trick introduced in section <link
            linkend="printing-advanced-header-pages-accounting">Accounting for
            Header Pages</link>: write an output filter that parses the
          LPD-generated header page and produces a &postscript; version.  If the
          user submits the job with <command>lpr -h</command>, then 
	  <application>LPD</application> will
          not generate a header page, and neither will your output filter.
          Otherwise, your output filter will read the text from 
	  <application>LPD</application> and send
          the appropriate header page &postscript; code to the printer.</para>
            
        <para>If you have a &postscript; printer on a serial line, you can make
          use of <command>lprps</command>, which comes with an output filter,
          <command>psof</command>, which does the above.  Note that
          <command>psof</command> does not charge for header pages.</para>
      </sect3>
    </sect2>
    
    <sect2 id="printing-advanced-network-printers">
			<title>
				Impress&atilde;o em Rede
			</title>
      
      <indexterm>
        <primary>printers</primary>
        <secondary>network</secondary>
      </indexterm>
      <indexterm><primary>network printing</primary></indexterm>
      <para>FreeBSD supports networked printing: sending <foreignphrase>jobs</foreignphrase> to remote
        printers.  Networked printing generally refers to two different
        things:</para>
      
      <itemizedlist>
        <listitem>
          <para>Accessing a printer attached to a remote host.  You install a
            printer that has a conventional serial or parallel interface on
            one host.  Then, you set up <application>LPD</application> to 
	    enable access to the printer
            from other hosts on the network. Section <link
              linkend="printing-advanced-network-rm">Printers Installed on
              Remote Hosts</link> tells how to do this.</para>
        </listitem>

        <listitem>
          <para>Accessing a printer attached directly to a network.  The
            printer has a network interface in addition (or in place of) a
            more conventional serial or parallel interface.  Such a printer
            might work as follows:</para>
          
          <itemizedlist>
            <listitem>
              <para>It might understand the <application>LPD</application>
		protocol and can even queue
                <foreignphrase>jobs</foreignphrase> from remote hosts.  In this case, it acts just like a
                regular host running <application>LPD</application>.  Follow 
		the same procedure in
                section <link linkend="printing-advanced-network-rm">Printers
                  Installed on Remote Hosts</link> to set up such a
                printer.</para>
            </listitem>
            
            <listitem>
              <para>It might support a data stream network connection. In this
                case, you <quote>attach</quote> the printer to one host on the
                network by making that host responsible for spooling <foreignphrase>jobs</foreignphrase> and
                sending them to the printer. Section <link
                  linkend="printing-advanced-network-net-if">Printers with
                  Networked Data Stream Interfaces</link> gives some
                suggestions on installing such printers.</para>
            </listitem>
          </itemizedlist>
        </listitem>
      </itemizedlist>
          
      <sect3 id="printing-advanced-network-rm">
			<title>
				Impressoras Intaladas em um Computador Remoto
			</title>

        <para>The <application>LPD</application> spooling system has built-in
	  support for sending <foreignphrase>jobs</foreignphrase> to
          other hosts also running <application>LPD</application> (or are 
	  compatible with <application>LPD</application>).  This
          feature enables you to install a printer on one host and make it
          accessible from other hosts.  It also works with printers that have
          network interfaces that understand the 
	  <application>LPD</application> protocol.</para>
            
        <para>To enable this kind of remote printing, first install a printer
          on one host, the <emphasis>printer host</emphasis>, using the simple
          printer setup described in the <link linkend="printing-simple">Simple
            Printer Setup</link> section.  Do any advanced setup in <link
            linkend="printing-advanced">Advanced Printer Setup</link> that you
          need.  Make sure to test the printer and see if it works with the
          features of <application>LPD</application> you have enabled.  
	  Also ensure that the
          <emphasis>local host</emphasis> has authorization to use the 
	  <application>LPD</application>
          service in the <emphasis>remote host</emphasis> (see <link
            linkend="printing-advanced-restricting-remote">Restricting Jobs
            from Remote Printers</link>).</para>
            
        <indexterm>
          <primary>printers</primary>
          <secondary>network</secondary>
        </indexterm>
        <indexterm><primary>network printing</primary></indexterm>
        <para>If you are using a printer with a network interface that is
          compatible with <application>LPD</application>, then the 
	  <emphasis>printer host</emphasis> in
          the discussion below is the printer itself, and the
          <emphasis>printer name</emphasis> is the name you configured for the
          printer.  See the documentation that accompanied your printer and/or
          printer-network interface.</para>

        <tip>
          <para>If you are using a Hewlett Packard Laserjet then the printer
            name <literal>text</literal> will automatically perform the LF to
            CRLF conversion for you, so you will not require the
            <filename>hpif</filename> script.</para>
        </tip>
            
        <para>Then, on the other hosts you want to have access to the printer,
          make an entry in their <filename>/etc/printcap</filename> files with
          the following:</para>

        <orderedlist>
          <listitem>
            <para>Name the entry anything you want.  For simplicity, though,
              you probably want to use the same name and aliases as on the
              printer host.</para>
          </listitem>
          
          <listitem>
            <para>Leave the <literal>lp</literal> capability blank, explicitly
              (<literal>:lp=:</literal>).</para>
          </listitem>
          
          <listitem>
            <para>Make a spooling directory and specify its location in the
              <literal>sd</literal> capability.  <application>LPD</application>
	      will store <foreignphrase>jobs</foreignphrase> here
              before they get sent to the printer host.</para>
          </listitem>
          
          <listitem>
            <para>Place the name of the printer host in the
              <literal>rm</literal> capability.</para>
          </listitem>
          
          <listitem>
            <para>Place the printer name on the <emphasis>printer
                host</emphasis> in the <literal>rp</literal>
              capability.</para>
          </listitem>
        </orderedlist>

        <para>That is it.  You do not need to list conversion filters, page
          dimensions, or anything else in the
          <filename>/etc/printcap</filename> file.</para>

        <para>Here is an example.  The host <hostid>rose</hostid> has two
          printers, <literal>bamboo</literal> and <literal>rattan</literal>.
          We will enable users on the host <hostid>orchid</hostid> to print
          to those printers.
          Here is the <filename>/etc/printcap</filename> file for
          <hostid>orchid</hostid> (back from section <link
            linkend="printing-advanced-header-pages-enabling">Enabling Header
            Pages</link>).  It already had the entry for the printer
          <literal>teak</literal>; we have added entries for the two printers
          on the host <hostid>rose</hostid>:</para>

        <programlisting>#
#  /etc/printcap for host orchid - added (remote) printers on rose
#

#
#  teak is local; it is connected directly to orchid:
#
teak|hp|laserjet|Hewlett Packard LaserJet 3Si:\
        :lp=/dev/lpt0:sd=/var/spool/lpd/teak:mx#0:\
        :if=/usr/local/libexec/ifhp:\
        :vf=/usr/local/libexec/vfhp:\
        :of=/usr/local/libexec/ofhp:

#
#  rattan is connected to rose; send <foreignphrase>jobs</foreignphrase> for rattan to rose:
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :lp=:rm=rose:rp=rattan:sd=/var/spool/lpd/rattan:

#
#  bamboo is connected to rose as well:
#
bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :lp=:rm=rose:rp=bamboo:sd=/var/spool/lpd/bamboo:</programlisting>

        <para>Then, we just need to make spooling directories on
          <hostid>orchid</hostid>:</para>
              
        <screen>&prompt.root; <userinput>mkdir -p /var/spool/lpd/rattan /var/spool/lpd/bamboo</userinput>
&prompt.root; <userinput>chmod 770 /var/spool/lpd/rattan /var/spool/lpd/bamboo</userinput>
&prompt.root; <userinput>chown daemon:daemon /var/spool/lpd/rattan /var/spool/lpd/bamboo</userinput></screen>
              
        <para>Now, users on <hostid>orchid</hostid> can print to
          <literal>rattan</literal> and <literal>bamboo</literal>.  If, for
          example, a user on <hostid>orchid</hostid> typed
              
          <screen>&prompt.user; <userinput>lpr -P bamboo -d sushi-review.dvi</userinput></screen>

          the <application>LPD</application> system on <hostid>orchid</hostid>
	  would copy the job to the spooling
          directory <filename>/var/spool/lpd/bamboo</filename> and note that it was a
          DVI job.  As soon as the host <hostid>rose</hostid> has room in its
          <literal>bamboo</literal> spooling directory, the two 
	  <application>LPDs</application> would transfer the
          file to <hostid>rose</hostid>.  The file would wait in <hostid>rose</hostid>'s
          queue until it was finally printed.  It would be converted from DVI to
          &postscript; (since <literal>bamboo</literal> is a &postscript; printer) on
          <hostid>rose</hostid>.</para>
      </sect3>
      
      <sect3 id="printing-advanced-network-net-if">
			<title>
				Impressoras com Interfaces de Rede 
				<foreignphrase>Data Stream</foreignphrase>
			</title>

        <para>Often, when you buy a network interface card for a printer, you
          can get two versions: one which emulates a <foreignphrase>spooler</foreignphrase> (the more
          expensive version), or one which just lets you send data to it as if
          you were using a serial or parallel port (the cheaper version).
          This section tells how to use the cheaper version. For the more
          expensive one, see the previous section <link
            linkend="printing-advanced-network-rm">Printers Installed on
            Remote Hosts</link>.</para>
            
        <para>The format of the <filename>/etc/printcap</filename> file lets
          you specify what serial or parallel interface to use, and (if you
          are using a serial interface), what baud rate, whether to use flow
          control, delays for tabs, conversion of newlines, and more.  But
          there is no way to specify a connection to a printer that is
          listening on a TCP/IP or other network port.</para>
            
        <para>To send data to a networked printer, you need to develop a
          communications program that can be called by the text and conversion
          filters.  Here is one such example: the script
          <command>netprint</command> takes all data on standard input and
          sends it to a network-attached printer.  We specify the hostname of
          the printer as the first argument and the port number to which to
          connect as the second argument to <command>netprint</command>.  Note
          that this supports one-way communication only (FreeBSD to printer);
          many network printers support two-way communication, and you might
          want to take advantage of that (to get printer status, perform
          accounting, etc.).</para>

        <programlisting>#!/usr/bin/perl
#
#  netprint - Text filter for printer attached to network
#  Installed in /usr/local/libexec/netprint
#
$#ARGV eq 1 || die "Usage: $0 &lt;printer-hostname&gt; &lt;port-number&gt;";

$printer_host = $ARGV[0];
$printer_port = $ARGV[1];

require 'sys/socket.ph';

($ignore, $ignore, $protocol) = getprotobyname('tcp');
($ignore, $ignore, $ignore, $ignore, $address)
    = gethostbyname($printer_host);

$sockaddr = pack('S n a4 x8', &amp;AF_INET, $printer_port, $address);

socket(PRINTER, &amp;PF_INET, &amp;SOCK_STREAM, $protocol)
    || die "Can't create TCP/IP stream socket: $!";
connect(PRINTER, $sockaddr) || die "Can't contact $printer_host: $!";
while (&lt;STDIN&gt;) { print PRINTER; }
exit 0;</programlisting>
            
        <para>We can then use this script in various filters.  Suppose we had
          a Diablo 750-N line printer connected to the network.  The printer
          accepts data to print on port number 5100.  The host name of the
          printer is scrivener.  Here is the text filter for the
          printer:</para>

        <programlisting>#!/bin/sh
#
#  diablo-if-net - Text filter for Diablo printer `scrivener' listening
#  on port 5100.   Installed in /usr/local/libexec/diablo-if-net
#
exec /usr/libexec/lpr/lpf "$@" | /usr/local/libexec/netprint scrivener 5100</programlisting>
      </sect3>
    </sect2>
    
    <sect2 id="printing-advanced-restricting">
			<title>
				Restingindo o Uso da Impressora
			</title>
      
      <indexterm>
        <primary>printers</primary>
        <secondary>restricting access to</secondary>
      </indexterm>
      <para>This section gives information on restricting printer usage. The
        <application>LPD</application> system lets you control who can access
	a printer, both locally or
        remotely, whether they can print multiple copies, how large their <foreignphrase>jobs</foreignphrase>
        can be, and how large the printer queues can get.</para>
      
      <sect3 id="printing-advanced-restricting-copies">
			<title>
				Restringindo Multiplas C&oacute;pias
			</title>

        <para>The <application>LPD</application> system makes it easy for
	  users to print multiple copies
          of a file.  Users can print <foreignphrase>jobs</foreignphrase> with <command>lpr -#5</command>
          (for example) and get five copies of each file in the job.  Whether
          this is a good thing is up to you.</para>
            
        <para>If you feel multiple copies cause unnecessary wear and tear on
          your printers, you can disable the <option>-#</option> option to
            &man.lpr.1; by adding the <literal>sc</literal> capability to the
          <filename>/etc/printcap</filename> file.  When users submit <foreignphrase>jobs</foreignphrase>
          with the <option>-#</option> option, they will see:</para>
              
        <screen>lpr: multiple copies are not allowed</screen>


        <para>Note that if you have set up access to a printer remotely (see
          section <link linkend="printing-advanced-network-rm">Printers
            Installed on Remote Hosts</link>), you need the
          <literal>sc</literal> capability on the remote
          <filename>/etc/printcap</filename> files as well, or else users will
          still be able to submit multiple-copy <foreignphrase>jobs</foreignphrase> by using another
          host.</para>

        <para>Here is an example.  This is the
          <filename>/etc/printcap</filename> file for the host
          <hostid>rose</hostid>.  The printer <literal>rattan</literal> is
          quite hearty, so we will allow multiple copies, but the laser
          printer <literal>bamboo</literal> is a bit more delicate, so we will
          disable multiple copies by adding the <literal>sc</literal>
          capability:</para>

        <programlisting>#
#  /etc/printcap for host rose - restrict multiple copies on bamboo
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:\
        :lp=/dev/lpt0:\
        :if=/usr/local/libexec/if-simple:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:sc:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:rw:\
        :if=/usr/local/libexec/psif:\
        :df=/usr/local/libexec/psdf:</programlisting>
            
        <para>Now, we also need to add the <literal>sc</literal> capability on
          the host <hostid>orchid</hostid>'s
          <filename>/etc/printcap</filename> (and while we are at it, let us
          disable multiple copies for the printer
          <literal>teak</literal>):</para>

        <programlisting>#
#  /etc/printcap for host orchid - no multiple copies for local
#  printer teak or remote printer bamboo
teak|hp|laserjet|Hewlett Packard LaserJet 3Si:\
        :lp=/dev/lpt0:sd=/var/spool/lpd/teak:mx#0:sc:\
        :if=/usr/local/libexec/ifhp:\
        :vf=/usr/local/libexec/vfhp:\
        :of=/usr/local/libexec/ofhp:

rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :lp=:rm=rose:rp=rattan:sd=/var/spool/lpd/rattan:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :lp=:rm=rose:rp=bamboo:sd=/var/spool/lpd/bamboo:sc:</programlisting>
            
        <para>By using the <literal>sc</literal> capability, we prevent the
          use of <command>lpr -#</command>, but that still does not prevent
          users from running &man.lpr.1;
          multiple times, or from submitting the same file multiple times in
          one job like this:</para>
              
        <screen>&prompt.user; <userinput>lpr forsale.sign forsale.sign forsale.sign forsale.sign forsale.sign</userinput></screen>
              
        <para>There are many ways to prevent this abuse (including ignoring
          it) which you are free to explore.</para>
      </sect3>
      
      <sect3 id="printing-advanced-restricting-access">
			<title>
				Restringindo o Acesso as Impressoras
			</title>

        <para>You can control who can print to what printers by using the &unix;
          group mechanism and the <literal>rg</literal> capability in
          <filename>/etc/printcap</filename>.  Just place the users you want
          to have access to a printer in a certain group, and then name that
          group in the <literal>rg</literal> capability.</para>
            
        <para>Users outside the group (including <username>root</username>)
	  will be greeted with
          
          <errorname>lpr: Not a member of the restricted group</errorname>
          
          if they try to print to the controlled printer.</para>

        <para>As with the <literal>sc</literal> (suppress multiple copies)
          capability, you need to specify <literal>rg</literal> on remote
          hosts that also have access to your printers, if you feel it is
          appropriate (see section <link
            linkend="printing-advanced-network-rm">Printers Installed on
            Remote Hosts</link>).</para>
            
        <para>For example, we will let anyone access the printer
          <literal>rattan</literal>, but only those in group
          <literal>artists</literal> can use <literal>bamboo</literal>.  Here
          is the familiar <filename>/etc/printcap</filename> for host
          <hostid>rose</hostid>:</para>

        <programlisting>#
#  /etc/printcap for host rose - restricted group for bamboo
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:\
        :lp=/dev/lpt0:\
        :if=/usr/local/libexec/if-simple:

bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:sc:rg=artists:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:rw:\
        :if=/usr/local/libexec/psif:\
        :df=/usr/local/libexec/psdf:</programlisting>

        <para>Let us leave the other example
          <filename>/etc/printcap</filename> file (for the host
          <hostid>orchid</hostid>) alone.  Of course, anyone on
          <hostid>orchid</hostid> can print to <literal>bamboo</literal>.  It
          might be the case that we only allow certain logins on
          <hostid>orchid</hostid> anyway, and want them to have access to the
          printer.  Or not.</para>

        <note>
          <para>There can be only one restricted group per printer.</para>
        </note>
      </sect3>
      
      <sect3 id="printing-advanced-restricting-sizes">
			<title>
				Controlando o Tamanho do Arquivos Enviados
			</title>

        <indexterm><primary>print <foreignphrase>jobs</foreignphrase></primary></indexterm>
        <para>If you have many users accessing the printers, you probably need
          to put an upper limit on the sizes of the files users can submit to
          print.  After all, there is only so much free space on the
          filesystem that houses the spooling directories, and you also need
          to make sure there is room for the <foreignphrase>jobs</foreignphrase> of other users.</para>
            
        <indexterm>
          <primary>print <foreignphrase>jobs</foreignphrase></primary>
          <secondary>controlling</secondary>
        </indexterm>
        <para><application>LPD</application> enables you to limit the maximum
	  byte size a file in a job
          can be with the <literal>mx</literal> capability. The units are in
          <literal>BUFSIZ</literal> blocks, which are 1024 bytes.  If you put
	  a zero for this
          capability, there will be no limit on file size; however, if no
          <literal>mx</literal> capability is specified, then a default limit
          of 1000 blocks will be used.</para>

        <note>
          <para>The limit applies to <emphasis>files</emphasis> in a job, and
            <emphasis>not</emphasis> the total job size.</para>
        </note>

        <para><application>LPD</application> will not refuse a file that is
	  larger than the limit you
          place on a printer.  Instead, it will queue as much of the file up
          to the limit, which will then get printed.  The rest will be
          discarded.  Whether this is correct behavior is up for
          debate.</para>
            
        <para>Let us add limits to our example printers
          <literal>rattan</literal> and <literal>bamboo</literal>.  Since
          those artists' &postscript; files tend to be large, we will limit them
          to five megabytes. We will put no limit on the plain text line
          printer:</para>

        <programlisting>#
#  /etc/printcap for host rose
#

#
#  No limit on job size:
#
rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:mx#0:sd=/var/spool/lpd/rattan:\
        :lp=/dev/lpt0:\
        :if=/usr/local/libexec/if-simple:

#
#  Limit of five megabytes:
#
bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:sc:rg=artists:mx#5000:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:rw:\
        :if=/usr/local/libexec/psif:\
        :df=/usr/local/libexec/psdf:</programlisting>

        <para>Again, the limits apply to the local users only.  If you have
          set up access to your printers remotely, remote users will not get
          those limits.  You will need to specify the <literal>mx</literal>
          capability in the remote <filename>/etc/printcap</filename> files as
          well.  See section <link
            linkend="printing-advanced-network-rm">Printers Installed      on
            Remote Hosts</link> for more information on remote
          printing.</para>
            
        <para>There is another specialized way to limit job sizes from remote
          printers; see section <link
            linkend="printing-advanced-restricting-remote">Restricting Jobs
            from Remote Printers</link>.</para>
      </sect3>
      
      <sect3 id="printing-advanced-restricting-remote">
			<title>
				Restringindo a Impress&atilde;o Remota
			</title>

        <para>The <application>LPD</application> spooling system provides 
	  several ways to restrict print
          <foreignphrase>jobs</foreignphrase> submitted from remote hosts:</para>
            
        <variablelist>
          <varlistentry>
            <term>Host restrictions</term>

            <listitem>
              <para>You can control from which remote hosts a local 
		<application>LPD</application> accepts requests with the files
                <filename>/etc/hosts.equiv</filename> and
                <filename>/etc/hosts.lpd</filename>.
		<application>LPD</application> checks to see if an
                incoming request is from a host listed in either one of these
                files.  If not, <application>LPD</application> refuses the
		request.</para>
                    
              <para>The format of these files is simple: one host name per
                line.  Note that the file
                <filename>/etc/hosts.equiv</filename> is also used by the
                  &man.ruserok.3; protocol, and affects programs like
                  &man.rsh.1; and &man.rcp.1;, so be careful.</para>
              
              <para>For example, here is the
                <filename>/etc/hosts.lpd</filename> file on the host
                <hostid>rose</hostid>:</para>

              <programlisting>orchid
violet
madrigal.fishbaum.de</programlisting>

              <para>This means <hostid>rose</hostid> will accept requests from
                the hosts <hostid>orchid</hostid>, <hostid>violet</hostid>,
                and <hostid role="fqdn">madrigal.fishbaum.de</hostid>. If any
                other host tries to access <hostid>rose</hostid>'s
                <application>LPD</application>, the job will be refused.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term>Size restrictions</term>
            
            <listitem>
              <para>You can control how much free space there needs to remain
                on the filesystem where a spooling directory resides.  Make a
                file called <filename>minfree</filename> in the spooling
                directory for the local printer.  Insert in that file a number
                representing how many disk blocks (512 bytes) of free space
                there has to be for a remote job to be accepted.</para>
                    
              <para>This lets you insure that remote users will not fill your
                filesystem.  You can also use it to give a certain priority to
                local users: they will be able to queue <foreignphrase>jobs</foreignphrase> long after the
                free disk space has fallen below the amount specified in the
                <filename>minfree</filename> file.</para>
                    
              <para>For example, let us add a <filename>minfree</filename>
                file for the printer <literal>bamboo</literal>.  We examine
                <filename>/etc/printcap</filename> to find the spooling
                directory for this printer; here is <literal>bamboo</literal>'s
                entry:</para>
                  
              <programlisting>bamboo|ps|PS|S|panasonic|Panasonic KX-P4455 PostScript v51.4:\
        :sh:sd=/var/spool/lpd/bamboo:sc:rg=artists:mx#5000:\
        :lp=/dev/ttyd5:ms#-parenb cs8 clocal crtscts:rw:mx#5000:\
        :if=/usr/local/libexec/psif:\
        :df=/usr/local/libexec/psdf:</programlisting>

              <para>The spooling directory is given in the <literal>sd</literal>
                capability.  We will make three megabytes (which is 6144 disk blocks)
                the amount of free disk space that must exist on the filesystem for
                <application>LPD</application> to accept remote <foreignphrase>jobs</foreignphrase>:</para>
                  
              <screen>&prompt.root; <userinput>echo 6144 &gt; /var/spool/lpd/bamboo/minfree
              </userinput></screen>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term>User restrictions</term>
            
            <listitem>
              <para>You can control which remote users can print to local
                printers by specifying the <literal>rs</literal> capability in
                <filename>/etc/printcap</filename>.  When
                <literal>rs</literal> appears in the entry for a
                locally-attached printer, <application>LPD</application> will
		accept <foreignphrase>jobs</foreignphrase> from remote
                hosts <emphasis>if</emphasis> the user submitting the job also
                has an account of the same login name on the local host.
                Otherwise, <application>LPD</application> refuses the job.</para>
                    
              <para>This capability is particularly useful in an environment
                where there are (for example) different departments sharing a
                network, and some users transcend departmental boundaries.  By
                giving them accounts on your systems, they can use your
                printers from their own departmental systems.  If you would
                rather allow them to use <emphasis>only</emphasis> your
                printers and not your computer resources, you can give them
                <quote>token</quote> accounts, with no home directory and a
                useless shell like <filename>/usr/bin/false</filename>.</para>
            </listitem>
          </varlistentry>
        </variablelist>
      </sect3>
    </sect2>
    
    <sect2 id="printing-advanced-acct">
			<title>
				Contabilizando o Uso da Impressora
			</title>
          
      <indexterm>
        <primary>accounting</primary>
        <secondary>printer</secondary>
      </indexterm>
      <para>So, you need to charge for printouts.  And why not? Paper and ink
        cost money.  And then there are maintenance costs&mdash;printers are
        loaded with moving parts and tend to break down.  You have examined
        your printers, usage patterns, and maintenance fees and have come up
        with a per-page (or per-foot, per-meter, or per-whatever) cost.  Now,
        how do you actually start accounting for printouts?</para>
          
      <para>Well, the bad news is the <application>LPD</application> spooling
	system does not provide
        much help in this department.  Accounting is highly dependent on the
        kind of printer in use, the formats being printed, and
        <emphasis>your</emphasis> requirements in charging for printer
        usage.</para>
      
      <para>To implement accounting, you have to modify a printer's text
        filter (to charge for plain text <foreignphrase>jobs</foreignphrase>) and the conversion filters (to
        charge for other file formats), to count pages or query the printer
        for pages printed.  You cannot get away with using the simple output
        filter, since it cannot do accounting.  See section <link
          linkend="printing-advanced-filter-intro">Filters</link>.</para>
          
      <para>Generally, there are two ways to do accounting:</para>
      
      <itemizedlist>
        <listitem>
          <para><emphasis>Periodic accounting</emphasis> is the more common
            way, possibly because it is easier.  Whenever someone prints a
            job, the filter logs the user, host, and number of pages to an
            accounting file.  Every month, semester, year, or whatever time
            period you prefer, you collect the accounting files for the
            various printers, tally up the pages printed by users, and charge
            for usage.  Then you truncate all the logging files, starting with
            a clean slate for the next period.</para>
        </listitem>
              
        <listitem>
          <para><emphasis>Timely accounting</emphasis> is less common,
            probably because it is more difficult.  This method has the
            filters charge users for printouts as soon as they use the
            printers.  Like disk quotas, the accounting is immediate. You can
            prevent users from printing when their account goes in the red,
            and might provide a way for users to check and adjust their
            <quote>print quotas.</quote> But this method requires some database
            code to track users and their quotas.</para>
        </listitem>
      </itemizedlist>
      
      <para>The <application>LPD</application> spooling system supports both 
	methods easily: since you
        have to provide the filters (well, most of the time), you also have to
        provide the accounting code.  But there is a bright side: you have
        enormous flexibility in your accounting methods.  For example, you
        choose whether to use periodic or timely accounting. You choose what
        information to log: user names, host names, job types, pages printed,
        square footage of paper used, how long the job took to print, and so
        forth.  And you do so by modifying the filters to save this
        information.</para>
          
      <sect3>
			<title>
				Uma Comtabilidade R&aacute;pida e 
				<foreignphrase>Dirty</foreignphrase>
			</title>

        <para>FreeBSD comes with two programs that can get you set up with
          simple periodic accounting right away.  They are the text filter
          <command>lpf</command>, described in section <link
            linkend="printing-advanced-lpf">lpf: a Text Filter</link>, and
            &man.pac.8;, a program to gather and total
          entries from printer accounting files.</para>

        <para>As mentioned in the section on filters (<link
            linkend="printing-advanced-filters">Filters</link>), 
	  <application>LPD</application> starts
          the text and the conversion filters with the name of the accounting
          file to use on the filter command line.  The filters can use this
          argument to know where to write an accounting file entry.  The name
          of this file comes from the <literal>af</literal> capability in
          <filename>/etc/printcap</filename>, and if not specified as an
          absolute path, is relative to the spooling directory.</para>

        <para><application>LPD</application> starts <command>lpf</command>
	  with page width and length
          arguments (from the <literal>pw</literal> and <literal>pl</literal>
          capabilities).  <command>lpf</command> uses these arguments to
          determine how much paper will be used.  After sending the file to
          the printer, it then writes an accounting entry in the accounting
          file.  The entries look like this:</para>

        <programlisting>2.00 rose:andy
3.00 rose:kelly
3.00 orchid:mary
5.00 orchid:mary
2.00 orchid:zhang</programlisting>
            
        <para>You should use a separate accounting file for each printer, as
          <command>lpf</command> has no file locking logic built into it, and
          two <command>lpf</command>s might corrupt each other's entries if
          they were to write to the same file at the same time.  An easy way
          to insure a separate accounting file for each printer is to use
          <literal>af=acct</literal> in <filename>/etc/printcap</filename>.
          Then, each accounting file will be in the spooling directory for a
          printer, in a file named <filename>acct</filename>.</para>
            
        <para>When you are ready to charge users for printouts, run the
            &man.pac.8; program.  Just change to the spooling directory for
          the printer you want to collect on and type <literal>pac</literal>.
          You will get a dollar-centric summary like the following:</para>
            
        <screen>  Login               pages/feet   runs    price
orchid:kelly                5.00    1   $  0.10
orchid:mary                31.00    3   $  0.62
orchid:zhang                9.00    1   $  0.18
rose:andy                   2.00    1   $  0.04
rose:kelly                177.00  104   $  3.54
rose:mary                  87.00   32   $  1.74
rose:root                  26.00   12   $  0.52

total                     337.00  154   $  6.74</screen>
              
        <para>These are the arguments &man.pac.8; expects:</para>

        <variablelist>
          <varlistentry>
            <term><option>-P<replaceable>printer</replaceable></option></term>

            <listitem>
              <para>Which <replaceable>printer</replaceable> to summarize.
                This option works only if there is an absolute path in the
                <literal>af</literal> capability in
                <filename>/etc/printcap</filename>.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term><option>-c</option></term>
            
            <listitem>
              <para>Sort the output by cost instead of alphabetically by user
                name.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term><option>-m</option></term>
            
            <listitem>
              <para>Ignore host name in the accounting files.  With this
                option, user <username>smith</username> on host
                <hostid>alpha</hostid> is the same user
                <username>smith</username> on host <hostid>gamma</hostid>.
                Without, they are different users.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term><option>-p<replaceable>price</replaceable></option></term>
            
            <listitem>
              <para>Compute charges with <replaceable>price</replaceable>
                dollars per page or per foot instead of the price from the
                <literal>pc</literal> capability in
                <filename>/etc/printcap</filename>, or two cents (the
                default).  You can specify <replaceable>price</replaceable> as
                a floating point number.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term><option>-r</option></term>
            
            <listitem>
              <para>Reverse the sort order.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term><option>-s</option></term>
            
            <listitem>
              <para>Make an accounting summary file and truncate the
                accounting file.</para>
            </listitem>
          </varlistentry>
          
          <varlistentry>
            <term><replaceable>name</replaceable>
              <replaceable>&hellip;</replaceable></term>
            
            <listitem>
              <para>Print accounting information for the given user
                <replaceable>names</replaceable> only.</para>
            </listitem>
          </varlistentry>
        </variablelist>

        <para>In the default summary that &man.pac.8; produces, you see the
          number of pages printed by each user from various hosts.  If, at
          your site, host does not matter (because users can use any host),
          run <command>pac -m</command>, to produce the following
          summary:</para>
              
        <screen>  Login               pages/feet   runs    price
andy                        2.00    1   $  0.04
kelly                     182.00  105   $  3.64
mary                      118.00   35   $  2.36
root                       26.00   12   $  0.52
zhang                       9.00    1   $  0.18

total                     337.00  154   $  6.74</screen>
              

        <para>To compute the dollar amount due,
            &man.pac.8; uses the <literal>pc</literal> capability in the
          <filename>/etc/printcap</filename> file (default of 200, or 2 cents
          per page).  Specify, in hundredths of cents, the price per page or
          per foot you want to charge for printouts in this capability.  You
          can override this value when you run &man.pac.8; with the
          <option>-p</option> option.  The units for the <option>-p</option>
          option are in dollars, though, not hundredths of cents.  For
          example,
              
          <screen>&prompt.root; <userinput>pac -p1.50</userinput></screen>
              
          makes each page cost one dollar and fifty cents.  You can really
          rake in the profits by using this option.</para>

        <para>Finally, running <command>pac -s</command> will save the summary
          information in a summary accounting file, which is named the same as
          the printer's accounting file, but with <literal>_sum</literal>
          appended to the name.  It then truncates the accounting file.  When
          you run &man.pac.8; again, it rereads the
          summary file to get starting totals, then adds information from the
          regular accounting file.</para>
      </sect3>
      
      <sect3>
			<title>
				Como Contar P&aacute;gians Impressas?
			</title>

        <para>In order to perform even remotely accurate accounting, you need
          to be able to determine how much paper a job uses.  This is the
          essential problem of printer accounting.</para>
            
        <para>For plain text <foreignphrase>jobs</foreignphrase>, the problem is not that hard to solve: you
          count how many lines are in a job and compare it to how many lines
          per page your printer supports.  Do not forget to take into account
          backspaces in the file which overprint lines, or long logical lines
          that wrap onto one or more additional physical lines.</para>
            
        <para>The text filter <command>lpf</command> (introduced in <link
            linkend="printing-advanced-lpf">lpf: a Text Filter</link>) takes
          into account these things when it does accounting.  If you are
          writing a text filter which needs to do accounting, you might want
          to examine <command>lpf</command>'s source code.</para>
            
        <para>How do you handle other file formats, though?</para>

        <para>Well, for DVI-to-LaserJet or DVI-to-&postscript; conversion, you
          can have your filter parse the diagnostic output of
          <command>dvilj</command> or <command>dvips</command> and look to see
          how many pages were converted.  You might be able to do similar
          things with other file formats and conversion programs.</para>

        <para>But these methods suffer from the fact that the printer may not
          actually print all those pages.  For example, it could jam, run out
          of toner, or explode&mdash;and the user would still get
          charged.</para>
            
        <para>So, what can you do?</para>

        <para>There is only one <emphasis>sure</emphasis> way to do
          <emphasis>accurate</emphasis> accounting.  Get a printer that can
          tell you how much paper it uses, and attach it via a serial line or
          a network connection.  Nearly all &postscript; printers support this
          notion.  Other makes and models do as well (networked Imagen laser
          printers, for example).  Modify the filters for these printers to
          get the page usage after they print each job and have them log
          accounting information based on that value
          <emphasis>only</emphasis>.  There is no line counting nor
          error-prone file examination required.</para>
            
        <para>Of course, you can always be generous and make all printouts
          free.</para>
      </sect3>
    </sect2>
  </sect1>

  <sect1 id="printing-using">
    <title>Usando as Impessoras</title>
    
    <indexterm>
      <primary>printers</primary>
      <secondary>usage</secondary>
   </indexterm>
    <para>This section tells you how to use printers you have set up with
      FreeBSD.  Here is an overview of the user-level commands:</para>

    <variablelist>
      <varlistentry>
	<term>&man.lpr.1;</term>

	<listitem>
	  <para>Print <foreignphrase>jobs</foreignphrase></para>
	</listitem>
      </varlistentry>
      
      <varlistentry>
	<term>&man.lpq.1;</term>

	<listitem>
	  <para>Check printer queues</para>
	</listitem>
      </varlistentry>
      
      <varlistentry>
	<term>&man.lprm.1;</term>

	<listitem>
	  <para>Remove <foreignphrase>jobs</foreignphrase> from a printer's queue</para>
	</listitem>
      </varlistentry>
    </variablelist>
    
    <para>There is also an administrative command, &man.lpc.8;, described in
      the section <link linkend="printing-lpc">Administering the 
	<application>LPD</application>
	Spooler</link>, used to control printers and their queues.</para>

    <para>All three of the commands &man.lpr.1;, &man.lprm.1;, and &man.lpq.1;
      accept an option <option>-P
	<replaceable>printer-name</replaceable></option> to specify on which
      printer/queue to operate, as listed in the
      <filename>/etc/printcap</filename> file.  This enables you to submit,
      remove, and check on <foreignphrase>jobs</foreignphrase> for various printers.  If you do not use the
      <option>-P</option> option, then these commands use the printer
      specified in the <envar>PRINTER</envar> environment variable.  Finally,
      if you do not have a <envar>PRINTER</envar> environment variable, these
      commands default to the printer named <literal>lp</literal>.</para>

    <para>Hereafter, the terminology <emphasis>default printer</emphasis>
      means the printer named in the <envar>PRINTER</envar> environment
      variable, or the printer named <literal>lp</literal> when there is no
      <envar>PRINTER</envar> environment variable.</para>
    
    <sect2 id="printing-lpr">
			<title>
				Tabalhos de Impress&atilde;o
			</title>
      
			<para>
				Para imprimir arquivos, digite:
			</para>
      
      <screen>&prompt.user; <userinput>lpr <replaceable>filename</replaceable> <replaceable>...</replaceable></userinput></screen>
	    
      <indexterm><primary>printing</primary></indexterm>
      <para>This prints each of the listed files to the default printer.  If
	you list no files, &man.lpr.1; reads data to
	print from standard input.  For example, this command prints some
	important system files:</para>

      <screen>&prompt.user; <userinput>lpr /etc/host.conf /etc/hosts.equiv</userinput></screen>
	    
      <para>To select a specific printer, type:</para>
		    
      <screen>&prompt.user; <userinput>lpr -P <replaceable>printer-name</replaceable> <replaceable>filename</replaceable> <replaceable>...</replaceable></userinput></screen>

      <para>This example prints a long listing of the current directory to the
	printer named <literal>rattan</literal>:</para>
	    
      <screen>&prompt.user; <userinput>ls -l | lpr -P rattan</userinput></screen>
	    
      <para>Because no files were listed for the
	  &man.lpr.1; command, <command>lpr</command> read the data to print
	from standard input, which was the output of the <command>ls
	  -l</command> command.</para>
      
      <para>The &man.lpr.1; command can also accept a wide variety of options
	to control formatting, apply file conversions, generate multiple
	copies, and so forth. For more information, see the section <link
	  linkend="printing-lpr-options">Printing Options</link>.</para>
    </sect2>
    
    <sect2 id="printing-lpq">
		<title>Verificando a Impress&atilde;o</title>
      
      <indexterm><primary>print <foreignphrase>jobs</foreignphrase></primary></indexterm>
      <para>When you print with &man.lpr.1;, the data you wish to print is put
	together in a package called a <quote>print job</quote>, which is sent
	to the <application>LPD</application> spooling system.  Each printer 
	has a queue of <foreignphrase>jobs</foreignphrase>, and
	your job waits in that queue along with other <foreignphrase>jobs</foreignphrase> from yourself and
	from other users.  The printer prints those <foreignphrase>jobs</foreignphrase> in a first-come,
	first-served order.</para>

      <para>To display the queue for the default printer, type &man.lpq.1;.
	For a specific printer, use the <option>-P</option> option.  For
	example, the command

	<screen>&prompt.user; <userinput>lpq -P bamboo</userinput></screen>

	shows the queue for the printer named <literal>bamboo</literal>.  Here
	is an example of the output of the <command>lpq</command>
	command:</para>
	    
      <screen>bamboo is ready and printing
Rank   Owner    Job  Files                              Total Size
active kelly    9    /etc/host.conf, /etc/hosts.equiv   88 bytes
2nd    kelly    10   (standard input)                   1635 bytes
3rd    mary     11   ...                                78519 bytes</screen>
	    
      <para>This shows three <foreignphrase>jobs</foreignphrase> in the queue for <literal>bamboo</literal>.
	The first job, submitted by user kelly, got assigned <quote>job
	number</quote> 9.  Every job for a printer gets a unique job number.
	Most of the time you can ignore the job number, but you will need it
	if you want to cancel the job; see section <link
	  linkend="printing-lprm">Removing Jobs</link> for details.</para>
	  
      <para>Job number nine consists of two files; multiple files given on the
	  &man.lpr.1; command line are treated as part of a single job.  It
	is the currently active job (note the word <literal>active</literal>
	under the <quote>Rank</quote> column), which means the printer should
	be currently printing that job.  The second job consists of data
	passed as the standard input to the &man.lpr.1; command.  The third
	  job came from user <username>mary</username>; it is a much larger
	  job. The pathname of the file she is trying to print is too long to
	  fit, so the &man.lpq.1; command just shows three dots.</para>

      <para>The very first line of the output from &man.lpq.1; is also useful:
	it tells what the printer is currently doing (or at least what 
	<application>LPD</application> thinks the printer is doing).</para>

      <para>The &man.lpq.1; command also support a <option>-l</option> option
	to generate a detailed long listing.  Here is an example of
	<command>lpq -l</command>:</para>
	    
      <screen>waiting for bamboo to become ready (offline ?)
kelly: 1st				 [job 009rose]
       /etc/host.conf                    73 bytes
       /etc/hosts.equiv                  15 bytes

kelly: 2nd				 [job 010rose]
       (standard input)                  1635 bytes

mary: 3rd                                [job 011rose]
      /home/orchid/mary/research/venus/alpha-regio/mapping 78519 bytes</screen>
    </sect2>

    <sect2 id="printing-lprm">
		<title>
			Removendo a Impress&atilde;o 
			( <foreignphrase>Jobs</foreignphrase>
		</title>
      
      <para>If you change your mind about printing a job, you can remove the
	job from the queue with the &man.lprm.1; command.  Often, you can
	even use &man.lprm.1; to remove an active job, but some or all of the
	job might still get printed.</para>
	  
      <para>To remove a job from the default printer, first use
	  &man.lpq.1; to find the job number.  Then type:</para>
	  
      <screen>&prompt.user; <userinput>lprm <replaceable>job-number</replaceable></userinput></screen>
	    
      <para>To remove the job from a specific printer, add the
	<option>-P</option> option.  The following command removes job number
	10 from the queue for the printer <literal>bamboo</literal>:</para>
	    
      <screen>&prompt.user; <userinput>lprm -P bamboo 10</userinput></screen>
      
      <para>The &man.lprm.1; command has a few shortcuts:</para>
      
      <variablelist>
	<varlistentry>
	  <term>lprm -</term>

	  <listitem>
	    <para>Removes all <foreignphrase>jobs</foreignphrase> (for the default printer) belonging to
	      you.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>lprm <replaceable>user</replaceable></term>
	  
	  <listitem>
	    <para>Removes all <foreignphrase>jobs</foreignphrase> (for the default printer) belonging to
	      <replaceable>user</replaceable>.  The superuser can remove other
	      users' <foreignphrase>jobs</foreignphrase>; you can remove only your own <foreignphrase>jobs</foreignphrase>.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>lprm</term>
	  
	  <listitem>
	    <para>With no job number, user name, or <option>-</option>
	      appearing on the command line,
		    &man.lprm.1; removes the currently active job on the
	      default printer, if it belongs to you.  The superuser can remove
	      any active job.</para>
	  </listitem>
	</varlistentry>
      </variablelist>
      
      <para>Just use the <option>-P</option> option with the above shortcuts
	to operate on a specific printer instead of the default. For example,
	the following command removes all <foreignphrase>jobs</foreignphrase> for the current user in the
	queue for the printer named <literal>rattan</literal>:</para>
	  
      <screen>&prompt.user; <userinput>lprm -P rattan -</userinput></screen>
	  
      <note>
	<para>If you are working in a networked environment, &man.lprm.1; will
	  let you remove <foreignphrase>jobs</foreignphrase> only from the
	  host from which the <foreignphrase>jobs</foreignphrase> were submitted, even if the same printer is
	  available from other hosts. The following command sequence
	  demonstrates this:</para>
	      
	<screen>&prompt.user; <userinput>lpr -P rattan myfile</userinput>
&prompt.user; <userinput>rlogin orchid</userinput>
&prompt.user; <userinput>lpq -P rattan</userinput>
Rank   Owner	  Job  Files                          Total Size
active seeyan	  12	...                           49123 bytes
2nd    kelly      13   myfile                         12 bytes
&prompt.user; <userinput>lprm -P rattan 13</userinput>
rose: Permission denied
&prompt.user; <userinput>logout</userinput>
&prompt.user; <userinput>lprm -P rattan 13</userinput>
dfA013rose dequeued
cfA013rose dequeued
	</screen>
      </note>
    </sect2>
    
    <sect2 id="printing-lpr-options">
		<title>Beyond Plain Text: Printing Options</title>
      
      <para>The &man.lpr.1; command supports a number of options that control
	formatting text, converting graphic and other file formats, producing
	multiple copies, handling of the job, and more.  This section
	describes the options.</para>
	  
      <sect3 id="printing-lpr-options-format">
	<title>
		Op&ccedil;&otilde;ess de Formata&ccedil;&atilde;o e Convers&atilde;o
	</title>

	<para>The following &man.lpr.1; options control formatting of the
	  files in the job.  Use these options if the job does not contain
	  plain text or if you want plain text formatted through the
	    &man.pr.1; utility.</para>
	    
        <indexterm><primary>&tex;</primary></indexterm>
	<para>For example, the following command prints a DVI file (from the
	  &tex; typesetting system) named <filename>fish-report.dvi</filename>
	  to the printer named <literal>bamboo</literal>:</para>
	      
	<screen>&prompt.user; <userinput>lpr -P bamboo -d fish-report.dvi</userinput></screen>
	      
	<para>These options apply to every file in the job, so you cannot mix
	  (say) DVI and ditroff files together in a job. Instead, submit the
	  files as separate <foreignphrase>jobs</foreignphrase>, using a different conversion option for each
	  job.</para>

	<note>
	  <para>All of these options except <option>-p</option> and
	    <option>-T</option> require conversion filters installed for the
	    destination printer.  For example, the <option>-d</option> option
	    requires the DVI conversion filter.  Section <link
	      linkend="printing-advanced-convfilters">Conversion
	      Filters</link> gives details.</para>
	</note>

	<variablelist>
	  <varlistentry>
	    <term><option>-c</option></term>

	    <listitem>
	      <para>Print cifplot files.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-d</option></term>
	    
	    <listitem>
	      <para>Print DVI files.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-f</option></term>
	    
	    <listitem>
	      <para>Print FORTRAN text files.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-g</option></term>
	    
	    <listitem>
	      <para>Print plot data.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-i <replaceable>number</replaceable></option></term>
		  
	    <listitem>
	      <para>Indent the output by <replaceable>number</replaceable>
		columns; if you omit <replaceable>number</replaceable>, indent
		by 8 columns.  This option works only with certain conversion
		filters.</para>

	      <note>
		<para>Do not put any space between the <option>-i</option> and
		  the number.</para>
	      </note>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-l</option></term>
	    
	    <listitem>
	      <para>Print literal text data, including control
		characters.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-n</option></term>
	    
	    <listitem>
	      <para>Print ditroff (device independent troff) data.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term>-p</term>
	    
	    <listitem>
	      <para>Format plain text with &man.pr.1; before printing.  See
		  &man.pr.1; for more information.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-T <replaceable>t&iacute;tulo</replaceable></option></term>
	    
	    <listitem>
	      <para>Use <replaceable>t&iacute;tulo</replaceable> on the
		  &man.pr.1; header instead of the file name.  This option has
		effect only when used with the <option>-p</option>
		option.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-t</option></term>
	    
	    <listitem>
	      <para>Print troff data.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term><option>-v</option></term>
	    
	    <listitem>
	      <para>Print raster data.</para>
	    </listitem>
	  </varlistentry>
	</variablelist>
		    
	<para>Here is an example: this command prints a nicely formatted
	  version of the &man.ls.1; manual page on the default printer:</para>
	    
	<screen>&prompt.user; <userinput>zcat /usr/share/man/man1/ls.1.gz | troff -t -man | lpr -t</userinput></screen>
	      
	<para>The &man.zcat.1; command uncompresses the source of the
	  &man.ls.1; manual page and passes it to the &man.troff.1;
	  command, which formats that source and makes GNU troff
	  output and passes it to &man.lpr.1;, which submits the job
	  to the <application>LPD</application> <foreignphrase>spooler</foreignphrase>.  Because we 
	  used the <option>-t</option>
	  option to &man.lpr.1;, the <foreignphrase>spooler</foreignphrase> will convert the GNU
	  troff output into a format the default printer can
	  understand when it prints the job.</para>
      </sect3>
      
      <sect3 id="printing-lpr-options-job-handling">
	<title>
		Op&ccedil;&otilde;ess de Manipula&ccedil;&atilde;o de Impress&atilde;o
	</title>

	<para>The following options to &man.lpr.1; tell 
	  <application>LPD</application> to handle the job
	  specially:</para>
      
	<variablelist>
	  <varlistentry>
	    <term>-# <replaceable>copies</replaceable></term>

	    <listitem>
	      <para>Produce a number of <replaceable>copies</replaceable> of
		each file in the job instead of just one copy.  An
		administrator may disable this option to reduce printer
		wear-and-tear and encourage photocopier usage.  See section
		<link
		  linkend="printing-advanced-restricting-copies">Restricting
		  Multiple Copies</link>.</para>

	      <para>This example prints three copies of
		<filename>parser.c</filename> followed by three copies of
		<filename>parser.h</filename> to the default printer:</para>
		      
	      <screen>&prompt.user; <userinput>lpr -#3 parser.c parser.h</userinput></screen>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term>-m</term>
	    
	    <listitem>
	      <para>Send mail after completing the print job.  With this
		option, the <application>LPD</application> system will send
		mail to your account when it
		finishes handling your job.  In its message, it will tell you
		if the job completed successfully or if there was an error,
		and (often) what the error was.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term>-s</term>
	    
	    <listitem>
	      <para>Do not copy the files to the spooling directory, but make
		symbolic links to them instead.</para>
		    
	      <para>If you are printing a large job, you probably want to use
		this option.  It saves space in the spooling directory (your
		job might overflow the free space on the filesystem where the
		spooling directory resides).  It saves time as well since 
		<application>LPD</application>
		will not have to copy each and every byte of your job to the
		spooling directory.</para>
		    
	      <para>There is a drawback, though: since 
		<application>LPD</application> will refer to the
		original files directly, you cannot modify or remove them
		until they have been printed.</para>
	      
	      <note>
		<para>If you are printing to a remote printer, 
		  <application>LPD</application> will
		  eventually have to copy files from the local host to the
		  remote host, so the <option>-s</option> option will save
		  space only on the local spooling directory, not the remote.
		  It is still useful, though.</para>
	      </note>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term>-r</term>
	    
	    <listitem>
	      <para>Remove the files in the job after copying them to the
		spooling directory, or after printing them with the
		<option>-s</option> option.  Be careful with this
		option!</para>
	    </listitem>
	  </varlistentry>
	</variablelist>
      </sect3>
	  
      <sect3 id="printing-lpr-options-misc">
	<title>
		Op&ccedil;&otilde;ess de P&aacute;ginas de Cabe&ccedil;alho
	</title>

	<para>These options to &man.lpr.1; adjust the text that normally
	  appears on a job's header page. If header pages are suppressed for
	  the destination printer, these options have no effect.  See section
	  <link linkend="printing-advanced-header-pages">Header Pages</link>
	  for information about setting up header pages.</para>
	    
	<variablelist>
	  <varlistentry>
	    <term>-C <replaceable>text</replaceable></term>

	    <listitem>
	      <para>Replace the hostname on the header page with
		<replaceable>text</replaceable>.  The hostname is normally the
		name of the host from which the job was submitted.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term>-J <replaceable>text</replaceable></term>
	    
	    <listitem>
	      <para>Replace the job name on the header page with
		<replaceable>text</replaceable>.  The job name is normally the
		name of the first file of the job, or
		<filename>stdin</filename> if you are printing standard
		input.</para>
	    </listitem>
	  </varlistentry>
	  
	  <varlistentry>
	    <term>-h</term>
	    
	    <listitem>
	      <para>Do not print any header page.</para>
	      
	      <note>
		<para>At some sites, this option may have no effect due to the
		  way header pages are generated.  See <link
		    linkend="printing-advanced-header-pages">Header
		    Pages</link> for details.</para>
	      </note>
	    </listitem>
	  </varlistentry>
	</variablelist>
      </sect3>
    </sect2>
    
    <sect2 id="printing-lpc">
		<title>
			Administrando Impressoras
		</title>
      
      <para>As an administrator for your printers, you have had to install,
	set up, and test them.  Using the &man.lpc.8; command, you
	can interact with your printers in yet more ways. With &man.lpc.8;,
	you can</para>
      
      <itemizedlist>
	<listitem>
	  <para>Start and stop the printers</para>
	</listitem>

	<listitem>
	  <para>Enable and disable their queues</para>
	</listitem>

	<listitem>
	  <para>Rearrange the order of the <foreignphrase>jobs</foreignphrase> in each queue.</para>
	</listitem>
      </itemizedlist>
      
      <para>First, a note about terminology: if a printer is
	<emphasis>stopped</emphasis>, it will not print anything in its queue.
	Users can still submit <foreignphrase>jobs</foreignphrase>, which will wait in the queue until the
	printer is <emphasis>started</emphasis> or the queue is
	cleared.</para>
	  
      <para>If a queue is <emphasis>disabled</emphasis>, no user (except
	<username>root</username>) can submit <foreignphrase>jobs</foreignphrase> for the printer.  An
	<emphasis>enabled</emphasis> queue allows <foreignphrase>jobs</foreignphrase> to be submitted.  A
	printer can be <emphasis>started</emphasis> for a disabled queue, in
	which case it will continue to print <foreignphrase>jobs</foreignphrase> in the queue until the queue
	is empty.</para>
	  
      <para>In general, you have to have <username>root</username> privileges
	to use the &man.lpc.8; command.  Ordinary users can use the &man.lpc.8;
	command to get printer status and to restart a hung printer only.</para>

      <para>Here is a summary of the &man.lpc.8; commands.  Most of the
	commands take a <replaceable>printer-name</replaceable> argument to
	tell on which printer to operate.  You can use <literal>all</literal>
	for the <replaceable>printer-name</replaceable> to mean all printers
	listed in <filename>/etc/printcap</filename>.</para>
      
      <variablelist>
	<varlistentry>
	  <term><command>abort
	      <replaceable>printer-name</replaceable></command></term>

	  <listitem>
	    <para>Cancel the current job and stop the printer.  Users can
	      still submit <foreignphrase>jobs</foreignphrase> if the queue is enabled.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>clean
	      <replaceable>printer-name</replaceable></command></term>
	  
	  <listitem>
	    <para>Remove old files from the printer's spooling directory.
	      Occasionally, the files that make up a job are not properly
	      removed by <application>LPD</application>, particularly if 
	      there have been errors during
	      printing or a lot of administrative activity.  This command
	      finds files that do not belong in the spooling directory and
	      removes them.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>disable
	      <replaceable>printer-name</replaceable></command></term>
	  
	  <listitem>
	    <para>Disable queuing of new <foreignphrase>jobs</foreignphrase>.  If the printer is running, it
	      will continue to print any <foreignphrase>jobs</foreignphrase> remaining in the queue.  The
	      superuser (<username>root</username>) can always submit <foreignphrase>jobs</foreignphrase>,
	      even to a disabled queue.</para>
		  
	    <para>This command is useful while you are testing a new printer
	      or filter installation: disable the queue and submit <foreignphrase>jobs</foreignphrase> as
	      <username>root</username>.  Other users will not be able to submit
	      <foreignphrase>jobs</foreignphrase> until you complete your testing and re-enable the queue with
	      the <command>enable</command> command.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>down <replaceable>printer-name</replaceable>
	      <replaceable>message</replaceable></command></term>
		
	  <listitem>
	    <para>Take a printer down.  Equivalent to
	      <command>disable</command> followed by <command>stop</command>.
	      The <replaceable>message</replaceable> appears as the printer's
	      status whenever a user checks the printer's queue with
		    &man.lpq.1; or status with <command>lpc
		status</command>.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>enable
	      <replaceable>printer-name</replaceable></command></term>
		
	  <listitem>
	    <para>Enable the queue for a printer.  Users can submit <foreignphrase>jobs</foreignphrase> but
	      the printer will not print anything until it is started.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>help
	      <replaceable>command-name</replaceable></command></term>
		
	  <listitem>
	    <para>Print help on the command
	      <replaceable>command-name</replaceable>.  With no
	      <replaceable>command-name</replaceable>, print a summary of the
	      commands available.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>restart
	      <replaceable>printer-name</replaceable></command></term>
	  
	  <listitem>
	    <para>Start the printer.  Ordinary users can use this command if
	      some extraordinary circumstance hangs 
	      <application>LPD</application>, but they cannot start
	      a printer stopped with either the <command>stop</command> or
	      <command>down</command> commands.  The
	      <command>restart</command> command is equivalent to
	      <command>abort</command> followed by
	      <command>start</command>.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>start
	      <replaceable>printer-name</replaceable></command></term>
		
	  <listitem>
	    <para>Start the printer.  The printer will print <foreignphrase>jobs</foreignphrase> in its
	      queue.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>stop
	      <replaceable>printer-name</replaceable></command></term>
	  
	  <listitem>
	    <para>Stop the printer.  The printer will finish the current job
	      and will not print anything else in its queue.  Even though the
	      printer is stopped, users can still submit <foreignphrase>jobs</foreignphrase> to an enabled
	      queue.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>topq <replaceable>printer-name</replaceable>
	      <replaceable>job-or-username</replaceable></command></term>
		
	  <listitem>
	    <para>Rearrange the queue for
	      <replaceable>printer-name</replaceable> by placing the <foreignphrase>jobs</foreignphrase> with
	      the listed <replaceable>job</replaceable> numbers or the <foreignphrase>jobs</foreignphrase>
	      belonging to <replaceable>username</replaceable> at the top of
	      the queue. For this command, you cannot use
	      <literal>all</literal> as the
	      <replaceable>printer-name</replaceable>.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term><command>up
	      <replaceable>printer-name</replaceable></command></term>
		
	  <listitem>
	    <para>Bring a printer up; the opposite of the
	      <command>down</command> command.  Equivalent to
	      <command>start</command> followed by
	      <command>enable</command>.</para>
	  </listitem>
	</varlistentry>
      </variablelist>
      
      <para>&man.lpc.8; accepts the above commands on the command line.  If
	you do not enter any commands, &man.lpc.8; enters an interactive mode,
	where you can enter commands until you type <command>exit</command>,
	<command>quit</command>, or end-of-file.</para>
    </sect2>
  </sect1>
  
  <sect1 id="printing-lpd-alternatives">
	<title>
		Alternativas para o <foreignphrase>Spooler</foreignphrase> 
		Padr&atilde;o
	</title>
    
    <para>If you have been reading straight through this manual, by now you
      have learned just about everything there is to know about the 
      <application>LPD</application>
      spooling system that comes with FreeBSD.  You can probably appreciate
      many of its shortcomings, which naturally leads to the question:
      <quote>What other spooling systems are out there (and work with
      FreeBSD)?</quote></para>

    <variablelist>
      <varlistentry>
	<term>LPRng</term>

 	<indexterm><primary>LPRng</primary></indexterm>	  
	<listitem>
	  <para><application>LPRng</application>, which purportedly means
	    <quote>LPR: the Next
	    Generation</quote> is a complete rewrite of PLP.  Patrick Powell
	    and Justin Mason (the principal maintainer of PLP) collaborated to
	    make <application>LPRng</application>.  The main site for 
	    <application>LPRng</application> is <ulink
	      url="http://www.lprng.org/"></ulink>.</para>
	</listitem>
      </varlistentry>
      <varlistentry>
	<term>CUPS</term>

 	<indexterm><primary>CUPS</primary></indexterm>	  
	<listitem>
	  <para><application>CUPS</application>, the Common UNIX Printing
	    System, provides a portable printing layer for &unix;-based
	    operating systems.  It has been developed by Easy Software
	    Products to promote a standard printing solution for all &unix;
	    vendors and users.</para>

	  <para><application>CUPS</application> uses the Internet Printing
	    Protocol (<acronym>IPP</acronym>) as the basis for managing
	    print <foreignphrase>jobs</foreignphrase> and queues.  The Line Printer Daemon
	    (<acronym>LPD</acronym>) Server Message Block
	    (<acronym>SMB</acronym>), and AppSocket (a.k.a. JetDirect)
	    protocols are also supported with reduced functionality.  CUPS
	    adds network printer browsing and PostScript Printer Description
	    (<acronym>PPD</acronym>) based printing options to support
	    real-world printing under &unix;.</para>

	  <para>The main site for <application>CUPS</application> is <ulink
	    url="http://www.cups.org/"></ulink>.</para>
	</listitem>
      </varlistentry>
    </variablelist>
  </sect1>

  <sect1 id="printing-troubleshooting">
	<title>
		Troubleshooting
	</title>

    <para>After performing the simple test with &man.lptest.1;, you might
      have gotten one of the following results instead of the correct
      printout:</para>

    <variablelist>
      <varlistentry>
	<term>It worked, after awhile; or, it did not eject a full
	  sheet.</term>

	<listitem>
	  <para>The printer printed the above, but it sat for awhile and
	    did nothing.  In fact, you might have needed to press a
	    PRINT REMAINING or FORM FEED button on the printer to get any
	    results to appear.</para>

	  <para>If this is the case, the printer was probably waiting to
	    see if there was any more data for your job before it printed
	    anything.  To fix this problem, you can have the text filter
	    send a FORM FEED character (or whatever is necessary) to the
	    printer.  This is usually sufficient to have the printer
	    immediately print any text remaining in its internal buffer.
	    It is also useful to make sure each print job ends on a full
	    sheet, so the next job does not start somewhere on the middle
	    of the last page of the previous job.</para>

	  <para>The following replacement for the shell script
	    <filename>/usr/local/libexec/if-simple</filename> prints a
	    form feed after it sends the job to the printer:</para>

	  <programlisting>#!/bin/sh
#
# if-simple - Simple text input filter for lpd
# Installed in /usr/local/libexec/if-simple
#
# Simply copies stdin to stdout.  Ignores all filter arguments.
# Writes a form feed character (\f) after printing job.

/bin/cat &amp;&amp; printf "\f" &amp;&amp; exit 0
exit 2</programlisting>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>It produced the <quote>staircase effect.</quote></term>

	<listitem>
	  <para>You got the following on paper:</para>

	  <programlisting>!"#$%&amp;'()*+,-./01234
                "#$%&amp;'()*+,-./012345
                                 #$%&amp;'()*+,-./0123456</programlisting>

	  <indexterm><primary>MS-DOS</primary></indexterm>
 	  <indexterm><primary>OS/2</primary></indexterm>
 	  <indexterm><primary>ASCII</primary></indexterm>
	  <para>You have become another victim of the <emphasis>staircase
	    effect</emphasis>, caused by conflicting interpretations of
	    what characters should indicate a new line.  &unix; style
	    operating systems use a single character:  ASCII code 10, the
	    line feed (LF). &ms-dos;, &os2;, and others uses a pair of
	    characters, ASCII code 10 <emphasis>and</emphasis> ASCII code
	    13 (the carriage return or CR).  Many printers use the &ms-dos;
	    convention for representing new-lines.</para>

	  <para>When you print with FreeBSD, your text used just the line
	    feed character.  The printer, upon seeing a line feed
	    character, advanced the paper one line, but maintained the
	    same horizontal position on the page for the next character
	    to print.  That is what the carriage return is for:  to move
	    the location of the next character to print to the left edge
	    of the paper.</para>

	  <para>Here is what FreeBSD wants your printer to do:</para>

	  <informaltable frame="none">
	    <tgroup cols="2">
	      <tbody>
		<row>
		  <entry>Printer received CR</entry>
		  <entry>Printer prints CR</entry>
		</row>

		<row>
		  <entry>Printer received LF</entry>
		  <entry>Printer prints CR + LF</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </informaltable>

	  <para>Here are some ways to achieve this:</para>

	  <itemizedlist>
	    <listitem>
	      <para>Use the printer's configuration switches or control
		panel to alter its interpretation of these characters.
		Check your printer's manual to find out how to do
		this.</para>

	      <note>
	        <para>If you boot your system into other operating systems
		  besides FreeBSD, you may have to
		  <emphasis>reconfigure</emphasis> the printer to use a an
		  interpretation for CR and LF characters that those other
		  operating systems use.  You might prefer one of the other
		  solutions, below.</para>
	      </note>
	    </listitem>

	    <listitem>
			<para>
				Ter um driver serial para FreeBSD converter o caracter LF em
		CRLF.  Claro, ele trabalha <emphasis>somente</emphasis> com impressoras 
		na porta serial.  Para habilitar essa fun&ccedil;&atilde;o, use a 
		op&ccedil;&atilde;o <literal>ms#</literal> e coloque o modo 
		<literal>onlcr</literal> no arquivo <filename>/etc/printcap</filename>. 
			</para>
	    </listitem>

	    <listitem>
			<para>
				Enviar um <emphasis>c&oacute;digo escape</emphasis> para a 
		impressora para term um tratamento tempor&aacute;rio diferente do
		caracter LF.  Condulte o manual de sua impressora para conhecer as
		seg&utrema;&ecirc;ncias escape que sua impressora pode suportar.  
		Quando voc&ecirc; encontrar o c&oacute;digo correto, modifique o
		filtro texto para enviar este c&oacute;digo inicialmente, para apos
		enviar o arquivo a ser impresso.
			</para>

	      <indexterm><primary>PCL</primary></indexterm>
		<para>
			Aqui tem um exemplo de filktro texto para as impressoras que 
		reconhecem os c&oacute;digos da linguagem PCL da Hewlett Packard.  Esse
		filtro faz a impressora tratar os caracteres LF como sendo uma 
		seg&utrema;&ecirc;ncia de LF + CR; entao ele envia o arquivo; 
		ent&atilde;o ele envia um caracter FF ( alimenta&ccedil;&atilde;o de
		formul&aacute;rio ) para ejetar a &uacute;ltima p&aacute;gina do 
		arquivo.  Ele deve funcionar com todas as impressoras da Hewlett Packard.
		</para>

	      <programlisting>#!/bin/sh
#
# hpif - Simple text input filter for lpd for HP-PCL based printers
# Installed in /usr/local/libexec/hpif
#
# Simply copies stdin to stdout.  Ignores all filter arguments.
# Tells printer to treat LF as CR+LF.  Ejects the page when done.

printf "\033&amp;k2G" &amp;&amp; cat &amp;&amp; printf "\033&amp;l0H" &amp;&amp; exit 0
exit 2</programlisting>

		<para>
			Aqui um exemplo do <filename>/etc/printcap</filename> de um
		computador chamado <hostid>orchid</hostid>.  Ele tem uma &uacute;nica
		impressora ligada a ele na primeira porta paralela, uma Hewlett Packard
		LaserJet 3Si, chamada de <literal>teak</literal>.  Ele esta usando o
		script acima como um filtro de texto:
		</para>

	      <programlisting>#
#  /etc/printcap for host orchid
#
teak|hp|laserjet|Hewlett Packard LaserJet 3Si:\
        :lp=/dev/lpt0:sh:sd=/var/spool/lpd/teak:mx#0:\
        :if=/usr/local/libexec/hpif:</programlisting>
	    </listitem>
          </itemizedlist>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>A Impressora Sobreescreve as linhas.</term>

	<listitem>
		<para>
			A impressora nunca avan&ccedil;a para linha abaixo.  Todas as linhas
	do texto s&atilde;o impressas no topo da p&aacute;gina e uma sobre as
	outras.
		</para>

		<para>
			Esse problema &eacute; o <quote>oposto</quote> do efeito escada,
		descrito acima, e muito mais raro.  Em algum lugar, o caracter LF
		que &eacute; usado pelo FreeBSD como final de linha, &eacute; tratado 
		como o caracter CR, que retorna a cabe&ccedil;a de impress&atilde;o
		para o inicio da linha, mas n&atilde;o move uma linha para baixo,
		como deveria ser.
		</para>

	  <para>
			Use as chaves de configura&ccedil;&atilde;o da impressora ou o painel 
	de controle para for&ccedil;ar a seguinte interpreta&ccedil;&atilde;o dos 
	carateres LF e CR.
		</para>

	  <informaltable frame="none">
	    <tgroup cols="2">
	      <thead>
		<row>
		  <entry>Impressora Recebe</entry>
		  <entry>Impressora Imprime</entry>
		</row>
	      </thead>

	      <tbody>
		<row>
		  <entry>CR</entry>
		  <entry>CR</entry>
		</row>

		<row>
		  <entry>LF</entry>
		  <entry>CR + LF</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </informaltable>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>A Impressora Perde Caracteres.</term>

	<listitem>
	  <para>
		Enquanto est&aacute; imprimindo, a impressora n&atilde;o imprime alguns
	caracteres po linha.  O problema pode estar na configura&ccedil;&atilde;o 
	<foreignphrase>raw</foreignphrase>, perdendo mais e mais caracteres.
		</para>

	  <para>
		O problema &eacute; que a impressora n&atilde;o pode manter
	a velociade a qual o computador est&aacute; usando para enviar
	os dados pela porta serial ( esse problema n&atilde;o deve ocorrer
	na porta paralela).  Existem duas maneiras de solucionar o problema:
	</para>

	  <itemizedlist>
	    <listitem>
	      <para>
		Se a impressora suportar o controle por XON/XOFF, o FreeeBSD
	ir&aacute; usa-lo se for especificado o modo <literal>ixon</literal> 
	na op&ccedil;&atilde;o <literal>ms#</literal>.
		</para>
	    </listitem>

	    <listitem>
		<para>
		Se a impressora suportar 
	<foreignphrase> carrier flow control</foreignphrase>,
	especifique o modo <literal>crtscts</literal> na op&ccedil;&atilde;o
	 <literal>ms#</literal>.
		Tenha certeza que o cabo que conecta a impressora ao 
	computador esteja corretamente feito para 
	<foreignphrase> carrier flow control</foreignphrase>,
		</para>
	    </listitem>
	  </itemizedlist>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>A Impressora Imprime Lixo.</term>

	<listitem>
	<para>
		A impressora aparentemente imprime lixo rand&ocirc;mico
	e n&atilde;o o texto solicitado.
	</para>

	<para>
		Esse &eacute; outro sintoma de par&acirc;metros
	incorretos da comunica&ccedil;&atilde;o com a impressora serial.
	Verifique novamente os valores nas op&ccedil;&otilde;es da taxa
	bps ( <literal>br</literal> ) e da paridade ( <literal>ms#</literal> );
	tenha certeza das configura&ccedil;&otilde;es especificadas no
	arquivo <filename>/etc/printcap</filename>.
	</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>Nada Acontece.</term>

	<listitem>
	<para>
		Se nada acontecer, o problema, provavelmente, est&aacute;
	dentro do FreeBSD e n&atilde;o no 
	<foreignphrase>hardware</foreignphrase>.  Adicione a 
	op&ccedil;&atilde;o (<literal>lf</literal>) no arquivo 
	<filename>/etc/printcap</filename> na impressora que voc&ecirc;
	est&aacute; verificando.  No nosso exemplo, estamos utilizando a 
	impressora <literal>rattan</literal>, com a op&ccedil;&atilde;o
	<literal>lf</literal>:
	</para>

	  <programlisting>rattan|line|diablo|lp|Diablo 630 Line Printer:\
        :sh:sd=/var/spool/lpd/rattan:\
        :lp=/dev/lpt0:\
        :if=/usr/local/libexec/if-simple:\
        :lf=/var/log/rattan.log</programlisting>

	<para>
		Ent&atilde;o, tente novamente.  Verifique o arquivo de
	<foreignphrase>log</foreignphrase> ( no nosso exemplo,
	<filename>/var/log/rattan.log</filename>) para ver qualquer 
	mensagem de erro que possa aparecer.  Baseado nessas mensagens, 
	voc&ecirc; poder&aacute; corrigir o problema.
	</para>

	<para>
		Se voc&ecirc; n&atilde;o especificar a op&ccedil;&atilde;o
	<literal>lf</literal> o <application>LPD</application> usar&aacute; 
	<filename>/dev/console</filename> como padr&atilde;o.
	</para>
	</listitem>
      </varlistentry>
    </variablelist>
  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->


