<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;
<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN">
%authors;
<!ENTITY % teams PUBLIC "-//FreeBSD//ENTITIES DocBook Team Entities//EN">
%teams;
<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//EN">
%mailing-lists;
<!ENTITY % trademarks PUBLIC "-//FreeBSD//ENTITIES DocBook Trademark Entities//EN">
%trademarks;
<!ENTITY % not.published "IGNORE">
]>

<article>
  <articleinfo>
    <title>Mirroring FreeBSD</title>
    <pubdate>$FreeBSD: /repoman/r/dcvs/doc/en_US.ISO8859-1/articles/hubs/article.sgml,v 1.42 2003/12/24 00:26:39 simon Exp $</pubdate>
    <authorgroup>
      <author>
        <firstname>Jun</firstname>
        <surname>Kuriyama</surname>
        <affiliation>
          <address><email>kuriyama@FreeBSD.org</email></address>
        </affiliation>
      </author>
      <author>
        <firstname>Valentino</firstname>  
        <surname>Vaschetto</surname>
        <affiliation>
          <address><email>logo@FreeBSD.org</email></address>                             
        </affiliation>
      </author>
      <author>
        <firstname>Daniel</firstname>
        <surname>Lang</surname>
        <affiliation>
          <address><email>dl@leo.org</email></address>
        </affiliation>
      </author>
      <author>
	<firstname>Ken</firstname>
	<surname>Smith</surname>
	<affiliation>
	  <address><email>kensmith@cse.buffalo.edu</email></address>
	</affiliation>
      </author>
    </authorgroup>

    <legalnotice id="trademarks" role="trademarks">
      &tm-attrib.freebsd;
      &tm-attrib.cvsup;
      &tm-attrib.general;
    </legalnotice>

    <abstract>

      <para>Este &eacute; um artigo que trata sobre como espelhar o FreeBSD,
	o mesmo esta em fase de elabora&ccedil;&atilde;o pelos coordenadores do
	sites espelho.</para>

    </abstract>
  </articleinfo>

  <sect1 id="mirror-contact">
    <title>Informa&ccedil;&otilde;es para contato</title>

    <para>Os coordenadores do sistema de espelhos podem ser alcan&ccedil;ados
      atrav&eacute;s do email <email>mirror-admin@FreeBSD.org</email>.  Existe
      a lista de discuss&atilde;o &a.hubs;.</para>
      
  </sect1>

  <sect1 id="mirror-requirements">
    <title>Requisitos para espelhar o FreeBSD</title>
    <sect2 id="mirror-diskspace">

      <title>Disk Space</title>
      
      <para>Espa&ccedil;o em disco &eacute; o requisito mais importantes.
      	Dependendo do conjunto de releases, arquiteturas, e de qu&atilde;o
	completo voc&ecirc; deseja que seja o seu mirror, uma enorme
	quantidade de espa&ccedil;o em disco pode ser consumida.  Tenha
	tamb&eacute;m em mente que os mirrors <emphasis>oficiais</emphasis>
	s&atilde;o provavelmente requeridos que sejam completos.  O
	reposit&oacute;rio de CVS e as p&aacute;ginas web devem ser sempre
	espelhados completamente.  Note tamb&eacute;m que os numeros
	aqui mencionados est&atilde;o refletindo o estado atual (4.9-RELEASE
	e 5.1-RELEASE).  Abrigar outras releases, bem como
	desenvolvimentos adicionais apenas ir&aacute; aumentar a a quantia
	necess&aacute;ria.  Certifique-se de manter algum espa&ccedil;o extra (entre
	10 e 20%) dispon&iacute;vel, al&eacute;m do mencionado abaixo, apenas por
	seguran&ccedil;a.  Aqui est&atilde;o algumas estimativas aproximadas:</para>
      </para>

      <itemizedlist>
        <listitem><para>Servidor de FTP completo: 126 GB</para></listitem>
        <listitem><para>Reposit&oacute;rio CVS: 2.7 GB</para></listitem>
        <listitem><para>Deltas CTM: 1.8 GB</para></listitem>
        <listitem><para>P&aacute;ginas Web: 300 MB</para></listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="mirror-bandwidth">

      <title>Conectividade de rede e disponibilidade de banda IP</title>

      <para>Obviamente, voc&ecirc; precisa estar conectado a Internet.  A
	largura de banda requerida depende do uso pretendido para o
	seu site espelho.  Se voc&ecirc; deseja apenas espelhar algumas
	partes do FreeBSD para uso local no seu site e/ou na sua 
	intranet, a demanda pode ser muito menor do que se voc&ecirc; desejar
	disponibilizar os arquivos publicamente.  Se voce pretende se
	tornar um site espelho official,  a largura de banda requerida
	ser&aacute; mesmo mais elevada.  N&oacute;s s&oacute; podemos dar estimativas
	grosseiras aqui:</para>
      </para>
      
      <itemizedlist>
         <listitem><para>Site local, sem acesso publico: basicamente n&atilde;o 
	  existe um min&iacute;mo, mas &lt; 2 Mbps pode tornar o processo de
	  sincronismo muito lento.</para></listitem>

         <listitem><para>Site p&uacute;blico n&atilde;o-oficial: 34 Mbps &eacute;
	  provavelmente um bom come&ccedil;o.</para></listitem>

         <listitem><para>Site Oficial: &gt; 100 Mbps &eacute; o recomendado, 
	  e o seu servidor deve estar conectado o mais perto possivel
	  do seu roteador de borda.</para></listitem>
      </itemizedlist>

    </sect2>
    
    <sect2 id="mirror-system">

      <title>Requisitos de sistema, CPU e Mem&oacute;ria</title>

	<para>Isto &eacute; algo que depende do numero esperado de clientes, o
	  que &eacute; determinado pela politica de uso do servidor.  Ele
	  tamb&eacute;m &eacute; afetado pelo tipo de servi&ccedil;os que voc&ecirc; deseja
	  oferecer.  Servi&ccedil;os b&aacute;sicos de FTP ou http podem n&atilde;o
	  necessitar de uma grande quantidade de recursos.  Mas fique
	  atento se voc&ecirc; for disponibilizar os servi&ccedil;os de CVSup, rsync
	  ou mesmo de AnonCVS.  Estes servi&ccedil;os podem ter um grande
	  impacto nos requisitos de CPU e de mem&oacute;ria.  Especialmente o
	  rsync o qual &eacute; considerado um devorador de mem&oacute;ria, e o CVSup
	  certamente consome um pouco da CPU.  No caso do AnonCVS pode
	  ser interessante configurar um sistema de arquivo residente 
	  em mem&oacute;ria (MFS) de no minimo 300MB, assim voc&ecirc; precisa
	  considerar este consumo quando avaliar a mem&oacute;ria requerida.  A
	  seguir temos alguns exemplos e sugest&otilde;es grosseiras.</para>

	<para>Para um site de visita&ccedil;&atilde;o m&eacute;dia o qual ofere&ccedil;a o servi&ccedil;o
	  de <application>rsync</application>, voc&ecirc; pode considerar o
	  uso de um servidor com uma CPU com clock entre 800MHz e 1 GHz,
	  e com um m&iacute;nimo de 512MB de mem&oacute;ria RAM.  Esta &eacute; provavelmente
	  a configura&ccedil;&atilde;o m&iacute;nima para um site espelho
	  <emphasis>oficial</emphasis>.</para>

	<para>Para um site de visita&ccedil;&atilde;o frequente, voc&ecirc; definitivamente
	  vai precisar de mais mem&oacute;ria RAM (considere 2 GB como um bom
	  come&ccedil;o) e possivelmente mais poder de processamento (CPU),  o
	  que pode significar que voc&ecirc; precisa ir para um sistema multi
	  processado (SMP).</para>

	<para>Voc&ecirc; tamb&eacute;m pode considerar o uso de um subsistema r&aacute;pido
	  de discos.  As opera&ccedil;&otilde;es em um reposit&oacute;rio CVS necesistam de
	  um subsistema de discos r&aacute;pido (o uso de RAID &eacute; altamente
	  desej&aacute;vel).  Uma controladora SCSI que possua cache dedicado
	  tamb&eacute;m pode melhorar a velocidade uma vez que a maioria destes
	  servi&ccedil;os incorre na realiza&ccedil;&atilde;o de um grande numero de pequenas
	  modifica&ccedil;&otilde;es para o disco.</para>
    
   </sect2>
   
   <sect2 id="mirror-services">
  
    <title>Servi&ccedil;os para oferecer</title>
      
      <para>Cada site espelho deve disponibilizar obrigatoriamente
	um conjunto de servi&ccedil;os b&aacute;sicos.  Em adi&ccedil;&atilde;o a estes servi&ccedil;os
	obrigat&oacute;rios, existe um grande numero de servi&ccedil;os opcionais
	os quais o administrador do servidor pode optar por oferecer.
	Esta ir&aacute; detalhar quais servi&ccedil;os voc&ecirc; pode oferecer, bem como
	detalha como proceder para implementa-los.</para>

      <sect3 id="mirror-serv-ftp">
        <title>FTP<title>
	
        <para>Este &eacute; um dos servi&ccedil;os mais b&aacute;sicos, e ele &eacute; requerido 
	  em todos os mirrors que oferecem acesso publico &agrave;s
	  distribui&ccedil;oes via FTP.  O acesso ao FTP deve ser an&ocirc;nimo, e
	  nao &eacute; permitido o uso de taxas de upload/download (algo
	  rid&iacute;culo de qualquer forma).  Nao &eacute; necess&aacute;rio ter o upload
	  de arquivos habilitado (e ele <emphasis>nunca</emphasis> 
	  deve ser permitido na &aacute;rea onde os arquivos do FreeBSD 
	  sao mantidos).  Os arquivos do FreeBSD devem ficar
	  dispon&iacute;veis sob o caminho <filename>/pub/FreeBSD
	  </filename>.</para>
	  
        <para>Abaixo voc&ecirc; encontra diversos softwares dispon&iacute;veis os
	  quais podem ser configurados para operarem como servidor de
	  FTP An&ocirc;nimo (em ordem alfab&eacute;tica).</para>
	
          <itemizedlist>
	  
            <listitem>
	      <para><command>/usr/libexec/ftpd</command>: 
		&Eacute; o servidor de FTP nativo do FreeBSD.  Consulte o 
		&man.ftpd.8;.</para>
            </listitem>
	    
            <listitem>
              <para><filename role="package">ftp/ncftpd</filename>: 
		Um pacote comercial, gratuito para uso
		educacional.</para>
            </listitem>
	    
            <listitem>
              <para><filename role="package">ftp/oftpd</filename>: 
		Um ftpd desenvolvido com foco principal voltado para a
		seguran&ccedil;a.</para>
            </listitem>
	    
            <listitem>
              <para><filename role="package">ftp/proftpd</filename>: 
		Um ftpd modular e muito flex&iacute;vel</para>
            </listitem>
	    
            <listitem>
              <para><filename role="package">ftp/pure-ftpd</filename>: 
		Outro ftpd desenvolvido com foco na seguran&ccedil;a.</para>
            </listitem>
	    
            <listitem>
	      <para><filename role="package">ftp/twoftpd</filename>: 
		Ftpd desenvolvido com foco na seguran&ccedil;a.</para>
	    </listitem>
	    
            <listitem>
	      <para><filename role="package">ftp/vsftpd</filename>: 
		Um ftpd <quote>muito seguro</quote>.</para>
	    </listitem>
	    
            <listitem>
              <para><filename role="package">ftp/wu-ftpd</filename>: 
		O ftpd da universidade de Washington. Ele se tornou
		impopular, por causa da enorme quantidade de problemas
		de seguran&ccedil;a que foram descobertos nele.  Se voc&ecirc;
		optar por utilizar este software, certifique-se de
		mant&ecirc;-lo atualizado.</para>
            </listitem>
          </itemizedlist>
	  
	  <para>O <application>ftpd</application> nativo do FreeBSD, 
	    o <application>proftpd</application>, o <application>wu-ftpd
	    </application> e talvez o <application>ncftpd</application> 
	    sao os programas utilizados com mais frequ&ecirc;ncia.  Os
	    demais nao possuem uma grande base de usu&aacute;rios entre
	    nossos sites espelho.  Um item a ser considerado &eacute; que
	    voc&ecirc; pode precisar de flexibilidade para controlar quantas
	    conexoes simult&acirc;neas serao permitidas no servidor,
	    limitando quanto da banda IP e dos recursos do sistema sao
	    consumidos.</para>
      </sect3>
      
      <sect3 id="mirror-serv-rsync">
        <title>RSYNC</title>

        <para>O <application>rsync</application> pode ser oferecido
	  como op&ccedil;ao para acesso ao conte&uacute;do da area de FTP do
	  FreeBSD, desta forma outros sites espelho podem utilizar o
	  seu sistema como fonte para o sistema deles.  O protocolo do
	  rsync &eacute; diferente do FTP em muitos aspectos.  Ele &eacute; muito
	  mais amig&aacute;vel com rela&ccedil;ao ao consumo de banda IP,  uma vez
	  que apenas as diferen&ccedil;as entre os arquivos sao tranferidas
	  ao inv&eacute;s de transferir o arquivo completo quando ele se
	  altera.  O <application>rsync</application> necessita de uma
	  grande quantidade de mem&oacute;ria para cada inst&acirc;ncia.  A
	  quantidade de mem&oacute;ria alocada depende do tamanho do modulo
	  sincronizado  em termos de numero de diret&oacute;rios e de
	  arquivos.  O <application>rsync</application> pode utilizar o 
	  <command>rsh</command> e o <command>ssh</command> (agora &eacute; 
	  padrao) para transporte dos dados, ou entao utilizar o seu
	  pr&oacute;prio protocolo para acesso stand-alone (este &eacute; o m&eacute;todo 
	  preferido para um servidor publico de rsync).  Autentica&ccedil;ao,
	  limite para o n&uacute;mero de conexoes e outras restri&ccedil;oes podem
	  ser aplicadas.  At&eacute; o momento s&oacute; existe um pacote de
	  software dispon&iacute;vel para implementar um servidor de
	  rsync:</para>
          
	  <itemizedlist>
            <listitem>i
	      <para><filename role="package">net/rsync</filename></para>
	    </listitem>
          </itemizedlist>
      
      </sect3>
      <sect3 id="mirror-serv-http">
        <title>HTTP (Necess&aacute;rio para as p&aacute;ginas web, Opcional nos
	  servidores FTP)</title>

        <para>Se voc&ecirc; deseja oferecer as p&aacute;ginas web do FreeBSD, voc&ecirc;
	  precisa instalar um servidor web, conhecido por
	  <application>httpd</application>.  Opcionalemente voc&ecirc; pode
	  oferecer acesso a sua &aacute;rvore de FTP via HTTP.  A escolha do
	  software do servidor web &eacute; uma escolha do administrador do
	  site espelho.  As op&ccedil;&otilde;es mais populares s&atilde;o:</para>

          <itemizedlist>
            <listitem>
              <para><filename role="package">www/apache13</filename>:
                O apache &eacute; o servidor web mais amplamente utilizado na
		Internet.  Ele &eacute; usado extensivamente pelo projeto
		FreeBSD.  Voc&ecirc; tamb&eacute;m pode desejar utilizar a nova
		gera&ccedil;&atilde;o do servidor web apache, dispon&iacute;vel na cole&ccedil;&atilde;o
		de ports como <filename role="package">www/apache2
		</filename>.</para>
            </listitem>

            <listitem>
              <para><filename role="package">www/thttpd</filename>:
                Se voc&ecirc; for servir uma grande quantidade de conteudo
		est&aacute;tico, voc&ecirc; pode constatar que o uso de uma
		aplica&ccedil;&atilde;o como o tHttpd &eacute; mais eficiente do que o uso
		do Apache.  Ele &eacute; otimizado para operar sob a m&aacute;xima
		performance no FreeBSD.</para>
            </listitem>

            <listitem>
              <para><filename role="package">www/boa</filename>:
                O Boa &eacute; uma outra alternativa ao uso do tHttpd e do
		Apache.  Ele deve prover uma performance
		consideravelmente melhor que a do Apache para conteudos
		puramente est&aacute;ticos.  Ele n&atilde;o possui, pelo menos at&eacute; o
		momento em que esse artigo est&aacute; sendo escrito, o mesmo
		conjunto de otimiza&ccedil;&otilde;es para o ambiente FreeBSD que 
		encontramos dispon&iacute;veis no tHttpd.</para>
            </listitem>
          </itemizedlist>
      
      </sect3>
      <sect3 id="mirror-serv-cvsup">
        <title>CVSup (desejado para reposit&oacute;rios CVS)</title>

        <para>O <application>CVSup</application> &eacute; um meio muito
	  eficiente de distribui&ccedil;&atilde;o de arquivos.  Ele trabalha de
	  forma semelhante ao <application>rsync</application>, por&eacute;m
	  foi desenvolvido para uso com reposit&oacute;rios CVS.  Se voc&ecirc;
	  desejar disponibilizar um reposit&oacute;rio CVS do FreeBSD, voc&ecirc;
	  deve considerar fortemente faz&ecirc;-lo via <application>CVSup
	  </application>.  &Eacute; poss&iacute;vel oferecer acesso a um reposit&oacute;rio
	  CVS via <application>AnonCVS</application>, FTP, <application>
	  Rsync</application> ou HTTP, mas as pessoas v&atilde;o se
	  beneficiar muito mais de um acesso via <application>CVSup
	  </application>.  O <application>CVSup</application> foi
	  desenvolvido pelo &a.jdp;.  &Eacute; um pouco complicado instal&aacute;-lo
	  em uma plataforma diferente do FreeBSD, uma vez que ele foi
	  escrito em Modula-3 e consequentemente necessita de um
	  ambiente Modula-3.  O John Polstra  preparaou uma vers&atilde;o
	  simplificada do M3 a qual &eacute; suficiente para executar o 
	  <application>CVSup</application>, a qual pode ser facilmente
	  instalada.  Consulte <ulink 
	  url="http://www.polstra.com/projects/freeware/ezm3/">Ezm3</ulink>
          para maiores detalhes. Os ports relacionados s&atilde;o:</para>

          <itemizedlist>
            <listitem>
              <para><filename role="package">net/cvsup</filename>: 
		O port nativo do CVSup (cliente e servidor) o qual
		requer a instala&ccedil;&atilde;o do <filename role="package">lang/ezm3
		</filename>.</para>
            </listitem>

            <listitem>
              <para><filename role="package">net/cvsup-mirror</filename>: 
		O kit de espelhamento do CVSup, o qual requer o 
                <filename role="package">net/cvsup</filename>, e que o
		configura para atuar no espelhamento dos servi&ccedil;os.
		Alguns administradores de sistema podem preferir uma
		forma diferente de configurar um site espelho.</para>
            </listitem>
          </itemizedlist>
	  
	  <para>Existem alguns outros, como o <filename role="package">
	    net/cvsup-without-gui</filename> o qual voc&ecirc; pode desejar
	    olhar.  Se voc&ecirc; preferir um pacote bin&aacute;rio, compilado
	    estaticamente, de uma olhada 
	    <ulink url="http://people.FreeBSD.org/~jdp/s1g/">
	    aqui</ulink>.  Esta pagina continua mencionando o erro SG1
	    o qual esteve presente no <application>CVSup</application>.	  
	    Pode ser que o John venha a definir no futuro um site 
	    gen&eacute;rico para download de bin&aacute;rios est&aacute;ticos para v&aacute;rias
	    plataformas.</para>
        
	 <para>&Eacute; possivel utilizar o <application>CVSup</application>
	   para disponibilizar qualquer tipo de arquivo, e n&atilde;o apenas
	   reposit&oacute;rios CVS, mas a configura&ccedil;&atilde;o ser&aacute; mais complexa.
           O <application>CVSup</application> &eacute; conhecido por comer
	   um pouco de CPU tanto no servidor quanto no cliente, o que
	   ocorre porque ele precisa comparar muitos arquivos.</para>

      </sect3>
      <sect3 id="mirror-anoncvs">
        <title>AnonCVS (Opcional para um reposit&oacute;rio CVS)</title>

        <para>Se voce possui o reposit&oacute;rio CVS, voc&ecirc; pode desejar
	  disponibiliz&aacute;-lo via cvs an&ocirc;nimo.  Um pequeno aviso antes:
	  N&atilde;o existe muita demanda para este tipo de acesso, ele
	  requer alguma experi&ecirc;ncia, e voc&ecirc; precisa saber o que est&aacute;
	  fazendo.</para>
        
	<para>Geralmente h&aacute; duas formas de se acessar um reposit&oacute;rio
	  CVS remotamente: via <emphasis>pserver</emphasis> ou via 
	  <command>ssh</command> (n&oacute;s n&atilde;o consideramos o <command>rsh
	  </command>).  Para acesso an&ocirc;nimo, o uso do
	  <emphasis>pserver</emphasis> &eacute; mais que suficiente, por&eacute;m
	  alguns tamb&eacute;m oferecem acesso via <command>ssh</command>.
	  Existe um crafted <ulink 
	  url="ftp://ftp.FreeBSD.org/pub/FreeBSD/development/FreeBSD-CVS/anoncvs.shar">wrapper</ulink>
	  no reposit&oacute;rio CVS, para ser utilizado como shell para uma
	  conta de ssh an&ocirc;nimo. Ele faz um chroot, e consequentemente
	  requer que o reposit&oacute;rio CVS esteja dispon&iacute;vel no diret&oacute;rio
	  home do usu&aacute;rio an&ocirc;nimo.  Isto pode n&atilde;o ser poss&iacute;vel para
	  todos os sites.  Se voc&ecirc; for oferecer apenas acesso via
	  <emphasis>pserver</emphasis>, esta restri&ccedil;&atilde;o n&atilde;o se aplica,
	  mas voc&ecirc; pode ficar sujeito a um risco maior de seguran&ccedil;a.
	  Voc&ecirc; n&atilde;o precisa  instalar nenhum software especial, uma vez
	  que o &man.cvs.1; vem por padr&atilde;o na instala&ccedil;&atilde;o b&aacute;sica do
	  FreeBSD.  Voc&ecirc; precisa habilitar o acesso atrav&eacute;s do
	  <command>inetd</command>, para isto basta adicionar uma
	  entrada ao seu <filename>/etc/inetd.conf</filename>
	  semelhante a esta:</para>
          
	  <programlisting>
cvspserver stream tcp nowait root /usr/bin/cvs cvs -f -l -R -T /anoncvstmp --allow-root=/home/ncvs pserver
          </programlisting>

	  <para>Consulte o manual para detalhes das op&ccedil;&otilde;es.  Consulte
	  tamb&eacute;m a p&aacute;gina de <emphasis>info</emphasis> do CVS sobre
	  formas adicionais de certificar-se de que o acesso &eacute; de
	  apenas leitura.  Recomenda-se que voc&ecirc; crie uma conta n&atilde;o
	  privilegiada, preferencialmente chamada <username>anoncvs
	  </username>.  Voc&ecirc; tamb&eacute;m precisa criar um arquivo
	  <filename>passwd</filename> no seu 
	  <filename>/home/ncvs/CVSROOT</filename> e atribuir um
	  password (em branco ou <literal>anoncvs</literal>) para 
	  acesso deste usu&aacute;rio ao CVS.  O diret&oacute;rio
	  <filename>/anoncvstmp</filename> &eacute; um sistema de arquivo
	  baseado em mem&oacute;ria que tem um prop&oacute;sito especial.  Ele n&atilde;o &eacute;
	  requerido mas recomendado, uma vez que o &man.cvs.1; cria uma
	  estrutura de diret&oacute;rios ocultos no seu
	  <filename>/tmp</filename> a qual n&atilde;o &eacute; utilizada depois da
	  opera&ccedil;&atilde;o, mas que deixa as coisas dram&aacute;ticamente lentas se
	  forem necess&aacute;rias opera&ccedil;&otilde;es reais de escrita/leitura para o 
	  disco.  Aqui est&aacute; um fragmento do <filename>/etc/fstab</filename>,
          de como configurar um MFS:</para>

          <programlisting>
/dev/da0s1b /anoncvstmp mfs rw,-s=786432,-b=4096,-f=512,-i=560,-c=3,-m=0,nosuid,nodev 0 0
          </programlisting>

	  <para>Esta &eacute; (naturalmente) uma sintaxe ajustada ao m&aacute;ximo, e foi 
	    sugerida  pelo &a.jdp;.</para>

      </sect3>
   </sect2>
  </sect1>
  
  <sect1 id="mirror-howto">
    <title>Como espelhar o FreeBSD</title>
    
    <para>Ok, agora voc&ecirc; conhece os requisitos e sabe como oferecer os
      servi&ccedil;os, mas n&atilde;o como come&ccedil;ar.  Esta sess&atilde;o explica como
      realizar realmente o espelhamento de v&aacute;rias partes do FreeBSD,
      que ferramentas utilizar e apartir de onde espelhar.</para>
    
    <sect2 id="mirror-ftp">
    <title>FTP</title>

      <para>
	A &aacute;rea de FTP representa o maior volume de dados a serem
	espelhados.  Ele inclui os <emphasis>conjuntos de
	distribui&ccedil;&atilde;o</emphasis> os quais s&atilde;o requeridos para as
	instala&ccedil;&otilde;es via rede, os <emphasis>ramos</emphasis> (branches) 
	do sistema dos quais se tira snapshots a partir da &aacute;rvore
	de c&oacute;digo fonte, as <emphasis>imagens ISO</emphasis> para
	gravar CDs de instala&ccedil;&atilde;o do sistema, um sistema de arquivos
	vivo, a &aacute;rvore do ports, os distifiles (c&oacute;digo fonte 
	necess&aacute;rios para compilar o ports) e uma quantidade enorme de
	pacotes.  Tudo naturalmente para as v&aacute;rias vers&otilde;es do FreeBSD,
	e para as v&aacute;rias arquiteturas.</para>
	
      <sect3 id="mirror-ftp-ftp">
        <title>Espelhando com FTP</title>

        <para>Voc&ecirc; pode utilizar um programa de
	  <application>espelhamento de FTP</application> para obter os
	  arquivos.  Existem muitos programas dispon&iacute;veis, os quais
	  s&atilde;o amplamente utilizados tais como:</para>
	  
          <itemizedlist>
            <listitem><para><filename role="package">ftp/mirror</filename></para></listitem>
            <listitem><para><filename role="package">ftp/ftpmirror</filename></para></listitem>
            <listitem><para><filename role="package">ftp/emirror</filename></para></listitem>
            <listitem><para><filename role="package">ftp/spegla</filename></para></listitem>
            <listitem><para><filename role="package">ftp/omi</filename></para></listitem>
            <listitem><para>alguns usam mesmo o <filename role="package">ftp/wget</filename></para></listitem>
          </itemizedlist>

	<para>O <filename role="package">ftp/mirror</filename> &eacute; muito 
	  popular, mas parece ter alguns inconvenientes, ele &eacute; escrito
	  em &man.perl.1;, e possui alguns problemas reais para
	  espelhar grandes diret&oacute;rios como o site FreeBSD.  Existem
	  rumores de que a vers&atilde;o atual corrigiu isso ao permitir que
	  seja especificado um algoritimo diferente para comparar a
	  estrutura de diret&oacute;rios.</para>

        <para>Em geral o FTP n&atilde;o &eacute; bom para tarefas de espelhamento.
	  Ele transfere o arquivo inteiro se ele for alterado, e n&atilde;o
	  cria um &uacute;nico stream de dados o qual o beneficiaria  de uma
	  grande janela de congest&atilde;o TCP.</para>

      </sect3>
      <sect3 id="mirror-ftp-rsync">
        <title>Espelhando com RSYNC</title>

        <para>Uma forma melhor de espelhar uma area FTP &eacute; atrav&eacute;s do
	  uso do <application>rsync</application>.  Voc&ecirc; pode instalar
	  o port <filename role="package">net/rsync</filename> e ent&atilde;o
	  utiliz&aacute;-lo para sincronizar com o seu servidor de upstream.
	  O <application>rsync</application> j&aacute; foi mencionado na
	  <xref linkend="mirror-serv-rsync">.  Uma vez que a
	  disponibiliza&ccedil;&atilde;o de acesso via rsync n&atilde;o &eacute; obrigat&oacute;ria, o
	  seu site preferido de upstream pode n&atilde;o adot&aacute;-lo.  Voc&ecirc; pode
	  ter um pouco de trabalho para encontrar um servidor que
	  permita o acesso via
	  <application>rsync</application>.</para>

          <note>
            <para>Uma vez que o n&uacute;mero de clientes <application>rsync
	      </application> ter&atilde;o um impacto significativo no
	      servidor, muitos administradores imp&otilde;e limita&ccedil;&otilde;es no
	      numero de acessos simult&acirc;neos aos seus servidores.  Para
	      um espelhamento, voc&ecirc; deve consultar o respons&aacute;vel pelo
	      servidor de upstream que voc&ecirc; est&aacute; utilizando, sobre as
	      regras do servidor, e se ele poderia abrir uma excess&atilde;o
	      para o seu servidor (uma vez que voc&ecirc; &eacute; um site
	      espelho).</para>
	  </note> 
	       
          </para>A linha de comando para espelhar o FreeBSD pode ser
	    parecida com essa:</para>

          <screen>&prompt.user; <userinput>rsync -vaz --delete ftp4.de.FreeBSD.org::FreeBSD/ /pub/FreeBSD/</userinput>
          </screen>

	  <para>Consulte a documenta&ccedil;&atilde;o do <application>rsync</application>, 
	    a qual est&aacute; dispon&iacute;vel em <ulink url="http://rsync.samba.org/">
	    http://rsync.samba.org/</ulink>, sobre as v&aacute;rias op&ccedil;&otilde;es
	    que podem ser utilizadas com o rsync.  Se voc&ecirc; sincronizar
	    o m&oacute;dulo inteiro (ao contr&aacute;rio de apenas alguns
	    subdiret&oacute;rios),  esteja ciente de que o m&oacute;dulo-diret&oacute;rio
	    (normalmente "FreeBSD") n&atilde;o ser&aacute; criado, assim voc&ecirc; n&atilde;o
	    deve omitir o diret&oacute;rio alvo.  Voc&ecirc; tamb&eacute;m pode desejar
	    configurar um script de trabalho o qual seria executado
	    como um comando pelo &man.cron.8;, para automatizar o
	    processo.</para>
      </sect3>

      <sect3 id="mirror-ftp-cvsup">
        <title>Espelhando com o CVSup</title>

        <para>Poucos sites, incluindo o <hostid role="fqdn">
	  ftp-master.FreeBSD.org</hostid>, oferecem acesso via CVSup
	  para espelhamento da &aacute;rea de FTP.  Voc&ecirc; deve instalar um
	  cliente de <application>cvsup</application>,
	  preferencialmente a partir do port <filename role="package">
	  net/cvsup</filename> (tamb&eacute;m visto na 
	  <xref linkend="mirror-serv-cvsup">). Um exemplo de arquivo 
	  <filename>supfile</filename> para fazer o espelhamento a partir
	  do <hostid role="fqdn">ftp-master.FreeBSD.org</hostid>
          se pareceria com isto:</para>

          <programlisting>
          #
          # FreeBSD archive supfile from master server
          #
          *default host=ftp-master.FreeBSD.org
          *default base=/usr
          *default prefix=/pub
          #*default release=all
          *default delete use-rel-suffix
          *default umask=002

          # If your network link is a T1 or faster, comment out the following line.
          #*default compress

          FreeBSD-archive release=all preserve
          </programlisting>

          <para>Parece que o <application>CVSup</application>
	  seria a melhor forma de espelhar o arquivo em termos de
	  efici&ecirc;ncia, mas infelizmente ele est&aacute; dispon&iacute;vel em apenas 
	  alguns sites.</para>
	  
          <note id="mirror-cvsup-s-option">
            <para>Por favor consulte a documenta&ccedil;&atilde;o do
	    <application>CVSup</application>, como por exemplo a
	    &man.cvsup.1; e considere o uso da op&ccedil;&atilde;o <option>-s</option>
	    uma vez que ela pode reduzir em muito o trabalho a ser
	    realizado.</para>
          </note>

      </sect3>
    </sect2>
    <sect2 id="mirror-cvs">
      <title>Espelhando o reposit&oacute;rio CVS</title>

      <para>De novo voc&ecirc; possui v&aacute;rias possibilidades para realizar
	esta tarefa, mas o mais recomendado &eacute; utilizar o 
        <link linkend="mirror-cvs-cvsup">CVSup</link>.</para>

      <sect3 id="mirror-cvs-cvsup">
        <title>Utilizando o CVSup</title>

        <para>O <application>CVSup</application> j&aacute; foi descrito em algum 
	  detalhe na <xref linkend="mirror-serv-cvsup"> e na <xref 
	  linkend="mirror-ftp-cvsup">.</para>

        <para>Abaixo voc&ecirc; encontra um exemplo de
	<filename>supfile</filename> para realizar esta tarefa:</para>

          <programlisting>
          #
          # FreeBSD CVS supfile from master server
          #
          *default host=cvsup-master.FreeBSD.org
          *default base=/usr
          *default prefix=/pub/FreeBSD/development/FreeBSD-CVS
          *default release=cvs
          *default delete use-rel-suffix
          *default umask=002

          # If your network link is a T1 or faster, comment out the following line.
          #*default compress

          cvs-all
          </programlisting>

	<para>Voc&ecirc; tamb&eacute;m deve dar uma olhada em <filename>
	/usr/share/examples/cvsup</filename>.</para>

        <note>
          <para>Por favor n&atilde;o esque&ccedil;a de considerar a dica mencionada
	   na <link linkend="mirror-cvsup-s-option">nota
	   acima</link>.</para>
        </note>

      </sect3>
      <sect3 id="mirror-cvs-other">
        <title>Utilizando outros m&eacute;todos</title>

        <para>Geralmente n&atilde;o se recomenda o uso de outros m&eacute;todos que
	  n&atilde;o o <application>CVSup</application>. De qualquer forma,
	  vamos descrever rapidamente como fazer.  Uma vez que a
	  maioria dos sites oferecem o reposit&oacute;rio CVS como parte da
	  &aacute;rea de FTP, sob o caminho <filename>
	  /pub/FreeBSD/development/FreeBSD-CVS</filename>, os
	  seguintes m&eacute;todos podem ser utilizados.</para>
          
	  <itemizedlist>
            <listitem><para><application>FTP</application></para></listitem>
            <listitem><para><application>RSYNC</application></para></listitem>
            <listitem><para>e talvez <application>HTTP</application></para></listitem>
          </itemizedlist>

	  <para>Se voc&ecirc; encontrar um site que suporte, voc&ecirc; pode
	  utilizar o <filename role="package">net/sup</filename>.  Mas
	  ele &eacute; inferior ao <application>CVSup</application> e foram
	  as suas defici&ecirc;ncias que levaram o John Polstra a
	  desenvolver o <application>CVSup</application>, ent&atilde;o o seu 
	  uso &eacute; claramente n&atilde;o recomendado.</para>
	  
          <important>
            <para>Voc&ecirc; <emphasis>n&atilde;o deve</emphasis> utilizar o
	      AnonCVS para espelhar o reposit&oacute;rio CVS, uma vez que o
	      CVS n&atilde;o permite que voc&ecirc; acesse o reposit&oacute;rio
	      propriamente dito (arquivos ",v"), mas sim apenas as
	      vers&otilde;es limpas dos modulos.</para>
          </important>

      </sect3>
    </sect2>
    <sect2 id="mirror-www">
      <title>Espelhando as p&aacute;ginas WWW</title>

      <para>A melhor forma &eacute; realizar um "check out" da distribui&ccedil;&atilde;o
	<emphasis>www</emphasis> do servidor de CVS.  Se voc&ecirc; tem um
	mirror local do reposit&oacute;rio CVS, provavelmente ser&aacute; t&atilde;o
	simples quanto executar:</para>

      <screen>&prompt.user; <userinput>cvs -d /home/ncvs co www</userinput></screen>
      <para>e um <emphasis>cronjob</emphasis>, o qual executa um 
        <command>cvs update -d -P</command> periodicamente, talvez
	imediatamente depois de cada atualiza&ccedil;&atilde;o do seu reposit&oacute;rio.
	Naturalmente, os arquivos necessitam ficar em um diret&oacute;rio
	dispon&iacute;vel para acesso p&uacute;blico via WWW.  A instala&ccedil;&atilde;o e
	configura&ccedil;&atilde;o de um servidor web n&atilde;o ser&aacute; abordada neste
	artigo.</para>

      <note>
	<para>Para que o site web fique dispon&iacute;vel, voc&ecirc; precisa
	  executaro comando &man.make.1; dentro do diret&oacute;rio principal
	  do <filename>www</filename>.  Este comando ir&aacute; criar os
	  arquivos <filename>*.html</filename> para serem visualizados
	  via web.  Para que o comando possa ser executado com
	  sucesso, o port <filename role="package">textproc/docproj
	  </filename> precisa estar instalado.</para>
      </note>

      <para>Se voc&ecirc; n&atilde;o possui um reposit&oacute;rio local, voc&ecirc; pode
	utilizar o <application>CVSup</application> para manter uma c&oacute;pia
        <quote>atualizada</quote> das p&aacute;ginas www.  Um exemplo de
	supfile para esta tarefa pode ser encontrado em
        <filename>/usr/share/examples/cvsup/www-supfile</filename> o
	qual ir&aacute; se parecer com isto:</para>

        <programlisting>
        #
        # WWW module supfile for FreeBSD
        #
        *default host=cvsup3.de.FreeBSD.org
        *default base=/usr
        *default prefix=/usr/local
        *default release=cvs tag=.
        *default delete use-rel-suffix

        # If your network link is a T1 or faster, comment out the following line.
        *default compress

        # This collection retrieves the www/ tree of the FreeBSD repository
        www
        </programlisting>

     <para>N&atilde;o recomendamos o uso do <filename role="package">ftp/wget
      </filename> ou de outras ferramentas de espelhamento web.</para>
      
     <sect3 id="mirror-www-doc">
       <title>Espelhando a documenta&ccedil;&atilde;o do FreeBSD</title>
       
       <para>Uma vez que a documenta&ccedil;&atilde;o &eacute; fortemente refer&ecirc;nciada
	 a partir das p&aacute;ginas web, recomenda-se que voc&ecirc; tamb&eacute;m
	 espelhe a documenta&ccedil;&atilde;o do FreeBSD.  Entretanto, isto n&atilde;o &eacute; t&atilde;o
	 trivial quando espelhar as p&aacute;ginas www isoladamente.</para>

       <para>Antes de mais nada, voc&ecirc; deve obter os fontes da
	 documenta&ccedil;&atilde;o, e de novo o m&eacute;todo preferencial &eacute; via <application>
	 CVSup</application>.  Aqui est&aacute; um exemplo do supfile
	 correspondente:</para>
         
	 <programlisting>
         #
         # FreeBSD documentation supfile
         #
         *default host=cvsup3.de.FreeBSD.org
         *default base=/usr
         *default prefix=/usr/share
         *default release=cvs tag=.
         *default delete use-rel-suffix

         # If your network link is a T1 or faster, comment out the following line.
         #*default compress

         # This will retrieve the entire doc branch of the FreeBSD repository.
         # This includes the handbook, FAQ, and translations thereof.
         doc-all
         </programlisting>
       
       <para>Ent&atilde;o voc&ecirc; ter&aacute; que instalar diversos ports.  Mas voc&ecirc;
	 est&aacute; com sorte, pois existe um meta port: <filename 
	 role="package">textproc/docproj</filename> que faz o trabalho
	 para voc&ecirc;.  Voce precisa configurar algumas vari&aacute;veis de
	 ambiente, como por exemplo <literal>SGML_CATALOG_FILES</literal>.  
	 Tamb&eacute;m de uma olhada no seu <filename>/etc/make.conf</filename> 
	 (fa&ccedil;a uma c&oacute;pia do <filename>/etc/defaults/make.conf</filename> 
	 se voc&ecirc; n&atilde;o possuir um), e verifique a vari&aacute;vel <literal>DOC_LANG
	 </literal>.  Agora voc&ecirc; j&aacute; est&aacute; provavelmente pronto para
	 executar o comando <command>make</command> no seu diret&oacute;rio
	 dos fontes da documenta&ccedil;&atilde;o (por padr&atilde;o <filename>
	 /usr/share/doc</filename>) para construir a documenta&ccedil;&atilde;o.  De
	 novo, voc&ecirc; precisa torn&aacute;-lo acess&iacute;vel atrav&eacute;s do seu servidor
	 web e certifique-se de que os links apontam para o local
	 correto.</para>
         
         <important>
           <para>A constru&ccedil;&atilde;o da documenta&ccedil;&atilde;o, assim como as diversas tarefas
	     associadas ao processo, est&atilde;o documentadas no 
             <ulink 
	     url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/fdp-primer/">
	     fdp-primer</ulink>.  Por favor leia este documento, especialmente 
	     se voc&ecirc; esta tendo problemas para contruir a documenta&ccedil;&atilde;o.</para>
         </important>

     </sect3>
   </sect2>

   <sect2 id="mirror-how-often">
     <title>Com que frequ&ecirc;ncia atualizar o site espelho?</title>

     <para>Cada site espelho deve ser atualizado regularmente.  Voc&ecirc;
       certamente ir&aacute; precisar de alguns scripts de trabalho, os quais
       ser&atilde;o executados pelo &man.cron.8;, automatizando o processo de
       atualiza&ccedil;&atilde;o.  Uma vez que cada administrador implementa estes 
       scripts da sua pr&oacute;pria maneira, n&oacute;s n&atilde;o podemos dar instru&ccedil;&otilde;es 
       espec&iacute;ficas sobre como proceder.  Mas de uma forma geral 
       o processo de implementa&ccedil;&atilde;o poderia ser resumido como:</para>

     <procedure>
       <step>
         <para>Coloque os comandos para executar a sua aplica&ccedil;&atilde;o de
	   espelhamento em um script.  Recomenda-se utilizar um script
	   simples em <command>/bin/sh</command>.</para>
         </para>
       </step>
       
       <step>
         <para>Adicione alguns redirecionamentos para arquivo das 
	   mensagens dos programas, de forma que possa usar o arquivo com 
	   a finalidade de diagn&oacute;stico de problemas.</para>
       </step>
       
       <step>
         <para>Teste se o seu script funciona, verifique o arquivo de
	   log.</para>
       </step>
       <step>
         <para>Utilize o &man.crontab.1; para adicionar o script ao
	   &man.crontab.5; do usu&aacute;rio apropriado.  O qual deve ser um
	   usu&aacute;rio diferente do usu&aacute;rio sob o qual o servidor de FTP &eacute;
	   executado, desta forma n&atilde;o ser&aacute; permitido o acesso via FTP
	   an&ocirc;nimo a arquivos presentes na &aacute;rea de FTP, os quais n&atilde;o
	   possuam permiss&otilde;es que possibilitem a leitura por todos os
	   demais usu&aacute;rios.  Isto &eacute; utilizando para a fase de
	   <quote>est&aacute;gio</quote> das distribui&ccedil;&otilde;es &mdash; garantindo
	   que todos os site espelhos oficiais possuam todos os arquivos
	   necess&aacute;rios de uma distribui&ccedil;&atilde;o, no dia em que a mesma &eacute;
	   liberada.</para>
       </step>
     </procedure>

     <para>Aqui est&atilde;o alguns dos agendamentos recomendados para a
       atualiza&ccedil;&atilde;o dos site espelho:</para>
     
       <itemizedlist>
         <listitem><para>Servidor FTP: di&aacute;rio</para></listitem>
         <listitem><para>Reposit&oacute;rio CVS: di&aacute;rio a hor&aacute;rio</para></listitem>
         <listitem><para>P&aacute;ginas WWW: di&aacute;rio</para></listitem>
       </itemizedlist>
     </para>
   </sect2>
  </sect1>
  <sect1 id="mirror-where">
    <title>De onde espelhar</title>
    
    <para>Este &eacute; um ponto importante.  Assim esta sess&atilde;o ir&aacute; gastar
      algum esfor&ccedil;o para explicar os detalhes.  N&oacute;s iremos mencionar
      isto diversas vezes:  Sob nenhuma circunst&acirc;ncia voc&ecirc; deve
      espelhar o seu servidor apartir do <hostid role="fqdn">
      ftp.FreeBSD.org</hostid>.</para>
      
    <sect2 id="mirror-where-organization">
      <title>Algumas palavras sobre a organiza&ccedil;&atilde;o</title>

      <para>O site espelhos s&atilde;o organizados por pa&iacute;s.  Todos os site
        espelhos oficiais possuem uma entrada DNS do tipo
        <hostid role="fqdn">ftpN.CC.FreeBSD.org</hostid>.  Onde
        <emphasis>CC</emphasis> (i.e. c&oacute;digo do pa&iacute;s) &eacute; o 
        <emphasis>dominio de primeiro n&iacute;vel</emphasis> (TLD) do pa&iacute;s
	no qual o site espelho est&aacute; localizado. O <emphasis>N</emphasis> 
	&eacute; um numero, o qual diz que o servidor &eacute; o de numero N naquele
	p&aacute;is.  (o mesmo se apliva para <hostid>cvsupN.CC.FreeBSD.org</hostid>,
        <hostid>wwwN.CC.FreeBSD.org</hostid>, etc.)  Existem sites
	espelhos que n&atilde;o possuem componentes <emphasis>CC</emphasis> em suas
	entradas de DNS.  Estes s&atilde;o os sites espelhos que est&atilde;o muito
	bem conectados e que permitem um grande numero de usu&aacute;rios
	simult&acirc;neos.  O <hostid role="fqdn">ftp.FreeBSD.org</hostid> &eacute; 
	composto atualmente por duas m&aacute;quinas , uma atualmente est&aacute;
	localizada na Dinamarca e a outra nos Estados Unidos.  Ele n&atilde;o
	&eacute; um servidor mestre e n&atilde;o deve ser utilizado como fonte para
	um espelhamento.  Diversos documentos online, conduzem de
	forma interativa o usu&aacute;rio para <hostid role="fqdn">
	ftp.FreeBSD.org</hostid>, assim os sistemas de espelhamento
	autom&aacute;tico devem procurar uma m&aacute;quina diferente como fonte
	para se espelhar.</para>
	
      <para>Adicionalmente existe uma hierarquia para os site
        espelhos, a qual &eacute; descrita em termos de
        <emphasis>tiers</emphasis>.  Os sites mestres n&atilde;o s&atilde;o
	referenciados, mas eles poderiam ser descritos como sendo um
	<emphasis>Tier-0</emphasis>.  Os sites espelhos construidos
	a partir destes servidores podem ser considerados <emphasis>
	Tier-1</emphasis>, os espelhos dos espelhos-<emphasis>Tier-1
	</emphasis> s&atilde;o <emphasis>Tier-2</emphasis>, etc.  Os sites
	oficiais s&atilde;o encorajados  a serem um tier baixo, por&eacute;m quanto
	mais baixo o tier, maiores as exig&ecirc;ncias nos termos descritos
	na <xref linkend="mirror-requirements">.  O acesso aos site
	espelhos de baixo tier podem ser restito, e o acesso aos sites
	mestre s&atilde;o definitivamente restritos.  A hierarquia de
	<emphasis>tier</emphasis> n&atilde;o &eacute; refletida no pelo DNS, e
	igeralmente n&atilde;o &eacute; documentado em nenhum lugar exceto para os
	sites mestre.  Entretanto os sites espelhos com numeros
	baixos, s&atilde;o usualmente <emphasis>Tier-1</emphasis> (esta &eacute;
	apenas uma sugest&atilde;o aproximada, e n&atilde;o &eacute; uma regra).</para>
    </sect2>

    <sect2 id="mirror-where-where">
      <title>Ok, mas de onde eu devo obter o material agora?</title>

      <para>Sob nenhuma circunst&acirc;ncia voce deve montar seu site
	espelho apartir do <hostid role="fqdn">ftp.FreeBSD.org</hostid>.
	A resposta curta &eacute;:  Apartir do site que for mais pr&oacute;ximo de
	voc&ecirc; em termos de conex&atilde;o internet, ou ent&atilde;o do que lhe
	disponibilizar o acesso mais r&aacute;pido.</para>
      
      <sect3 id="mirror-where-simple">

        <title>Eu quero apenas espelhar a partir de algum lugar!</title>
	
        <para>Se voc&ecirc; n&atilde;o possui nenhuma inten&ccedil;&atilde;o ou necessidade especial,
	  a indica&ccedil;&atilde;o da <xref linkend="mirror-where-where"> se
	  aplica.  Isto significa:</para>

        <procedure>
          <step>
            <para>Verifique os sites espelhos dispon&iacute;veis no seu pa&iacute;s.
	      O <ulink url="http://www.freebsdmirrors.org/FBSDsites.php3">
	      Banco de dados de sites espelho do FreeBSD</ulink> pode
	      ajud&aacute;-lo com isso.</para>
          </step>

          <step>
            <para>Verifique qual deles prov&ecirc; o acesso mais r&aacute;pido
	      (numero de hops, tempo de lat&ecirc;ncia, etc) e que oferece
	      os servi&ccedil;os que voc&ecirc; pretende utilizar (tal como 
	      <application>rsync</application> ou <application>CVSup
	      </application>).</para>
          </step>

          <step>
            <para>Entre em contato com o administrador do site que
	      voc&ecirc; escolheu, mencione sua inten&ccedil;&atilde;o e pergunte
	      sobre os termos e regras para uso do servidor.</para>
          </step>

          <step>
            <para>Configure o seu site espelho como descrito
	    anteriormente.</para>
          </step>
        </procedure>
      </sect3>

      <sect3 id="mirror-where-official">
        <title>Eu sou um site espelho oficial, qual &eacute; o site 
	  correto para mim?</title>

        <para>Em geral a descri&ccedil;&atilde;o da <xref linkend="mirror-where-simple">
          continua v&aacute;lido. Naturalmente voc&ecirc; pode desejar colocar
	  algum peso no fato de que com a sua capacidade de upstream
	  voc&ecirc; poderia ter um tier menor.  Existem algumas outras
	  considera&ccedil;&otilde;es sobre os sites espelhos <emphasis>oficiais</emphasis>
          que s&atilde;o descritos na <xref linkend="mirror-official">.
        </para>

      </sect3>
      <sect3 id="mirror-where-master">
        <title>Eu quero ter acesso aos servidores mestres!</title>

        <para>Se voc&ecirc; possui boas raz&otilde;es e bons pr&eacute;-requisitos, voc&ecirc;
	  pode querer e ter acesso a um dos servidores mestre. O
	  acesso a estes servidores &eacute; geralmente restrito, e existem
	  regras especiais para o acesso.  Se voc&ecirc; j&aacute; &eacute; um site
	  espelho <emphasis>oficial</emphasis>, isto certamente ir&aacute;
	  auxili&aacute;-lo a conseguir o acesso.  Em qualquer outro caso,
	  certifique-se que o seu pa&iacute;s realmente precisa de outro site
	  espelho.  Se ele j&aacute; possui 3 ou mais, pergunte ao
	  <quote>administrador da zona</quote>
	  (<email>hostmaster@CC.freebsd.org</email>) ou primeiro ao
	  &a.hubs;</para>

	<para>Quem quer que tenha lhe ajudado a se tornar um site
	  espelho oficial, deve ter providenciado para que voc&ecirc;
	  obtivesse acesso a um servidor de upstream apropriado, seja
	  ele um dos servidores mestres ou um servidor Tier-1
	  apropriado.  Se n&atilde;o, voc&ecirc; pode enviar um email para
	  <email>mirror-admin@FreeBSD.org</email> solicitar ajuda 
	  com isto.</para>

        <para>Existem 3 servidores master para a &aacute;rvore de FTP e um
	  um para o reposit&oacute;rio de CVS (as p&aacute;ginas web e a
	  documenta&ccedil;&atilde;o s&atilde;o obtidos apartir do CVS, assim n&atilde;o h&aacute;
	  necessidade de se ter um servidor mestre).</para>
	
        <sect4 id="mirror-where-master-ftp">
	
          <title>ftp-master.FreeBSD.org</title>
	  
          <para>
            Este &eacute; o servidor mestre da &aacute;rvore de FTP. 
          </para>

          <para>O <hostid>ftp-master.FreeBSD.org</hostid> fornece
	    acesso via <application>rsync</application> e via 
	    <application>CVSup</application>, al&eacute;m do protocolo FTP.
	    Consulte a <xref linkend="mirror-ftp-rsync"> e a
            <xref linkend="mirror-ftp-cvsup"> para instru&ccedil;&otilde;es de como
	    acessar utilizando estes protocolos.</para>

          <para>Os sites espelhos s&atilde;o encorajados a tamb&eacute;m
	    disponibilizarem acesso via <application>rsync
	    </application> &agrave; &aacute;rea de FTP, desde que sejam
	    espelhos-<emphasis>Tier-1</emphasis>.</para>

        </sect4>
        <sect4 id="mirror-where-master-cvsup">

          <title>cvsup-master.FreeBSD.org</title>

          <para>Este &eacute; o servidor mestre do reposit&oacute;rio CVS </para>

          <para>O <hostid>cvsup-master.FreeBSD.org</hostid> fornece
	    acesso apenas via <application>CVSup</application>.
	    Consulte a <xref linkend="mirror-cvs-cvsup"> para maiores
	    detalhes.</para>

          <para>Para obter acesso, voc&ecirc; precisa contactar o &a.cvsup-master;.  
	    Certifique-se de ter lido antes as <ulink 
	    url="http://people.FreeBSD.org/~jdp/cvsup-access/">
	    Regras de acesso ao CVSup do FreeBSD</ulink>!</para>
          
	  <para>Configure a autentica&ccedil;&atilde;o necess&aacute;ria seguindo 
	    <ulink
	    url="http://people.FreeBSD.org/~jdp/cvpasswd/">estas
            instru&ccedil;&otilde;es</ulink>.  Certifique-se de que voc&ecirc; especificou 
	    o servidor como <hostid>freefall.FreeBSD.org</hostid> 
	    na linha de comando do <command>cvpasswd</command>, como
	    descrito no documento mencionado acima, mesmo quando voc&ecirc;
	    estiver contactando o <hostid>cvsup-master.FreeBSD.org
	    </hostid>
          </para>
        </sect4>
      </sect3>
    </sect2>
  </sect1>
  <sect1 id="mirror-official">
    <title>Sites espelhos oficiais</title>
    <para>
      Official mirrors are mirrors that
      <itemizedlist>
        <listitem>
          <para>
            a) have a <hostid>FreeBSD.org</hostid> DNS entry
            (usually a CNAME).
          </para>
        </listitem>
        <listitem>
          <para>
            b) are listed as an official mirror in the FreeBSD
               documentation (like handbook).
          </para>
        </listitem>
      </itemizedlist>

      So far to distinguish official mirrors.
      Official mirrors are not necessarily <emphasis>Tier-1</emphasis>-mirrors.
      However you probably won't find a <emphasis>Tier-1</emphasis>-mirror,
      that is not also official.
    </para>
    <sect2 id="mirror-official-requirements">
      <title>Special Requirements for official (tier-1) mirrors</title>
      <para>
        It is not so easy to state requirements for all
        official mirrors, since the project is sort of
        tolerant here. It is more easy to say,
        what <emphasis>official tier-1 mirrors</emphasis>
        are required to. All other official mirrors
        can consider this a big <emphasis>should</emphasis>.
        <note>
          <para>
            The following applies mainly to the FTP fileset,
            since a CVS repository should always be mirrored 
            completely, and the webpages are a case of 
            its own.
          </para>
        </note>
      </para>
      <para>
        Tier-1 mirrors are required to:
        <itemizedlist>
          <listitem><para>carry the complete fileset</para></listitem>
          <listitem><para>allow access to other mirror sites</para></listitem>
          <listitem><para>provide <application>FTP</application> and 
            <application>RSYNC</application> access</para></listitem>
        </itemizedlist>

        Furthermore, admins should be subscribed to the &a.hubs;.
        See <ulink url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">this link</ulink> for details, how to subscribe.
      </para>
      <important>
        <para>It is <emphasis>very</emphasis> important for a hub administrator, especially
          Tier-1 hub admins, to check the
          <ulink url="http://www.FreeBSD.org/releng/">release schedule</ulink>
          for the next FreeBSD release. This is important because it will tell you when the
          next release is scheduled
          to come out, and thus giving you time to prepare for the big spike of traffic which follows it.
        </para>
        <para>
          It is also important that hub administrators try to keep their mirrors as up-to-date as
          possible (again, even more crucial for Tier-1 mirrors). If Mirror1 doesn't update for a
          while, lower tier mirrors will begin to mirror old data from Mirror1 and thus begins
          a downward spiral... Keep your mirrors up to date!
        </para>
      </important>
    </sect2>
    <sect2 id="mirror-official-become">
      <title>How to become official then?</title>
      <para>
        An interesting question, especially, since the state
        of being official comes with some benefits, like a much
        higher bill from your ISP as more people will be using
        your site. Also it may be a key requirement to get access
        to a master site.
      </para>
      <para>
        Before applying, please consider (again) if
        another official mirror is really needed for
        your region. Check first with your zone administrator (<email>hostmaster@CC.FreeBSD.org</email>) or, if that fails, ask on the &a.hubs;.
      </para>
      <para>Ok, here is how to do it:</para>
      <procedure>
        <step>
          <para>
            Get the mirror running in first place (maybe not
            using a master site, yet).
          </para>
        </step>
        <step>
          <para>
            <ulink url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/eresources.html#ERESOURCES-MAIL">Subscribe</ulink> to the &a.hubs;.
          </para>
        </step>
        <step>
          <para>
            If everything works so far, contact the DNS administrator responsible
            for your region/country, and ask for a DNS entry for your
            site. The admin should able to be contacted via
            <email>hostmaster@CC.FreeBSD.org</email>, where 
            <emphasis>CC</emphasis> is your country code/TLD.
            Your DNS entry will be as described
            in <xref linkend="mirror-where-organization">.
          </para>
          <para>
            If there is no subdomain set up for your
            country yet, you should contact
            <email>mirror-admin@FreeBSD.org</email>,
            or you can try the &a.hubs; first.
          </para>
        </step>
        <step>
          <para>
            Whoever helps you get an official name should send email
            to <email>mirror-admin@FreeBSD.org</email> so your site will be
            added to the mirror list in the
            <ulink url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook">FreeBSD
            Handbook</ulink>.
          </para>
        </step> 
      </procedure>
      <para>That is it.</para>
    </sect2>
  </sect1>
  <sect1 id="mirror-statpages">
    <title>Algumas estat&iacute;sticas dos sites espelhos</title>

    <para>Aqui voc&ecirc; encontra links para as p&aacute;ginas de estat&iacute;sticas de
      acesso aos seus sites espelhos favoritos (ito &eacute;, pelo menos dos 
      sites que as disponibilizam).</para>

    <sect2 id="mirror-statpagesftp">
      <title>Estat&iacute;sticas dos sites FTP</title>
      <itemizedlist>
        <listitem>
          <para>ftp2.FreeBSD.org - <email>grisha@ispol.com</email> -
            <ulink url="http://people.FreeBSD.org/~logo/ftp2/">(Consumo de banda IP)</ulink>
          </para>
        </listitem>
        <listitem>
          <para>ftp.is.FreeBSD.org - <email>hostmaster@is.FreeBSD.org</email> - 
            <ulink url="http://www.rhnet.is/status/draupnir/draupnir.html">
            (Consumo de banda IP)</ulink> <ulink url="http://www.rhnet.is/status/ftp/ftp-notendur.html">(Processos FTP
            )</ulink> <ulink url="http://www.rhnet.is/status/ftp/http-notendur.html">(Processos HTTP)
            </ulink>
          </para>
        </listitem>
        <listitem>
          <para>ftp.cz.FreeBSD.org - <email>cejkar@fit.vutbr.cz</email> -
            <ulink url="http://www.cz.FreeBSD.org/stats/mrtg/net.html">(Consumo de banda IP)</ulink>
            <ulink url="http://www.freebsd.cz/stats/mrtg/ftpd.html">(Processos FTP)</ulink>
            <ulink url="http://www.freebsd.cz/stats/mrtg/rsyncd.html">(Processos Rsync)</ulink>
          </para>
        </listitem>
        <listitem>
          <para>ftp4.de.FreeBSD.org - <email>dl@leo.org</email> -
            <ulink url="http://admin.leo.org/mrtg/services/ftp/ftp.html">(Usu&aacute;rios FTP)</ulink>
            <ulink url="http://admin.leo.org/mrtg/services/rsync/rsync.html">(Usu&aacute;rios RSYNC)</ulink>
          </para>
        </listitem>
      </itemizedlist>
    </sect2>
    <sect2 id="mirror-statpagescvsup">
      <title>Estat&iacute;sticas dos sistes CVSup</title>
      <itemizedlist>
        <listitem>
          <para>cvsup5.FreeBSD.org - <email>staff@blackened.com</email> - <ulink
            url="http://cvsup.freebsd.blackened.com/cvsup.freebsd.html">(Processos CVSup)</ulink></para>
        </listitem>
        <listitem>
          <para>cvsup[23456].jp.FreeBSD.org - <email>kuriyama@FreeBSD.org</email> - <ulink
            url="http://home.jp.FreeBSD.org/stats/mrtg/cvsup/">(Processos CVSup)</ulink></para>
        </listitem>
        <listitem>
          <para>cvsup.cz.FreeBSD.org - <email>cejkar@fit.vutbr.cz</email> -
            <ulink url="http://www.freebsd.cz/stats/mrtg/cvsupd.html">(Processos CVSup)</ulink></para>
        </listitem>
        <listitem>
          <para>[cvsup3|anoncvs].de.FreeBSD.org - <email>dl@leo.org</email> -
            <ulink url="http://admin.leo.org/mrtg/services/cvsup/cvsup.html">(Processos CVSup)</ulink></para>
        </listitem>
      </itemizedlist>
    </sect2>
  </sect1>
</article>

<!-- 
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
