<!--
     The FreeBSD Documentation Project

     $FreeBSD: pt_BR.ISO8859-1/books/handbook/kernelconfig/chapter.sgml,v 1.29 2003/12/12 16:46:09 surf Exp $
-->

<chapter id="kernelconfig">
  <chapterinfo>
    <authorgroup>
      <author>
	<firstname>Jim</firstname>
	<surname>Mock</surname>
	<contrib>Updated and restructured by </contrib>
	<!-- Mar 2000 -->
      </author>
    </authorgroup>
    <authorgroup>
      <author>
	<firstname>Jake</firstname>
	<surname>Hamby</surname>
	<contrib>Originally contributed by </contrib>
	<!-- 6 Oct 1995 -->
      </author>
    </authorgroup>
  </chapterinfo>

  <title>Configurando o kernel do FreeBSD</title>

  <sect1 id="kernelconfig-synopsis">
    <title>Sin&oacute;pse</title>

    <indexterm>
      <primary>kernel</primary>
      <secondary>compilando um kernel personalizado</secondary>
    </indexterm>

    <para>O kernel &eacute; o cora&ccedil;&atilde;o do &os; Sistema Operacional.  
      &Eacute; respons&iacute;vel por gerenciar a mem&oacute;ria, refor&ccedil;ando 
      controles de seguran&ccedil;a,
      rede, accesso a disco, e muito mais.  Quando mais e mais do &os;
      tornarem din&acirc;micamente configurado &eacute; mais ocasionalmente necess&aacute;rio
      configurar e recompilar seu kernel.</para>

    <para>Depois de ler este cap&iacute;tulo, você dever&aacute; saber:</para>

    <itemizedlist>
      <listitem>
	<para>Porque voc&ecirc; pode precisar compilar um kernel personalizado.</para>
      </listitem>

      <listitem>
	<para>Como escrever um arquivo de configura&ccedil;&atilde;o do kernel, ou alterar um arquivo de
	  configura&ccedil;&atilde;o existente.</para>
      </listitem>

      <listitem>
	<para>Como uso o arquivo de configura&ccedil;&atilde;o do kernel para criar e compilar um
	  novo kernel.</para>
      </listitem>

      <listitem>
	<para>Como instalo o novo kernel.</para>
      </listitem>

      <listitem>
	<para>Como crio algumas entradas em <filename>/dev</filename> isso pode
	  ser necess&aacute;rio.</para>
      </listitem>

      <listitem>
	<para>Como pesquiso defeitos se algo der errado.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="kernelconfig-custom-kernel">
    <title>Porque compilar um kernel personalisado?</title>

    <para>Tradicionalmente, &os; teve o que foi chamado de kernel
      <quote>monolitico</quote>. Isto significa que o kernel era um
      grande programa, contendo uma lista fixa de dispositivos suportados, e se voc&ecirc; quisesse
      alterar o comportamento do kernel ent&atilde;o &eacute; voc&ecirc; teria que compilar um novo kernel,
      ent&atilde;o reiniciar seu computador com o novo kernel.</para>

    <para>Hoje, o &os; est&aacute; movendo-se rapidamente para um modelo onde muitas das funcionalidades do
      kernel est&aacute; contida em m&oacute;dulos que s&atilde;o carregados e descarregados din&acirc;micamente do kernel conforme necess&aacute;rios.
      Isto permite que o kernel se adapte ao novo hardware de repente
      tornando-se dispon&iacute;vel (tais como cart&otilde;es PCMCIA para laptop), ou para
      novas funcionalidades a serem traduzidas dentro do kernel isso n&atilde;o era
      necess&aacute;rio quando o kernel era originalmente compilado. Isso
      &eacute; conhecido como kernel modular. Coloquialmente eles s&atilde;o chamados KLDs.</para>

    <para>Apesar disto, sabemos que ainda &eacute necess&aacute;rio fazer algumas configura&ccedil;&otilde;es est&aacute;ticas no kernel. Em alguns casos 
      isto est&aacute; assim porque a funcionalidades que est&atilde;o amarrada ao kernel e n&atilde;o podem ser carregadas din&acirc;micamente. 
      Em outros casos isto pode simplesmente estar assim porque ningu&eacute;m ainda conseguiu tempo para escrever um m&oacute;dulo do kernel de 
carregamento din&acirc;mico ainda para essas funcionalidades.</para>

    <para>Compilar um kernel personalizado e um dos passos mais importante que cada usu&aacute;rio de
      &unix; deve saber. Este processo, consome um tempo curto e trar&aacute; muitos benef&iacute;cios para o seu sistema &os;.
      Diferente do kernel <filename>GENERIC</filename>, o qual necessita de suporte de uma
      abrangente lista de hardware, um kernel personalizado somente cont&eacute;m suporte para o hardware dos
      <emphasis>seus</emphasis> PC's. Isto tem benef&iacute;cios in&uacute;meros, como:</para>

    <itemizedlist>
      <listitem>
	<para>Tempo mais r&aacute;pido para carregar. Posto que o kernel apenas experimentar&aacute; o
	hardware que voc&ecirc; tiver em seu sistema, o tempo de testes do seu sistema ao carregar a m&aacute;quina diminuir&aacute; drasticamente.</para>
      </listitem>

      <listitem>
	<para>Menos uso da mem&oacute;ria. Um kernel personalizado usa frequentemente menos mem&oacute;ria
	  que o kernel <filename>GENERIC</filename>, o que &eacute; importante
	  porque o kernel atual deve sempre estar presente na mem&oacute;ria real.
	  Por esta raz&atilde;o, um kernel personalizado e &uacute;til especialmente
	  em um sistema com pouca quantidade de RAM.</para>
      </listitem>

      <listitem>
	<para>Adicionar suporte a hardware. Um kernel personalizado permite a voc&ecirc; adicionar suporte a dispositivos tais como Placas de Som, que n&atilde;o est&atilde;o presentes no kernel <filename>GENERIC</filename>.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="kernelconfig-building">
    <title> Compilando e instalando um kernel personalizado</title>
    <indexterm>
      <primary>kernel</primary>
      <secondary>Compilando / instalando</secondary>
    </indexterm>

    <para>Primeiramente, devemos ir rapidamente at&eacute; o  diret&oacute;rio de configura&ccedil;&atilde;o do kernel.
      Todos os diret&oacute;rios mencionados ser&atilde;o relativos ao diret&oacute;rio principal
      <filename>/usr/src/sys</filename>, que tamb&eacute;m pode ser acessado direto
      <filename>/sys</filename>. H&aacute; um n&uacute;mero de subdiret&oacute;rios que representam partes diferentes do kernel, mas
      o mais importante, para nossos objetivos, s&atilde;o
      <filename><replaceable>arch</replaceable>/conf</filename>, onde voc&ecirc;
      editar&aacute; sua configura&ccedil;&atilde;o de kernel personalizado, e
      <filename>compile</filename>, que est&atilde;o na &aacute;rea de prepara&ccedil;&atilde;o onde seu
      kernel ir&aacute; ser compilado. <replaceable>arch</replaceable> representa
      qualquer <filename>i386</filename>, <filename>alpha</filename>, ou
      <filename>pc98</filename> (uma alternativa de se&ccedil;&atilde;o de desenvolvimento de hardware do PC, popular no Jap&atilde;o).  
      Tudo dentro da arquitetura particular de diret&oacute;rios trata apenas de uma arquitetura. O resto
      do c&oacute;digo do &os; &eacute; comum para todas as plataformas por ele potencialmente suportado. Observe a 
organiza&ccedil;&atilde;o 
      l&oacute;gica da estrutura de diret&oacute;rio, com cada um dos dispositivos suportados, sistema de arquivos, e
      op&ccedil;&otilde;es em seu pr&oacute;prio subdiret&oacute;rio. &os; 5.X e superiores tem suporte para
      <filename>sparc64</filename>, e algumas outras arquiteturas sob
      desenvolvimento.</para>

    <note>
      <para>Se <emphasis>não</emphasis> tiver o diret&oacute;rio
	<filename>/usr/src/sys</filename> no seu sistema,
	ent&atilde;o o source do kernel n&atilde;o foi instalado. A maneira mais f&aacute;cil
	para fazer isso e rodando
	<command>/stand/sysinstall</command> como
	<username>root</username>, escolher
	<guimenuitem>Configure</guimenuitem>,
	<guimenuitem>Distributions</guimenuitem>,
	<guimenuitem>src</guimenuitem>, ent&atilde;o
	<guimenuitem>sys</guimenuitem>. Se voc&ecirc; tiver alguma avers&atilde;o a
	<application>sysinstall</application> e voc&ecirc; tem acesso a
	um <quote>oficial</quote> &os; CDROM, ent&atilde;o voc&ecirc; pode tamb&eacute;m
	instalar o fonte atrav&eacute;s da linha de comando:</para>

      <screen>&prompt.root; <userinput>mount /cdrom</userinput>
&prompt.root; <userinput>mkdir -p /usr/src/sys</userinput>
&prompt.root; <userinput>ln -s /usr/src/sys /sys</userinput>
&prompt.root; <userinput>cat /cdrom/src/ssys.[a-d]* | tar -xzvf -</userinput></screen>
    </note>

    <para>Depois, v&aacute; at&eacute; o diret&oacute;rio
      <filename><replaceable>arch</replaceable>/conf</filename>
      e copie o arquivo de configura&ccedil;&atilde;o <filename>GENERIC</filename> com o
      nome que voc&ecirc; quer para o seu kernel. Por exemplo:</para>

    <screen>&prompt.root; <userinput>cd /usr/src/sys/i386/conf</userinput>
&prompt.root; <userinput>cp GENERIC MYKERNEL</userinput></screen>

    <para>Tradicionalmente, este nome tem todas as principais letras e, se voc&ecirc;s
      s&atilde;o mantenedores de m&uacute;ltiplos &os; m&aacute;quinas com diferentes hardware,
      &Eacute; uma boa id&eacute;ia nome&aacute;-lo para o hostname da sua m&aacute;quina. N&oacute;s normalmente
      alteramos isto <filename>MYKERNEL</filename> para a finalidade deste
      exemplo.</para>

    <tip>
      <para>Guardar os arquivos de configura&ccedil;&atilde;o do seu kernel abaixo do directly
	<filename>/usr/src</filename> pode ser uma m&aacute; id&eacute;ia. Se voc&ecirc; sentir problemas
	para apenas ajustar delete o
	<filename>/usr/src</filename> e comece novamente. Cinco segundos depois
	que voc&ecirc; realizou que voc&ecirc; teve que deletar seu arquivo de configura&ccedil;&atilde;o de kernel personalizado. N&atilde;o 
        edite 
        diretamente o arquivo <filename>GENERIC</filename>,
	pois da pr&oacute;xima vez que voc&ecirc;s forem 
	<link linkend="cutting-edge">atualizar seu c&oacute;digo da &aacute;rvore</link>, 
	as suas antigas modifica&ccedil;&otilde;es do kernel ser&atilde;o perdidas.</para>

      <para>Voc&ecirc; querer manter em outro local seu arquivo de configura&ccedil;&atilde;o do kernel, e ent&atilde;o
	criar um link simb&oacute;lico do arquivo para o diret&oacute;rio <filename>i386</filename>.</para>

      <para>Por exemplo:</para>

      <screen>&prompt.root; <userinput>cd /usr/src/sys/i386/conf</userinput>
&prompt.root; <userinput>mkdir /root/kernels</userinput>
&prompt.root; <userinput>cp GENERIC /root/kernels/<replaceable>MYKERNEL</replaceable></userinput>	
&prompt.root; <userinput>ln -s /root/kernels/<replaceable>MYKERNEL</replaceable></userinput></screen>
    </tip>

    <note>
      <para>Voc&ecirc; deve executar todos estes comandos sobre
	a conta do <username>root</username> sen&atilde;o voc&ecirc; dar&aacute; erros
        <errortype>permiss&atilde;o negada</errortype>.</para>
    </note>

    <para>Agora, edite <filename>MYKERNEL</filename> com seu editor de texto favorito. Se voc&ecirc; for come&ccedil;ar a configurar, 
    provavelmente somente o 
    <application>vi</application> esteja dispon&iacute;vel, o qual &eacute; muito complexo para
      explicar aqui, mas &eacute; coberto em muitos livros de <link
      linkend="bibliography">bibliografia</link>. Entretanto, o &os; oferece um editor mais f&aacute;cil chamado <application>ee</application> 
      que, se 
      voc&ecirc; for um novato, deve ser o editor de sua escolha.
      Sensa&ccedil;&atilde;o de liberdade para mudar as linhas de coment&aacute;rios principalmente para pensar sua 
configura&ccedil;&atilde;o e as 
      altera&ccedil;&otilde;es para diferenciar do 
      <filename>GENERIC</filename>.</para>
    <indexterm><primary>SunOS</primary></indexterm>

    <para>Se voc&ecirc; tiver que compilar um kernel sobre &sunos; ou qualquer outro
      Sistema Operacional BSD, muito destes arquivos ser&atilde;o muito familiar a voc&ecirc;.
      Se voc&ecirc; vier de outro sistema operacional tal como DOS, o  
      arquivo de configura&ccedil;&atilde;o <filename>GENERIC</filename> 
      pode impressionar voc&ecirc;, sendo assim siga as descri&ccedil;&otilde;es do
      <link linkend="kernelconfig-config">Arquivo de Configura&ccedil;&atilde;o</link>
      lentamente e com cuidado.</para>

    <note>
      <para>&Eacute; importante voc&ecirc; sempre verificar o arquivo
        <filename>/usr/src/UPDATING</filename>, antes que voc&ecirc; execute todas as etapas da atualiza&ccedil;&atilde;o,
        No caso você pode <link
        linkend="cutting-edge">sincronizar sua &aacute;rvore de c&oacute;digo</link> com o
        c&oacute;digo fonte do &uacute;ltimo projeto do &os;.
        Neste arquivo todas as importantes altera&ccedil;&otilde;es para atualia&ccedil;&atilde;o do &os;
        s&atilde;o digitadas. Ajuste sempre sua vers&atilde;o do c&oacute;digo fonte do &os; 
<filename>/usr/src/UPDATING</filename>, 
        s&atilde;o mais precisas para novas informa&ccedil;&otilde;es que o handbook.</para>
    </note>

    <para>Voc&ecirc; deve agora compilar o c&oacute;digo fonte do kernel. Est&atilde;o aqui dois
      procedimentos que voc&ecirc; pode usar para isto, e qual voc&ecirc; usar&aacute;, vai depender de como voc&ecirc; quer recompilar seu 
      kernel, e a vers&atilde;o do &os; que voc&ecirc; est&aacute; rodando.</para>

    <itemizedlist>
      <listitem>
	<para>Se voc&ecirc; tiver instalado <emphasis>somente</emphasis> o c&oacute;digo fonte do kernel,
	  use o procedimento 1.</para>
      </listitem>

      <listitem>
	<para>Se voc&ecirc; tiver rodando um &os; vers&atilde;o anterior ao 4.0, e voc&ecirc; 
	  <emphasis>n&atilde;o</emphasis> tiver atualiza&ccedil;zaç&atilde;o para o 4.0 ou mais atual use
	  o procedimento <maketarget>make world</maketarget>, procedimento 1.
        </para>
      </listitem>

      <listitem>
	<para>Se voc&ecirc; estiver recompilando um kernel novo sem atualizar o c&oacute;digo fonte
	  (talvez para adicionar uma nova op&ccedil;&atilde;o, tal como
	  <literal>IPFIREWALL</literal>) voc&ecirc; teria que usar o outro procedimento.</para>
      </listitem>

      <listitem>
	<para>Se voc&ecirc; estiver recompilando o kernel como parte de um processo de um
          <maketarget>make world</maketarget>, use o procedimento 2.
        </para>
      </listitem>
    </itemizedlist>
    
    <procedure>
      <title>Procedimento 1. Compilando um Kernel da Maneira <quote>Tradicional</quote></title>
      
      <step>
	<para>Execute &man.config.8; para gerar o c&oacute;digo fonte do kernel.</para>
	
	<screen>&prompt.root; <userinput>/usr/sbin/config <replaceable>MYKERNEL</replaceable></userinput></screen>
      </step>

      <step>
	<para>Mude o diret&oacute;rio de configura&ccedil;&atilde;o. Isto e mostrado ap&oacute;s rodar o comando acima mencionado.</para>

	<screen>&prompt.root; <userinput>cd ../compile/<replaceable>MYKERNEL</replaceable></userinput></screen>

	<para>Para &os; version anterior a 5.0, usa-se preferivelmente:</para>

	<screen>&prompt.root; <userinput>cd ../../compile/<replaceable>MYKERNEL</replaceable></userinput></screen>
      </step>

      <step>
	<para>Compilando o kernel.</para>
	
	<screen>&prompt.root; <userinput>make depend</userinput>
&prompt.root; <userinput>make</userinput></screen>
      </step>

      <step>
	<para>Instalando o novo kernel.</para>
	
	<screen>&prompt.root; <userinput>make install</userinput></screen>
      </step>
    </procedure>

    <procedure>
      <title>Procedimento 2.  Compilando um Kernel Maneira <quote>Nova</quote></title>
      
      <step>
	<para>Mude o diret&oacute;rio para <filename>/usr/src</filename>.</para>
	
	<screen>&prompt.root; <userinput>cd /usr/src</userinput></screen>
      </step>

      <step>
	<para>Compilando o kernel.</para>
	
	<screen>&prompt.root; <userinput>make buildkernel KERNCONF=<replaceable>MYKERNEL</replaceable></userinput></screen>
      </step>

      <step>
	<para>Instalando o novo kernel.</para>

	<screen>&prompt.root; <userinput>make installkernel KERNCONF=<replaceable>MYKERNEL</replaceable></userinput></screen>
      </step>
    </procedure>
    
    <note>
      <para>Em &os;&nbsp;4.2 e anteriores troque
        <literal>KERNCONF=</literal> por <literal>KERNEL=</literal>.
        4.2-STABLE isso foi colocado antes de Fevereiro, 2001 ele n&atilde;o reconhece <literal>KERNCONF=</literal>.</para>
    </note>

    <indexterm>
      <primary><command>cvsup</command></primary>
    </indexterm>
    <indexterm><primary>anonymous CVS</primary></indexterm>
    <indexterm><primary>CTM</primary></indexterm>
    <indexterm>
      <primary>CVS</primary>
      <secondary>anonymous</secondary>
    </indexterm>

    <para>Se voc&ecirc; <emphasis>n&atilde;o</emphasis> tem atualizado seu c&oacute;digo
      de alguma maneira (voc&ecirc; n&atilde;o pode executar <application>CVSup</application>, 
      <application>CTM</application>, ou usar 
      <application>anoncvs</application>), ent&atilde;o voc&ecirc; deve usar 
      <command>config</command>, <maketarget>make depend</maketarget>,
      <command>make</command>, <maketarget>make install</maketarget> nesta sequ&ecirc;ncia.
    </para>

    <indexterm>
      <primary><filename>kernel.old</filename></primary>
    </indexterm> 

    <para>O novo kernel ser&aacute; copiado para o diret&oacute;rio do root como
      <filename>/kernel</filename> e o velho kernel ser&aacute; movido para
      <filename>/kernel.old</filename>. Agora, desligue o sistema e
      reinicie para usar seu novo kernel. Caso algo saia errado, h&aacute; algumas instru&ccedil;&otilde;es para 
      <link linkend="kernelconfig-trouble">pesquisa de defeitos</link> no final deste cap&iacute;tulo. 
      &Eacute; interessante que voc&ecirc; leia the a se&ccedil;&atilde;o de como recuperar caso seu novo kernel <link
      linkend="kernelconfig-noboot"> n&atilde;o carregue</link>.</para>

    <note>
      <para>No &os; 5.0, o kernel &eacute; instalados junto com os
	m&oacute;dulos em <filename>/boot/kernel</filename>, e os kernels
	velhos s&atilde;o colocados em <filename>/boot/kernel.old</filename>.
	Outros arquivos relacionados ao processo de carregamento, tal como o carregamento do sistema
	&man.loader.8; e as configura&ccedil;&otilde;es s&atilde;o armazenadas tamb&eacute;m em
	<filename>/boot</filename>. A terceira parte de parsonaliza&ccedil;&atilde;o dos m&oacute;dulos
	normalmente s&atilde;o colocados em <filename>/boot/modules</filename>, embora
	os usu&aacute;rios devam estar cientes que manter os m&oacute;dulos na sincroniza&ccedil;&atilde;o com o
	kernel compilado &eacute; muito importante. Os m&oacute;dulos pretendidos n&atilde;o
	rodar com o kernel compilado podem resultar em instabilidade
	ou inconformidades.</para>
    </note>

    <note>
      <para>Se voc&ecirc; adicionar qualquer dispositivo novo (tal como Placa de Som)
	e voc&ecirc; estiver rodando &os;&nbsp;4.X ou vers&otilde;es anteriores, voc&ecirc;
	pode ter que adicionar algum dispositivo de liga&ccedil;&atilde;o para seu diret&oacute;rio
	<filename>/dev</filename> antes que voc&ecirc; possa usar
	eles. Para mais informa&ccedil;&otilde;es, de uma olhada na se&ccedil;&atilde;o <link
	linkend="kernelconfig-nodes">Fazendo ligacao de dispositivos</link>
	mais tarde neste cap&iacute;tulo.</para>
    </note>
  </sect1>

  <sect1 id="kernelconfig-config">
    <title>O arquivo de Configura&ccedil;&atilde;o</title>
    <indexterm>
      <primary>kernel</primary>
      <secondary>LINT</secondary>
    </indexterm>
    <indexterm><primary>LINT</primary></indexterm>
    <indexterm>
      <primary>kernel</primary>
      <secondary>config file</secondary>
    </indexterm>

    <para>O formato geral do arquivo de configura&ccedil;&atilde;o &eacute; bastante simples.
      Cada linha cont&eacute;m uma palavra-chave e mais algum argumento. Para
      simplificar, a maioria das linhas cont&eacute;m somente um argumento. Qualquer coisa
      que segue um <literal>#</literal> &eacute; considerado um coment&aacute;rio e &eacute;
      ignorado. As seguintes se&ccedil;&otilde;es descrevem cada palavra-chave, geralmente na
      ordem que s&atilde;o listadas no <filename>GENERIC</filename>, embora
      algumas palavras-chaves relacionadas sejam agrupadas em uma &uacute;nica se&ccedil;&atilde;o
      (tal como Rede) mesmo que sejam descartados durante todo o arquivo
      <filename>GENERIC</filename>. <anchor
      id="kernelconfig-options"> Uma lista completa de op&ccedil;&otilde;es mais
      detalhes e a explica&ccedil;&atilde;o dos dispositivos presentes no arquivo de configura&ccedil;&atilde;o
      <filename>LINT</filename>, localizado no mesmo
      diret&oacute;rio do <filename>GENERIC</filename>. Se voc&ecirc; tiver na d&uacute;vida a
      respeito da necessidade de uma linha, verifique primeiramente no
      <filename>LINT</filename>.</para>

    <note><para>No &os; 5.X e superiores o <filename>LINT</filename> &eacute;
      inexistente. Veja as <filename>NOTES</filename> arquivo para
      arquiterura de op&ccedil;&otilde;es independentes. Algumas op&ccedil;&otilde;es, principalmente
      independentes da arquitetura, s&atilde;o armazenadas no arquivo
      <filename>/usr/src/sys/conf/NOTES</filename>. &Eacute; aconselh&aacute;vel
      revisar as op&ccedil;&otilde;es dentro daqui tamb&eacute;m.</para></note>

    <indexterm>
      <primary>kernel</primary>
      <secondary>Exemplos de arquivo de configura&ccedil;&atilde;o</secondary>
    </indexterm>

    <para>A seguir um exemplo de arquivo de configura&ccedil;&atilde;o <filename>GENERIC</filename> do kernel
      com v&aacute;rios coment&aacute;rios adicionais onde seja necess&aacute;rio para
      esclarecimentos. Este exemplo deveria ser compat&iacute;vel com sua copia em
      <filename>/usr/src/sys/i386/conf/GENERIC</filename>. 
      Para detalhes de todas as op&ccedil;&otilde;es poss&iacute;veis do kernel, veja
      <filename>/usr/src/sys/i386/conf/LINT</filename>.</para>

    <programlisting>#
# GENERIC -- Generic kernel configuration file for &os;/i386
#
# For more information on this file, please read the handbook section on
# Kernel Configuration Files:
#
#    http://www.&os;.org/doc/en_US.ISO8859-1/books/handbook/kernelconfig-config.html
#
# The handbook is also available locally in /usr/share/doc/handbook
# if you've installed the doc distribution, otherwise always see the
# &os; World Wide Web server (http://www.FreeBSD.org/) for the
# latest information.
#
# An exhaustive list of options and more detailed explanations of the
# device lines is also present in the ../../conf/NOTES and NOTES files. 
# If you are in doubt as to the purpose or necessity of a line, check first 
# in NOTES.
#
# &dollar;FreeBSD: src/sys/i386/conf/GENERIC,v 1.380 2003/03/29 13:36:41 mdodd Exp $</programlisting>

    <para>A seguir as palavra-chaves obrigat&oacute;rias requeridas em 
      <emphasis>todos</emphasis> os kernels compilados por voc&ecirc;:</para>
    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>m&aacute;quina</secondary>
    </indexterm>

    <programlisting>m&aacute;quina		i386</programlisting>

    <para>Est&aacute; &eacute; a arquitetura da m&aacute;quina. Deve ser algum desses
      <literal>i386</literal>, <literal>pc98</literal>,
      <literal>sparc64</literal>, <literal>alpha</literal>,
      <literal>ia64</literal>, <literal>amd64</literal>, or
      <literal>powerpc</literal>.</para>

    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>cpu</secondary>
    </indexterm>
    <programlisting>cpu          I486_CPU
cpu          I586_CPU
cpu          I686_CPU</programlisting>

    <para>A op&ccedil;&atilde;o acima especifica o tipo da CPU que voc&ecirc; tem em seu sistema.
      Voc&ecirc; deve ter exemplos m&uacute;ltiplos na linha da CPU (isto &eacute;,
      n&atilde;o &eacute; certo se voc&ecirc; utiliza 
      <literal>I586_CPU</literal> ou <literal>I686_CPU</literal>),
      entretanto, para personalizar um kernel, &eacute; melhor especificar apenas a CPU que voc&ecirc; tem.
      Se voc&ecirc; estiver inseguro do tipo da sua CPU, voc&ecirc; pode verificar o arquivo
      <filename>/var/run/dmesg.boot</filename> para ver suas mensagem do carregamento do seu sistema.</para>

    <indexterm>
      <primary>Opções do kernel</primary>
      <secondary>tipo da CPU</secondary>

    </indexterm>
    <para>Suporte para <literal>I386_CPU</literal> &eacute; fornecido ainda no fonte
      do &os;, mas &eacute; desativada por padr&atilde;o em ambos -STABLE e
      -CURRENT. Isto significa que para instalar &os; com um 386-class cpu, voc&ecirc; agora
      tem as seguintes op&ccedil;&otilde;es:</para>

    <itemizedlist>
      <listitem>
        <para>Instale uma release do &os; antiga e recompile o fonte como
	  descrito dentro <xref linkend="kernelconfig-building">.</para>
      </listitem>

      <listitem>
        <para>Compile o userland e o kernel sobre uma nova m&aacute;quina e instale num
          386 usando os arquivos precompilados <filename>/usr/obj</filename>
          (para mais detalhes <xref linkend="small-lan">).</para>
      </listitem>

      <listitem>
        <para>Gere sua pr&oacute;pria release do FreeBSD qual inclui suporte a
          <literal>I386_CPU</literal> dentro do kernel de instala&ccedil;&atilde;o do
          CD-ROM.</para>
      </listitem>
    </itemizedlist>

    <para>A primeira destas op&ccedil;&otilde;es &eacute; provavelmente a mais f&aacute;cil de todas, mas voc&ecirc;
      necessitar&aacute; de muito espa&ccedil;o em disco numa m&aacute;quina 386-class a qual possa ser
      dif&iacute;cil de encontrar.</para>

    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>ident</secondary>
    </indexterm>

    <programlisting>ident          GENERIC</programlisting>

    <para>Est&aacute; &eacute; a identifica&ccedil;&atilde;o do kernel. Voc&ecirc; deve mudar
      o nome do seu kernel para qualquer um,
      como exemplo <literal>MYKERNEL</literal> voc&ocirc; deve acompanhar as
      instru&ccedil;&otilde;es dos pr&oacute;ximos exemplos. O nome que voc&ecirc; colocou na
      <literal>ident</literal> ser&atilde;o mostrados quando voc&ecirc; carregar o
      kernel, assim &eacute; usado para dar um nome novo ao kernel um nome diferente se voc&ecirc;
      quiser manter isto separado do seu kernel atual (isto &eacute; voc&ecirc; quer 
      compilar um kernel experimental).</para>
    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>maxusers</secondary>
    </indexterm>

    <programlisting>maxusers          <replaceable>n</replaceable></programlisting>

    <para>A op&ccedil;&atilde;o <literal>maxusers</literal> ajusta o n&uacute;mero de
      tabelas importantes do sistema. Este n&uacute;mero &eacute; selecionado para ser aproximadamente
      igual ao n&uacute;mero de usu&aacute;rios simult&acirc;neos que voc&ecirc; espera ter em sua
      m&aacute;quina.</para>

    <para>A partir do &os;&nbsp;4.5, o sistema escolhe auto-ajuste desta configura&ccedil;&atilde;o para 
      voc&ecirc; se voc&ecirc; mudar esta op&ccedil;&atilde;o para <literal>0</literal><footnote>
	<para>O auto-ajuste do algoritmo ajusta <literal>maxuser</literal> igual
	  a quantidade de mem&oacute;ria do sistema, com um m&iacute;nimo de 32, e um
	  m&aacute;ximo de 384.</para></footnote>.
      No &os;&nbsp;5.X, <literal>maxusers</literal> ficar&aacute; como padr&atilde;o em
      <literal>0</literal> se n&atilde;o especificado. Se voc&ecirc; estiver usando uma
      vers&atilde;o do &os; anterior ao 4.5, ou voc&ecirc; quiser gerenciar voc&ecirc; mesmo isto
      e quiser ajustar o
      <literal>maxusers</literal> para o m&iacute;nimo 4, especialmente se voc&ecirc; estiver
      usando o X Window System ou compilando software. A raz&atilde;o &eacute; que
      a tabela mais importante ajustada com <literal>maxusers</literal> &eacute; o
      n&uacute;mero m&aacute;ximo de processos, que &eacute; ajustado para <literal>20 + 16 *
      maxusers</literal>, assim se voc&ecirc; ajustar <literal>maxusers</literal> para 1,
      ent&atilde;o voc&ecirc; poder&aacute; somente ter 36 processos simult&acirc;neos, incluindo os 18
      que o sistema carrega na hora da inicializa&ccedil;&atilde;o, e os 15 que voc&ecirc; provavelmente
      ir&aacute; criar quando voc&ecirc; iniciar o X Window System. Mesmo uma
      tarefa simples uma leitura de uma p&aacute;gina de manual come&ccedil;ar&aacute; levantando nove processos para
      filtro, decompactando, e vendo isso. Configurando
      <literal>maxusers</literal> para 64 permitir&aacute; voc&ecirc; ter carregados 1044
      processos simult&acirc;neos, qual deve ser bastante para quase todo o uso.
      Se, entretanto, voc&ecirc; ver o erro <errortype>proc completo da tabela
      </errortype> ao tentar iniciar outro programa, ou &eacute;
      um servidor rodando com um grande n&uacute;meros de usu&aacute;rios simult&acirc;neos (se preferir
      <hostid role="fqdn">ftp.FreeBSD.org</hostid>), voc&ecirc; pode aumentar
      o n&uacute;mero e recompilar.</para>

    <note>
      <para><literal>maxusers</literal><emphasis>n&atilde;o</emphasis>
	limita o n&uacute;mero de usu&aacute;rios que podem logar em sua m&aacute;quina. Isto
	simplesmente ajusta tamanho de v&aacute;rias tabelas aos valores razo&aacute;veis considerando
	o n&uacute;mero m&aacute;ximo de usu&aacute;rios e processos que voc&ecirc; provavelmente ter&aacute; rodando em seu sistema.
	A palavra-chave qual <emphasis>faz</emphasis> limita&ccedil;&atilde;o ao n&uacute;mero de logins <emphasis>remotos simult&acirc;neous e X terminal windows</emphasis>
	&eacute; <link linkend="kernelconfig-ptys"><literal>pseudo-device pty 16</literal></link>.</para>
    </note>
    
    <programlisting># Floating point support - n&atilde;o disabilite.
device          npx0     at nexus? port IO_NPX irq 13</programlisting>
    
    <para><literal>npx0</literal> &eacute; a unidade para o ponto flutuante das unidades matem&aacute;ticas no
      &os;, qual &eacute; tamb&eacute;m o hardware co-processador ou
      o emulador de software matem&aacute;tico. Isto <emphasis>n&atilde;o</emphasis>
      &eacute; opicional.</para>

    <programlisting># Pseudo devices - o n&uacute;mero indica quantas unidades a ser alocadas.
pseudo-device   loop          # Network loopback</programlisting>

    <para>Isto &eacute; o dispositivo generic loopback para TCP/IP. Se for telnet
      ou FTP para <hostid>localhost</hostid> (exemplo, <hostid
      role="ipaddr">127.0.0.1</hostid>) isto voltar&aacute; para voc&ecirc; direto atrav&eacute;s da
      pseudo-device. Isto &eacute; <emphasis>imposto</emphasis>.</para>

    <para>Tudo que segue &eacute; mais ou menos opcional. Vejam as notas
      abaixo ou ao lado para cada op&ccedil;&atilde;o para ter mais informa&ccedil;&otilde;es.</para>

    <programlisting>#To statically compile in device wiring instead of /boot/device.hints
#hints          "GENERIC.hints"         #Default places to look for devices.</programlisting>

    <para>Em &os; 5.X e vers&otilde;es mais novas o &man.device.hints.5; &eacute;
      usado para configurar op&ccedil;&otilde;es de dispositivos drivers. O padr&atilde;o
      da localiza&ccedil;&atilde;o &man.loader.8; que verifica na inicializa&ccedil;&atilde;o &eacute;
      <filename>/boot/device.hints</filename>. Usando a op&ccedil;&atilde;o
      <literal>hints</literal> voc&ecirc; pode compilar estas hints
      est&aacute;ticamente dentro do seu kernel. Ent&atilde;o n&atilde;o h&aacute; nenhuma necessidade de criar um arquivo
      <filename>device.hints</filename> dentro de
      <filename>/boot</filename>.</para>

    <!-- XXX: Add a comment here that explains when compiling hints into the kernel is a good idea and why. -->

    <programlisting>#makeoptions     DEBUG=-g          #Build kernel with gdb(1) debug symbols</programlisting>

    <para>O processo normal de compila&ccedil;&atilde;o do &os; n&atilde;o inclui informa&ccedil;&otilde;es sobre
      problemas com a compila&ccedil;&atilde;o do kernel e tira a maioria
      dos s&iacute;mbolos depois que o kernel instalado, para salvar algum espa&ccedil;o
      no local da instala&ccedil;&atilde;o. Se voc&ecirc; estiver fazendo testes com os kernels
      na -CURRENT ou alterando a se&ccedil;&atilde;o de desenvolvimento do seu pr&oacute;prio kernel do &os;,
      Voc&ecirc; pode querer descomentar esta linha. Isto ir&aacute; habilitar o
      uso da op&ccedil;&atilde;o <option>-g</option> que habilita informa&ccedil;&otilde;es de problemas   
      quando passados para &man.gcc.1;. O mesmo podem ser
      realizados pelo &man.config.8; op&ccedil;&atilde;o <option>-g</option>, se
      voc&ecirc; estiver usando a maneira <quote>tradicional</quote> para compilar seu kernel (veja o <xref linkend="kernelconfig-building">
      para mais informa&ccedil;&otilde;es.).</para>

    <programlisting>options          MATH_EMULATE      #Support for x87 emulation</programlisting>

    <para>Esta linha permite que o kernel simule um co-processador matem&aacute;tico se
      seu computador n&atilde;o for um (386 ou 486SX). Se voc&ecirc; tiver um
      486DX, ou um 386 ou 486SX (com um chip 387 ou 487 separado), ou
      superior (&pentium;, &pentium;&nbsp;II, etc.), voc&ecirc; poder&aacute; comentar esta linha.</para>

    <note>
      <para>As rotinas normais matem&aacute;ticas do co-processador para emula&ccedil;&atilde;o vem com o
	&os; <emphasis>não</emphasis> s&atilde;o muito precisas. Se voc&ecirc; quer fazer e n&atilde;o tem
	um co-processador matem&aacute;tico, e voc&ecirc; precisa de melhor precis&atilde;o, &eacute;
	recomendado que voc&ecirc; mude esta op&ccedil;&atilde;o para
	<literal>GPL_MATH_EMULATE</literal> para usar o GNU suporte matem&aacute;tico,
	qual n&atilde;o &eacute; incluso por padr&atilde;o por raz&otilde;es licenciais.</para>

      <para>No &os; 5.X, a emula&ccedil;&atilde;o matem&aacute;tica &eacute; desabilitada por padr&atilde;o,
      em outras CPUs que n&atilde;o tem suporte a ponto flotuante matem&aacute;tico nativo
      s&atilde;o menos comuns, e em muitos casos n&atilde;o suportados pelo kernel
      <filename>GENERIC</filename> sem outras op&ccedil;&otilde;es adicionais.</para></note>

    <programlisting>options          INET          #InterNETworking</programlisting>

    <para>Suporte a Rede. Deixe isto dentro, mesmo se voc&ecirc; n&atilde;o planeja ser
      ser conectado a uma rede. Muitos programas requerem ao menos loopback
      rede (isto &eacute;, fazendo conex&otilde;es de rede dentro do seu PC), assim
      este &eacute; essencialmente imposto.</para>

    <programlisting>options          INET6          #IPv6 communications protocols</programlisting>

    <para>Isto &eacute; protoc&oacute;lo de comunicação IPv6.</para>

    <programlisting>options          FFS          #Berkeley Fast Filesystem
options          FFS_ROOT     #FFS usable as root device [keep this!]</programlisting>

    <para>Isto &eacute; o sistema de arquivos b&aacute;sico do HD. Deixe isto dentro se voc&ecirc; quiser carregar o HD.
      </para>

    <note><para>Em &os; 5.X, <literal>FFS_ROOT</literal> n&atilde;o &eacute; mais    
    requerido.</para></note>

    <programlisting>options          UFS_ACL      #Support for access control lists</programlisting>

    <para>Esta op&ccedil;&atilde;o, somente est&aacute; presente no &os;&nbsp;5.X, habilita o suporte do kernel
      a lista de controle de acesso. Isto conta com o uso de atributos extendidos
      e <acronym>UFS2</acronym>, e os detalhes s&atilde;o descritas no
      <xref linkend="fs-acl">. <acronym>ACL</acronym>s s&atilde;o habilitadas por padr&atilde;o, e n&atilde;o devem
      ser desabilitadas no kernel se tiverem usado previamente no sistema de arquivos,
      pois remover&aacute; a lista de controle de acessos mudando os
      arquivos protegidos de forma imprevis&iacute;vel.</para>

    <programlisting>options          UFS_DIRHASH  #Improve performance on big directories</programlisting>

    <para>Est&aacute; op&ccedil;&atilde;o inclui funcionalidades para aumentar velocidade de opera&ccedil;&otilde;es de disco em diret&oacute;rios grandes,
      a custo de usar
      mem&oacute;ria adicional. Voc&ecirc; deseja normalmente guardar isto para um grande
      servidor, ou interagir com esta&ccedil;&otilde;es de trabalho, e remova isto se voc&ecirc; estiverem
      usando &os; em um pequeno sistema onde mem&oacute;ria &eacute; um pr&ecirc;mio e
      velocidade de acesso a disco &eacute; menos importante, como um firewall.</para>

    <programlisting>options          SOFTUPDATES  #Enable FFS Soft Updates support</programlisting>

    <para>Esta op&ccedil;&atilde;o habilita Soft Updates no kernel, isto ir&aacute;
      ajudar a aumentar a velocidade de escrita no acesso ao disco. Mesmo que est&aacute;
      funcionalidade seja fornecida pelo kernel, isto deve ser voltado para
      especificar discos. Reveja o &man.mount.8; para ver
      se Soft Updates est&aacute; habilitado para seu sistema de discos. Se voc&ecirc; n&atilde;o      
      vendo a op&ccedil;&atilde;o do 
<literal>soft-updates</literal> ent&atilde;o voc&ecirc; necessitar&aacute; para ativar isto usando o &man.tunefs.8; (para o sistema de 
      arquivos existente) ou &man.newfs.8; (para novo sistema de arquivos)
      comandos.</para>

    <programlisting>options          MFS          #Memory Filesystem
options          MD_ROOT      #MD is a potential root device</programlisting>

    <para>Isto &eacute; o mapeamento da mem&oacute;ria do Sistema de arquivos. Este &eacute; basicamente um disco de RAM
      para armazenamento r&aacute;pido de arquivos tempor&aacute;rios, &uacute;til se voc&ecirc; tiver um grande
      espa&ccedil;o de troca que voc&ecirc; queira para ter vantagem. Um lugar perfeito 
      para mountar uma parti&ccedil;&atilde;o MFS &eacute; no diret&oacute;rio <filename>/tmp</filename>,
      desde que muitos programas e dados tempor&aacute;rios sejam armazenados aqui. Para mountar
      uma MFS RAM disk no <filename>/tmp</filename>, adicione a seguinte linha no
      <filename>/etc/fstab</filename>:</para>

    <informalexample>
      <programlisting>/dev/ad1s2b	/tmp mfs rw 0 0</programlisting>
    </informalexample>

    <para>Agora voc&ecirc; necessita simplesmente reiniciar, ou rodar o comando
      <command>mount /tmp</command>.</para>

    <note><para>No &os; 5.X, &man.md.4;-backed UFS sistema de arquivos s&atilde;o
      usados para sistema de arquivos de mem&oacute;ria melhor que MFS. Informa&ccedil;&atilde;o  
      de configura&ccedil;&atilde;o do sistema de arquivos de mem&oacute;ria-suportandos pode ser encontrada no manual
      em &man.mdconfig.8; e &man.mdmfs.8;, e no <xref linkend="disks-virtual">. Em consequ&ecirc;ncia, a op&ccedil;&atilde;o
      <literal>MFS</literal> n&atilde;o &eacute; mais suportada.</para></note>

    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel options</primary>
      <secondary>NFS</secondary>
    </indexterm>
    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>NFS_ROOT</secondary>
    </indexterm>
    <programlisting>options          NFS          #Network Filesystem
options          NFS_ROOT     #NFS usable as root device, NFS required</programlisting>

    <para>O sistema de arquivos de rede. A menos que voc&ecirc; n&atilde;o planeje mountar parti&ccedil;&otilde;es
      do Unix &unix; arquivo do servidor sobre TCP/IP, voc&ecirc; pode comentar esta
      linha.</para>

    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>MSDOSFS</secondary>
    </indexterm>
    <programlisting>options          MSDOSFS      #MSDOS Filesystem</programlisting>

    <para>Sistema de arquivos &ms-dos;. A menos que voc&ecirc; planeje mountar uma parti&ccedil;&atilde;o no seu disco formatada em DOS
      na hora da inicializa&ccedil;&atilde;o, voc&ecirc; pode com seguran&ccedil;a comentar isto.
      Isto ser&aacute; carregado automaticamente na primeira vez que voc&ecirc; mountar uma parti&ccedil;&atilde;o DOS,
      como descrito acima. Tamb&eacute;m, o excelente software
      <application>mtools</application> (na cole&ccedil;&atilde;o do ports)
      permite que voc&ecirc; acesse disquetes DOS sem ter que mount&aacute;-los e
      desmont&aacute;-los (e n&atilde;o requer <literal>MSDOSFS</literal>).</para>

    <programlisting>options          CD9660       #ISO 9660 Filesystem
options          CD9660_ROOT  #CD-ROM usable as root, CD9660 required</programlisting>

    <para>O sistema de arquivos ISO 9660 &eacute; para CDROMs. Comentando isto se voc&ecirc;  
      n&atilde;o tiver um drive de CDROM ou somente montar dados de CDs ocasionalmente (desde que
      seja carregado dinamicamente na primeira vez que voc&ecirc; montar um CD de dados).
      CDs de audio n&atilde;o necessitam desde Sistema de Arquivos.</para>

    <programlisting>options          PROCFS       #Process filesystem</programlisting>

    <para>O sistema de arquivos process. Este sistema de arquivo &eacute; <quote>pretendido</quote>
      mountar em <filename>/proc</filename> que permite
      programas como &man.ps.1; para voc&ecirc; ter mais informa&ccedil;&otilde;es de qual
      processo est&aacute; rodando. No &os; 5.X, o uso do <literal>PROCFS</literal>
      n&atilde;o &eacute; mais requerido por v&aacute;rias circunst&acirc;ncias, a maioria
      erros e ferramentas de monitoramento tem que ser adaptado para rodar sobre
      <literal>PROCFS</literal>. Em adi&ccedil;&atilde;o, 5.X-CURRENT kernel
      que usam <literal>PROCFS</literal> devem agora tamb&eacute;m incluir
      suporte para <literal>PSEUDOFS</literal>:</para>

    <programlisting>options          PSEUDOFS     #Pseudo-filesystem framework</programlisting>

    <para><literal>PSEUDOFS</literal> n&atilde;o est&aacute; dispon&iacute;vel nos &os; 4.X.
      Ao contr&aacute;rio dos &os; 4.X, as novas instala&ccedil;&otilde;es do &os; 5.X n&atilde;o montar&aacute;
      o processo do sistema de arquivos por padr&atilde;o.</para>

    <programlisting>options          COMPAT_43    #Compatible with BSD 4.3 [KEEP THIS!]</programlisting>

    <para>Compatibilidade com BSD 4.3. Deixe isto descomentado, alguns programas agir&atilde;o
      estranhamente se voc&ecirc; comentar isto.</para>

    <programlisting>options          COMPAT_FREEBSD4     #Compatible with &os;4</programlisting>

    <para>Esta op&ccedil;&atilde;o &eacute; requerida no &os;&nbsp;5.X &i386; e Sistemas Alpha
      para suporte aplicativos compilados ou outras vers&otilde;es do &os;
      que usam outro sistema de interfaces de chamadas. Recomenda-se que esta op&ccedil;&atilde;o
      seja usada sobre todos &i386; e sistemas Alpha que podem
      rodar outros aplicativos; plataformas que ganham suporte somente em
      5.X, tal como ia64 e &sparc64;, n&atilde;o requer est&aacute; op&ccedil;&atilde;o.</para>

    <programlisting>options          SCSI_DELAY=15000    #Delay (in ms) before probing SCSI</programlisting>

    <para>Isso faz com que o kernel pare por 15 segundos antes de experimentar
      cada dispositivo SCSI em seu sistema. Se voc&ecirc; somente tiver IDE hard drives,
      voc&ecirc; poder&aacute; ignorar isto, voc&ecirc; provavelmente queira baixar este n&uacute;mero,
      talvez a 5 segundos, para acelerar a inicializa&ccedil;&atilde;o. Naturalmente, se
      voc&ecirc; fizer isto, e &os; tenha problema em reconhecer seus dispositivos SCSI,
      voc&ecirc; ter&aacute; que levant&aacute;-lo de maneira alternativa.</para>

    <programlisting>options          UCONSOLE            #Allow users to grab the console</programlisting>

    <para>Permite que usu&aacute;rios peguem a console, que &eacute; usado por usu&aacute;rios do X.
      Por exemplo, voc&ecirc; pode criar um <application>xterm</application> da console
      para digitar<command>xterm
      -C</command>, que indica tudo em &man.write.1;,
      &man.talk.1;, e todas as outras mensagens que voc&ecirc; receber, assim como
      algumas mensagens de console emitidas pelo kernel.</para>

    <note><para>No &os; 5.X, <literal>UCONSOLE</literal> n&atilde;o &eacute;
      mais requerido.</para></note>

    <programlisting>options          USERCONFIG          #boot -c editor</programlisting>

    <para>Esta op&ccedil;&atilde;o permite a voc&ecirc; carregar e editar as configura&ccedil;&otilde;es do menu de inicializa&ccedil;&atilde;o.</para>

    <programlisting>options          VISUAL_USERCONFIG   #visual boot -c editor</programlisting>

    <para>Esta op&ccedil;&atilde;o permite a voc&ecirc; carregar e editar as configura&ccedil;&otilde;es do menu de inicializa&ccedil;&atilde;o em modo 
	gr&aacute;fico. 
    </para>

      <note><para>Do &os; versions 5.0 e posteriores, o op&ccedil;&atilde;o <literal>USERCONFIG</literal> foi
	colocada em favor do novo m&eacute;todo &man.device.hints.5;.
	Para maiores informa&ccedil;&otilde;es sobre &man.device.hints.5; por favor
	visite <xref linkend="device-hints">.</para></note>

    <programlisting>options          KTRACE              #ktrace(1) support</programlisting>

    <para>Isto permite seguir o processo do kernel, que &eacute; usado na
      verifica&ccedil;&atilde;o dos erros.</para>

    <programlisting>options          SYSVSHM             #SYSV-style shared memory</programlisting>

    <para>Est&aacute; op&ccedil;&atilde;o fornece compartilhamento de mem&oacute;ria para o Sistema V. O uso
      mais comum deste &eacute; o XSHM extens&atilde;o em X, com muitos
      programas de gr&aacute;ficos-intensivos que dar&atilde;o automaticamente vantagem para acr&eacute;scimo de velocidade.
      Se voc&ecirc; usa X, voc&ecirc; dever&aacute; definitivamente incluir
      este.</para>

    <programlisting>options          SYSVSEM             #SYSV-style semaphores</programlisting>

    <para>Suporte para Sistemas V de sinaliza&ccedil;&atilde;o. Geralmente menos usado mas somente
      adicionado cem alguns bytes para o kernel.</para>

    <programlisting>options          SYSVMSG             #SYSV-style message queues</programlisting>

    <para>Suporte para Sistema V mensagens. Novamente, somente adicionado cem alguns 
      bytes no kernel.</para>

    <note>
      <para>O comando &man.ipcs.1; listar&aacute; algum processo usando alguma facilidade
	deste Sistema V.</para>
    </note>

    <programlisting>options 	P1003_1B		#Posix P1003_1B real-time extensions
options 	_KPOSIX_PRIORITY_SCHEDULING</programlisting>

    <para>Extens&otilde;es em tempo real adicionadas em 1993 no &posix;. Determinadas
      aplica&ccedil;&otilde;es da cole&ccedil;&atilde;o do ports usam isto
      (tal como <application>&staroffice;</application>).</para>

    <note><para>No &os; 5.X, todas estas funcionalidades agora s&atilde;o
      fornecidos pela op&ccedil;&atilde;o <literal>_KPOSIX_PRIORITY_SCHEDULING</literal>,
      e <literal>P1003_1B</literal> n&atilde;o &eacute; 
      requirido.</para></note>

    <indexterm>
      <primary>Op&ccedil;&atilde;o do kernel</primary>
      <secondary>ICMP_BANDLIM</secondary>
    </indexterm>
    <indexterm>
      <primary>Negando Servi&ccedil;o (DoS)</primary>
    </indexterm>
    <programlisting>options		ICMP_BANDLIM		#Rate limit bad replies</programlisting>

    <para>Est&aacute; op&ccedil;&atilde;o permite limitar largura de resposta de erro de ICMP. Voc&ecirc;
      tipicamente quer est&aacute; op&ccedil;&atilde;o para lhe ajudar a proteger a m&aacute;quina 
      negando do ataques de servi&ccedil;o pacotes.</para>

    <note><para>No &os; 5.X, est&aacute; caracter&iacute;stica &eacute; habilitada por padr&atilde;o e
      a op&ccedil;&atilde;o <literal>ICMP_BANDLIM</literal> n&atilde;o &eacute; requerida.
      </para></note>

    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>SMP</secondary>
    </indexterm>
    <programlisting># To make an SMP kernel, the next two are needed
#options        SMP                     # Symmetric MultiProcessor Kernel
#options        APIC_IO                 # Symmetric (APIC) I/O</programlisting>

    <para>Acima ambos s&atilde;o requeridos para suporte a SMP.</para>

    <programlisting>device          isa</programlisting>

    <para>Todos os PCs com &os; suportam uma desta. Se voc&ecirc; tiver um
      IBM PS/2 (Micro Channel Architecture), o &os; fornece algum
      limite suporte por tempo. Para maiores informa&ccedil;&otilde;es sobre o suporte
      MCA, veja
      <filename>/usr/src/sys/i386/conf/LINT</filename>.</para>

    <programlisting>device          eisa</programlisting>

    <para>Inclua este se voc&ecirc; tiver uma placa-m&atilde;e EISA. Isto habilita
      auto-detecta&ccedil;&atilde;o e suporte a configura&ccedil;&atilde;o para todos os dispositivos sobre o EISA
      bus.</para>

    <programlisting>device          pci</programlisting>

    <para>Inclua este se voc&ecirc; tiver uma placa-m&atilde;e PCI. Isto habilita
      auto-detecta&ccedil;&atilde;o de cart&otilde;es PCI e passando da PCI para ISA
      bus.</para>

    <programlisting>device          agp</programlisting>

    <para>Inclua isto se voc&ecirc; tiver um cart&atilde;o  AGP no sistema. Isto
      habilitar&aacute; suporte para AGP, e AGP GART para placas que
      tem estas caracter&iacute;sticas.</para>

    <programlisting># Floppy drives
device          fdc0        at isa? port IO_FD1 irq 6 drq 2
device          fd0         at fdc0 drive 0
device          fd1         at fdc0 drive 1</programlisting>

    <para>Este &eacute; o controlador de disco flex&iacute;vel. <literal>fd0</literal> &eacute;
      o drive flex&iacute;vel <devicename>A:</devicename>, e
      <literal>fd1</literal> &eacute; o drive <devicename>B:</devicename>.</para>

    <programlisting>device          ata</programlisting>

    <para>Este driver suporta todos dispositivos ATA e de ATAPI. Voc&ecirc; necessitar&aacute; somente
      uma <literal>device ata</literal> linha para o kernel detectar todos os dispositivos 
      PCI ATA/ATAPI sobre uma m&aacute;quina moderna.</para>

    <programlisting>device          atadisk                 # ATA disk drives</programlisting>

    <para>Isto &eacute; necess&aacute;rio em conjunto com a <literal>device ata</literal> para
      ATA disk drives.</para>

    <programlisting><anchor id="kernelconfig-atapi">
device          atapicd                 # ATAPI CDROM drives</programlisting>

    <para>Isto &eacute; necess&aacute;rio em conjunto com <literal>device ata</literal> para
      ATAPI CDROM drives.</para>

    <programlisting>device          atapifd                 # ATAPI floppy drives</programlisting>

    <para>Isto &eacute; necess&aacute;rio em conjunto com <literal>device ata</literal> para
      ATAPI floppy drives.</para>

    <programlisting>device          atapist                 # ATAPI tape drives</programlisting>

    <para>Isto &eacute; necess&aacute;rio junto com <literal>device ata</literal> para
      ATAPI tape drives.</para>

    <programlisting>options         ATA_STATIC_ID           #Static device numbering</programlisting>

    <para>Isto faz o controle est&aacute;tico de n&uacute;mero (parecendo o velho driver) ou
      os n&uacute;meros de dispositivos s&atilde;o alocados dinamicamente.</para>

    <programlisting># ATA and ATAPI devices
device          ata0        at isa? port IO_WD1 irq 14
device          ata1        at isa? port IO_WD2 irq 15</programlisting>

    <para>Usa-se sobre sistemas mais velhos, sistemas non-PCI.</para>

    <programlisting># SCSI Controllers
device          ahb        # EISA AHA1742 family
device          ahc        # AHA2940 and onboard AIC7xxx devices
device          amd        # AMD 53C974 (Teckram DC-390(T))
device          dpt        # DPT Smartcache - See LINT for options!
device          isp        # Qlogic family
device          ncr        # NCR/Symbios Logic
device          sym        # NCR/Symbios Logic (newer chipsets)

device          adv0       at isa?
device          adw
device          bt0        at isa?
device          aha0       at isa?
device          aic0       at isa?</programlisting>

    <para>Controladoras SCSI. Comente alguma linha se voc&ecirc; n&atilde;o tiver em seu
      sistema. Se voc&ecirc; tiver somente sistema IDE, voc&ecirc; pode remover todos estes
      completamente.</para>

    <programlisting># SCSI peripherals
device          scbus      # SCSI bus (required)
device          da         # Direct Access (disks)
device          sa         # Sequential Access (tape etc)
device          cd         # CD
device          pass       # Passthrough device (direct SCSI
access)</programlisting>

    <para>Perif&eacute;ricos SCSI. Novamente, comente alguma linha se voc&ecirc; n&atilde;o tiver, ou se
      voc&ecirc; tiver apenas hardware IDE, voc&ecirc; pode remover estas linhas completamente.</para>

    <programlisting># RAID controllers
device          ida        # Compaq Smart RAID
device          amr        # AMI MegaRAID
device          mlx        # Mylex DAC960 family</programlisting>

    <para>Suporte a controladoras RAID. Se voc&ecirc; n&atilde;o tiver algumas destas,
      voc&ecirc; pode comentar esta ou remover todas estas.</para>

    <programlisting># atkbdc0 controls both the keyboard and the PS/2 mouse
device          atkbdc0    at isa? port IO_KBD</programlisting>

    <para>O controlador de teclado (<literal>atkbdc</literal>) fornece serviços de I/O
      para o teclado AT e estilo PS/2 que aponta dispositivos. Este
      controlador &eacute; requerido pelo driver do teclado
      (<literal>atkbd</literal>) e o PS/2 que aponta dispositivo driver
      (<literal>psm</literal>).</para>

    <programlisting>device          atkbd0     at atkbdc? irq 1</programlisting>

    <para>O driver <literal>atkbd</literal>, em comjunto com o controlador
      <literal>atkbdc</literal>, prov&eacute;m accesso para o teclado AT 84
      ou o teclado AT real&ccedil;ado que &eacute; conectado ao controlador de teclado AT.</para>

    <programlisting>device          psm0       at atkbdc? irq 12</programlisting>

    <para>Use este dispositivo se o plug do seu mouse for na porta PS/2.</para>

    <programlisting>device          vga0        at isa?</programlisting>

    <para>O driver de video.</para>

    <programlisting># splash screen/screen saver
pseudo-device          splash</programlisting>

    <para>Splash screen na inicializa&ccedil;&atilde;o! Protetores de tela requerem isto
      tamb&eacute;m.</para>

    <programlisting># syscons is the default console driver, resembling an SCO console
device          sc0          at isa?</programlisting>

    <para><literal>sc0</literal> &eacute; o driver padr&atilde;o da console, que
      se assemelha a console de um SCO. Desde a maioria de acessos a console de programas tela cheia a
      console atrav&eacute;s de um terminal base de dados como biblioteca
      <filename>termcap</filename>, isto n&atilde;o deve importar se voc&ecirc; usar
      <literal>vt0</literal>, o driver compat&iacute;vel com a console <literal>VT220</literal>.
      Quando voc&ecirc; logar, voc&ecirc; seta a vari&aacute;vel
      <envar>TERM</envar> para <literal>scoansi</literal> se
      programas de tela cheia tiver irrita&ccedil;&atilde;o rodando sobre esta console.</para>

    <programlisting># Enable this and PCVT_FREEBSD for pcvt vt220 compatible console driver
#device          vt0     at isa?
#options         XSERVER          # support for X server on a vt console
#options         FAT_CURSOR       # start with block cursor
# If you have a ThinkPAD, uncomment this along with the rest of the PCVT lines
#options         PCVT_SCANSET=2   # IBM keyboards are non-std</programlisting>

    <para>Isto &eacute; um driver VT220 compat&iacute;vel com console, compat&iacute;vel para
      VT100/102. Isto trabalha bem em laptops que tenham hardware
      incompat&iacute;vel com <literal>sc0</literal>. Ajuste tamb&eacute;m a vari&aacute;vel do seu
      <envar>TERM</envar> para <literal>vt100</literal> ou
      <literal>vt220</literal> quando voc&ecirc; logar. Este driver pode ser usado
      para conectar um grande n&uacute;mero de diferentes m&aacute;quinas
      sobre a rede, onde <filename>termcap</filename> ou
      <filename>terminfo</filename> entradas para o dispositivo <literal>sc0</literal>
      n&atilde;o esteja muitas vezes dispon&iacute;vel &mdash; <literal>vt100</literal>
      deve estar virtualmente dispon&iacute;vel para toda plataforma.</para>

    <programlisting># Power management support (see LINT for more options)
device          apm0     at nexus? disable flags 0x20  # Advanced Power Management</programlisting>

    <para>Suporte a Avançado Gerenciamento de Energia. Usado para laptops.</para>

    <programlisting># PCCARD (PCMCIA) support
device          card
device          pcic0    at isa? irq 10 port 0x3e0 iomem 0xd0000
device          pcic1    at isa? irq 11 port 0x3e2 iomem 0xd4000 disable</programlisting>

    <para>Suporte PCMCIA. Se voc&ecirc; estiver usando um
      laptop.</para>

    <programlisting># Serial (COM) ports
device          sio0     at isa? port IO_COM1 flags 0x10 irq 4
device          sio1     at isa? port IO_COM2 irq 3
device          sio2     at isa? disable port IO_COM3 irq 5
device          sio3     at isa? disable port IO_COM4 irq 9</programlisting>

    <para>Essas 4 portas seriais s&atilde;o referentes a COM1 at&eacute; COM4
      como s&atilde;o no mundo &ms-dos/&windows;.</para>

    <note>
      <para>Se voc&ecirc; tiver um modem interno na COM4 e uma porta serial na
	COM2, voc&ecirc; ter&aacute; que mudar a IRQ do modem para 2 (pelas
	raz&otilde;es t&eacute;cnicas IRQ2 = IRQ 9) em ordem para acessar isto
	do &os;. Se voc&ecirc; tiver um cart&atilde;o multiport serial, verifique a
	p&aacute;gina do manual &man.sio.4; para maiores informa&ccedil;&otilde;es nos valores apropriados
	para esta linha. Alguns cart&otilde;es de video (notavelmente aqueles baseados no chip
	S3) usam endereço IO em forma de
	<literal>0x*2e8</literal>, e desde que muitos cart&otilde;es seriais baratos n&atilde;o fa&ccedil;am
	completamente decodifica&ccedil;&atilde;o de espaços no endereço 16-bit IO, eles confrontam com
	estes cart&otilde;es macados para porta COM4 praticamente n&atilde;o dispon&iacute;vel.</para>

      <para>Cada porta serial &eacute; preciso ter uma IRQ exclusiva (ao menos que voc&ecirc;
        esteja usando um cart&atilde;o multiport onde as interrup&ccedil;&otilde;es compartilhadas s&atilde;o
	suportadas), sendo assim o padr&atilde;o IRQs para COM3 e COM4 n&atilde;o podem ser
	usadas.</para>
    </note>

    <programlisting># Parallel port
device          ppc0    at isa? irq 7</programlisting>

    <para>Esta &eacute; a porta paralela para interface ISA-bus.</para>

    <programlisting>device          ppbus      # Parallel port bus (required)</programlisting>

    <para>Fornece suporte para a porta paralela bus.</para>

    <programlisting>device          lpt        # Printer</programlisting>

    <para>Suporte para porta paralela de impressoras.</para>

    <note>
      <para>Todos os tr&ecirc;s acima s&atilde;o requeridas para habilitar suporte a impressoras paralela.</para>
    </note>

    <programlisting>device          plip       # TCP/IP over parallel</programlisting>

    <para>Este &eacute; o driver para a interface de rede paralela.</para>

    <programlisting>device          ppi        # Parallel port interface device</programlisting>

    <para>O prop&oacute;sito geral de I/O (<quote>geek port</quote>) + IEEE1284
      I/O.</para>

    <programlisting>#device         vpo        # Requires scbus and da</programlisting>

    <indexterm><primary>zip drive</primary></indexterm>
    <para>Isto &eacute; para Iomega Zip drive. Isto requere suporte a
      <literal>scbus</literal> e <literal>da</literal>. Melhor
      performance &eacute; conseguidos com portas em modo EPP 1.9.</para>

    <programlisting># PCI Ethernet NICs.
device          de         # DEC/Intel DC21x4x (<quote>Tulip</quote>)
device          fxp        # Intel EtherExpress PRO/100B (82557, 82558)
device          tx         # SMC 9432TX (83c170 <quote>EPIC</quote>)
device          vx         # 3Com 3c590, 3c595 (<quote>Vortex</quote>)
device          wx         # Intel Gigabit Ethernet Card (<quote>Wiseman</quote>)</programlisting>

    <para>Varios cart&otilde;es de drivers PCI de rede. Pode comentar ou remover alguma das
      n&atilde;o presentes em seu sistema.</para>

    <programlisting># PCI Ethernet NICs that use the common MII bus controller code.
device          miibus     # MII bus support</programlisting>

    <para>O suporte a MII bus &eacute; requerido para algumas Placas de Rede PCI 10/100 NICs,
      ou seja aqueles que usam transceivers MII-compliant ou implementam
      controle de interface transceiver o operam como um MII. Adicionando
      <literal>dispositivo miibus</literal> para a configura&ccedil;&atilde;o do kernel puxam 
      suporte para um gen&eacute;rico miibus API e todos drivers de PHY,
      incluindo um gen&eacute;rico para PHYs que n&atilde;o s&atilde;o especificados na negocia&ccedil;&atilde;o
      por um driver individual.</para>

    <programlisting>device          dc         # DEC/Intel 21143 and various workalikes
device          rl         # RealTek 8129/8139
device          sf         # Adaptec AIC-6915 (<quote>Starfire</quote>)
device          sis        # Silicon Integrated Systems SiS 900/SiS 7016
device          ste        # Sundance ST201 (D-Link DFE-550TX)
device          tl         # Texas Instruments ThunderLAN
device          vr         # VIA Rhine, Rhine II
device          wb         # Winbond W89C840F
device          xl         # 3Com 3c90x (<quote>Boomerang</quote>, <quote>Cyclone</quote>)</programlisting>

    <para>Drivers que usam o c&oacute;digo do controlador MII bus.</para>

    <programlisting># ISA Ethernet NICs.
device          ed0    at isa? port 0x280 irq 10 iomem 0xd8000
device          ex
device          ep
# WaveLAN/IEEE 802.11 wireless NICs. Note: the WaveLAN/IEEE really
# exists only as a PCMCIA device, so there is no ISA attachment needed
# and resources will always be dynamically assigned by the pccard code.
device          wi
# Aironet 4500/4800 802.11 wireless NICs. Note: the declaration below will
# work for PCMCIA and PCI cards, as well as ISA cards set to ISA PnP
# mode (the factory default). If you set the switches on your ISA
# card for a manually chosen I/O address and IRQ, you must specify
# those parameters here.
device          an
# The probe order of these is presently determined by i386/isa/isa_compat.c.
device          ie0    at isa? port 0x300 irq 10 iomem 0xd0000
device          fe0    at isa? port 0x300
device          le0    at isa? port 0x300 irq 5 iomem 0xd0000
device          lnc0   at isa? port 0x280 irq 10 drq 0
device          cs0    at isa? port 0x300
device          sn0    at isa? port 0x300 irq 10
# requires PCCARD (PCMCIA) support to be activated
#device         xe0    at isa?</programlisting>

    <para>ISA Ethernet drivers. Veja
      <filename>/usr/src/sys/i386/conf/LINT</filename> os cart&otilde;es suportados 
      por este driver.</para>

    <programlisting>pseudo-device   ether         # Ethernet support</programlisting>

    <para><literal>ether</literal> &eacute; somente necess&aacute;rio se voc&ecirc; tem um cart&atilde;o Ethernet.
      Isto inclui o c&oacute;digo gen&eacute;rico do protoc&oacute;lo Ethernet.</para>

    <programlisting>pseudo-device   sl      1     # Kernel SLIP</programlisting>

    <para><literal>sl</literal> &eacute; para suporte SLIP. Isto foi quase inteiramente
      suplando por PPP, que &eacute; mais f&aacute;cil para se ajustar, melhor adpata&ccedil;&atilde;o
      para conex&atilde;o modem-a-modem, e mais poderoso. O
      <replaceable>n&uacute;mero</replaceable> depois <literal>sl</literal>
      espec&iacute;fica quantas sess&otilde;es simult&acirc;neas SLIP s&atilde;o suportadas.</para>

    <programlisting>pseudo-device   ppp     1     # Kernel PPP</programlisting>

    <para>Isto &eacute; para suporte do  kernel a PPP para conex&otilde;es dial-up. H&aacute;
      tamb&eacute;m uma outra vers&atilde;o do PPP implementada executada como uma aplica&ccedil;&atilde;o que
      usa <literal>tun</literal> e oferece mais flexibilidade e caracter&iacute;sticas
      tais como exige discagem. O <replaceable>n&uacute;mero</replaceable> de conex&otilde;es depois do
      <literal>ppp</literal> especifica a quantidade de conex&otilde;es simult&acirc;neas PPP
      suporta.</para>

    <programlisting>pseudo-device   tun           # Packet tunnel.</programlisting>

    <para>Isto &eacute; usado pelo software de PPP. Um
      <replaceable>n&uacute;mero</replaceable> depois <literal>tun</literal>
      especificado &eacute; o n&uacute;mero de sess&otilde;es simultaneas PPP suportadas. Veja
      a se&ccedil;&atilde;o <link linkend="userppp">PPP</link> deste livro para maiores
      informa&ccedil;&otilde;es.</para>

    <programlisting><anchor id="kernelconfig-ptys">
pseudo-device   pty           # Pseudo-ttys (telnet etc)</programlisting>

    <para>Isto &eacute; um <quote>pseudo-terminal</quote> que simula porta de login.
      Isto &eacute; usado para entrada <command>telnet</command> e se&ccedil;&otilde;es
      <command>rlogin</command>,
      <application>xterm</application>, e algumas outras aplica&ccedil;&otilde;es como
      <application>Emacs</application>. Um
      <replaceable>n&uacute;mero</replaceable> depois <literal>pty</literal> indica o n&uacute;mero de
      <literal>pty</literal>s para ser criado. Se voc&ecirc; necessita mais que o
      padr&atilde;o de 16 simult&acirc;neas <application>xterm</application> windows
      ou remote logins, &eacute; certo aumentar este n&uacute;mero,
      para o m&aacute;ximo de 256.</para>

    <programlisting>pseudo-device   md            # Memory <quote>disks</quote></programlisting>

    <para>Disco de mem&oacute;ria pseudo-devices.</para>

    <programlisting>pseudo-device   gif</programlisting>

    <para>ou</para>

    <programlisting>pseudo-device   gif     4     # IPv6 and IPv4 tunneling</programlisting>

    <para>Isto implementa IPv6 sobre IPv4 tunneling,
      IPv4 sobre IPv4 tunneling, e IPv6 sobre IPv6 tunneling. Começando com
      &os;&nbsp;4.4 o <literal>gif</literal> dispositivo &eacute;
      <quote>auto-cloning</quote>, e voc&ecirc; deve usar o primeiro exemplo
      (sem o n&uacute;mero depois do <literal>gif</literal>). Vers&otilde;es mais avan&ccedil;adas do
      &os; requerem o n&uacute;mero.</para>

    <programlisting>pseudo-device   faith   1     # IPv6-to-IPv4 relaying (translation)</programlisting>

    <para>Esta pseudo-device captura os pacotes que s&atilde;o emitidos e
      desvía-os ao daemon da tradu&ccedil;&atilde;o IPv4/IPv6.</para>

    <programlisting># O `bpf' pseudo-device permite o filtro de pacotes Berkeley.
# Esteja ciente das consequencias administrativas ao habilitar isto!
pseudo-device   bpf           # Berkeley packet filter</programlisting>

    <para>Este &eacute; o filtro de pacotes Berkeley. Esta pseudo-device permite
      que as interfaces da rede sejam colocadas em modo promiscuous, capturando cada
      pacote sobre um broadcast da rede (por exemplo uma Ethernet). Estes pacotes
      podem ser capturados para disco e ou examinados com o programa &man.tcpdump.1;.</para>

    <note>
      <para>O <literal>bpf pseudo-device</literal> &eacute; usado tamb&eacute;m por
	&man.dhclient.8; para obter o endereço IP de roteador padr&atilde;o
	(gateway) e assim por diante. Se voc&ecirc; usa DHCP, deixe isto
	descomentado.</para>
    </note>

    <programlisting># Suporte USB
#device         uhci          # UHCI PCI-&gt;USB interface
#device         ohci          # OHCI PCI-&gt;USB interface
#device         usb           # USB Bus (required)
#device         ugen          # Generic
#device         uhid          # <quote>Human Interface Devices</quote>
#device         ukbd          # Keyboard
#device         ulpt          # Printer
#device         umass         # Disks/Mass storage - Requires scbus and da
#device         ums           # Mouse
# USB Ethernet, requires mii
#device         aue           # ADMtek USB ethernet
#device         cue           # CATC USB ethernet
#device         kue           # Kawasaki LSI USB ethernet</programlisting>

    <para>Suporte para v&aacute;rios dispositivos USB.</para>

    <para>Para maiores e adicionais informa&ccedil;&otilde;es sobre dispositivos suportados pelo 
      &os;, veja
      <filename>/usr/src/sys/i386/conf/LINT</filename>.</para>

      <sect2>
        <title>Grandes Configura&ccedil;&otilde;es de Mem&oacute;ria (<acronym>PAE</acronym>)</title>
	<indexterm>
	  <primary>
	    Extens&otilde;es F&iacute;sicas do endereço (<acronym>PAE</acronym>)
	  </primary>
	  <secondary>
	    Grandes Configura&ccedil;&otilde;es de Mem&oacute;ria
	  </secondary>
	</indexterm>

	<para>As máquinas com grandes configurações de memória requerem acesso a
	  mais que o limite de 4 gigabyte no User+Kernel Virtual do espaço do endereço
	  (<acronym>KVA</acronym>). Devido a esta
	  limitação, a Intel adicionou suporte para 36-bit de acesso a espaço de endereço físico
	  no &pentium; Na linha Pro e anteriores de CPUs.</para>
	
	<para>A extensão de endereço físico (<acronym>PAE</acronym>)
	  capacita oe &intel; &pentium; Pro e CPUs anteriores
	  permitindo configuração de memória para levantar até 64 gigabytes.
	  &os; fornecendo suporte para esta capacidade via opção 
	  <option>PAE</option> na configuração do kernel, disponível
	  no 4.X da série &os; começando com 4.9-RELEASE e
	  no 5.X da série &os; começando com 5.1-RELEASE. Devido 
	  a limitações da arquitetura de memória da Intel, nenhuma distinção
	  e feita para memórias acima ou abaixo de 4 gigabytes. A memória alocada
	  acima de 4 gigabytes é adicionada simplesmente ao pool da memória
	  disponível.</para>

	<para>Para habilitar suporte ao <acronym>PAE</acronym>no kernel,
	  adicione simplesmente a seguinte linha no arquivo de configuação do seu kernel:
	  </para>
	
	<programlisting>options		    PAE</programlisting>

	<note>
	  <para>O suporte ao <acronym>PAE</acronym> no &os; está somente
	    disponível para processadores &intel; IA-32. Deve-se também 
	    notar, que o suporte ao <acronym>PAE</acronym> no &os; não
	    foi totalmente testado, e são considerados de qualidade beta 
	    se comparedos com outras características stable do &os;.</para>
	</note>

	<para>Suporte <acronym>PAE</acronym> no &os; tem algumas limitações:</para>
	
	<itemizedlist>
	  <listitem>
	    <para>Um processo não pode alcançar mais de 4
	      gigabytes do espaço da VM.</para>
	  </listitem>

	  <listitem>
	    <para>O módulo <acronym>KLD</acronym> não pode ser carregado dentro
	      de um kernel com o <acronym>PAE</acronym> habilitado, devido a 
	      diferenças na estrutura da configuração de um módulo do kernel.
	      </para>
	  </listitem>

	  <listitem>
	    <para>Drivers do dispositivos que não usam o &man.bus.dma.9;
	      a interface causará corrumpção de dados em um kernel com
	      <acronym>PAE</acronym> habilitado e não são
	      recomendados para uso. Para esta razão, o arquivos de configuração do
	      <filename>PAE</filename> no kernel
	      é fornecido no &os; 5.X, que
	      exclui todos os drivers desconhecidos para trabalhar com o <acronym>PAE</acronym> habilitado no
	      kernel.</para>
	  </listitem>

	  <listitem>
	    <para>Alguns sistemas tunables determinam o uso do recurso da memória
	      pela quantidade de memória física disponível. Alguns
	      tunables podem desnecessariamente sobre-alocar devido a
	      natureza da grande mamória de um sistema <acronym>PAE</acronym>.
	      Um exemplo é o <option>kern.maxvnodes</option>
	      sysctl, que controla o número máximo de vnodes permitidos
	      no kernel. Recomenda-se para ajustar este e outros
	      tais tunables a um valor rasoável.</para>
	  </listitem>

	  <listitem>
	    <para>Pode ser necessário aumentar o espaço do endereço 
	      (<acronym>KVA</acronym>) virtual do kernel ou diminuir a
	      quantidade de recursos especificados do kernel que é pesadamente usado
	      (veja acima) s fim de evitar a exaustão do <acronym>KVA</acronym>.
	      A opção do kernel <option>KVA_PAGES</option>
	      pode ser usado para aumentar o espaço do
	      <acronym>KVA</acronym>.</para>
	  </listitem>
	</itemizedlist>

	<para>Para preocupação com performance e estabilidade, recomenda-se 
	  consultar o &man.tuning.7; página do manual. A &man.pae.4;
	  página do manual contém informação moderna do &os;'s
	  para suporte <acronym>PAE</acronym>.</para>
    </sect2>
  </sect1>

  <sect1 id="kernelconfig-nodes">
    <title>Fazendo Ligação dos Dispositivos</title>

    <indexterm><primary>dispositivos ligados</primary></indexterm>
    <indexterm>
      <primary><command>MAKEDEV</command></primary>
    </indexterm>

    <note><para>Se você estiver rodando &os;&nbsp;5.0 ou posteriores
      você poderá com segurança pular está seção. Estas versões usam
      &man.devfs.5; para alocar ligação entre dispositivos transparentes para o usuário.</para></note>

    <para>Quase cada dispositivo no kernel tem uma  
      <quote>ligação</quote> correspondente no diretório <filename>/dev</filename>.
      Esta ligação olha como arquivos regulares, mas são realmente entradas especiais
      no kernel que os programas usam para acessar os dispositivos.
      O shell script <filename>/dev/MAKEDEV</filename>, que é
      executado quando você instala primeiramente o sistema operacional, cria
      quase todas os dispositivos de ligação suportados. Entretanto, isto não
      cria <emphasis>todos</emphasis>, assim quando você adiciona suporte para
      um novo dispositivo, isto faz apropriadamente que a entrada são
      neste diretório, e senão, adiciona este. Está aqui um exemplo simples:</para>

    <para>Supondo que você adicione suporte de um IDE CD-ROM ao kernel. A linha
      a adicionar é:</para>

    <programlisting>device acd0</programlisting>

    <para>Isto significa que você deve procurar alguma entrada que começe com
      <filename>acd0</filename> no diretório <filename>/dev</filename>,
      possivelmente seguidas por uma letra, tal como
      <literal>c</literal>, ou precedido por uma letra
      <literal>r</literal>, que significa um dispositivo <quote>raw</quote>. It
      turns out daqueles arquivos que não estão lá, assim você deve mudar para o diretório e o tipo para
      <filename>/dev</filename>:</para>

    <indexterm>
      <primary><command>MAKEDEV</command></primary></indexterm>
    <screen>&prompt.root; <userinput>sh MAKEDEV acd0</userinput></screen>

    <para>Quando este script terminar, você encontrará agora uma entrada
      <filename>acd0c</filename> e <filename>racd0c</filename>
      em <filename>/dev</filename> assim que você executar
      corretamente.</para>

    <para>Para Placas de Som, o seguinte comando cria as entradas apropriadas:</para>

    <screen>&prompt.root; <userinput>sh MAKEDEV snd0</userinput></screen>

    <note>
      <para>Ao criar ligação para dispositivos tais como Placas de Som, se
	outra pessoa tiver acesso a sua maquina, pode ser necessário 
	proteger os dispositivos contra acesso externo adicionando os arquivos no
	<filename>/etc/fbtab</filename>. Veja &man.fbtab.5; para maiores
	informações.</para>
    </note>

    <para>Siga este simples procedimentos para outros dispositivos
      non-<filename>GENÉRICOS</filename> que não tiverem
      entradas.</para>

    <note>
      <para>Todas as controladoras SCSI usam a mesma entrada no
	<filename>/dev</filename>, assim você não necessita criar
	este. Também, as placas de rede e SLIP/PPP pseudo-devices não
	tem entradas em <filename>/dev</filename> em tudo, assim você não
	tem que preocupar-se sobre estes também.</para>
    </note>
  </sect1>

  <sect1 id="kernelconfig-trouble">
    <title>Se algo der errado</title>

    <para>Há 5 categorias de problema que podem ocorrer ao construir um kernel personalizado.
      São:</para>

    <variablelist>
      <varlistentry>
	<term>Falhas na <command>configuração</command>:</term>

	<listitem>
	  <para>Se o &man.config.8; comando falhar quando você
	    dar esta descrição seu kernel, você provavelmente fez um
	    erro simples em algum lugar. Felizmente,
	    &man.config.8; imprimirá o número da linha que está com
	    problema, assim você pode tranquilamente pular para isto com o
	    <application>vi</application>. Por exemplo, se você ver:</para>

	  <screen>config: line 17: syntax error</screen>

	  <para>Você pode chegar ao problema pelo <application>vi</application> 
	    procurando <command>17G</command> no mode de comando. Certifique-se que o
	    teclado está corretamente classificado, comparando o kernel
	    <filename>GENÉRICO</filename> com uma outra
	    referência.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>Falha no <command>make</command>:</term>

	<listitem>
	  <para>Se o comando <command>make</command> falhar, isso normalmente
	    significa que tem erros em suas descrições do kernel, mas não bastante
	    grave para &man.config.8; travá-lo. Novamente, olhe
	    sobre sua configuração, e se você ainda não pode resolver o problema,
	    envie um e-mail para o &a.questions; com sua configuração do kernel,
	    e isto deve ser diagnosticado mais rapidamente.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>Falha na instalação do kernel:</term>
	
	<listitem>
	  <para>Se o kernel perfeitamente estiver compilado, mas não instalou
	    (o comando <command>make install</command> ou
	    <command>make installkernel</command> falhar,
	    a primeira coisa a se fazer  é checar se seu sistema está rodando em
	    securelevel 1 ou mais elevado (veja &man.init.8;). A instalação do kernel
	    tenta remover a área de memória que contem informação do
	    seu kernel e coloca a área de memória num novo um.
	    Desde que o securelevel 1 ou mais elevado impede a desconfiguração da área de memória
	    para alguns arquivos no sistema, a instalação do kernel necessita
	    se executado no securelevel 0 ou seja baixo.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>O kernel não carrega:<anchor
	  id="kernelconfig-noboot"></term>

	<listitem>
	  <para>Se seu kernel novo não carregar, ou falhar para
	    reconhecer seus dispositivos, não se apavore! Felizmente, &os; tem
	    um excelente mecanismo para recuperar kernels incompatíveis.
	    Escolha o kernel que você deseja carregar no
	    &os; e carregue ele. Você pode acessar este quando o sistema
	    de contas estiver abaixo de 10. Hit e tecle exceto a
            tecla <keycap>Enter</keycap>, type <command>unload</command>
            and then type
	    <command>boot <replaceable>kernel.old</replaceable></command>,
            or the filename of any other kernel that will boot properly.
            Ao reconfigurar um kernel, é sempre uma boa idéia manter
            um kernel confiável na mão para trabalhar.</para>

	  <para>Depois de carregar um kernel confiável você pode verificar o arquivo de configuração do seu kernel e tentar recompilá-lo novamente.
	    Um recurso de ajudo útil é o arquivo
	    <filename>/var/log/messages</filename> 
	    que grava, entre outras coisas, todas as mensagens do kernel
	    que são com sucesso carregados. Também, o comando &man.dmesg.8;
	    imprimirá as mesnagens do kernel que estiver carregado atualmente.</para>

	  <note>
	    <para>Se você estiver tendo problemas para compilar um kernel, certifique
	      e guarde um <filename>GENERIC</filename>, ou algum outro kernel
	      que seja conhecido na mão para trabalhar com um nome diferente que 
	      não apagará na próxima compilação. Você não pode confiar em
	      <filename>kernel.old</filename> porque ao instalar um
	      novo kernel, o <filename>kernel.old</filename> é sobscrevido
	      com o último kernel instalado que pode não se funcional.
	      Tambem, o mais cedo possivel, realize a movimentacao do kernel para a
	      localizacao apropriada <filename>kernel</filename> com comandos tal
	      como &man.ps.1; nao trabalhara corretamente. O comando apropriado 
	      <quote>destrava</quote> o arquivo do kernel que
	      <command>faz</command> a instacao (a fim de move-los permanentemente para
	      uma outra parte traseira do kernel) e:</para>

	    <screen>&prompt.root; <userinput>chflags noschg /kernel</userinput></screen>

	    <para>Se voce encontrar voce nao pode fazer isto, voce estara rodando provavelmente
	      em um &man.securelevel.8; mais extremamente em zero. Edite o
	      <literal>kern_securelevel</literal> em
	      <filename>/etc/rc.conf</filename> e ajuste isto para
	      <literal>-1</literal>, entao reinicie. Voce pode mudar isto para tras
	      para esta configuracao anterior quando voce e feliz com seu novo
	      kernel.</para>

	    <para>E, se voce quiser <quote>travar</quote> seu novo kernel
	      dentro de um local, ou algum arquivo para importacao, de algum mod que nao
	      possa ser movido ou alterado:</para>

	    <screen>&prompt.root; <userinput>chflags schg /kernel</userinput></screen>

	    <para>No &os; 5.X, o kernel nao sao instalados com o
	    sistema one a area de memoria nao pode ser mudado, assim como esta e improvavel ser a fonte 
	    do problema que voce esta experimentando.</para></note>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>O trabalho do kernel, mas nao trabalha mais algum &man.ps.1;:</term>

	<listitem>
	  <para>Se voce tiver instado uma versao diferente do kernel
	    de um sistema de utilizades que estiveram sido construidas com,
	    por exemplo, um kernel 4.X em um sistema 3.X, muitos comandos de status do sistema
	    como &man.ps.1; e &man.vmstat.8; nao funcionara
	    mais. Voce deve recompilar a biblioteca <filename>libkvm</filename>
	    como pode se util. Isto e uma razao que normalmente
	    nao e uma boa ideia usar uma versao diferente do
	    kernel do resto do sistema operacional.</para>
	</listitem>
      </varlistentry>
    </variablelist>
  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->

