<!--
     The FreeBSD Documentation Project

     $FreeBSD: pt_BR.ISO8859-1/books/handbook/kernelconfig/chapter.sgml,v 1.29 2004/02/16 18:37:09 eksffa Exp $
-->

<chapter id="kernelconfig">
  <chapterinfo>
    <authorgroup>
      <author>
	<firstname>Jim</firstname>
	<surname>Mock</surname>
	<contrib>Atualizado e reestruturado por </contrib>
	<!-- Mar 2000 -->
      </author>
    </authorgroup>
    <authorgroup>
      <author>
	<firstname>Jake</firstname>
	<surname>Hamby</surname>
	<contrib>Contribui&ccedil;&atilde;o original de </contrib>
	<!-- 6 Out 1995 -->
      </author>
    </authorgroup>
  </chapterinfo>

  <title>Configurando o <literal>kernel</literal> do FreeBSD</title>

  <sect1 id="kernelconfig-synopsis">
    <title>Sinópse</title>

    <indexterm>
      <primary>kernel</primary>
      <secondary>compilando um <literal>kernel</literal> customizado</secondary>
    </indexterm>

    <para>O <literal>kernel</literal> &eacute; o cora&ccedil;&atilde;o do sistema &os;.  
      Ele &eacute; respons&aacute;vel por gerenciar a mem&oacute;ria, refor&ccedil;ar 
      controles de seguran&ccedil;a,
      pela rede, pelo accesso a disco, e muito mais.  A medida que mais e mais o &os;
      torna-se din&acirc;micamente configur&aacute;vel, ocasionalmente faz-se necess&aacute;rio
      configurar e recompilar seu <literal>kernel</literal>.</para>

    <para>Depois de ler este cap&iacute;tulo, voc&ecirc; saber&aacute;:</para>

    <itemizedlist>
      <listitem>
	<para>Porque voc&ecirc; poder&aacute; precisar compilar um <literal>kernel</literal> customizado.</para>
      </listitem>

      <listitem>
	<para>Como escrever um arquivo de configura&ccedil;&atilde;o do <literal>kernel</literal>, ou alterar um arquivo de
	  configura&ccedil;&atilde;o existente.</para>
      </listitem>

      <listitem>
	<para>Como usar o arquivo de configura&ccedil;&atilde;o do <literal>kernel</literal> para criar e compilar um
	  novo <literal>kernel</literal>.</para>
      </listitem>

      <listitem>
	<para>Como instalar o novo <literal>kernel</literal>.</para>
      </listitem>

      <listitem>
	<para>Como criar quaisquer entradas no <filename>/dev</filename> caso isso venha a 
	  ser necess&aacute;rio.</para>
      </listitem>

      <listitem>
	<para>Como resolver problemas se algo der errado.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="kernelconfig-custom-kernel">
    <title>Porque compilar um <literal>kernel</literal> customizado?</title>

    <para>Tradicionalmente, o &os; teve o que foi chamado de <literal>kernel</literal>
      <quote>monol&iacute;tico</quote>. Isto significa que o <literal>kernel</literal> era um
      grande programa, contendo uma lista fixa de dispositivos suportados, e se voc&ecirc; quisesse
      alterar seu comportamento ent&atilde;o seria necess&aacute;rio compilar um novo <literal>kernel</literal>,
      e então reiniciar seu computador com ele.</para>

    <para>Hoje, o &os; est&aacute; movendo-se rapidamente para um modelo onde muitas das funcionalidades do
      <literal>kernel</literal> est&atilde;o contidas em m&oacute;dulos que s&atilde;o carregados e descarregados din&acirc;micamente conforme eles s&atilde;o necess&aacute;rios.
      Isto permite que o <literal>kernel</literal> imediatamente se adapte a um novo <foreignphrase>hardware</foreignphrase>
      tornando-o dispon&iacute;vel (tais como cart&otilde;es PCMCIA para <foreignphrase>laptop</foreignphrase>), ou a
      novas funcionalidades à serem inseridas no <literal>kernel</literal> que n&atilde;o eram
      necess&aacute;rias quando o ele foi originalmente compilado. Isso
      &eacute; conhecido como <literal>kernel</literal> modular. Coloquialmente eles s&atilde;o chamados KLDs.</para>

    <para>Apesar disto, ainda &eacute necess&aacute;rio carregar algumas configura&ccedil;&otilde;es est&aacute;ticas no <literal>kernel</literal>. Em alguns casos 
      isto est&aacute; assim porque estas funcionalidades est&atilde;o t&atilde;o amarradas ao <literal>kernel</literal> que elas n&atilde;o podem ser carregadas din&acirc;micamente. 
      Em outros casos, isto pode simplesmente estar assim porque ningu&eacute;m ainda conseguiu tempo para escrever
um m&oacute;dulo de carga din&acirc;mico do <literal>kernel</literal> para cada uma delas.</para>

    <para>Compilar um <literal>kernel</literal> personalizado &eacute; um dos rituais mais importantes que cada usu&aacute;rio de
      &unix; deve enfrentar. Este processo, embora consuma tempo, trar&aacute; muitos benef&iacute;cios para o seu sistema &os;.
      Diferentemente do <literal>kernel</literal> <filename>GENERIC</filename>, o qual necessita de suporte a uma
      abrangente lista de equipamentos, um <literal>kernel</literal> personalizado somente conter&aacute; suporte para o <foreignphrase>hardware</foreignphrase> do
      <emphasis>seu</emphasis> PC. Isto tem in&uacute;meros benef&iacute;cios, tais como:</para>

    <itemizedlist>
      <listitem>
	<para>Tempo de inicializa&ccedil;&atilde;o mais r&aacute;pido. Visto que o <literal>kernel</literal> apenas testar&aacute; o
	equipamento que voc&ecirc; tiver em seu sistema, o tempo de testes ao inicializar a m&aacute;quina diminuir&aacute; drasticamente.</para>
      </listitem>

      <listitem>
	<para>Menor uso da mem&oacute;ria. Um <literal>kernel</literal> personalizado frequentemente utiliza menos mem&oacute;ria
	  que o <literal>kernel</literal> <filename>GENERIC</filename>, o que &eacute; importante
	  porque o <literal>kernel</literal> deve sempre estar presente na mem&oacute;ria f&iacute;sica.
	  Por esta raz&atilde;o, um <literal>kernel</literal> personalizado &eacute; especialmente &uacute;til 
	  em um sistema com pouca quantidade de RAM.</para>
      </listitem>

      <listitem>
	<para>Suporte adicional de <foreignphrase>hardware</foreignphrase>. Um <literal>kernel</literal> personalizado permite a voc&ecirc; adicionar suporte a dispositivos, tais como placas de som, que n&atilde;o est&atilde;o presentes no <literal>kernel</literal> <filename>GENERIC</filename>.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="kernelconfig-building">
    <title>Compilando e instalando um <literal>kernel</literal> customizado</title>
    <indexterm>
      <primary>kernel</primary>
      <secondary>Compilando / instalando</secondary>
    </indexterm>

    <para>Primeiramente, deixe-nos apresentar rapidamente o diret&oacute;rio de compila&ccedil;&atilde;o do <literal>kernel</literal>.
      Todos os diret&oacute;rios mencionados ser&atilde;o relativos ao diret&oacute;rio principal,
      <filename>/usr/src/sys</filename>, que tamb&eacute;m poder&aacute; ser acessado diretamente atrav&eacute;s de
      <filename>/sys</filename>. H&aacute; um n&uacute;mero de subdiret&oacute;rios que representam partes diferentes do <literal>kernel</literal>, mas
      os mais importantes, para nossos objetivos, s&atilde;o
      <filename><replaceable>arch</replaceable>/conf</filename>, onde voc&ecirc;
      editar&aacute; sua configura&ccedil;&atilde;o de <literal>kernel</literal> personalizado, e
      <filename>compile</filename>, que &eacute; a &aacute;rea de prepara&ccedil;&atilde;o onde seu
      <literal>kernel</literal> ir&aacute; ser compilado.  <replaceable>arch</replaceable> representa
      uma das arquiteturas suportadas pelo &os; como <filename>i386</filename>, <filename>alpha</filename>, ou
      <filename>pc98</filename> (uma ramo de desenvolvimento alternativo de <foreignphrase>hardware</foreignphrase> do PC, popular no Jap&atilde;o).  
      Tudo que est&aacute; dentro de um diret&oacute;rio de uma arquitetura espec&iacute;fica diz respeito somente a esta arquitetura; o resto
      do c&oacute;digo do &os; &eacute; comum para todas as plataformas &agrave;s quais ele poder&aacute; ser potencialmente convertido. Observe a 
      organiza&ccedil;&atilde;o 
      l&oacute;gica da estrutura de diret&oacute;rio, com cada dispositivo suportado, sistema de arquivos, e
      op&ccedil;&otilde;es em seu pr&oacute;prio subdiret&oacute;rio. As vers&otilde;es do &os; 5.X e superiores tem suporte para
      <filename>sparc64</filename>, e algumas outras arquiteturas em
      desenvolvimento.</para>

    <note>
      <para>Se <emphasis>n&atilde;o</emphasis> existir o diret&oacute;rio
	<filename>/usr/src/sys</filename> no seu sistema,
	ent&atilde;o o fonte do <literal>kernel</literal> n&atilde;o foi instalado. A maneira mais f&aacute;cil
	para fazer isso &eacute; rodando
	<command>/stand/sysinstall</command> como
	<username>root</username>, escolher
	<guimenuitem>Configure</guimenuitem>,
	<guimenuitem>Distributions</guimenuitem>,
	<guimenuitem>src</guimenuitem>, e ent&atilde;o
	<guimenuitem>sys</guimenuitem>. Se voc&ecirc; tiver alguma avers&atilde;o ao
	<application>sysinstall</application> e possuir acesso a
	um &os; CDROM <quote>oficiais</quote>, ent&atilde;o voc&ecirc; poder&aacute; tamb&eacute;m
	instalar o fonte atrav&eacute;s da linha de comando:</para>

      <screen>&prompt.root; <userinput>mount /cdrom</userinput>
&prompt.root; <userinput>mkdir -p /usr/src/sys</userinput>
&prompt.root; <userinput>ln -s /usr/src/sys /sys</userinput>
&prompt.root; <userinput>cat /cdrom/src/ssys.[a-d]* | tar -xzvf -</userinput></screen>
    </note>

    <para>Depois, v&aacute; at&eacute; o diret&oacute;rio
      <filename><replaceable>arch</replaceable>/conf</filename>
      e copie o arquivo de configura&ccedil;&atilde;o <filename>GENERIC</filename> com o
      nome que voc&ecirc; quiser para o seu <literal>kernel</literal>. Por exemplo:</para>

    <screen>&prompt.root; <userinput>cd /usr/src/sys/i386/conf</userinput>
&prompt.root; <userinput>cp GENERIC MYKERNEL</userinput></screen>

    <para>Tradicionalmente, este nome tem todas letras em mai&uacute;sculas, se voc&ecirc;
      mant&eacute;m m&uacute;ltiplas m&aacute;quinas &os; com diferentes <foreignphrase>hardware</foreignphrase>,
      &eacute; uma boa id&eacute;ia nome&aacute;-lo prefixando o <foreignphrase>hostname</foreignphrase> da sua m&aacute;quina. Para a finalidade deste
      exemplo, ser&aacute; usado o nome <filename>MYKERNEL</filename>.</para> 

    <tip>
      <para>Guardar os arquivos de configura&ccedil;&atilde;o do seu <literal>kernel</literal> diretamente abaixo do
	<filename>/usr/src</filename> pode ser uma m&aacute; id&eacute;ia. Se voc&ecirc; tiver problemas
	poder&aacute; ser tentado a apenas apagar o
	<filename>/usr/src</filename> e iniciar tudo novamente. Cinco segundos depois disto feito,
	voc&ecirc; poder&aacute; perceber que removeu o seu arquivo de configura&ccedil;&atilde;o de <literal>kernel</literal> personalizado.
        N&atilde;o edite 
        diretamente o arquivo <filename>GENERIC</filename>,
	pois ele pode ser sobrescrito da pr&oacute;xima vez que voc&ecirc; for
	<link linkend="cutting-edge">atualizar a &aacute;rvore do c&oacute;digo fonte</link>;
	suas modifica&ccedil;&otilde;es do <literal>kernel</literal> ser&atilde;o perdidas.</para>

      <para>Voc&ecirc; pode querer manter em outro local seu arquivo de configura&ccedil;&atilde;o do <literal>kernel</literal>, e ent&atilde;o
	criar um link simb&oacute;lico deste arquivo para o diret&oacute;rio <filename>i386</filename>.</para>

      <para>Por exemplo:</para>

      <screen>&prompt.root; <userinput>cd /usr/src/sys/i386/conf</userinput>
&prompt.root; <userinput>mkdir /root/kernels</userinput>
&prompt.root; <userinput>cp GENERIC /root/kernels/<replaceable>MYKERNEL</replaceable></userinput>	
&prompt.root; <userinput>ln -s /root/kernels/<replaceable>MYKERNEL</replaceable></userinput></screen>
    </tip>

    <note>
      <para>Voc&ecirc; dever&aacute; executar todos estes comandos sob
	a conta do <username>root</username> sen&atilde;o ocorrer&atilde;o erros de
        <errortype>permiss&atilde;o negada</errortype>.</para>
    </note>

    <para>Agora, edite o <filename>MYKERNEL</filename> com seu editor de texto favorito. Se voc&ecirc; for come&ccedil;ar a configurar, 
    provavelmente somente o 
    <application>vi</application> esteja dispon&iacute;vel, o qual &eacute; muito complexo para
      explicar aqui, mas &eacute; coberto em muitos livros indicados na <link
      linkend="bibliography">bibliografia</link>. Entretanto, o &os; oferece um editor mais f&aacute;cil chamado <application>ee</application> 
      que, se 
      voc&ecirc; for um novato, deve ser o editor de sua escolha.
      Sinta-se livre para mudar as linhas de coment&aacute;rios, principalmente para identificar sua 
configura&ccedil;&atilde;o e as 
      altera&ccedil;&otilde;es que diferenciam seu arquivo do 
      <filename>GENERIC</filename>.</para>
    <indexterm><primary>SunOS</primary></indexterm>

    <para>Se voc&ecirc; tiver que compilar um kernel sobre &sunos; ou qualquer outro
      Sistema Operacional BSD, muito destes arquivos ser&atilde;o muito familiar a voc&ecirc;.
      Se voc&ecirc; vier de outro sistema operacional tal como DOS, o  
      arquivo de configura&ccedil;&atilde;o <filename>GENERIC</filename> 
      pode impressionar voc&ecirc;, sendo assim siga as descri&ccedil;&otilde;es do
      <link linkend="kernelconfig-config">Arquivo de Configura&ccedil;&atilde;o</link>
      lentamente e com cuidado.</para>

    <note>
      <para>&Eacute; importante voc&ecirc; sempre verificar o arquivo
        <filename>/usr/src/UPDATING</filename>, antes de executar todas as etapas da atualiza&ccedil;&atilde;o,
        No caso voc&ecirc; pode <link
        linkend="cutting-edge">sincronizar sua &aacute;rvore de c&oacute;digo</link> com o
        c&oacute;digo fonte do &uacute;ltimo projeto do &os;.
        Neste arquivo todas as importantes altera&ccedil;&otilde;es para atualia&ccedil;&atilde;o do &os;
        s&atilde;o digitadas. Ajuste sempre sua vers&atilde;o do c&oacute;digo fonte do &os; de acordo com
<filename>/usr/src/UPDATING</filename>, pois estas notas 
        s&atilde;o mais precisas para novas informa&ccedil;&otilde;es que o handbook.</para>
    </note>

    <para>Voc&ecirc; deve agora compilar o c&oacute;digo fonte do kernel. Est&atilde;o aqui dois
      procedimentos que voc&ecirc; pode usar para isto, e qual voc&ecirc; usar&aacute;, vai depender de como quer recompilar seu 
      kernel, e a vers&atilde;o do &os; que voc&ecirc; est&aacute; rodando.</para>

    <itemizedlist>
      <listitem>
	<para>Se voc&ecirc; tiver instalado <emphasis>somente</emphasis> o c&oacute;digo fonte do kernel,
	  use o procedimento 1.</para>
      </listitem>

      <listitem>
	<para>Se voc&ecirc; tiver rodando um &os; vers&atilde;o anterior ao 4.0, e voc&ecirc; 
	  <emphasis>n&atilde;o</emphasis> tiver atualiza&ccedil;za&ccedil;&atilde;o para o 4.0 ou mais atual use
	  o procedimento <maketarget>make world</maketarget>, procedimento 1.
        </para>
      </listitem>

      <listitem>
	<para>Se voc&ecirc; estiver recompilando um kernel novo sem atualizar o c&oacute;digo fonte
	  (talvez para adicionar uma nova op&ccedil;&atilde;o, tal como
	  <literal>IPFIREWALL</literal>) voc&ecirc; teria que usar o outro procedimento.</para>
      </listitem>

      <listitem>
	<para>Se voc&ecirc; estiver recompilando o kernel como parte de um processo de um
          <maketarget>make world</maketarget>, use o procedimento 2.
        </para>
      </listitem>
    </itemizedlist>
    
    <procedure>
      <title>Procedimento 1. Compilando um Kernel da Maneira <quote>Tradicional</quote></title>
      
      <step>
	<para>Execute &man.config.8; para gerar o c&oacute;digo fonte do kernel.</para>
	
	<screen>&prompt.root; <userinput>/usr/sbin/config <replaceable>MYKERNEL</replaceable></userinput></screen>
      </step>

      <step>
	<para>Mude o diret&oacute;rio de configura&ccedil;&atilde;o. Isto e mostrado ap&oacute;s rodar o comando acima mencionado.</para>

	<screen>&prompt.root; <userinput>cd ../compile/<replaceable>MYKERNEL</replaceable></userinput></screen>

	<para>Para &os; anterior a 5.0, usa-se preferivelmente:</para>

	<screen>&prompt.root; <userinput>cd ../../compile/<replaceable>MYKERNEL</replaceable></userinput></screen>
      </step>

      <step>
	<para>Compilando o kernel.</para>
	
	<screen>&prompt.root; <userinput>make depend</userinput>
&prompt.root; <userinput>make</userinput></screen>
      </step>

      <step>
	<para>Instalando o novo kernel.</para>
	
	<screen>&prompt.root; <userinput>make install</userinput></screen>
      </step>
    </procedure>

    <procedure>
      <title>Procedimento 2.  Compilando um Kernel da <quote>Nova</quote> maneira</title>
      
      <step>
	<para>Mude de diret&oacute;rio para <filename>/usr/src</filename>.</para>
	
	<screen>&prompt.root; <userinput>cd /usr/src</userinput></screen>
      </step>

      <step>
	<para>Compilando o kernel.</para>
	
	<screen>&prompt.root; <userinput>make buildkernel KERNCONF=<replaceable>MYKERNEL</replaceable></userinput></screen>
      </step>

      <step>
	<para>Instalando o novo kernel.</para>

	<screen>&prompt.root; <userinput>make installkernel KERNCONF=<replaceable>MYKERNEL</replaceable></userinput></screen>
      </step>
    </procedure>
    
    <note>
      <para>No &os;&nbsp;4.2 e anteriores troque
        <literal>KERNCONF=</literal> por <literal>KERNEL=</literal>.
        Após o 4.2-STABLE esta opção já foi atualizada, e antes de Fevereiro de 2001 o sistema não reconhece <literal>KERNCONF=</literal>.</para>
    </note>

    <indexterm>
      <primary><command>cvsup</command></primary>
    </indexterm>
    <indexterm><primary>anonymous CVS</primary></indexterm>
    <indexterm><primary>CTM</primary></indexterm>
    <indexterm>
      <primary>CVS</primary>
      <secondary>anonymous</secondary>
    </indexterm>

    <para>Se voc&ecirc; <emphasis>n&atilde;o</emphasis> atualizou seu c&oacute;digo
      de alguma maneira (as formas possíveis incluem <application>CVSup</application>, 
      <application>CTM</application>, ou 
      <application>anoncvs</application>), ent&atilde;o deve-se usar os comandos
      <command>config</command>, <maketarget>make depend</maketarget>,
      <command>make</command>, <maketarget>make install</maketarget> nesta sequ&ecirc;ncia.
    </para>

    <indexterm>
      <primary><filename>kernel.old</filename></primary>
    </indexterm> 

    <para>O novo kernel ser&aacute; copiado para o diret&oacute;rio do root como
      <filename>/kernel</filename> e o velho kernel ser&aacute; movido para
      <filename>/kernel.old</filename>. Agora, desligue o sistema e
      reinicie-o, para carregar seu novo kernel. Caso algo saia errado, h&aacute; algumas instru&ccedil;&otilde;es para 
      <link linkend="kernelconfig-trouble">resolver problemas</link> no final deste cap&iacute;tulo. 
      &Eacute; interessante que voc&ecirc; leia a se&ccedil;&atilde;o de como recuperar o sistema caso seu novo kernel <link
      linkend="kernelconfig-noboot"> n&atilde;o carregue</link>.</para>

    <note>
      <para>No &os; 5.0, o kernel &eacute; instalados junto com os
	m&oacute;dulos em <filename>/boot/kernel</filename>, e os kernel
	velhos s&atilde;o colocados em <filename>/boot/kernel.old</filename>.
	Outros arquivos relacionados ao processo de carregamento, tal como o carregamento do sistema
	por meio do &man.loader.8; e suas configura&ccedil;&otilde;es s&atilde;o armazenadas tamb&eacute;m em
	<filename>/boot</filename>.  Módulos personalizados de terceiros 
	normalmente s&atilde;o colocados em <filename>/boot/modules</filename>, embora
	os usu&aacute;rios devam estar cientes que manter os m&oacute;dulos em sincroniza&ccedil;&atilde;o com o
	kernel compilado &eacute; muito importante. Se os m&oacute;dulos pretendidos n&atilde;o
	rodarem com o kernel compilado, isso pode resultar em instabilidade
	ou inconformidades no sistema.</para>
    </note>

    <note>
      <para>Se voc&ecirc; adicionar qualquer dispositivo novo (tal como Placa de Som)
	e estiver rodando &os;&nbsp;4.X ou vers&otilde;es anteriores,
	pode ser necessário adicionar algum dispositivo de controle em seu diretório
	<filename>/dev</filename> antes que eles possam ser utilizados corretamente,
	Para mais informa&ccedil;&otilde;es, dê uma olhada na se&ccedil;&atilde;o <link
	linkend="kernelconfig-nodes">Criando dispositivos de controle</link>
	posteriormente neste mesmo cap&iacute;tulo.</para>
    </note>
  </sect1>

  <sect1 id="kernelconfig-config">
    <title>O arquivo de configura&ccedil;&atilde;o</title>
    <indexterm>
      <primary>kernel</primary>
      <secondary>LINT</secondary>
    </indexterm>
    <indexterm><primary>LINT</primary></indexterm>
    <indexterm>
      <primary>kernel</primary>
      <secondary>config file</secondary>
    </indexterm>

    <para>O formato geral do arquivo de configura&ccedil;&atilde;o &eacute; bastante simples.
      Cada linha cont&eacute;m uma palavra-chave e mais algum argumento. Para
      simplificar, a maioria das linhas cont&eacute;m somente um argumento. Qualquer coisa
      que segue um <literal>#</literal> &eacute; considerado um coment&aacute;rio e &eacute;
      ignorado. As seguintes se&ccedil;&otilde;es descrevem cada palavra-chave, geralmente na
      ordem que s&atilde;o listadas no <filename>GENERIC</filename>, embora
      algumas palavras-chaves relacionadas sejam agrupadas em uma &uacute;nica se&ccedil;&atilde;o
      (tal como rede) mesmo que sejam descartados durante todo o arquivo
      <filename>GENERIC</filename>. <anchor
      id="kernelconfig-options"> Uma lista completa de op&ccedil;&otilde;es mais
      detalhadas, a explica&ccedil;&atilde;o de cada um dos dispositivos presentes no arquivo de configura&ccedil;&atilde;o
      do kernel, estão disponíveis no arquivo <filename>LINT</filename>, localizado no mesmo
      diret&oacute;rio do <filename>GENERIC</filename>. Se voc&ecirc; tiver na d&uacute;vida a
      respeito da necessidade de uma linha, verifique primeiro no
      <filename>LINT</filename>.</para>

    <note><para>No &os; 5.X e superiores o <filename>LINT</filename> não existe.
      Veja o arquivo <filename>NOTES</filename> para opções dependentes de
      arquitetura. Algumas op&ccedil;&otilde;es, principalmente
      independentes da arquitetura, s&atilde;o armazenadas no arquivo
      <filename>/usr/src/sys/conf/NOTES</filename>. &Eacute; aconselh&aacute;vel
      revisar as op&ccedil;&otilde;es dispostas neste arquivo tamb&eacute;m.</para></note>

    <indexterm>
      <primary>kernel</primary> 
	<!--  PAREI A REVISAO AQUI - eksffa -->
      <secondary>Exemplos de arquivo de configura&ccedil;&atilde;o</secondary>
    </indexterm>

    <para>A seguir um exemplo de arquivo de configura&ccedil;&atilde;o <filename>GENERIC</filename> do kernel
      com v&aacute;rios coment&aacute;rios adicionais, onde eles forem necess&aacute;rios, para
      esclarecimentos. Este exemplo deve se equivaler uma cópia que você tem disponível em
      <filename>/usr/src/sys/i386/conf/GENERIC</filename>. 
      Para obter detalhes sobre todas as op&ccedil;&otilde;es poss&iacute;veis do kernel, veja
      <filename>/usr/src/sys/i386/conf/LINT</filename>.</para>

    <programlisting>#
# GENERIC -- Generic kernel configuration file for &os;/i386
#
# For more information on this file, please read the handbook section on
# Kernel Configuration Files:
#
#    http://www.&os;.org/doc/en_US.ISO8859-1/books/handbook/kernelconfig-config.html
#
# The handbook is also available locally in /usr/share/doc/handbook
# if you've installed the doc distribution, otherwise always see the
# &os; World Wide Web server (http://www.FreeBSD.org/) for the
# latest information.
#
# An exhaustive list of options and more detailed explanations of the
# device lines is also present in the ../../conf/NOTES and NOTES files. 
# If you are in doubt as to the purpose or necessity of a line, check first 
# in NOTES.
#
# &dollar;FreeBSD: src/sys/i386/conf/GENERIC,v 1.380 2003/03/29 13:36:41 mdodd Exp $</programlisting>

    <para>Em seguida estão as palavra-chaves obrigat&oacute;riamente necessárias em 
      <emphasis>todos</emphasis> os kernels que você for compilar:</para>
    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>m&aacute;quina</secondary>
    </indexterm>

    <programlisting>m&aacute;quina		i386</programlisting>

    <para>Est&aacute; &eacute; a arquitetura da m&aacute;quina. Deve ser algum dos seguintes valores:
      <literal>i386</literal>, <literal>pc98</literal>,
      <literal>sparc64</literal>, <literal>alpha</literal>,
      <literal>ia64</literal>, <literal>amd64</literal>, or
      <literal>powerpc</literal>.</para>

    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>cpu</secondary>
    </indexterm>
    <programlisting>cpu          I486_CPU
cpu          I586_CPU
cpu          I686_CPU</programlisting>

    <para>A op&ccedil;&atilde;o acima especifica o tipo da CPU em seu sistema.
      É possível manter múltiplas entradas desta definição, em casos onde
	não souber ao certo que classes de CPU devem ser suportadas em seu kernel,
	nesse caso, as opções escolhidas são
      <literal>I586_CPU</literal> ou <literal>I686_CPU</literal>),
      entretanto, para personalizar um kernel, &eacute; melhor especificar apenas a CPU que voc&ecirc; dispõe,
	quando esta puder ser prevista.
      Se voc&ecirc; estiver inseguro quanto à classe da sua CPU, pode verificar o arquivo
      <filename>/var/run/dmesg.boot</filename> para verificar as mensagem do carregamento do sistema.</para>

    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>classe de CPU</secondary>

    </indexterm>
    <para>O suporte à <literal>I386_CPU</literal> ainda está disponível no fonte
      do &os;, mas esta opção agora é desativada por padr&atilde;o em ambos -STABLE e
      -CURRENT. Isto significa que para instalar o &os; com um processador de classe 386,
	voc&ecirc; terá que optar por uma das seguintes alternativas:</para>

    <itemizedlist>
      <listitem>
        <para>Instale uma versão mais antiga do &os; e recompile o sistema como
	 descrito na <xref linkend="kernelconfig-building">.</para>
      </listitem>

      <listitem>
        <para>Compile as aplicações em nível de usuário e o kernel em outra m&aacute;quina e instale-as
	 no 386 em questão, usando os arquivos previamente compilados, armazenados em <filename>/usr/obj</filename>
          (para mais detalhes veja a <xref linkend="small-lan">).</para>
      </listitem>

      <listitem>
        <para>Gere sua pr&oacute;pria versão do FreeBSD incluindo suporte a
          <literal>I386_CPU</literal> no kernel de instala&ccedil;&atilde;o via
          CD-ROM.</para>
      </listitem>
    </itemizedlist>

    <para>A primeira destas op&ccedil;&otilde;es &eacute; provavelmente a mais f&aacute;cil, mas voc&ecirc;
	necessitar&aacute; de muito espa&ccedil;o em disco em uma m&aacute;quina de classe 386, o que pode ser
	difícil de encontrar.</para>

    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>ident</secondary>
    </indexterm>

    <programlisting>ident          GENERIC</programlisting>

    <para>Est&aacute; &eacute; a identifica&ccedil;&atilde;o do kernel. Voc&ecirc; pode mudar
      o nome do seu kernel para qualquer um, mas como exemplo da configuração do nosso kernel
	customizado, o <literal>MYKERNEL</literal>, voc&ocirc; deve acompanhar as
      instru&ccedil;&otilde;es dos pr&oacute;ximos exemplos. O nome que voc&ecirc; colocou no
      <literal>ident</literal> ser&atilde;o mostrados quando o kernel for carregado,
	de forma que a opção é utilizada para dar um nome novo ao kernel, ou um nome diferente se voc&ecirc;
      quiser distinguir seu novo kernel do kernel atual (especialmente útil quando quiser 
      compilar um kernel experimental).</para>
    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>maxusers</secondary>
    </indexterm>

    <programlisting>maxusers          <replaceable>n</replaceable></programlisting>

    <para>A op&ccedil;&atilde;o <literal>maxusers</literal> ajusta uma série de
      tabelas importantes do sistema. Esta opção não deve ser utilizada de forma
	a se igualar ao n&uacute;mero de usu&aacute;rios simult&acirc;neos esperados em sua
      m&aacute;quina.</para>

    <para>Desde o &os;&nbsp;4.5, o sistema ajusta automaticamente esta configura&ccedil;&atilde;o, se
	seu valor for modificado para <literal>0</literal><footnote>
	<para>O algoritmo de ajuste automático do <literal>maxuser</literal> define o valor igual
	  a quantidade de mem&oacute;ria do sistema, respeitando o valor m&iacute;nimo de 32, e o
	  m&aacute;ximo de 384.</para></footnote>.
      No &os;&nbsp;5.X, <literal>maxusers</literal> é definido por padrão com o valor
      <literal>0</literal> quando for omitido. Se sua versão do &os; for anterior
      ao 4.5, ou voc&ecirc; deve definir está variável manualmente sempre, e o valor
	de <literal>maxusers</literal> deve ser no m&iacute;nimo 4, especialmente se for
      usando o Sistema de Janelas X, ou compilando programas com frequência. A raz&atilde;o &eacute; que
      a tabela mais importante ajustada por meio do <literal>maxusers</literal> &eacute; o
      n&uacute;mero m&aacute;ximo de processos, que &eacute; definido como <literal>20 + 16 *
      maxusers</literal>, de forma que, se você ajustar <literal>maxusers</literal> para o valor 1,
      poderão existir no máximo 36 processos simultâneos, incluindo ai os 18 processos
      que o sistema carrega na hora da inicializa&ccedil;&atilde;o, e os 15 que voc&ecirc; provavelmente
      ir&aacute; criar quando iniciar o sistema de interface gráfica. Mesmo tarefas simples como
      a leitura de uma p&aacute;gina de manual será iniciada levantando nove processos para
      filtro, decompactação e visualização do manual. Colocando
      <literal>maxusers</literal> em 64 permitir&aacute; que você tenha 1044
      processos simult&acirc;neos carregados, o que deve ser o suficiente para a maioria de suas
      necessidades.
      Entretanto, se você se deparar com o erro <errortype>proc table is full
      </errortype> ao tentar iniciar outro programa, ou se o sistema em questão tratar
	de um servidor com um grande número de usuários simultâneos (digamos, como o
      <hostid role="fqdn">ftp.FreeBSD.org</hostid> por exemplo), é possível aumentar
	o valor da variável <literal>maxusers</literal> e recompilar o kernel do sistema.</para>

    <note>
      <para><literal>maxusers</literal><emphasis>n&atilde;o</emphasis>
	limita o n&uacute;mero de usu&aacute;rios que podem logar em sua m&aacute;quina. Ele apenas
	define o valor de v&aacute;rias tabelas à quantias razoáveis considerando
	o n&uacute;mero m&aacute;ximo de usu&aacute;rios e processos que voc&ecirc; provavelmente ter&aacute; rodando em seu sistema.
	A opção que <emphasis>possibilita</emphasis> limitar o n&uacute;mero de logins <emphasis>remotos simult&acirc;neous e de terminais gráficos</emphasis>
	&eacute; <link linkend="kernelconfig-ptys"><literal>pseudo-device pty 16</literal></link>.</para>
    </note>
    
    <programlisting># Floating point support - n&atilde;o desabilite.
device          npx0     at nexus? port IO_NPX irq 13</programlisting>
    
    <para><literal>npx0</literal> &eacute; a opção que disponibiliza suporte lógico à ponto flutuante em unidades matem&aacute;ticas do
      &os;, que faz o papel de equipamento co-processador, ou simplesmente emulador matemático lógico. Esta definição
	<emphasis>n&atilde;o</emphasis> &eacute; opcional.</para>

    <programlisting># Pseudo devices - o n&uacute;mero indica quantas unidades serão alocadas.
pseudo-device   loop          # Network loopback</programlisting>

    <para>Trata-se do dispositivo genérico de comunicação TCP/IP interna - via <foreignphrase>loopback</foreignphrase>.
	Por exemplo, se você fizer uma conexão telnet ou FTP para <hostid>localhost</hostid> (ou seja, <hostid
      role="ipaddr">127.0.0.1</hostid>) a conexão voltará à você através deste pseudo-dispositivo. Este comportamento é
	mandatório.</para>

    <para>Todas as outras opções no decorrer do arquivo são consideravelmente optativas. Veja as notas em cada uma das
	opções abaixo, para obter mais informações.</para>

    <programlisting>#To statically compile in device wiring instead of /boot/device.hints
#hints          "GENERIC.hints"         #Default places to look for devices.</programlisting>

    <para>No &os; 5.X e vers&otilde;es posteriores, o &man.device.hints.5; &eacute;
      usado para configurar algumas op&ccedil;&otilde;es de dispositivos de controle. Por padr&atilde;o
      o &man.loader.8; verifica as opções em
      <filename>/boot/device.hints</filename>. Usando a op&ccedil;&atilde;o
      <literal>hints</literal> estas definições podem ser estaticamente compiladas
	dentro do seu kernel, de forma que a necessidade de cirar o arquivo
      <filename>device.hints</filename> dentro de
      <filename>/boot</filename> seja suprimida.</para>

    <!-- XXX: Add a comment here that explains when compiling hints into the kernel is a good idea and why. -->

    <programlisting>#makeoptions     DEBUG=-g          #Build kernel with gdb(1) debug symbols</programlisting>

    <para>O processo normal de compila&ccedil;&atilde;o do &os; n&atilde;o inclui informa&ccedil;&otilde;es sobre
      problemas com a compila&ccedil;&atilde;o do kernel, e remove a maioria
      dos s&iacute;mbolos depois que o kernel é instalado, para economizar algum espa&ccedil;o
      em disco.  Caso você esteja fazendo testes com kernel 
      na série -CURRENT, ou alterando opções de desenvolvimento de seu pr&oacute;prio kernel &os;,
      pode ser interessante descomentar esta linha.  Isto irá  habilitar o
      uso da op&ccedil;&atilde;o <option>-g</option> que habilita a adição de informações de depuração do
      programa, realizados pelo &man.config.8;, caso você esteja compilando seu kernel da maneira 
	<quote>tradicional</quote> (veja a <xref linkend="kernelconfig-building">
      para obter mais informa&ccedil;&otilde;es.).</para>

    <programlisting>options          MATH_EMULATE      #Support for x87 emulation</programlisting>

    <para>Esta linha permite que o kernel simule um co-processador matem&aacute;tico se
      seu computador n&atilde;o tiver um disponível (386 ou 486SX). Caso seu PC seja um
      486DX, ou um 386 ou 486SX (com um chip 387 ou 487 separado), ou
      superior (&pentium;, &pentium;&nbsp;II, etc.), esta opção poderá ser comentada.</para>

    <note>
      <para>As rotinas normais para emulação matem&aacute;ticas do co-processador que vem com o
	&os; <emphasis>n&atilde;o</emphasis> s&atilde;o muito precisas.  Se você não dispõe de um co-processador
	matemático mas tem necessidade de uma emulação mais precisa, substituia a opção anterior por
	<literal>GPL_MATH_EMULATE</literal>, de forma a usar o suporte à co-processamento matemático GNU que
	não é habilitado por padrão em razão de questões legais da licença <acronym>GPL</acronym>.</para>

      <para>No &os; 5.X, a emula&ccedil;&atilde;o matem&aacute;tica &eacute; desabilitada por padr&atilde;o,
      em outras CPUs que n&atilde;o tem suporte a ponto flutuante matem&aacute;tico nativo, a emulação é
	menos comum, e em muitos casos não são sequer suportados pelo kernel
      <filename>GENERIC</filename> sem que outras op&ccedil;&otilde;es adicionais sejam incluídas.</para></note>

    <programlisting>options          INET          #InterNETworking</programlisting>

    <para>Suporte a Rede.  Mantenha esta opção ainda que você não planeje
	se conectar a uma rede.  Muitos programas tem necessidade mínimas que necessitam de suporte
	à rede, como o uso da interface de <foreignphrase>loopbacl</foreignphrase> (isto é, conexões internas
	de rede), de forma que esta opção é mandatória.</para>

    <programlisting>options          INET6          #IPv6 communications protocols</programlisting>

    <para>Trata-se do protoc&oacute;lo de comunica&ccedil;&atilde;o IPv6.</para>

    <programlisting>options          FFS          #Berkeley Fast Filesystem
options          FFS_ROOT     #FFS usable as root device [keep this!]</programlisting>

    <para>Trata-se do sistema de arquivos essencial do &os;. Mantenha esta opção se você planeja controlar algum disco
	rígido.</para>

    <note><para>À partir do &os; 5.X, <literal>FFS_ROOT</literal> não é mais necessário.</para></note>

    <programlisting>options          UFS_ACL      #Support for access control lists</programlisting>

    <para>Esta op&ccedil;&atilde;o, est&aacute; presente apenas no &os;&nbsp;5.X; ela habilita o suporte do kernel
      à listas de controle de acesso.  Seu uso requer as opções de atributos extendidos
      e <acronym>UFS2</acronym>, e os detalhes s&atilde;o descritos na
      <xref linkend="fs-acl">. <acronym>ACL</acronym>s s&atilde;o habilitadas por padr&atilde;o, e n&atilde;o devem
      ser desabilitadas no kernel se tiverem sido previamente utilizadas no sistema de arquivos,
      pois remover&aacute; a lista de controle de acessos, modificando os atributos dos
      arquivos protegidos para valores imprevis&iacute;veis.</para>

    <programlisting>options          UFS_DIRHASH  #Improve performance on big directories</programlisting>

    <para>Est&aacute; op&ccedil;&atilde;o inclui recursos para aumentar a velocidade de opera&ccedil;&otilde;es de disco em diret&oacute;rios grandes,
      ao custo de usar um pouco de
      mem&oacute;ria adicional.  Normalmente é interessante usufruir desta opção em um grande
      servidor, ou em situações onde haja grande demanda de interação com esta&ccedil;&otilde;es de trabalho; remova esta opção
	quando estiver usando o &os; em um pequeno sistema onde mem&oacute;ria a &eacute; é prioritária e
      velocidade de acesso a disco &eacute; menos importante, como um firewall.</para>

    <programlisting>options          SOFTUPDATES  #Enable FFS Soft Updates support</programlisting>

    <para>Esta op&ccedil;&atilde;o habilita o método <emphasis>Soft Updates</emphasis> no kernel, isto ir&aacute;
      ajudar a aumentar a velocidade de escrita ao disco.  Mesmo sendo habilitada no kernel, estes recursos
	ainda precisam ser atribuídos à cada partição de disco.  Revise a saída do comando
	&man.mount.8; para obter detalhes sobre que sistemas de arquivos estão com
	<emphasis>Soft Updates</emphasis> habilitados.  Caso não esteja observando a opção, é necessário ativa-la
	usando o &man.tunefs.8; (para sistemas de 
      arquivos existentes) ou &man.newfs.8; (para novo sistema de arquivos).</para>

    <programlisting>options          MFS          #Memory Filesystem
options          MD_ROOT      #MD is a potential root device</programlisting>

    <para>Trata-se basicamente de um espaço em memória mapeado para armazenamento rápido de arquivos temporários, se você
	tiver uma boa quantidade de memória real e virtual, pode forçar a utilização deste recurso em outros
	pontos também.  Uma idéia interessante é montar como MFS o diretório <filename>/tmp</filename>, se houver
	necessidade de muito desempenho nesta unidade. Neste caso, adicione por exemplo a seguinte linha
	no arquivo <filename>/etc/fstab</filename>:</para>

    <informalexample>
      <programlisting>/dev/ad1s2b	/tmp mfs rw 0 0</programlisting>
    </informalexample>

    <para>Agora basta reiniciar seu sistema ou rodar o comando
      <command>mount /tmp</command>.</para>

    <note><para>No &os; 5.X, a opção &man.md.4; é usada com grande vantagem sobre MFS.  Mais informações sobre
	a configuração de sistemas de arquivo em memória, podem ser obtidas nos manuais
	&man.mdconfig.8; e &man.mdmfs.8;, e também na <xref linkend="disks-virtual">. Consequentemente, 
	a opção <literal>MFS</literal> n&atilde;o &eacute; mais suportada na série 5.X.</para></note>

    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>NFS</secondary>
    </indexterm>
    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>NFS_ROOT</secondary>
    </indexterm>
    <programlisting>options          NFS          #Network Filesystem
options          NFS_ROOT     #NFS usable as root device, NFS required</programlisting>

    <para>Trata-se do sistema de arquivos de rede.  A menos que voc&ecirc; n&atilde;o planeje montar parti&ccedil;&otilde;es
      &unix; sob rede TCP/IP, comente esta linha.</para>

    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>MSDOSFS</secondary>
    </indexterm>
    <programlisting>options          MSDOSFS      #MSDOS Filesystem</programlisting>

    <para>Trata-se do sistema de arquivos &ms-dos;.  Se você não pretende montar partições formatadas em DOS, pode
	seguramente retirar esta opção.  Se você tiver necessidade de montar sistemas DOS posteriormente, o módulo
	será automaticamente carregado.  O ótimo conjunto de programas <application>mtools</application> (disponível na Coleção de Ports)
	permite que voc&ecirc; acesse disquetes DOS sem ter que mount&aacute;-los e desmont&aacute;-los (e n&atilde;o
	requer <literal>MSDOSFS</literal>).</para>

    <programlisting>options          CD9660       #ISO 9660 Filesystem
options          CD9660_ROOT  #CD-ROM usable as root, CD9660 required</programlisting>

    <para>O sistema de arquivos ISO 9660 &eacute; utilizado em CDROMs.  Pode ser interessante comentar
	esta opção se você não tem um dispositivo óptico de leitura de CDROM, ou se tem a necessidade
	ocasional de montar CDs de dados (uma vez que o módulo correspondendo pode ser carregado dinamicamente
	quando for necessário montar um CD de dados).  CDs de áudio não necessitam deste suporte.</para>

    <programlisting>options          PROCFS       #Process filesystem</programlisting>

    <para>Trata-se do sistema de arquivo de processos.  Este sistema de arquivo tem a função de criar
	e montar o ambiente <filename>/proc</filename> que permite o uso de 
      programas como &man.ps.1; para voc&ecirc; ter mais informa&ccedil;&otilde;es sobre quais
      processos est&aacute; rodando.  No &os; 5.X, o uso do <literal>PROCFS</literal>
      n&atilde;o &eacute; mais necessário por vários motivos, visto que a maioria
      das ferramentas de monitoramento tem que ser adaptadas para rodar sobre
      <literal>PROCFS</literal>. Em adi&ccedil;&atilde;o, o kernel 5.X-CURRENT
      que usa <literal>PROCFS</literal> deve agora tamb&eacute;m incluir
      suporte para <literal>PSEUDOFS</literal>:</para>

    <programlisting>options          PSEUDOFS     #Pseudo-filesystem framework</programlisting>

    <para><literal>PSEUDOFS</literal> n&atilde;o est&aacute; dispon&iacute;vel sob &os; 4.X.
      Ao contr&aacute;rio do &os; 4.X, as novas instala&ccedil;&otilde;es do &os; 5.X n&atilde;o montam, por padrão,
	o sistema de arquivos de processos.</para>

    <programlisting>options          COMPAT_43    #Compatible with BSD 4.3 [KEEP THIS!]</programlisting>

    <para>Compatibilidade com BSD 4.3. Deixe isto descomentado, alguns programas agir&atilde;o
      estranhamente se voc&ecirc; comentar isto.</para>

    <programlisting>options          COMPAT_FREEBSD4     #Compatible with &os;4</programlisting>

    <para>Esta op&ccedil;&atilde;o &eacute; necessária no &os;&nbsp;5.X &i386; e Sistemas Alpha
      para suporte à aplicativos compilados em outras vers&otilde;es do &os;,
      que usa outro sistema de interfaces de chamadas. Recomenda-se que esta op&ccedil;&atilde;o
      seja usada sobre todos &i386; e sistemas Alpha que podem
      rodar outros aplicativos; plataformas que ganham suporte somente em
      5.X, tal como ia64 e &sparc64;, n&atilde;o tem esta necessidade.</para>

    <programlisting>options          SCSI_DELAY=15000    #Delay (in ms) before probing SCSI</programlisting>

    <para>Isso faz com que o kernel pare por 15 segundos antes de procurar pelos
      dispositivos SCSI em seu sistema.  Se você dispor apenas de discos IDE,
      pode ignorar esta opção;  em discos SCSI, pode ser interessante baixar
	à até 5 segundos, para acelerar a inicializa&ccedil;&atilde;o. Naturalmente, se
      depois disso o &os; tiver problemas para reconhecer algum dispositivo SCSI, suba este valor
	novamente.</para>

    <programlisting>options          UCONSOLE            #Allow users to grab the console</programlisting>

    <para>Permite que a console usada por aplicações gráficas sejam acessadas por outros usuários.  Por exemplo,
	se você criar um terminal <application>xterm</application> com <command>xterm
      -C</command>, tudo que estiver sendo feito pelo &man.write.1;,
      &man.talk.1;, e todas as outras mensagens que voc&ecirc; receber, assim como
      algumas mensagens de console emitidas pelo kernel, serão capturadas.</para>

    <note><para>No &os; 5.X, <literal>UCONSOLE</literal> n&atilde;o &eacute;
      mais necessária.</para></note>

    <programlisting>options          USERCONFIG          #boot -c editor</programlisting>

    <para>Esta op&ccedil;&atilde;o permite carregar e editar as configura&ccedil;&otilde;es do menu de inicializa&ccedil;&atilde;o.</para>

    <programlisting>options          VISUAL_USERCONFIG   #visual boot -c editor</programlisting>

    <para>Esta op&ccedil;&atilde;o permite carregar e editar as configura&ccedil;&otilde;es do menu de inicializa&ccedil;&atilde;o em modo 
	gr&aacute;fico. 
    </para>

      <note><para>À partir do&os; 5.0, a op&ccedil;&atilde;o <literal>USERCONFIG</literal> foi
	substituída pelo novo m&eacute;todo &man.device.hints.5;.
	Para maiores informa&ccedil;&otilde;es sobre &man.device.hints.5; por gentileza,
	visite a <xref linkend="device-hints">.</para></note>

    <programlisting>options          KTRACE              #ktrace(1) support</programlisting>

    <para>Esta opção permite rastrear os processos do kernel, que são usados em rotinas de verificação
	e tratamento de erros.</para>

    <programlisting>options          SYSVSHM             #SYSV-style shared memory</programlisting>

    <para>Est&aacute; op&ccedil;&atilde;o fornece compartilhamento de mem&oacute;ria no estilo <emphasis>System V</emphasis>. O uso
      mais comum deste, são as extensões XSHM do X, com muitos
	programas de gr&aacute;ficos-intensivos que obterão automaticamente vantagens e acr&eacute;scimo de velocidade.
      Se voc&ecirc; usa X, mantenha esta opção ativa.</para>

    <programlisting>options          SYSVSEM             #SYSV-style semaphores</programlisting>

    <para>Suporte à semáforos padrão <emphasis>System V</emphasis>. Geralmente são pouco usados, e adicionam algumas
	centenas de bytes no tamanho total do kernel.</para>

    <programlisting>options          SYSVMSG             #SYSV-style message queues</programlisting>

    <para>Suporte mensagens interprocessos em padrão <emphasis>System V</emphasis>.  Mais uma vez, também requer poucas
	centenas de bytes no kernel.</para>

    <note>
      <para>O comando &man.ipcs.1; listar&aacute; algum processo que estiver fazendo uso de alguma funcionalidade
	padrão System V.</para>
    </note>

    <programlisting>options 	P1003_1B		#Posix P1003_1B real-time extensions
options 	_KPOSIX_PRIORITY_SCHEDULING</programlisting>

    <para>Extens&otilde;es em tempo real adicionadas em 1993 ao padrão &posix;. Determinadas
      aplica&ccedil;&otilde;es da cole&ccedil;&atilde;o do ports usam estes recursos
      (tal como <application>&staroffice;</application>).</para>

    <note><para>No &os; 5.X, todas estas funcionalidades agora s&atilde;o
      fornecidos pela op&ccedil;&atilde;o <literal>_KPOSIX_PRIORITY_SCHEDULING</literal>,
      e <literal>P1003_1B</literal> n&atilde;o &eacute; mais necessária.</para></note>

    <indexterm>
      <primary>Op&ccedil;&atilde;o do kernel</primary>
      <secondary>ICMP_BANDLIM</secondary>
    </indexterm>
    <indexterm>
      <primary>Negação de Servi&ccedil;o (DoS)</primary>
    </indexterm>
    <programlisting>options		ICMP_BANDLIM		#Rate limit bad replies</programlisting>

    <para>Est&aacute; op&ccedil;&atilde;o permite limitar a quantidade de resposta de erros de ICMP.  Normalmente
	esta opção auxilia a proteção do sistema contra ataques do tipo degação de serviço por pacotes ICMP.  É
	recomendado manter esta opção.</para>

    <note><para>No &os; 5.X, esta caracter&iacute;stica &eacute; habilitada por padr&atilde;o e
      a op&ccedil;&atilde;o <literal>ICMP_BANDLIM</literal> n&atilde;o &eacute; mais necessária.
      </para></note>

    <indexterm>
      <primary>Op&ccedil;&otilde;es do kernel</primary>
      <secondary>SMP</secondary>
    </indexterm>
    <programlisting># To make an SMP kernel, the next two are needed
#options        SMP                     # Symmetric MultiProcessor Kernel
#options        APIC_IO                 # Symmetric (APIC) I/O</programlisting>

    <para>Ambas opções acima são necessárias para suporte à multiprocessamento simétrico (<acronym>SMP</acronym>).</para>

    <programlisting>device          isa</programlisting>

    <para>Todos os PCs com &os; suportam esta opção.  Caso seu computador seja um
      IBM PS/2 (Arquitetura Micro Canal), o &os; fornece um suporte um pouco limitado.
	Para maiores informa&ccedil;&otilde;es sobre este, veja a opcão MCA, em
      <filename>/usr/src/sys/i386/conf/LINT</filename>.</para>

    <programlisting>device          eisa</programlisting>

    <para>Inclua esta opção caso sua placa-mãe seja EISA.  Esta opção habilita a auto-detecção e suporte 
	a configura&ccedil;&atilde;o de todos os dispositivos sobre o barramento EISA.</para>

    <programlisting>device          pci</programlisting>

    <para>Inclua este opção se sua placa-mãe suporta PCI.  Esta opção habilita a auto-detecção e suporte
	a configura&ccedil;&atilde;o demplacas PCI e os que estiverem em transição do barramento ISA para PCI.</para>

    <programlisting>device          agp</programlisting>

    <para>Inclua esta opção se você dispor de uma placa de AGP em seu sistema.  Esta opção habilita suporte à
	AGP e AGP GART em placas com estes recursos.</para>

    <programlisting># Floppy drives
device          fdc0        at isa? port IO_FD1 irq 6 drq 2
device          fd0         at fdc0 drive 0
device          fd1         at fdc0 drive 1</programlisting>

    <para>Trata-se do controlador de disco flex&iacute;vel. <literal>fd0</literal> &eacute;
      o drive flex&iacute;vel <devicename>A:</devicename>, e
      <literal>fd1</literal> &eacute; o drive <devicename>B:</devicename>.</para>

    <programlisting>device          ata</programlisting>

    <para>Este driver suporta todos dispositivos ATA e de ATAPI. Voc&ecirc; necessitar&aacute; somente
      uma linha com a entrada <literal>device ata</literal> para que o kernel detecte todos os dispositivos 
      PCI ATA/ATAPI em uma m&aacute;quina moderna.</para>

    <programlisting>device          atadisk                 # ATA disk drives</programlisting>

    <para>Esta opção é necessário em conjunto com a <literal>device ata</literal> para dispositivos de 
	controle de discos ATA.</para>

    <programlisting><anchor id="kernelconfig-atapi">
device          atapicd                 # ATAPI CDROM drives</programlisting>

    <para>Esta opção é necessário em conjunto com a <literal>device ata</literal> para dispositivos de
	de controle de drives de CD ATAPI.</para>

    <programlisting>device          atapifd                 # ATAPI floppy drives</programlisting>

    <para>Esta opção é necessário em conjunto com a <literal>device ata</literal> para controle dispositivos
	de unidades de disquetes ATAPI.</para>

    <programlisting>device          atapist                 # ATAPI tape drives</programlisting>

    <para>Esta opção é necessário em conjunto com a <literal>device ata</literal> para dispositivos de
	de controle de dispositivos de fitas ATAPI.</para>

    <programlisting>options         ATA_STATIC_ID           #Static device numbering</programlisting>

    <para>Esta opção faz o controle est&aacute;tico de n&uacute;mero identificador ATA, no padrão antigo, ou
      os n&uacute;meros de dispositivos que s&atilde;o alocados dinâmicamente.</para>

    <programlisting># ATA and ATAPI devices
device          ata0        at isa? port IO_WD1 irq 14
device          ata1        at isa? port IO_WD2 irq 15</programlisting>

    <para>É usado em sistemas mais antigos, que não suportam padrão PCI.</para>

    <programlisting># SCSI Controllers
device          ahb        # EISA AHA1742 family
device          ahc        # AHA2940 and onboard AIC7xxx devices
device          amd        # AMD 53C974 (Teckram DC-390(T))
device          dpt        # DPT Smartcache - See LINT for options!
device          isp        # Qlogic family
device          ncr        # NCR/Symbios Logic
device          sym        # NCR/Symbios Logic (newer chipsets)

device          adv0       at isa?
device          adw
device          bt0        at isa?
device          aha0       at isa?
device          aic0       at isa?</programlisting>

    <para>Controladoras SCSI. Caso alguma destas controladoras não estejam disponíveis em seu sistema,
	comente a linha em questão.  Caso você tenha apenas discos IDE, todas opções aqui podem ser
	completamente removidas.</para>

    <programlisting># SCSI peripherals
device          scbus      # SCSI bus (required)
device          da         # Direct Access (disks)
device          sa         # Sequential Access (tape etc)
device          cd         # CD
device          pass       # Passthrough device (direct SCSI
access)</programlisting>

    <para>Perif&eacute;ricos SCSI. Mais uma vez, se algum destes periféricos não estiverem disponíveis
	em seu sistema,  comente a linha em questão.  Caso você tenha apenas discos IDE, todas opções aqui podem ser
	completamente removidas.</para>

    <programlisting># RAID controllers
device          ida        # Compaq Smart RAID
device          amr        # AMI MegaRAID
device          mlx        # Mylex DAC960 family</programlisting>

    <para>Suporte à controladoras RAID.  Você pode manter apenas suporte aos equipamentos
	que você tem disponível, removendo o suporte às controladoras RAID não
	disponíveis.</para>

    <programlisting># atkbdc0 controls both the keyboard and the PS/2 mouse
device          atkbdc0    at isa? port IO_KBD</programlisting>

    <para>O controlador de teclado (<literal>atkbdc</literal>) fornece recursos de controle
	à operações de E/S para o teclado AT e teclados e dispositivos de apontamento PS/2
	(como <foreignphrase>mouse</foreignphrase> e canetas).  Este dispositivo é
	necessário ao suporte de teclado
      (<literal>atkbd</literal>) bem como ao dispositivo de controle PS/2
      (<literal>psm</literal>).</para>

    <programlisting>device          atkbd0     at atkbdc? irq 1</programlisting>

    <para>O dispositivo de controle <literal>atkbd</literal>, em comjunto com o
      <literal>atkbdc</literal>, prov&eacute;m accesso ao teclado AT 84
      ou à teclados AT, modelos aprimorados e convencionais.</para>

    <programlisting>device          psm0       at atkbdc? irq 12</programlisting>

    <para>Use este dispositivo caso seu mouse seja do tipo que requer conectores PS/2.</para>

    <programlisting>device          vga0        at isa?</programlisting>

    <para>Dispositivo de controle de vídeo.</para>

    <programlisting># splash screen/screen saver
pseudo-device          splash</programlisting>

    <para>Possibilita que seja adicionada uma tela de sobreposição (bitmap) na inicialização do sistema.
	Protetores de tela também exijem suporte a este dispositivo.</para>

    <programlisting># syscons is the default console driver, resembling an SCO console
device          sc0          at isa?</programlisting>

    <para><literal>sc0</literal> é o dispositivo padrão de controle do console do sistema,
	e se assenelha ao console de sistema SCO.  A maioria dos terminais requerem este suporte
	mesmo terminais que fazem uso do mapeamento <filename>termcap</filename>, mas não deve
	ser relevante quando o dispositivo <literal>vt0</literal> for utilizado, uma vez que
	este é compatível com o console <literal>VT220</literal>.  Neste caso, ao se logar,
	basta definir a variável de ambiente <envar>TERM</envar> como <literal>scoansi</literal>
	especialmente alguma aplicação que ocupe a tela inteira apresentar inconformidades
	no console.</para>

    <programlisting># Enable this and PCVT_FREEBSD for pcvt vt220 compatible console driver
#device          vt0     at isa?
#options         XSERVER          # support for X server on a vt console
#options         FAT_CURSOR       # start with block cursor
# If you have a ThinkPAD, uncomment this along with the rest of the PCVT lines
#options         PCVT_SCANSET=2   # IBM keyboards are non-std</programlisting>

    <para>Trata-se de um dispositivo de controle VT220 compat&iacute;vel com o console, padrões
      VT100/102.  Esta opção é aconselhada para computadores móveis que tenham problemas de
	compatibilidade com <literal>sc0</literal>.  Ajuste tamb&eacute;m o valor da vari&aacute;vel
	<envar>TERM</envar> para <literal>vt100</literal> ou
      <literal>vt220</literal> logar-se no terminal.  Este dispositivo pode ser usado
      para interconectar um grande n&uacute;mero de diferentes m&aacute;quinas em um ambiente
      de rede, onde <filename>termcap</filename> ou
      <filename>terminfo</filename> contenham entradas para o dispositivo
	<literal>sc0</literal> &mdash; <literal>vt100</literal>
      deve estar virtualmente dispon&iacute;vel em todas estações.</para>

    <programlisting># Power management support (see LINT for more options)
device          apm0     at nexus? disable flags 0x20  # Advanced Power Management</programlisting>

    <para>Suporte à Gerenciamento Avançado de Energia. Usado especialmente em laptops.</para>

    <programlisting># PCCARD (PCMCIA) support
device          card
device          pcic0    at isa? irq 10 port 0x3e0 iomem 0xd0000
device          pcic1    at isa? irq 11 port 0x3e2 iomem 0xd4000 disable</programlisting>

    <para>Suporte PCMCIA.  Especialmente útil em laptop.</para>

    <programlisting># Serial (COM) ports
device          sio0     at isa? port IO_COM1 flags 0x10 irq 4
device          sio1     at isa? port IO_COM2 irq 3
device          sio2     at isa? disable port IO_COM3 irq 5
device          sio3     at isa? disable port IO_COM4 irq 9</programlisting>

    <para>Essas 4 portas seriais s&atilde;o referentes a COM1 at&eacute; COM4
      como s&atilde;o no mundo &ms-dos/&windows;.</para>

    <note>
      <para>Se voc&ecirc; tiver um modem interno na COM4 e uma porta serial na
	COM2, voc&ecirc; ter&aacute; que mudar a IRQ do modem para 2 (pelas
	raz&otilde;es t&eacute;cnicas IRQ2 = IRQ 9) em ordem para acessar isto
	do &os;. Se voc&ecirc; tiver um cart&atilde;o multiport serial, verifique a
	p&aacute;gina do manual &man.sio.4; para maiores informa&ccedil;&otilde;es nos valores apropriados
	para esta linha. Alguns cart&otilde;es de video (notavelmente aqueles baseados no chip
	S3) usam endere&ccedil;o IO em forma de
	<literal>0x*2e8</literal>, e desde que muitos cart&otilde;es seriais baratos n&atilde;o fa&ccedil;am
	completamente decodifica&ccedil;&atilde;o de espa&ccedil;os no endere&ccedil;o 16-bit IO, eles confrontam com
	estes cart&otilde;es macados para porta COM4 praticamente n&atilde;o dispon&iacute;vel.</para>

      <para>Cada porta serial &eacute; preciso ter uma IRQ exclusiva (ao menos que voc&ecirc;
        esteja usando um cart&atilde;o multiport onde as interrup&ccedil;&otilde;es compartilhadas s&atilde;o
	suportadas), sendo assim o padr&atilde;o IRQs para COM3 e COM4 n&atilde;o podem ser
	usadas.</para>
    </note>

    <programlisting># Parallel port
device          ppc0    at isa? irq 7</programlisting>

    <para>Esta &eacute; a porta paralela para interface ISA-bus.</para>

    <programlisting>device          ppbus      # Parallel port bus (required)</programlisting>

    <para>Fornece suporte para a porta paralela bus.</para>

    <programlisting>device          lpt        # Printer</programlisting>

    <para>Suporte para porta paralela de impressoras.</para>

    <note>
      <para>Todos os tr&ecirc;s acima s&atilde;o requeridas para habilitar suporte a impressoras paralela.</para>
    </note>

    <programlisting>device          plip       # TCP/IP over parallel</programlisting>

    <para>Este &eacute; o driver para a interface de rede paralela.</para>

    <programlisting>device          ppi        # Parallel port interface device</programlisting>

    <para>O prop&oacute;sito geral de I/O (<quote>geek port</quote>) + IEEE1284
      I/O.</para>

    <programlisting>#device         vpo        # Requires scbus and da</programlisting>

    <indexterm><primary>zip drive</primary></indexterm>
    <para>Isto &eacute; para Iomega Zip drive. Isto requere suporte a
      <literal>scbus</literal> e <literal>da</literal>. Melhor
      performance &eacute; conseguidos com portas em modo EPP 1.9.</para>

    <programlisting># PCI Ethernet NICs.
device          de         # DEC/Intel DC21x4x (<quote>Tulip</quote>)
device          fxp        # Intel EtherExpress PRO/100B (82557, 82558)
device          tx         # SMC 9432TX (83c170 <quote>EPIC</quote>)
device          vx         # 3Com 3c590, 3c595 (<quote>Vortex</quote>)
device          wx         # Intel Gigabit Ethernet Card (<quote>Wiseman</quote>)</programlisting>

    <para>Varios cart&otilde;es de drivers PCI de rede. Pode comentar ou remover alguma das
      n&atilde;o presentes em seu sistema.</para>

    <programlisting># PCI Ethernet NICs that use the common MII bus controller code.
device          miibus     # MII bus support</programlisting>

    <para>O suporte a MII bus &eacute; requerido para algumas Placas de Rede PCI 10/100 NICs,
      ou seja aqueles que usam transceivers MII-compliant ou implementam
      controle de interface transceiver o operam como um MII. Adicionando
      <literal>dispositivo miibus</literal> para a configura&ccedil;&atilde;o do kernel puxam 
      suporte para um gen&eacute;rico miibus API e todos drivers de PHY,
      incluindo um gen&eacute;rico para PHYs que n&atilde;o s&atilde;o especificados na negocia&ccedil;&atilde;o
      por um driver individual.</para>

    <programlisting>device          dc         # DEC/Intel 21143 and various workalikes
device          rl         # RealTek 8129/8139
device          sf         # Adaptec AIC-6915 (<quote>Starfire</quote>)
device          sis        # Silicon Integrated Systems SiS 900/SiS 7016
device          ste        # Sundance ST201 (D-Link DFE-550TX)
device          tl         # Texas Instruments ThunderLAN
device          vr         # VIA Rhine, Rhine II
device          wb         # Winbond W89C840F
device          xl         # 3Com 3c90x (<quote>Boomerang</quote>, <quote>Cyclone</quote>)</programlisting>

    <para>Drivers que usam o c&oacute;digo do controlador MII bus.</para>

    <programlisting># ISA Ethernet NICs.
device          ed0    at isa? port 0x280 irq 10 iomem 0xd8000
device          ex
device          ep
# WaveLAN/IEEE 802.11 wireless NICs. Note: the WaveLAN/IEEE really
# exists only as a PCMCIA device, so there is no ISA attachment needed
# and resources will always be dynamically assigned by the pccard code.
device          wi
# Aironet 4500/4800 802.11 wireless NICs. Note: the declaration below will
# work for PCMCIA and PCI cards, as well as ISA cards set to ISA PnP
# mode (the factory default). If you set the switches on your ISA
# card for a manually chosen I/O address and IRQ, you must specify
# those parameters here.
device          an
# The probe order of these is presently determined by i386/isa/isa_compat.c.
device          ie0    at isa? port 0x300 irq 10 iomem 0xd0000
device          fe0    at isa? port 0x300
device          le0    at isa? port 0x300 irq 5 iomem 0xd0000
device          lnc0   at isa? port 0x280 irq 10 drq 0
device          cs0    at isa? port 0x300
device          sn0    at isa? port 0x300 irq 10
# requires PCCARD (PCMCIA) support to be activated
#device         xe0    at isa?</programlisting>

    <para>ISA Ethernet drivers. Veja
      <filename>/usr/src/sys/i386/conf/LINT</filename> os cart&otilde;es suportados 
      por este driver.</para>

    <programlisting>pseudo-device   ether         # Ethernet support</programlisting>

    <para><literal>ether</literal> &eacute; somente necess&aacute;rio se voc&ecirc; tem um cart&atilde;o Ethernet.
      Isto inclui o c&oacute;digo gen&eacute;rico do protoc&oacute;lo Ethernet.</para>

    <programlisting>pseudo-device   sl      1     # Kernel SLIP</programlisting>

    <para><literal>sl</literal> &eacute; para suporte SLIP. Isto foi quase inteiramente
      suplando por PPP, que &eacute; mais f&aacute;cil para se ajustar, melhor adpata&ccedil;&atilde;o
      para conex&atilde;o modem-a-modem, e mais poderoso. O
      <replaceable>n&uacute;mero</replaceable> depois <literal>sl</literal>
      espec&iacute;fica quantas sess&otilde;es simult&acirc;neas SLIP s&atilde;o suportadas.</para>

    <programlisting>pseudo-device   ppp     1     # Kernel PPP</programlisting>

    <para>Isto &eacute; para suporte do  kernel a PPP para conex&otilde;es dial-up. H&aacute;
      tamb&eacute;m uma outra vers&atilde;o do PPP implementada executada como uma aplica&ccedil;&atilde;o que
      usa <literal>tun</literal> e oferece mais flexibilidade e caracter&iacute;sticas
      tais como exige discagem. O <replaceable>n&uacute;mero</replaceable> de conex&otilde;es depois do
      <literal>ppp</literal> especifica a quantidade de conex&otilde;es simult&acirc;neas PPP
      suporta.</para>

    <programlisting>pseudo-device   tun           # Packet tunnel.</programlisting>

    <para>Isto &eacute; usado pelo software de PPP. Um
      <replaceable>n&uacute;mero</replaceable> depois <literal>tun</literal>
      especificado &eacute; o n&uacute;mero de sess&otilde;es simultaneas PPP suportadas. Veja
      a se&ccedil;&atilde;o <link linkend="userppp">PPP</link> deste livro para maiores
      informa&ccedil;&otilde;es.</para>

    <programlisting><anchor id="kernelconfig-ptys">
pseudo-device   pty           # Pseudo-ttys (telnet etc)</programlisting>

    <para>Isto &eacute; um <quote>pseudo-terminal</quote> que simula porta de login.
      Isto &eacute; usado para entrada <command>telnet</command> e se&ccedil;&otilde;es
      <command>rlogin</command>,
      <application>xterm</application>, e algumas outras aplica&ccedil;&otilde;es como
      <application>Emacs</application>. Um
      <replaceable>n&uacute;mero</replaceable> depois <literal>pty</literal> indica o n&uacute;mero de
      <literal>pty</literal>s para ser criado. Se voc&ecirc; necessita mais que o
      padr&atilde;o de 16 simult&acirc;neas <application>xterm</application> windows
      ou remote logins, &eacute; certo aumentar este n&uacute;mero,
      para o m&aacute;ximo de 256.</para>

    <programlisting>pseudo-device   md            # Memory <quote>disks</quote></programlisting>

    <para>Disco de mem&oacute;ria pseudo-devices.</para>

    <programlisting>pseudo-device   gif</programlisting>

    <para>ou</para>

    <programlisting>pseudo-device   gif     4     # IPv6 and IPv4 tunneling</programlisting>

    <para>Isto implementa IPv6 sobre IPv4 tunneling,
      IPv4 sobre IPv4 tunneling, e IPv6 sobre IPv6 tunneling. Come&ccedil;ando com
      &os;&nbsp;4.4 o <literal>gif</literal> dispositivo &eacute;
      <quote>auto-cloning</quote>, e voc&ecirc; deve usar o primeiro exemplo
      (sem o n&uacute;mero depois do <literal>gif</literal>). Vers&otilde;es mais avan&ccedil;adas do
      &os; requerem o n&uacute;mero.</para>

    <programlisting>pseudo-device   faith   1     # IPv6-to-IPv4 relaying (translation)</programlisting>

    <para>Esta pseudo-device captura os pacotes que s&atilde;o emitidos e
      desv&iacute;a-os ao daemon da tradu&ccedil;&atilde;o IPv4/IPv6.</para>

    <programlisting># O `bpf' pseudo-device permite o filtro de pacotes Berkeley.
# Esteja ciente das consequencias administrativas ao habilitar isto!
pseudo-device   bpf           # Berkeley packet filter</programlisting>

    <para>Este &eacute; o filtro de pacotes Berkeley. Esta pseudo-device permite
      que as interfaces da rede sejam colocadas em modo promiscuous, capturando cada
      pacote sobre um broadcast da rede (por exemplo uma Ethernet). Estes pacotes
      podem ser capturados para disco e ou examinados com o programa &man.tcpdump.1;.</para>

    <note>
      <para>O <literal>bpf pseudo-device</literal> &eacute; usado tamb&eacute;m por
	&man.dhclient.8; para obter o endere&ccedil;o IP de roteador padr&atilde;o
	(gateway) e assim por diante. Se voc&ecirc; usa DHCP, deixe isto
	descomentado.</para>
    </note>

    <programlisting># Suporte USB
#device         uhci          # UHCI PCI-&gt;USB interface
#device         ohci          # OHCI PCI-&gt;USB interface
#device         usb           # USB Bus (required)
#device         ugen          # Generic
#device         uhid          # <quote>Human Interface Devices</quote>
#device         ukbd          # Keyboard
#device         ulpt          # Printer
#device         umass         # Disks/Mass storage - Requires scbus and da
#device         ums           # Mouse
# USB Ethernet, requires mii
#device         aue           # ADMtek USB ethernet
#device         cue           # CATC USB ethernet
#device         kue           # Kawasaki LSI USB ethernet</programlisting>

    <para>Suporte para v&aacute;rios dispositivos USB.</para>

    <para>Para maiores e adicionais informa&ccedil;&otilde;es sobre dispositivos suportados pelo 
      &os;, veja
      <filename>/usr/src/sys/i386/conf/LINT</filename>.</para>

      <sect2>
        <title>Grandes Configura&ccedil;&otilde;es de Mem&oacute;ria (<acronym>PAE</acronym>)</title>
	<indexterm>
	  <primary>
	    Extens&otilde;es F&iacute;sicas do endere&ccedil;o (<acronym>PAE</acronym>)
	  </primary>
	  <secondary>
	    Grandes Configura&ccedil;&otilde;es de Mem&oacute;ria
	  </secondary>
	</indexterm>

	<para>As m&aacute;quinas com grandes configura&ccedil;&otilde;es de mem&oacute;ria requerem acesso a
	  mais que o limite de 4 gigabyte no User+Kernel Virtual do espa&ccedil;o de endere&ccedil;o
	  (<acronym>KVA</acronym>). Devido a esta
	  limita&ccedil;&atilde;o, a Intel adicionou suporte para 36-bit de acesso a espa&ccedil;o de endere&ccedil;o f&iacute;sico
	  no &pentium; Na linha Pro e anteriores de CPUs.</para>
	
	<para>A extens&atilde;o de endere&ccedil;o f&iacute;sico (<acronym>PAE</acronym>)
	  capacita o &intel; &pentium; Pro e CPUs anteriores
	  permitindo a configura&ccedil;&atilde;o de mem&oacute;ria para levantar at&eacute; 64 gigabytes.
	  &os; fornecendo suporte para esta capacidade via op&ccedil;&atilde;o 
	  <option>PAE</option> na configura&ccedil;&atilde;o do kernel, dispon&iacute;vel
	  no 4.X da s&eacute;rie &os; come&ccedil;ando com 4.9-RELEASE e
	  no 5.X da s&eacute;rie &os; come&ccedil;ando com 5.1-RELEASE. Devido 
	  a limita&ccedil;&otilde;es da arquitetura de mem&oacute;ria da Intel, nenhuma distin&ccedil;&atilde;o
	  e feita para mem&oacute;rias acima ou abaixo de 4 gigabytes. A mem&oacute;ria alocada
	  acima de 4 gigabytes &eacute; adicionada simplesmente ao pool da mem&oacute;ria
	  dispon&iacute;vel.</para>

	<para>Para habilitar suporte ao <acronym>PAE</acronym>no kernel,
	  adicione simplesmente a seguinte linha no arquivo de configua&ccedil;&atilde;o do seu kernel:
	  </para>
	
	<programlisting>options		    PAE</programlisting>

	<note>
	  <para>O suporte ao <acronym>PAE</acronym> no &os; est&aacute; somente
	    dispon&iacute;vel para processadores &intel; IA-32. Deve-se tamb&eacute;m 
	    notar, que o suporte ao <acronym>PAE</acronym> no &os; n&atilde;o
	    foi totalmente testado, e s&atilde;o considerados de qualidade beta 
	    se comparedos com outras caracter&iacute;sticas stable do &os;.</para>
	</note>

	<para>Suporte <acronym>PAE</acronym> no &os; tem algumas limita&ccedil;&otilde;es:</para>
	
	<itemizedlist>
	  <listitem>
	    <para>Um processo n&atilde;o pode alcan&ccedil;ar mais de 4
	      gigabytes do espa&ccedil;o da VM.</para>
	  </listitem>

	  <listitem>
	    <para>O m&oacute;dulo <acronym>KLD</acronym> n&atilde;o pode ser carregado dentro
	      de um kernel com o <acronym>PAE</acronym> habilitado, devido a 
	      diferen&ccedil;as na estrutura da configura&ccedil;&atilde;o do m&oacute;dulo do kernel.
	      </para>
	  </listitem>

	  <listitem>
	    <para>Drivers do dispositivos que n&atilde;o usam o &man.bus.dma.9;
	      a interface causar&aacute; corrump&ccedil;&atilde;o de dados em um kernel com
	      <acronym>PAE</acronym> habilitado e n&atilde;o s&atilde;o
	      recomendados para uso. Por esta raz&atilde;o, o arquivos de configura&ccedil;&atilde;o do
	      <filename>PAE</filename> no kernel
	      &eacute; fornecido no &os; 5.X, que
	      exclui todos os drivers desconhecidos para trabalhar com o <acronym>PAE</acronym> habilitado no
	      kernel.</para>
	  </listitem>

	  <listitem>
	    <para>Alguns sistemas tunables determinam o uso do recurso da mem&oacute;ria
	      pela quantidade de mem&oacute;ria f&iacute;sica dispon&iacute;vel. Alguns
	      tunables podem desnecessariamente sobre-alocar devido a
	      natureza da grande mam&oacute;ria de um sistema <acronym>PAE</acronym>.
	      Um exemplo &eacute; o <option>kern.maxvnodes</option>
	      sysctl, que controla o n&uacute;mero m&aacute;ximo de vnodes permitidos
	      no kernel. Recomenda-se para ajustar este e outros
	      tais tunables a um valor raso&aacute;vel.</para>
	  </listitem>

	  <listitem>
	    <para>Pode ser necess&aacute;rio aumentar o espa&ccedil;o do endere&ccedil;o 
	      (<acronym>KVA</acronym>) virtual do kernel ou diminuir a
	      quantidade de recursos especificados do kernel que &eacute; pesadamente usado
	      (veja acima) a fim de evitar a exaust&atilde;o do <acronym>KVA</acronym>.
	      A op&ccedil;&atilde;o do kernel <option>KVA_PAGES</option>
	      pode ser usado para aumentar o espa&ccedil;o do
	      <acronym>KVA</acronym>.</para>
	  </listitem>
	</itemizedlist>

	<para>Para preocupa&ccedil;&atilde;o com performance e estabilidade, recomenda-se 
	  consultar o &man.tuning.7; p&aacute;gina do manual. A &man.pae.4;
	  p&aacute;gina do manual cont&eacute;m informa&ccedil;&atilde;o moderna do &os;'s
	  para suporte <acronym>PAE</acronym>.</para>
    </sect2>
  </sect1>

  <sect1 id="kernelconfig-nodes">
    <title>Fazendo Liga&ccedil;&atilde;o dos Dispositivos</title>

    <indexterm><primary>dispositivos ligados</primary></indexterm>
    <indexterm>
      <primary><command>MAKEDEV</command></primary>
    </indexterm>

    <note><para>Se voc&ecirc; estiver rodando &os;&nbsp;5.0 ou posteriores
      voc&ecirc; poder&aacute; com seguran&ccedil;a pular est&aacute; se&ccedil;&atilde;o. Estas vers&otilde;es usam
      &man.devfs.5; para alocar liga&ccedil;&atilde;o entre dispositivos transparentes para o usu&aacute;rio.</para></note>

    <para>Quase todos dispositivo no kernel tem uma  
      <quote>liga&ccedil;&atilde;o</quote> correspondente no diret&oacute;rio <filename>/dev</filename>.
      Voc&ecirc; visualiza esta liga&ccedil;&atilde;o como arquivos regulares, mas s&atilde;o realmente entradas especiais
      no kernel que os programas usam para acessar os dispositivos.
      O shell script <filename>/dev/MAKEDEV</filename>, que &eacute;
      executado quando voc&ecirc; instala primeiramente o sistema operacional, cria
      quase todas os dispositivos de liga&ccedil;&atilde;o suportados. Entretanto, isto n&atilde;o
      cria <emphasis>todos</emphasis>, assim quando voc&ecirc; adiciona suporte para
      um novo dispositivo, isto faz apropriadamente a entrada
      neste diret&oacute;rio e adiciona este. Est&aacute; aqui um exemplo simples:</para>

    <para>Supondo que voc&ecirc; adicione suporte de um IDE CD-ROM ao kernel. A linha
      a adicionar &eacute;:</para>

    <programlisting>device acd0</programlisting>

    <para>Isto significa que voc&ecirc; deve procurar alguma entrada que comece com
      <filename>acd0</filename> no diret&oacute;rio <filename>/dev</filename>,
      possivelmente seguidas por uma letra, tal como
      <literal>c</literal>, ou precedido por uma letra
      <literal>r</literal>, que significa um dispositivo <quote>raw</quote>. Estes
      turns daqueles arquivos que n&atilde;o est&atilde;o l&aacute;, assim voc&ecirc; deve mudar para o diret&oacute;rio e o tipo para
      <filename>/dev</filename>:</para>

    <indexterm>
      <primary><command>MAKEDEV</command></primary></indexterm>
    <screen>&prompt.root; <userinput>sh MAKEDEV acd0</userinput></screen>

    <para>Quando este script terminar, voc&ecirc; encontrar&aacute; agora uma entrada
      <filename>acd0c</filename> e <filename>racd0c</filename>
      em <filename>/dev</filename> assim que voc&ecirc; executar
      corretamente.</para>

    <para>Para Placas de Som, o seguinte comando cria as entradas apropriadas:</para>

    <screen>&prompt.root; <userinput>sh MAKEDEV snd0</userinput></screen>

    <note>
      <para>Ao criar liga&ccedil;&atilde;o para dispositivos tais como Placas de Som, se
	outra pessoa tiver acesso a sua m&aacute;quina, pode ser necess&aacute;rio 
	proteger os dispositivos contra acesso externo adicionando os arquivos no
	<filename>/etc/fbtab</filename>. Veja &man.fbtab.5; para maiores
	informa&ccedil;&otilde;es.</para>
    </note>

    <para>Siga este simples procedimentos para outros dispositivos
      n&atilde;o <filename>GEN&Eacute;RICOS</filename> que n&atilde;o tiverem
      entradas.</para>

    <note>
      <para>Todas as controladoras SCSI usam a mesma entrada no
	<filename>/dev</filename>, assim voc&ecirc; n&atilde;o necessita criar
	este. Tamb&eacute;m, as placas de rede e SLIP/PPP pseudo-devices n&atilde;o
	tem entradas em <filename>/dev</filename> em tudo, assim voc&ecirc; n&atilde;o
	tem que preocupar-se sobre estes tamb&eacute;m.</para>
    </note>
  </sect1>

  <sect1 id="kernelconfig-trouble">
    <title>Se algo der errado</title>

    <para>H&aacute; 5 categorias de problema que podem ocorrer ao construir um kernel personalizado.
      S&atilde;o:</para>

    <variablelist>
      <varlistentry>
	<term>Falhas na <command>configura&ccedil;&atilde;o</command>:</term>

	<listitem>
	  <para>Se o comando &man.config.8; falhar, e
	    der esta descri&ccedil;&atilde;o do seu kernel, voc&ecirc; provavelmente fez algum
	    erro simples em algum lugar. Felizmente,
	    &man.config.8; imprimir&aacute; o n&uacute;mero da linha que est&aacute; com
	    problema, assim voc&ecirc; pode tranquilamente pular para isto com o
	    <application>vi</application>. Por exemplo, se voc&ecirc; ver:</para>

	  <screen>config: line 17: syntax error</screen>

	  <para>Voc&ecirc; pode chegar ao problema pelo <application>vi</application> 
	    procurando <command>17G</command> no mode de comando. Certifique-se que o
	    teclado est&aacute; corretamente configurado, comparando o kernel
	    <filename>GEN&Eacute;RICO</filename> com uma outra
	    refer&ecirc;ncia.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>Falha no <command>make</command>:</term>

	<listitem>
	  <para>Se o comando <command>make</command> falhar, isso normalmente
	    significa que tem erros em suas descri&ccedil;&otilde;es do kernel, mas n&atilde;o bastante
	    grave para &man.config.8; trav&aacute;-lo. Novamente, olhe
	    sobre sua configura&ccedil;&atilde;o, e se voc&ecirc; ainda n&atilde;o pode resolver o problema,
	    envie um e-mail para &a.questions; com sua configura&ccedil;&atilde;o do kernel,
	    e isto deve ser diagnosticado mais rapidamente.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>Falha na instala&ccedil;&atilde;o do kernel:</term>
	
	<listitem>
	  <para>Se o kernel estiver perfeitamente compilado, e n&atilde;o foi instalado
	    (ou o comando <command>make install</command> ou
	    <command>make installkernel</command> falhar,
	    a primeira coisa a se fazer &eacute; checar se seu sistema est&aacute; rodando em
	    securelevel 1 ou mais elevado (veja &man.init.8;). A instala&ccedil;&atilde;o do kernel
	    tenta remover a &aacute;rea de mem&oacute;ria que cont&eacute;m informa&ccedil;&atilde;o do
	    seu kernel e coloca a &aacute;rea de mem&oacute;ria num novo um.
	    Desde que o securelevel 1 ou mais elevado impede a desconfigura&ccedil;&atilde;o da &aacute;rea de mem&oacute;ria
	    para alguns arquivos no sistema, a instala&ccedil;&atilde;o do kernel necessita
	    se executado no securelevel 0 ou seja baixo.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>O kernel n&atilde;o carrega:<anchor
	  id="kernelconfig-noboot"></term>

	<listitem>
	  <para>Se seu kernel novo n&atilde;o carregar, ou falhar para
	    reconhecer seus dispositivos, n&atilde;o se apavore! Felizmente, o &os; tem
	    um excelente mecanismo para recuperar kernels incompat&iacute;veis.
	    Escolha o kernel que voc&ecirc; deseja carregar no
	    &os; e carregue ele. Voc&ecirc; pode acessar este quando o sistema
	    de contagem regressiva estiver abaixo de 10. Tecle qualquer letra exceto a
            tecla <keycap>Enter</keycap>, use o comando tipo <command>unload</command>
            e entao o tipo
	    <command>boot <replaceable>kernel.old</replaceable></command>,
            ou o nome do arquivo de algum outro kernel correto que voc&ecirc; queira carregar.
            Ao reconfigurar um kernel, &eacute; sempre uma boa id&eacute;ia manter
            um kernel confi&aacute;vel, na m&atilde;o para trabalhar.</para>

	  <para>Depois de carregar um kernel confi&aacute;vel voc&ecirc; pode verificar o arquivo de configura&ccedil;&atilde;o do seu kernel e tentar 
	    recompil&aacute;-lo novamente.
	    Um recurso de ajuda &uacute;til &eacute; o arquivo
	    <filename>/var/log/messages</filename> 
	    que grava, entre outras coisas, todas as mensagens do kernel
	    que s&atilde;o com sucesso carregados. Tamb&eacute;m, o comando &man.dmesg.8;
	    imprimir&aacute; as mensagens do kernel que estiverem carregadas atualmente.</para>

	  <note>
	    <para>Se voc&ecirc; estiver tendo problemas para compilar um kernel, certifique
	      e guarde um <filename>GENERIC</filename>, ou algum outro kernel
	      que funcione na m&atilde;o para trabalhar com um nome diferente que 
	      n&atilde;o apagar&aacute; na pr&oacute;xima compila&ccedil;&atilde;o. Voc&ecirc; n&atilde;o pode confiar em
	      <filename>kernel.old</filename> porque ao instalar um
	      novo kernel, o <filename>kernel.old</filename> &eacute; sobscrevido
	      com o &uacute;ltimo kernel instalado que pode n&atilde;o ser funcional.
	      Tamb&eacute;m, o mais cedo poss&iacute;vel, realize a movimenta&ccedil;&atilde;o do kernel para a
	      localiza&ccedil;&atilde;o apropriada <filename>kernel</filename> com comandos tal
	      como &man.ps.1; n&atilde;o trabalhara corretamente. O comando apropriado 
	      <quote>destrava</quote> o arquivo do kernel que
	      <command>faz</command> a insta&ccedil;&atilde;o (a fim de mov&ecirc;-los permanentemente para
	      uma outra parte traseira do kernel).</para>

	    <screen>&prompt.root; <userinput>chflags noschg /kernel</userinput></screen>

	    <para>Se voc&ecirc; encontrar isto, voc&ecirc; estar&aacute; rodando provavelmente
	      em &man.securelevel.8; mais exatamente em zero. Edite o
	      <literal>kern_securelevel</literal> em
	      <filename>/etc/rc.conf</filename> e ajuste isto para
	      <literal>-1</literal>, ent&atilde;o reinicie. Voc&ecirc; pode mudar esta
	      configura&ccedil;&atilde;o antes de voc&ecirc; instalar o seu novo
	      kernel.</para>

	    <para>E, se voc&ecirc; quiser <quote>travar</quote> seu novo kernel
	      dentro de um local, ou algum arquivo para importa&ccedil;&atilde;o, de algum modo que n&atilde;o
	      possa ser movido ou alterado:</para>

	    <screen>&prompt.root; <userinput>chflags schg /kernel</userinput></screen>

	    <para>No &os; 5.X, os kernels n&atilde;o s&atilde;o instalados com o
	    sistema one a &aacute;rea de mem&oacute;ria n&atilde;o pode ser mudado, assim como esta &eacute; improvavel que seja a fonte 
	    do problema que voc&ecirc; est&aacute; tentando.</para></note>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>O trabalho do kernel, mas &man.ps.1;: n&atilde;o trabalha mais algum</term>

	<listitem>
	  <para>Se voc&ecirc; tiver instado uma vers&atilde;o diferente do kernel
	    de um sistema que estiver utilizando uma vers&atilde;o do kernel diferente da que tinha sido construida,
	    por exemplo, um kernel 4.X em um sistema 3.X, muitos comandos de status do sistema
	    como &man.ps.1; e &man.vmstat.8; n&atilde;o funcionaram
	    mais. Voce deve recompilar a biblioteca <filename>libkvm</filename>
	    que pode ser &uacute;til. Isto &eacute; uma raz&atilde;o que normalmente
	    n&atilde;o &eacute; uma boa id&eacute;ia usar uma vers&atilde;o diferente do
	    kernel do resto do sistema operacional.</para>
	</listitem>
      </varlistentry>
    </variablelist>
  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->

