<!--
     The FreeBSD Documentation Project

     $FreeBSD: doc/en_US.ISO8859-1/books/handbook/ports/chapter.sgml,v 1.207 2003/09/09 12:21:13 simon Exp $
-->

<chapter id="ports">
  <title>Instalando aplicativos: Pacotes e Ports</title>

  <sect1 id="ports-synopsis">
    <title>Sin&oacute;pse</title>

    <indexterm><primary>ports</primary></indexterm>
    <indexterm><primary>packages</primary></indexterm>
    <para>
      O FreeBSD tem como parte de seu pacote b&aacute;sico uma vasta
      cole&ccedil;ao de ferramentas de sistemas. No entanto, &eacute;
      poss&iacute;vel fazer muita coisa antes de ter que instalar
      aplicativos adicionais de terceiros para trabalhar de verdade. O
      FreeBSD disponibiliza duas tecnologias complementares para a
      instala&ccedil;&atilde;o de aplicativos em seu sistema: A
      cole&ccedil;&atilde;o de ports do FreeBSD, e pacotes
      bin&aacute;rios de software. Qualquer um dos dois sistemas pode
      ser utilizado para instalar as ver&otilde;es mais recentes das
      suas aplica&ccedil;&otilde;es preferidas apartir de uma media
      local ou ent&atilde;o direto da rede.</para>
      
    <para>Ap&oacute;s ler este capitulo voc&ecirc; ir&aacute;
      conhecer:</para>

    <itemizedlist>
      <listitem>
	<para>Como instalar aplicativos a partir de pacotes
	  bin&aacute;rios do software.</para>
      </listitem>
      <listitem>
	<para>Como compilar aplicativos a partir da
	  cole&ccedil;&atilde;o do Ports.</para>
      </listitem>
      <listitem>
	<para>Como remover aplicativos instalados pr&eacute;viamente
	  atrav&eacute;s de <literal>packages</literal> ou
	  <literal>ports</literal>.</para>
      </listitem>
      <listitem>
	<para>Como sobrescrever os valores padr&otilde;es utilizados
	  pela cole&ccedil;&atilde;o de ports.</para>
      </listitem>
      <listitem>
	<para>Como atualizar sua cole&ccedil;&atilde;o de
	  ports.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="ports-overview">
    <title>Vis&atilde;o geral do processo de instala&ccedil;&atilde;o
      de software</title>

    <para>Se voc&ecirc; j&aacute; utilizou um sistema &unix;
      anteriormente, voc&ecirc; deve saber que o procedimento tipico
      para instalar um aplicativo &eacute; parecido com isto:</para>

    <procedure>
      <step>
	<para>Fa&ccedil;a o download do software, o qual pode ser
	  distribuido como c&oacute;digo fonte ou no formato
	  bin&aacute;rio.</para>
      </step>

      <step>
	<para>Descompacte o arquivo de distribui&ccedil;&atilde;o do software 
	  (tipicamente um tarball comprimido com &man.compress.1;, 
	&man.gzip.1;, ou &man.bzip2.1;). </para>
      </step>

      <step>
	<para>Localize a documenta&ccedil;&atilde;o (normalmente
	  &eacute; um arquivo chamado <filename>INSTALL</filename> ou
	  <filename>README</filename>, ou ent&atilde;o um conjunto de
	  arquivos no subdiret&oacute;rio <filename>doc/ </filename>)
	  e descubra como instalar o software.</para>
      </step>

      <step>
	<para>Se o software for distribuido como c&oacute;digo fonte,
	  compile-o. Isto pode envolver a edi&ccedil;&atilde;o de um
	  arquivo <filename>Makefile </filename>, ou a
	  execu&ccedil;&atilde;o de um script chamado
	  <command>configure </command>, al&eacute;m de outras
	  tarefas.</para>
      </step>

      <step>
	<para>Teste e instale o software.</para>
      </step>
    </procedure>

    <para>E &eacute; s&oacute; isso se tudo correu como esperado.
      Agora se voc&ecirc; est&aacute; instalando um aplicativo que
      n&atilde;o foi deliberamente portado para o FreeBSD, voc&ecirc;
      pode ter que fazer ajustes no c&oacute;digo fonte do mesmo para
      que ele compile corretamente.</para>

    <para>Se voc&ecirc; desejar, voc&ecirc; pode continuar instalando
      aplicativos no FreeBSD pelo m&eacute;todo
      <quote>tradicional</quote>. Contudo, o FreeBSD disponibiliza
      duas tecnologias que podem lhe economizar muito esfor&ccedil;o:
      <literal>packages</literal> e <literal>ports</literal>. No
      momento, mais de &os.numports; aplicativos j&aacute; foram
      disponibilizados desta forma.</para>
    
    <para>Independente de qual seja o aplicativo, o pacote FreeBSD do mesmo 
    consiste-se em um unico arquivo para download.  O pacote cont&eacute;m
    c&oacute;pias pr&eacute;-compiladas de todos os comandos do aplicativo, bem como
    c&oacute;pias dos arquivos de configura&ccedil;&atilde;o e/ou da documenta&ccedil;&atilde;o.  O
    gerenciamento de um pacote FreeBSD &eacute; realizado por uma s&eacute;rie de
      comandos especificos, tais como &man.pkg.add.1;,
    &man.pkg.delete.1;, &man.pkg.info.1; entre outros.  A instala&ccedil;&atilde;o
    de um novo aplicativo pode ser realizada atrav&eacute;s da execu&ccedil;&atilde;o de um
    unico comando.</para>

    <para>Um port FreeBSD para um aplicativo consiste-se em uma
      cole&ccedil;&atilde;o de arquivos destinados a automatizar o
      processo de compila&ccedil;&atilde;o da aplica&ccedil;&atilde;o
      apartir do seu c&oacute;digo fonte.</para> 
    
    <para>Lembre-se que existem diversos passos que voc&ecirc; teria
      que executar para compilar o programa manualmente (download,
      descompactar, aplicar patch, compilar e instalar). Os arquivos
      de um port cont&eacute;m todas as informa&ccedil;&otilde;es
      necess&aacute;rias para possibilitar que o sistema automatize o
      processo para voc&ecirc;. Voc&ecirc; executa um conjunto de
      comandos simples e o c&oacute;digo fonte do aplicativo &eacute;
      automaticamente baixado, descompactado, patcheado, compilado e
      instalado para voc&ecirc;.</para> 
    
    <para>De fato, o systema de ports pode ser utilizado para pacotes
      bin&aacute;rios do aplicativo, o qual pode ser manipulado mais
      tarde atrav&eacute;s do comando <command>pkg_add</command>, ou
      por qualquer outro comando de gerenciamento de pacotes, os quais
      iremos introduzir em instantes.</para>
    
    <para>Ambos os sistemas de instala&ccedil;&atilde;o cuidam da
      instala&ccedil;&atilde;o das
      <emphasis>depend&ecirc;ncias</emphasis> do aplicativo. Suponha
      que voc&ecirc; deseja instalar uma aplica&ccedil;&atilde;o que
      depende de uma biblioteca especifica para funcionar. Tanto o
      aplicativo quanto a biblioteca s&atilde;o disponibilizadas no
      FreeBSD como pacote e como ports. Se voce utilizar o comando
      <command>pkg_add</command> ou o sistema de ports para adicionar
      o aplicativo, ambos ir&atilde;o informar que a biblioteca
      necess&aacute;ria para o funcionamento do aplicativo n&atilde;o
      est&aacute; instalada corretamente e ir&atilde;o instalar
      automaticamente a biblioteca antes de instalar o
      aplicativo.</para>
    
    <para>dado que ambas as tecnologias s&atilde;o muito similares,
      voc&ecirc; deve querer saber o porque o FreeBSD se preocupa com
      as duas. Os sistemas de pacotes e ports possuem suas
      pr&oacute;prias virtudes, e qual voc&ecirc; ir&aacute; utilizar
      depender&aacute; da sua preferencia pessoal.</para>
    
    <itemizedlist>
      <title>Beneficios do sistema de Pacotes</title>
      
      <listitem>
	<para>Um pacote tarball comprimido dos bin&aacute;rios do
	  aplicativo &eacute; normalmente menor que um tarball
	  compactado contendo o c&oacute;digo fonte do mesmo
	  aplicativo</para>
      </listitem>

      <listitem>
	<para>Um pacote n&atilde;o requer nenhuma
	  compila&ccedil;&atilde;o adicional. Para os grandes
	  aplicativos como por exemplo
	  <application>Mozilla</application>,
	  <application>KDE</application>, or
	  <application>GNOME</application> isto pode ser importante,
	  particularmente se voc&ecirc; est&aacute; utilizando um
	  sistema lento.</para>
      </listitem>

      <listitem>
	<para>A instala&ccedil;&atilde;o de um pacote n&atilde;o
	  requer nenhum conhecimento do processo envolvido na
	  compila&ccedil;&atilde;o do software para o FreeBSD.</para>
      </listitem>
    </itemizedlist>

    <itemizedlist>
      <title>Beneficios do Sistema de ports</title>
      
      <listitem>
	<para>
	  Um pacote &eacute; compilado normalmente com
	  op&ccedil;&otilde;es conservadoras, pois ele tem que
	  executar no maior numero de sistemas possivel. Ao instalar
	  apartir do ports, voc&ecirc; pode ajustar as
	  op&ccedil;&otilde;es de compila&ccedil;&atilde;o para (por
	  exemplo) gerar um bin&aacute;rio especifico para
	  processadores Pentiun IV ou para processadores
	  Athlon.</para>
      </listitem>

      <listitem>
	<para>
	  Alguns aplicativos possuem op&ccedil;&otilde;es que
	  s&atilde;o especificadas no ato da compila&ccedil;&atilde;o
	  que est&atilde;o relacionadas ao que eles podem ou
	  n&atilde;o fazer. Por exemplo, o
	  <application>Apache</application> pode ser configurado no
	  momento de sua compila&ccedil;&atilde;o com uma grande
	  variedade de op&ccedil;&otilde;es. Ao compilar apartir do
	  port voce n&atilde;o &eacute; obrigado a aceitar as
	  op&ccedil;&otilde;es default, e pode defini-las de acordo
	  com suas necessidades.</para>
	  
	<para>
	  Em alguns casos, ir&atilde;o existir multiplos pacotes de um
	  mesmo aplicativo para especificar certas
	  op&ccedil;&otilde;es. Por exemplo, o aplicativo
	  <application>Ghostscript</application> esta
	  dispon&iacute;vel em dois pacotes,
	  <filename>ghostscript</filename> e
	  <filename>ghostscript-nox11</filename>, voc&ecirc;
	  ir&aacute; optar por um ou por outro dependendo se possui ou
	  n&atilde;o um servidor X11 instalado. Esse tipo de ajuste
	  fino &eacute; poss&iacute;vel de ser realizado com pacotes,
	  mas se torna invi&aacute;vel se o aplicativo possuir mais de
	  uma ou duas op&ccedil;&otilde;es em tempo de
	  compila&ccedil;&atilde;o diferentes.</para>
      </listitem>

      <listitem>
	<para>As condi&ccedil;&otilde;es de licenciamento de alguns
	  softwares proibem a distribui&ccedil;&atilde;o de pacotes
	  bin&aacute;rios. Eles tem que ser distribuidos como
	  c&oacute;digo fonte.</para>
      </listitem>

      <listitem>
	<para>
	  Algumas pessoas n&atilde;o confiam em
	  distribui&ccedil;&otilde;es bin&aacute;rias. tendo acesso ao
	  c&oacute;digo fonte, voc&ecirc; pode (em teoria)
	  inspecion&aacute;-lo e procurar por problemas potenciais
	  voc&ecirc; mesmo.</para>
      </listitem>

      <listitem>
	<para>Se voc&ecirc; possui patches customizados, voc&ecirc;
	  vai precisar do c&oacute;digo fonte para poder
	  aplic&aacute;-los.</para>
      </listitem>

      <listitem>
	<para>Muitos usuarios gostam de ter o c&oacute;digo a sua
	  disposi&ccedil;&atilde;o, para estud&aacute;-los,
	  modific&aacute;-los, copi&aacute;-los (respeitando a
	  licenca, &eacute; claro) e assim por diante.</para>
      </listitem>
    </itemizedlist>

    <para>Para manter-se atualizado sobre a cole&ccedil;&atilde;o de
      ports, inscreva-se nais listas &a.ports; e
      &a.ports-bugs;.</para>

    <para>
      O restante deste capitulo ir&aacute; explicar como utilizar o
      sistema de packages e o de ports para instalar e gerenciar
      aplicativos de terceiros no FreeBSD.</para>
  </sect1>

  <sect1 id="ports-finding-applications">
    <title>Encontrando seu aplicativo</title>

    <para>
      Antes que voc&ecirc; possa instalar todas as
      aplica&ccedil;&otilde;es de que necessita, voc&ecirc; precisa
      saber do que precisa, e tamb&eacute;m como a
      aplica&ccedil;&atilde;o se chama.</para>

    <para>
      A lista de aplicativos disponiveis para FreeBSD cresce o tempo
      todo. Felizmente, existem diversas formas de procurar o que
      voc&ecirc; necessita:</para>

    <itemizedlist>
      <listitem>
	<para>
	  O web site do projeto FreeBSD mant&eacute;m uma lista
	  atualizada de todos os aplicativos disponiveis e na qual
	  voc&ecirc; pode executar buscas, em <ulink
	    url="../../../../ports/index.html">
	    http://www.FreeBSD.org/ports/</ulink>. O ports est&aacute;
	  dividido em categorias, e voc&ecirc; pode efetuar buscas
	  pelo nome do aplicativo (se voc&ecirc; souber qual
	  &eacute;), ou ent&atilde;o olhar todos os aplicativos
	  disponiveis em uma categoria.</para>	
      </listitem>

      <indexterm><primary>FreshPorts</primary></indexterm>

      <listitem>
	<para>Dan Langille mant&eacute;m o web site FreshPorts, em
	  <ulink url="http://www.FreshPorts.org/"></ulink>.
	  FreshPorts rastreia as altera&ccedil;&otilde;es nas
	  aplica&ccedil;&otilde;es na &aacute;rvore do ports a medida
	  que elas acontecem, permitindo que voc&ecirc; monitore um ou
	  mais ports, enviando um email para voc&ecirc; quando eles
	  forem atualizados.</para>
      </listitem>

      <indexterm><primary>FreshMeat</primary></indexterm>

      <listitem>
	<para>Se voc&ecirc; n&atilde;o sabe o nome da
	  aplica&ccedil;&atilde;o que deseja, consulte um site no
	  estilo do FreshMeat (<ulink
	    url="http://www.freshmeat.net/"></ulink>) para procurar um
	  aplicativo que lhe atenda, quando encontrar volte ao site do
	  FreeBSD e verifique se o aplicativo j&aacute; foi
	  portado.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="packages-using">
    <sect1info>    
      <authorgroup>
        <author>
          <firstname>Chern</firstname>
	  <surname>Lee</surname>
	  <contrib>Contributed by </contrib>
        </author>
      </authorgroup>
    <!-- 30 Mar 2001 -->
    </sect1info>

    <title>Usando o sistema de pacotes</title>

    <sect2>
      <title>Instalando um pacote</title>
      <indexterm>
        <primary>packages</primary>
        <secondary>installing</secondary>
      </indexterm>
    
      <indexterm>
        <primary><command>pkg_add</command></primary>
      </indexterm>
      <para>
	Voc&ecirc; pode utilizar o utilit&aacute;rio &man.pkg.add.1; para instalar
	um pacote de software no FreeBSD apartir de um arquivo local
	ou apartir de um servidor na rede.
      </para>

      <example>
        <title>Fazendo o download manual de um pacote e instalando-o localmente</title>

        <screen>&prompt.root; <userinput>ftp -a <replaceable>ftp2.FreeBSD.org</replaceable></userinput>
Connected to ftp2.FreeBSD.org.
220 ftp2.FreeBSD.org FTP server (Version 6.00LS) ready.
331 Guest login ok, send your email address as password.
230-
230-     This machine is in Vienna, VA, USA, hosted by Verio.
230-         Questions? E-mail freebsd@vienna.verio.net.
230-
230-
230 Guest login ok, access restrictions apply.
Remote system type is UNIX.
Using binary mode to transfer files.
<prompt>ftp></prompt> <userinput>cd /pub/FreeBSD/ports/packages/sysutils/</userinput>
250 CWD command successful.
<prompt>ftp></prompt> <userinput>get lsof-4.56.4.tgz</userinput>
local: lsof-4.56.4.tgz remote: lsof-4.56.4.tgz
200 PORT command successful.
150 Opening BINARY mode data connection for 'lsof-4.56.4.tgz' (92375 bytes).
100% |**************************************************| 92375       00:00 ETA
226 Transfer complete.
92375 bytes received in 5.60 seconds (16.11 KB/s)
<prompt>ftp></prompt> <userinput>exit</userinput>
&prompt.root; <userinput>pkg_add <replaceable>lsof-4.56.4.tgz</replaceable></userinput></screen>
      </example>

      <para>
	Se voc&ecirc; n&atilde;o possui uma fonte local de pacotes (como por
	exemplo um Set de CD-ROMs do FreeBSD) ser&aacute; mais facil utilizar
	a op&ccedil;&atilde;p <option>-r</option> com o &man.pkg.add.1;. Esta op&ccedil;&atilde;o
	far&aacute; com que o utilit&aacute;rio determine automaticamente o formato
	correto do objeto, a vers&atilde;o apropriada, bem como dir&aacute; ao
	utilit&aacute;rio para fazer o download e a instala&ccedil;&atilde;o do aplicativo 
	a partir de um servidor FTP.</para>
	
      <indexterm>
        <primary><command>pkg_add</command></primary></indexterm>
      <screen>&prompt.root; <userinput>pkg_add -r <replaceable>lsof</replaceable></userinput></screen>

      <para>
	O exemplo acima ir&aacute; fazer o download do pacote correto e
	instal&aacute;-lo sem nenhuma outra interven&ccedil;&atilde;o do usu&aacute;rio. O
	&man.pkg.add.1; utiliza o &man.fetch.3; para fazer download
	dos arquivos, o qual considera vari&aacute;veis de ambiente incluindo
	<envar>FTP_PASSIVE_MODE</envar>, <envar>FTP_PROXY</envar>, e 
	<envar>FTP_PASSWORD</envar>. Voc&ecirc; pode ter que ajustar uma ou
	mais delas caso esteja atr&aacute;s de um firewall, ou ent&atilde;o ter&aacute; que
	utilizar um proxy FTP/HTTP. Consulte &man.fetch.3; para
	visualizar a lista completa. Observe que no exemplo acima
	<literal>lsof</literal> &eacute; utilizado no lugar de
	<literal>lsof-4.56.4</literal>. Quando o recurso de busca
	remota &eacute; utilizada, o numero de vers&atilde;o do pacote deve ser
	removida. O &man.pkg.add.1; ir&aacute; buscar automaticamente a
	ultima vers&atilde;o do aplicativo.</para>

      <para>
	Os pacotes s&atilde;o distribuidos no formato
	<filename>.tgz</filename> e <filename>.tbz</filename>,
	voc&ecirc; pode encontra-los em <ulink
	  url="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/packages/"></ulink>, 
	ou nos CDs de instala&ccedil;&atilde;o do FreeBSD. Todos os
	CDs do set de 4 CDs de instala&ccedil;&atilde;o do FreeBSD (e
	do PowerPack, etc) cont&eacute;m pacotes no diret&oacute;rio
	<filename>/packages</filename>. O layout do diret&oacute;rio
	packages &eacute; similar ao encontrado na &aacute;rvore
	<filename>/usr/ports</filename>. Cada categoria possui seu
	pr&oacute;prio diret&oacute;rio, e cada pacote pode ser
	encontrado no diret&oacute;rio <filename>All</filename>.
      </para>

      <para>A estrutura do diret&oacute;rio do sistema de pacotes
	&eacute; identica ao layout do ports; eles trabalham em
	conjunto para formar o sistema de pacotes/ports.
      </para>

    </sect2>

    <sect2>
      <title>Gerenciando Pacotes</title>

      <indexterm>
        <primary>packages</primary>
        <secondary>managing</secondary>
      </indexterm>
      <para>O &man.pkg.info.1; &eacute; um utilit&aacute;rio que lista e descreve os
      varios pacotes instalados.</para>

      <indexterm>
        <primary><command>pkg_info</command></primary>
      </indexterm>
      <screen>&prompt.root; <userinput>pkg_info</userinput>
cvsup-16.1          A general network file distribution system optimized for CV
docbook-1.2         Meta-port for the different versions of the DocBook DTD
...</screen>
      <para>O &man.pkg.version.1; &eacute; um utilit&aacute;rio que sumariza a
      vers&atilde;o de todos os pacotes instalados. Ele compara a vers&atilde;o do
      pacote instalado com a vers&atilde;o atual encontrada na &aacute;rvore do
      ports.</para> 
      <indexterm>
        <primary><command>pkg_version</command></primary>
      </indexterm>
        <screen>&prompt.root; <userinput>pkg_version</userinput>
cvsup                       =
docbook                     =
...</screen>

      <para>Os simbolos na segunda coluna indicam a idade relativa da
	vers&atilde;o instadada e da vers&atilde;o disponivel na
	&aacute;rvore local do ports.</para>

      <informaltable frame="none">
        <tgroup cols="2">
	  <thead>
            <row>
              <entry>Symbol</entry>
              <entry>Meaning</entry>
            </row>
          </thead>

 	  <tbody>
  	    <row>
	    <entry>=</entry> <entry>A vers&atilde;o instalada do pacote &eacute;
	    identica a vers&atilde;o dispon&iacute;vel na &aacute;rvore local do ports.
	    </entry>
  	    </row>
 
        <row><entry>&lt;</entry>
	<entry>A vers&atilde;o instalada do pacote &eacute; mais antiga que a vers&atilde;o
	disponivel na &aacute;rvore local do ports.
	</entry>
	</row>

        <row><entry>&gt;</entry><entry>A vers&atilde;o instalada do pacote &eacute;
	mais rescente que a vers&atilde;o disponivel na &aacute;rvore local do
	ports. (Provavelmente sua &aacute;rvore do ports est&aacute; desatualizada)
        </entry></row>

        <row><entry>?</entry><entry>
	  O pacote instalado n&atilde;o foi localizado no indice do ports.
	  (Isto pode ocorrer, por exemplo, se um aplicativo instalado
	  for removido da aravore do ports ou ent&atilde;o renomeado).
	  </entry></row>

        <row><entry>*</entry><entry>Existem multiplas vers&otilde;es do pacote.</entry></row>

	</tbody>
	</tgroup>
    </informaltable>
    </sect2>

    <sect2>
      <title>Deletando um pacote</title>
      <indexterm>
        <primary><command>pkg_delete</command></primary>
      </indexterm>
      <indexterm>
        <primary>packages</primary>
        <secondary>deleting</secondary>
      </indexterm>
      <para>
	Para remover um pacote pr&eacute;viamente instalado, utilize o
	utilit&aacute;rio &man.pkg.delete.1;.
      </para>

      <screen>&prompt.root; <userinput>pkg_delete <replaceable>xchat-1.7.1</replaceable></userinput></screen>
    </sect2>

    <sect2>
      <title>Miscelanea</title>
      <para>Todas as informa&ccedil;&otilde;es dos pacotes &eacute;
	armazenada no diret&oacute;rio
	<filename>/var/db/pkg</filename>. A lista de arquivos
	instalados e a descri&ccedil;&atilde;o de cada pacote pode ser
	encontrada nos arquivos destes diretorios.
      </para>
    </sect2>
  </sect1>
  
  <sect1 id="ports-using">
    <title>Usando a cole&ccedil;&atilde;o de ports</title>

    <para>A sess&atilde;o abaixo fornecer&aacute; as
      instru&ccedil;&otilde;es b&aacute;sicas sobre o uso da
      cole&ccedil;&atilde;o de ports para instalar e remover programas
      do seu sistema.
    </para>

    <sect2 id="ports-tree">
      <title>Obtendo a cole&ccedil;&atilde;o do ports</title>

      <para>
	Antes que voc&ecirc; possa instalar um port, voc&ecirc;
	primeiro precisa obter a cole&ccedil;&atilde;o de ports, a
	qual &eacute; basicamente um conjunto de arquivos
	<filename>Makefiles</filename>, patches, e arquivos de
	descri&ccedil;&atilde;o colocados sob
	<filename>/usr/ports</filename>
      </para>

      <para>
	Quando voc&ecirc; est&aacute; instalando o FreeBSD, o
	<application>Sysinstall</application> pergunta se voc&ecirc;
	deseja instalar a arvore do ports, se voc&ecirc; respondeu
	n&atilde;o naquela ocasi&atilde;o, voc&ecirc; pode seguir as
	seguintes instru&ccedil;&otilde;es para instalar a
	cole&ccedil;&atilde;o de ports:</para>

      <procedure>
	<title>Via Sysinstall</title>

	<para>
	  Este m&eacute;todo envolve novamente a
	  utiliza&ccedil;&atilde;o do <application>sysinstall
	  </application> para instalar manualmente a
	  cole&ccedil;&atilde;o de ports.</para>

	<step>
	  <para>Estando logado como o usu&aacute;rio
	    <username>root</username>, execute o comando
	    <command>/stand/sysinstall</command> como ilustrado
	    abaixo:</para>

	  <screen>&prompt.root; <userinput>/stand/sysinstall</userinput></screen>
	</step>

	<step>
	  <para>Utilize as setas direcionais de seu teclado e
	    selecione a op&ccedil;&atilde;o
	    <guimenuitem>Configure</guimenuitem>, e pressione
	    <keycap>Enter</keycap> .</para>
	</step>

	<step>
	  <para>Selecione a op&ccedil;&atilde;o
	    <guimenuitem>Distributions</guimenuitem>, e pressione
	    <keycap>Enter</keycap>.</para>
	</step>

	<step>
	  <para>Selecione a op&ccedil;&atilde;o
	    <guimenuitem>ports</guimenuitem>, e pressione <keycap>a
	      barra de espa&ccedil;o</keycap> para
	    marc&aacute;-la.</para>
	</step>

	<step>
	  <para>Selecione a op&ccedil;&atilde;o
	    <guimenuitem>Exit</guimenuitem>, e pressione
	    <keycap>Enter</keycap>.</para>
	</step>

	<step>
	  <para>Agora voc&ecirc; deve escolher a media apartir da qual
	    a cole&ccedil;&atilde;o de ports ser&aacute; instalada,
	    como por exemplo CDROM, FTP, etc. Selecione a
	    op&ccedil;&atilde;o desejada e pressione
	    <keycap>Enter</keycap> para iniciar a
	    instala&ccedil;&atilde;o.</para>
	</step>

	<step>
	  <para>Selecione a op&ccedil;&atilde;o
	    <guimenuitem>Exit</guimenuitem> e pressione
	    <keycap>Enter</keycap> para voltar a tela inicial.</para>
	</step>

	<step>
	  <para>Pressione <keycap>X</keycap> para sair do
	    <application> sysinstall</application>.</para>
	</step>
      </procedure>

      <para>
	Um m&eacute;todo alternativo para obter e manter atualiza a
	cole&ccedil;&atilde;o de ports &eacute; atrav&eacute;s da
	utiliza&ccedil;&atilde;o do aplicativo <application>CVSup
	</application>. De uma olhada no arquivo de
	configura&ccedil;&atilde;o do <application>CVSup
	</application> para o ports em
	<filename>/usr/share/examples/cvsup/ports-supfile</filename>.
	Cosulte a sess&atilde;o <link linkend="cvsup">Utilizando o
	  CVSup</link> (<xref linkend="cvsup">) para maiores
	informa&ccedil;&otilde;es sobre a utiliza&ccedil;&atilde;o do
	<application>CVSup</application> e deste arquivo.</para>

      <procedure>
	<title>Via CVSup</title>

	<para>
	  Este &eacute; um guia r&aacute;pido sobre como obter a
	  cole&ccedil;&atilde;o de ports atrav&eacute;s do uso do
	  <application>CVSup</application>. Se voce deseja manter a
	  sua &aacute;rvore do ports atualizada, ou ent&atilde;o se
	  desejar aprender mais sobre o
	  <application>CVSup</application>, leia a sess&atilde;o
	  mencionada anteriormente.</para>

	<step>
	  <para>Instale o port <filename
	      role="package">net/cvsup</filename>.  Consulte a
	    sess&atilde;o <link linkend="cvsup-install">Instalando o
	      CVSup</link> (<xref
	      linkend="cvsup-install">) para maiores detalhes.</para>
	</step>

	<step>
	  <para>Estando logado como o usu&aacute;rio
	    <username>root</username>, copie o arquivo
	    <filename>/usr/share/examples/cvsup/ports-supfile
	    </filename> para um novo local, como por exemplo para o
	    diret&oacute;rio <filename>/root</filename> ou
	    ent&atilde;o para o seu diret&oacute;rio home. </para>
	</step>

	<step>
	  <para>Abra o arquivo <filename>ports-supfile</filename> com o seu 
	  editor de textos preferido.</para>
	</step>

	<step>
	  <para>Altere a entrada
	    <replaceable>CHANGE_THIS.FreeBSD.org</replaceable> para o
	    endere&ccedil;o v&aacute;lido de um servidor
	    <application>CVSup</application> perto de voc&ecirc;.
	    Consulte a sess&atilde;o <link
	      linkend="cvsup-mirrors">Espelhos CVSup</link> (<xref
	      linkend="cvsup-mirrors">) para
	    visualizar a lista completa com todos os servidores
	    disponiveis.</para>
	</step>

	<step>
	  <para>Execute o comando <command>cvsup</command>:</para>

	  <screen>&prompt.root; <userinput>cvsup -g -L 2 <replaceable>/root/ports-supfile</replaceable></userinput></screen>
	</step>

	<step>
	  <para>Ao executar este comando novamente no futuro, ele
	    ir&aacute; atualizar a sua &aacute;rvore do ports, fazendo
	    o download de todas as altera&ccedil;&otilde;es que
	    ocorreram na cole&ccedil;&atilde;o desde a ultima vez em
	    que ele foi executado.</para>
	</step>
      </procedure>
    </sect2>

    <sect2 id="ports-skeleton">
      <title>Instalando um aplicativo via Ports</title>

      <indexterm>
        <primary>ports</primary>
        <secondary>installing</secondary>
      </indexterm>
      <para>
	A primeira coisa que precisa ser explicada a algu&eacute;m que
	est&aacute; iniciando no uso do ports &eacute; que na verdade
	um port &eacute; composto por um <quote>conjunto de
	  arquivos</quote>. Em poucas palavras, um port &eacute; o
	conjunto minimo de arquivos que diz ao sistema FreeBSD como
	compilar corretamente e como instalar um aplicativo. Cada port
	&eacute; composto por:</para>

      <itemizedlist>
	<listitem>
	  <para>Um arquivo <filename>Makefile</filename>. O
	    <filename>Makefile</filename> cont&eacute;m v&aacute;rias
	    instru&ccedil;&otilde;es que definem como o aplicativo
	    deve ser compilado e onde ele deve ser instalado em seu
	    sistema.</para>
	</listitem>

	<listitem>
	  <para>Um arquivo <filename>distinfo</filename>.  
	  Este arquivo contem informa&ccedil;&otilde;es sobre quais arquivos
	  precisam ser obtidos para compilar o port e os seus
	  respectivos <literal>checksums</literal>, os quais s&atilde;o
	  utilizados para  verificar se o o arquivo n&atilde;o foi corrompido durante 
	  o processo de download, a verifica&ccedil;&atilde;o &eacute; realizada atrav&eacute;s do
	    utilit&aacute;rio &man.md5.1;.</para>
	</listitem>
	
	<listitem>
	  <para>Um diret&oacute;rio chamado <filename>files</filename>.  
	   Este diret&oacute;rio cont&eacute;m os patchs necess&aacute;rios para que o
	   aplicativo possa ser compilado e instalado no FreeBSD. Os
	   patchs s&atilde;o basicamente arquivos pequenos os quais
	   especificam altera&ccedil;&otilde;es a serem aplicadas a determinados
	   arquivos. S&atilde;o arquivos em formato texto plano, e
	   basicamente dizem <quote> remova a linha 10</quote> ou
	   <quote>Altere a linha 26 para ...</quote>. Os patchs s&atilde;o
	   normalmente conhecidos como <quote>diffs</quote>, pois
	    s&atilde;o gerados pelo utilit&aacute;rio &man.diff.1;</para>
	  
	  <para>Este diret&oacute;rio tamb&eacute;m pode conter outros
	    arquivos necess&aacute;rios para a
	    compila&ccedil;&atilde;o do aplicativo.</para>
	</listitem>

	<listitem>
	  <para>Um arquivo <filename>pkg-descr</filename>. Este
	    arquivo cont&eacute;m a descri&ccedil;&atilde;o detalhada
	    do aplicativo.</para>
	</listitem>
	
	<listitem>
	  <para>Um arquivo <filename>pkg-plist</filename>. Este
	    arquivo cont&eacute;m a listagem de todos os arquivos que
	    ser&atilde;o instalados pelo port. Ele tamb&eacute;m diz
	    ao sistema de ports quais arquivos devem ser removidos
	    durante a desinstala&ccedil;&atilde;o do
	    aplicativo.</para>
	</listitem>
      </itemizedlist>

      <para>iAlguns ports possuem outros arquivos, como por exemplo
	<filename>pkg-message</filename>. O sistema de ports utiliza
	estes arquivos para lidar com sistua&ccedil;&otilde;es
	especiais. Se voc&ecirc; desejar maiores detalhes sobre estes
	arquivos, e sobre o sistema de ports em geral, consulte o
	<ulink url="../porters-handbook/index.html">FreeBSD Porter's
	  Handbook </ulink>.</para>
      
      <para>
	Agora que voc&ecirc; tem bastante informa&ccedil;&atilde;o de
	fundo para saber para que a cole&ccedil;&atilde;o de ports
	&eacute; utilizada, voc&ecirc; est&aacute; pronto para
	instalar seu primeiro aplicativo pelo sistema de ports.
	Existem 2 formas pelas quais isto pode ser feito, e cada uma
	delas est&aacute; detalhada abaixo.</para>
      
      <para>
	No entanto antes de iniciarmos voc&ecirc; precisair&aacute;
	escolher um aplicativo para instalar. Existem algumas formas
	de fazer isso, mas a maneira mais facil &eacute;
	atrav&eacute;s da <ulink
	  url="../../../../ports/index.html">listagem de ports no web
	  site do FreeBSD</ulink>. No site voc&ecirc; pode navegar
	pela &aacute;rvore de ports ou ent&atilde;o utilizar-se do
	mecanismo de busca. Cada port possui uma
	descri&ccedil;&atilde;o sobre a finalidade do aplicativo a que
	ele se refere, a leitura destas descri&ccedil;&otilde;es vai
	ajuda-lo na escolha de qual port instalar.</para>
      
      <para>Uma outra op&ccedil;&atilde;o &eacute; utilizar-se do utilit&aacute;rio &man.whereis.1;.
	Simplesmente execute <command>whereis <replaceable>arquivo
	</replaceable></command>, onde <replaceable>arquivo</replaceable> 
	&eacute; o programa que voc&ecirc; deseja instalar. Se ele for encontrado
	em seu sistema, voc&ecirc; ser&aacute; informado da sua localiza&ccedil;&atilde;o, como
	mostrado abaixo:</para>

      <screen>&prompt.root; <userinput>whereis lsof</userinput>
lsof: /usr/ports/sysutils/lsof</screen>

      <para>A saida acima nos diz que o <command>lsof</command>
	(utilit&aacute;rio de sistema) pode ser encontrado no
	diret&oacute;rio
	<filename>/usr/ports/sysutils/lsof</filename>.</para>

      <para>
	Outra forma de procurar um port em particular &eacute;
	atrav&eacute;s da utiliza&ccedil;&atilde;o do mecanismo
	interno de busca disponibilizado pelo sistema de ports. Para
	usar o reurso de busca, voce tem que estar dentro do
	diret&oacute;rio <filename>/usr/ports</filename>. Uma vez
	dentro do diret&oacute;rio, execute o comando <command>make
	  search
	  name=<replaceable>nome_do_programa</replaceable></command>
	onde <replaceable>nome_do_programa</replaceable> &eacute; o
	nome do aplicativo que vc est&aacute; procurando. Por exemplo,
	se voc&ecirc; estiver procurando pelo
	command>lsof</command>:</para>

      <screen>&prompt.root; <userinput>cd /usr/ports</userinput>
&prompt.root; <userinput>make search name=lsof</userinput>
Port:   lsof-4.56.4
Path:   /usr/ports/sysutils/lsof
Info:   Lists information about open files (similar to fstat(1))
Maint:  obrien@FreeBSD.org
Index:  sysutils
B-deps: 
R-deps: </screen>

      <para>
	A parte da sa&iacute;da na qual voc&ecirc; deve prestar um
	aten&ccedil;&atilde;o especial &eacute; a linha iniciada com
	<quote>Path:</quote>, uma vez que &eacute; ela que diz onde
	encontrar o port. As outras informa&ccedil;&otilde;es exibidas
	n&atilde;o s&atilde;o necess&aacute;rias para a
	instala&ccedil;&atilde;o do aplicativo pelo ports, e portanto
	n&atilde;o ser&atilde;o comentadas aqui.</para>

      <para>
	Para uma busca mais profunda voce pode utilizar <command>make
	  search key=<replaceable>string</replaceable></command> ,
	onde <replaceable>string</replaceable> &eacute; a palavra
	chave que deseja procurar. Esta busca ir&aacute; varrer os
	nomes dos ports, os coment&aacute;rios, as
	descri&ccedil;&otilde;es, as depend&ecirc;ncias e pode pode
	ser utilizada para buscar um aplicativo que esteja relacionado
	a um assunto em particular caso voc&ecirc; n&atilde;o saiba o
	nome do aplicativo pelo qual voc&ecirc; est&aacute;
	procurando.</para>

      <para>Em ambos os casos descritos acima,i o argumento da busca
	&eacute; <literal>case-insensitive</literal>. A busca por
	<quote>LSOF</quote> ir&aacute; apresentar o mesmo resultado
	que uma busca por <quote>lsof </quote>.</para>

      <note>
        <para>Voce Precisa estar logado como <username>root</username>
	  para instalar um aplicativo pelo ports.</para>
      </note>

      <para>
	Agora que voc&ecirc; ja encontrou um aplicativo que gostaria
	de instalar, voc&ecirc; j&aacute; est&aacute; pronto para
	executar a instala&ccedil;&atilde;o. O port inclui
	instru&ccedil;&otilde;es sobre como compilar o c&oacute;digo
	fonte, por&eacute;m n&atilde;o inclui o c&oacute;digo fonte
	propriamente dito. Voc&ecirc; pode obter o c&oacute;digo fonte
	apartir de um CDROM ou apartir da internet. O c&oacute;digo
	fonte &eacute; distribuido da forma como o autor do software
	desejar, normalmente o formaro utilizado &eacute; um tarball
	compactado com o utilit&aacute;rio gzip, por&eacute;m ele pode
	estar compactado com outro utilit&aacute;rio ou mesmo estar
	descompactado. O c&oacute;digo fonte de um software,
	independente de como ele for distribuido, &eacute; chamado de
	<quote>distfile</quote>. Voce pode obter o
	<quote>distfile</quote> apartir de um CDROM ou da
	internet.</para>
      
      <sect3 id="ports-cd">
        <title>Instalando um aplicativo atrav&eacute;s do ports via
	  CDROM</title>

        <indexterm>
          <primary>ports</primary>
          <secondary>installing from CD-ROM</secondary>
        </indexterm>
        <para>
	  Os ISOs oficiais distribuidos pelo projeto FreeBSD
	  n&atilde;o incluem nenhum distfile. Eles ocupariam muito
	  espa&ccedil;o, o qual &eacute; melhor utilizado pelos
	  pacotes pr&eacute;-compilados. Os CDROMs da linha PowerPack
	  incluem distifiles, e voce pode comprar este conjunto de CDs
	  em vendedores como a <ulink
	    url="http://www.freebsdmall.com/">FreeBSD Mall</ulink>.
	  Esta sess&atilde;o assume que voc&ecirc; possui este
	  conjunto de CDs.</para>
	
        <para>
	  Insira o CDROM do FreeBSD no drive. Monte-o como
	  <filename>/cdrom</filename>. Se voc&ecirc; utilizar um ponto
	  de montagem diferente o processo de instala&ccedil;&atilde;o
	  n&atilde;o ir&aacute; funcionar. Para iniciar, va para o
	  diret&oacute;rio do ports que voc&ecirc; deseja
	  instalar:</para>
	
        <screen>&prompt.root; <userinput>cd /usr/ports/sysutils/lsof</userinput></screen>

        <para>
	  Uma vez dentro do diret&oacute;rio
	  <filename>lsof</filename>, voc&ecirc; ir&aacute; ver o
	  esqueleto do port. O pr&oacute;ximo passo &eacute; compilar,
	  ou construir, o port. Isto &eacute; realizado pela simples
	  execu&ccedil;&atilde;o do comando <command>make</command>.
	  Ao executar o comando, voc&ecirc; ir&aacute; visualizar uma
	  saida semelhante a esta:</para>
	  
        <screen>&prompt.root; <userinput>make</userinput>
&gt;&gt; lsof_4.57D.freebsd.tar.gz doesn't seem to exist in /usr/ports/distfiles/.
&gt;&gt; Attempting to fetch from file:/cdrom/ports/distfiles/.
===&gt;  Extracting for lsof-4.57
...
[extraction output snipped]
...
&gt;&gt; Checksum OK for lsof_4.57D.freebsd.tar.gz.
===&gt;  Patching for lsof-4.57
===&gt;  Applying FreeBSD patches for lsof-4.57
===&gt;  Configuring for lsof-4.57
...
[configure output snipped]
...
===&gt;  Building for lsof-4.57
...
[compilation output snipped]
...
&prompt.root;</screen>

        <para>
	  Observe que ap&oacute;s completar o processo de
	  compila&ccedil;&atilde;o voc&ecirc; ir&aacute; voltar para o
	  prompt. O pr&oacute;ximo passo &eacute; instalar o port.
	  Para instal&aacute;-lo, basta adicionat a palavra
	  <command>install</command> ao comando
	  <command>make</command>, como mostrado abaixo:</para>

        <screen>&prompt.root; <userinput>make install</userinput>
===&gt;  Installing for lsof-4.57
...
[installation output snipped]
...
===&gt;   Generating temporary packing list
===&gt;   Compressing manual pages for lsof-4.57
===&gt;   Registering installation for lsof-4.57
===&gt;  SECURITY NOTE: 
      This port has installed the following binaries which execute with
      increased privileges.
&prompt.root;</screen>

        <para>
	  Uma vez que voc&ecirc; tenha retornado ao prompt, voc&ecirc;
	  j&aacute; deve ser capaz de executar a
	  aplica&ccedil;&atilde;o que acabou de instalar. Como o
	  aplicativo <command>lsof</command> executa com
	  privil&eacute;gios altos, um aviso de seguran&ccedil;a
	  &eacute; exibido. Durante o processo de
	  compila&ccedil;&atilde;o e de instala&ccedil;&atilde;o,
	  outros avisos podem ser exibidos.</para>

        <note>
          <para>
	    Voce pode economizar um passo executando diretamente o
	    comando <command>make install</command>, ao inv&eacute;s
	    de executar o comando <command>make</command> seguido do
	    comando <command>make install</command> como duas etapas
	    separadas.</para>
	</note>

	<note>
	  <para>
	    Alguns <literal>shells</literal> mantem um
	    <literal>cache</literal> dos comandos disponiveis nos
	    diret&oacute;rios listados na v&aacute;riavel de ambiente
	    <envar>PATH</envar>, com o objetivo de agilizar o processo
	    de busca para a execu&ccedil;&atilde;o desdes comandos. Se
	    voce estiver utilizando um destes
	    <literal>shells</literal>, voc&ecirc; ter&aacute; que
	    executar o comando <command>rehash</command> logo
	    ap&oacute;s a instala&ccedil;&atilde;o do ports, antes que
	    voce possa utilizar o aplicativo rec&eacute;m instalado.
	    Esta opera&ccedil;&atilde;o &eacute; necess&aacute;ria com
	    todos os shells disponibilizados na base do sistema (como
	    por exemplo o <command>tcsh</command>) e com alguns dos
	    disponibilizados no ports (por exemplo, <filename
	      role="package">shells/zsh</filename>).</para>
	</note>

        <note>
          <para>
	    Por favor esteja ciente de que a licensa de alguns
	    aplicativos n&atilde;o permite a inclus&atilde;o dos
	    mesmos em um CDROM. Isto pode ocorrer devido a necessidade
	    de se preencher algum formul&aacute;rio antes de se fazer
	    o download ou ent&atilde;o porque a
	    redistribui&ccedil;&atilde;o n&atilde;o &eacute;
	    permitida, ou por qualquer outra raz&atilde;o. Se
	    voc&ecirc; deseja instalar um ports cujo distfile
	    n&atilde;o esteja presente no CDROM, voc&ecirc;
	    ter&aacute; que estar online para instal&aacute;-lo
	    (consulte a <link linkend="ports-inet">pr&oacute;xima
	      sess&atilde;o</link>.</para>
	</note>
      </sect3>

      <sect3 id="ports-inet">
      <title>Instalando um aplicativo atrav&eacute;s do ports via
	  Internet</title>

        <para>
	  Como na ultima sess&atilde;o, est&aacute; sess&atilde;o
	  assume que voc&ecirc; possui uma conex&atilde;o internet
	  funcional. Se voc&ecirc; n&atilde;o possuir, voc&ecirc;
	  ter&aacute; que executar a <link
	    linkend="ports-cd">instala&ccedil;&atilde;o apartir do
	    CDROM</link>, ou ent&atilde;o colocar manualmente uma
	  c&oacute;pia do distifile do port desejado no
	  diret&oacute;rio
	  <filename>/usr/ports/distfiles</filename>.</para>
	
        <para>
	  A instala&ccedil;&atilde;o de um port apartir da internet
	  &eacute; realizada de forma id&ecirc;ntica a
	  instala&ccedil;&atilde;o apartir do CDROM, a unica
	  diferen&ccedil;a entre as duas &eacute; que agora o distfile
	  ser&aacute; obtido da internet ao inv&eacute;s de ser lido
	  do CDROM.</para>

        <para>Os passos envolvidos s&atilde;o id&ecirc;nticos:</para>

        <screen>&prompt.root; <userinput>make install</userinput>
&gt;&gt; lsof_4.57D.freebsd.tar.gz doesn't seem to exist in /usr/ports/distfiles/.
&gt;&gt; Attempting to fetch from ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/distfiles/.
Receiving lsof_4.57D.freebsd.tar.gz (439860 bytes): 100%
439860 bytes transferred in 18.0 seconds (23.90 kBps)
===&gt;  Extracting for lsof-4.57
...
[extraction output snipped]
...
&gt;&gt; Checksum OK for lsof_4.57D.freebsd.tar.gz.
===&gt;  Patching for lsof-4.57
===&gt;  Applying FreeBSD patches for lsof-4.57
===&gt;  Configuring for lsof-4.57
...
[configure output snipped]
...
===&gt;  Building for lsof-4.57
...
[compilation output snipped]
...
===&gt;  Installing for lsof-4.57
...
[installation output snipped]
...
===&gt;   Generating temporary packing list
===&gt;   Compressing manual pages for lsof-4.57
===&gt;   Registering installation for lsof-4.57
===&gt;  SECURITY NOTE: 
      This port has installed the following binaries which execute with
      increased privileges.
&prompt.root;</screen>

        <para>
	  Como voce pode ver a &uacute;nica diferen&ccedil;a &eacute;
	  a linha que informa que o sistema esta fazendo o download do
	  distfile.</para>

	<para>
	  O sistema de ports utiliza o &man.fetch.1; para fazer
	  download dos arquivos, o qual considera varias vari&aacute;veis de
	  ambiente, incluindo <envar>FTP_PASSIVE_MODE</envar>,
	  <envar>FTP_PROXY</envar>, e <envar>FTP_PASSWORD</envar>.
	  Voc&ecirc; pode precisar definir uma ou mais delas caso esteja
	  atr&aacute;s de um firewall, ou mesmo fazer uso de um proxy
	  FTP/HTTP, Consulte &man.fetch.3; para visualizar a lista de
	  todas as vari&aacute;veis.</para>
	
	<para>
	  Para os usu&aacute;rios que n&atilde;o podem ficar
	  conectados o tempo todo, &eacute; oferecido o comando
	  <command>make <maketarget>fetch</maketarget></command> como
	  op&ccedil;&atilde;o. Ao executar este comando na raiz da
	  &aacute;rvore do ports (<filename>/usr/ports</filename>),
	  ele ir&aacute; fazer o download de todos os distifiles
	  necess&aacute;rios para o uso do ports para voc&ecirc;. Este
	  comando tamb&eacute;m funciona para as demais categorias do
	  segundo nivel (por exemplo,
	  filename>/usr/ports/net</filename>). Observe que se um port
	  depender de uma biblioteca ou de outros ports para
	  funcionar, o comando acima n&atilde;o ir&aacute; fazer o
	  download do distifile destes ports. Se voc&ecirc; desejar
	  que seja efetuado o download do distfile de todas as
	  dependencias, substitua a op&ccedil;&atilde;o
	  <maketarget>fetch</maketarget> por
	  <maketarget>fetch-recursive</maketarget>.
	
	<note>
	    <para>
	      Voc&ecirc; pode compilar todos os ports de uma
	      determinada categoria, ou mesmo todos os ports,
	      executando o comando <command>make</command> na raiz da
	      &aacute;rvore do ports, exatamente como mencionado acima
	      para o <command>make <makevar>fetch</makevar></command>.
	      Isto &eacute; perigoso, pois alguns ports n&atilde;o
	      podem co-existir no mesmo sistema. Em outros casos,
	      alguns ports podem instalar 2 arquivos diferentes com o
	      mesmo nome, um sobrescrevendo o arquivo do
	      outro.</para></note>

	<para>
	  Em alguns casos raros, os usu&aacute;rios podem precisar
	  obter os tarballs, apartir de um site diferente do
	  especificado no <makevar>MASTER_SITES</makevar> (local de
	  onde os distfiles s&atilde;o obtidos). Voce pode
	  sobrescrever o valor da op&ccedil;&atilde;o
	  <makevar>MASTER_SITES</makevar> com o seguinte
	  comando:</para>

	<screen>&prompt.root; <userinput>cd /usr/ports/<replaceable>directory</replaceable></userinput></screen>
	<screen>&prompt.root; <userinput>make MASTER_SITE_OVERRIDE= \
	ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/distfiles/ fetch</userinput></screen>

	<para>No exemplo acima, n&oacute;s alteramos a
	  op&ccedil;&atilde;o <makevar>MASTER_SITES </makevar> para
	  <hostid
	    role="fqdn">ftp.FreeBSD.org/pub/FreeBSD/ports/distfiles/</hostid>.</para>

	<note>
	<para>
	    Alguns ports permitem (ou mesmo precisam) que voc&ecirc;
	    forne&ccedil;a algumas op&ccedil;&otilde;es no momento da
	    compila&ccedil;&atilde;o, com o objetido de habilitar ou
	    desabilitar partes da aplica&ccedil;&atilde;o que
	    n&atilde;o s&atilde;o necess&aacute;rias,
	    op&ccedil;&otilde;es de seguran&ccedil;a e outras
	    customiza&ccedil;&otilde;es. Alguns ports onde ocorrem
	    isso, e que vem a mente no momento s&atilde;o <filename
	      role="package">www/mozilla</filename>, <filename
	      role="package">security/gpgme</filename>, e <filename
	      role="package">mail/sylpheed-claws</filename>. Uma
	    mensagem &eacute; exibida quando este tipo de
	    op&ccedil;&otilde;es estiverem dispon&iacute;veis.
	 </para></note>
      </sect3>

      <sect3>
        <title>Sobrescrevendo o diret&oacute;rio default do Ports</title>

	<para>
	  Algumas vezes &eacute; &uacute;til (ou obrigat&oacute;rio)
	  utilizar diferentes distfiles e diretorios de ports. As
	  vari&aacute;veis <makevar>PORTSDIR</makevar> e
	  <makevar>PREFIX</makevar> podem sobrescrever os
	  diret&oacute;rios default. Por exemplo:</para>

	<screen>&prompt.root; <userinput>make PORTSDIR=/usr/home/example/ports install</userinput></screen>

	<para>Ir&aacute; compilar o port dispon&iacute;vel no
	  diret&oacute;rio
	  <filename>/usr/home/example/ports</filename> e instalar tudo
	  sob o diret&oacute;rio
	  <filename>/usr/local</filename>.</para>
	
	<screen>&prompt.root; <userinput>make PREFIX=/usr/home/example/local install</userinput></screen>

	<para>Ir&aacute; compilar o port em
	  <filename>/usr/ports</filename> e instalar tudo em
	  <filename>/usr/home/example/local</filename>.</para>
	
	<para> E &eacute; claro,</para>

	<screen>&prompt.root; <userinput>make PORTSDIR=../ports PREFIX=../local install</userinput></screen>

	<para>
	  Ir&aacute; combinar os dois (&eacute; muito longo para
	  escrever nesta pagina, mas j&aacute; deu para voc&ecirc; ter
	  uma id&eacute;ia geral de como isso funciona).</para>
	
	<para>
	  Alternativamente, estas variaveis podem fazer parte do seu
	  ambiente. Leia o manual do seu shell para ver
	  instru&ccedil;&otilde;es de como fazer desta forma.</para>
      </sect3>

      <sect3>
	<title>Lidando com o <command>imake</command></title>

	<para>
	  Alguns ports que fazem uso do <command>imake</command> (uma
	  parte do Sistema X Windows) n&atilde;o funiona bem com a
	  vari&aacute;vel <makevar>PREFIX</makevar>,e ir&aacute;
	  insistir em instalar o aplicativo sob
	  <filename>/usr/X11R6</filename>. De forma semelhante, alguns
	  ports Perl ignoram a vari&aacute;vel
	  <makevar>PREFIX</makevar> e se instalam sob a &aacute;rvore
	  do Perl. Fazer estes ports respeitarem a vari&aacute;vel
	  <makevar>PREFIX</makevar> &eacute; um trabalho dificil,
	  sen&atilde;o impossivel.</para>

      </sect3>
    </sect2>

    <sect2 id="ports-removing">
      <title>Desinstalando um Ports</title>

      <indexterm>
        <primary>ports</primary>
        <secondary>removing</secondary>
      </indexterm>
      <para>
	Agora que voc&ecirc; sabe como instalar um ports, voc&ecirc;
	prov&aacute;velmente est&aacute; se perguntando como remove-lo
	do sistema, apenas para o caso de voc&ecirc; instalar um e
	mais tarde descobrir que instalaou o port errado. N&oacute;s
	iremos remover o nosso exemplo anterior (era o
	<command>lsof</command> caso n&atilde;o tenha prestado
	aten&ccedil;&atilde;o). Assim como na
	instala&ccedil;&atilde;o, voc&ecirc; primeiro deve entrar no
	diret&oacute;rio do port, no nosso caso
	<filename>/usr/ports/sysutils/lsof</filename>. Depois que
	voc&ecirc; tiver entrado no diret&oacute;rio, voc&ecirc;
	estar&aacute; pronto para desinstalar o
	<command>lsof</command>. O que &eacute; feito atrav&eacute;s
	do comando <command>make deinstall</command>:</para>

      <screen>&prompt.root; <userinput>cd /usr/ports/sysutils/lsof</userinput>
&prompt.root; <userinput>make deinstall</userinput>
===&gt;  Deinstalling for lsof-4.57</screen>

      <para>
	Simples assim, voce j&aacute; removeu o
	<command>lsof</command> do seu sistema. Se voc&ecirc; desejar
	reinstal&aacute;-lo, basta executar o comando <command>make
	  reinstall</command> dentro do diret&oacute;rio
	<filename>/usr/ports/sysutils/lsof</filename>.</para>

      <para>
	Os comandos <command>make deinstall</command> e <command>make
	reinstall</command>, n&atilde;o ir&atilde;o funcionar depois que voce
	executar o comando <command>make clean</command>. Se voce
	desejar desinstalar um ports depois de ter limpado o diret&oacute;rio
	de trabalho, utilize o comando &man.pkg.delete.1; como
	mostrado na <link linkend="packages-using">Sess&atilde;o sobre
	pacotes do Handbook</link>.</para>
      
    </sect2>

    <sect2 id="ports-disk-space">
      <title>Ports e espa&ccedil;o em disco</title>

      <indexterm>
        <primary>ports</primary>
        <secondary>disk-space</secondary>
      </indexterm>
      <para>
	Utilizar a cole&ccedil;&atilde;o de ports pode definitivamente
	devorar espa&ccedil;o do seu HDD. Por esta raz&atilde;o
	voc&ecirc; precisa se lembrar de limpar o diret&oacute;rio de
	trabalho utilizando o comando <command>make
	  <makevar>clean</makevar></command>. Ao execut&aacute;-lo ele
	ir&aacute; remover o diret&oacute;rio
	<filename>work</filename> depois do port ter sido compilado e
	instalado. Voc&ecirc; tamb&eacute;m pode remover os arquivos
	tarballs do diret&oacute;rio <filename>distfiles</filename>,
	al&eacute;m de remover os aplicativos instalados quando eles
	n&atilde;o tiverem mais utilidade.</para>
	 
      <para>
	Alguns usu&aacute;rios preferem limitar as categorias do port,
	colocando uma entrada no arquivo <filename>refuse</filename>.
	Desta forma quando eles executam o
	<application>CVSup</application>, ele n&atilde;o ir&aacute;
	fazer o download de nenhum arquivo desta categoria.</para>
    </sect2>

    <sect2 id="ports-upgrading">
      <title>Atualizando um aplicativo instalado via Ports</title>

      <indexterm>
	<primary>portupgrade</primary>
      </indexterm>
      <indexterm>
	<primary>ports</primary>
	<secondary>upgrading</secondary>
      </indexterm>
      <para>
	Manter um aplicativo atualizado pode ser uma tarefa tediosa.
	Pois para atualizar um aplicativo voc&ecirc; precisa ir ao
	diret&oacute;rio do ports, compilar o port, desinstalar a
	vers&atilde;o antiga do port, instalar a nova vers&atilde;o e
	ent&atilde;o limpar o diret&oacute;rio de trabalho ap&oacute;s
	a compila&ccedil;&atilde;o. Imagine fazer isso para 5
	aplicativos, entediante certo ? Este &eacute; um dos grandes
	problemas com que um administrador de sistema tem que lidar,
	mas agora temos um utilit&aacute;rio para fazer este trabalho
	para n&oacute;s. Por exemplo o utilit&aacute;rio <filename
	  role="port">sysutils/portupgrade </filename> ir&aacute;
	fazer tudo para voc&ecirc;. Instale-o da mesma forma como faz
	com qualquer outro port, usando o comando <command>make
	  <makevar>install clean</makevar></command>.</para>
	
      <para>
	Agora crie o banco de dados com o comando <command>pkgdb
	  -F</command>. Este comando ir&aacute; ler a lista de ports
	instados em seu sistema e ir&aacute; criar um banco de dados
	com informa&ccedil;&otilde;es dos mesmos no diret&oacute;rio
	<filename>/var/db/pkg</filename>. Agora quando voc&ecirc;
	executar <command>portupgrade -a</command>, ele ir&aacute; ler
	este banco de dados e o arquivo <filename>INDEX</filename> na
	raiz da &aacute;rvore do ports. Em seguida o
	<command>portupgrade</command> ir&aacute; iniciar o processo
	de download, compila&ccedil;&atilde;o, backup,
	instala&ccedil;&atilde;o e limpeza dos aplicativos que
	precisarem de atualiza&ccedil;&atilde;o. Existem outros
	utilit&aacute;rios que fazem um trabalho semelhante, verifique
	as demais op&ccedil;&otilde;es no diret&oacute;rio
	<filename>ports/sysutils</filename>.
	</para>
    </sect2>
  </sect1>

  <sect1 id="ports-nextsteps">
    <title>Atividades p&oacute;s-instala&ccedil;&atilde;o</title>

    <para>
      Depois de instalar um novo aplicativo voc&ecirc; normalmente
      ir&aacute; querer ler a documenta&ccedil;&atilde;o instalada com
      ele, editar algum arquivo de configura&ccedil;&atilde;o
      necess&aacute;rio para o correto funcionamento do aplicativo,
      certificar-se de que ele o aplicativo ir&aacute; iniciar
      automaticamente no pr&oacute;ximo boot (se ele for um servidor)
      e assim por diante.</para>
    
    <para>Os passos exatos necess&aacute;rios para configurar cada
      aplicativo s&atilde;o obviamente diferentes. No entando, se
      voc&ecirc; acabou de instalar um novo aplicativo e est&aacute;
      se perguntando <quote>O que fazer agora ? </quote>, as dicas
      abaixo podem ajud&aacute;-lo:</para>
    
    <itemizedlist>
      <listitem>
	<para>Utilize o comando &man.pkg.info.1; para descobrir quais aplicativos 
	est&atilde;o instalados e onde eles est&atilde;o instalados. Por exemplo,
	voc&ecirc; tiver instalado o aplicativo
	<literal>FooPackage</literal> vers&atilde;o 1.0.0, ent&atilde;o o
	  comando</para>
	
	<screen>&prompt.root; <userinput>pkg_info -L foopackage-1.0.0 | less</userinput></screen>

	<para>Ir&aacute; exibir todos os arquivos instalados com o
	  pacote. Preste aten&ccedil;&atilde;o especial aos arquicos
	  instalados no diret&oacute;rio <filename>man/</filename>,
	  pois eles s&atilde;o os manuais dos aplicativos que compoem
	  o pacote, Tamb&eacute;m preste aten&ccedil;&atilde;o aos
	  arquivos instalados no diret&oacute;rio
	  <filename>etc/</filename>, pois s&atilde;o os arquivos de
	  configura&ccedil;&atilde;o, e por fim preste
	  aten&ccedil;&atilde;o aos arquivos instalados no
	  diret&oacute;rio <filename>doc/</filename>, pois nele ficam
	  os documentos complementares sobre o aplicativo.</para>

	<para>Se voc&ecirc; n&atilde;o tem certeza de qual
	  vers&atilde;o do aplicativo esta instalada, utilize um
	  comando semelhante ao abaixo</para>

	<screen>&prompt.root; <userinput>pkg_info | grep -i <replaceable>foopackage</replaceable></userinput></screen>

	<para>Ir&aacute; procurar todos os aplicativos instalados que possuem
	a palavra <replaceable>foopackage</replaceable> no nome.
	Substitua a palavra <replaceable>foopackage</replaceable> no
	seu comando de acordo com sua necessidade.</para>
      </listitem>

      <listitem>
	<para>
	  Uma vez que voc&ecirc; tiver identificado as paginas de manual
	  instaladas com o seu aplicativo, utilize o comando
	  &man.man.1; para visualiz&aacute;-las. De forma an&aacute;loga, leia os
	  arquivos de configura&ccedil;&atilde;o instalados como exemplo, bem como
	  qualquer outra documenta&ccedil;&atilde;o complementar que tenha sido
	  disponibilizada.</para>
      </listitem>

      <listitem>
	<para>Se o aplicativo possuir um <literal>web site</literal>,
	  fa&ccedil;a uma visita e verifique se ele disponibiliza
	  alguma documenta&ccedil;&atilde;o adicional, uma lista com
	  as perguntas e repostas mais frequentes, e assim por diante.
	  Se voc&ecirc; n&atilde;o tiver certeza do endere&ccedil;o do
	  <literal>web site</literal> do aplicativo, ele pode ser
	  listado na saida do comando</para>
	
	<screen>&prompt.root; <userinput>pkg_info <replaceable>foopackage-1.0.0</replaceable></userinput></screen>
	
	<para>Verifique se existe uma linha iniciada por
	  <literal>WWW:</literal> , se ela estiver presente,
	  voc&ecirc; tera descoberto o endere&ccedil;o do <literal>web
	    site</literal> do aplicativo.</para>
	
      </listitem>

      <listitem>
	<para>
	  Os aplicativos que inicializam no boot (aplicativos
	  servidores) ir&atilde;o instalar um script shell no
	  diret&oacute;rio <filename>/usr/local/etc/rc.d</filename>.
	  Voce deve verificar este script para ter certeza de que
	  est&aacute; correto, editando-o ou renomeando-o se for
	  necess&aacute;rio. Consulte a sess&atilde;o <link
	    linkend="configtuning-starting-services">Iniciando
	    Servi&ccedil;os </link> para maiores
	  informa&ccedil;&otilde;es.</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="ports-broken">
    <title>Lidando com ports quebrados</title>

      <para>Se voc&ecirc; encontrar um port que n&atilde;o est&aacute;
      funcionando, existem algumas coisas que voc&ecirc; pode fazer,
      incluindo:</para>

      <orderedlist>
        <listitem>
	  <para>Conserte-o!  O <ulink
	    url="../porters-handbook/index.html">Porter's
	    Handbook</ulink> inclui informa&ccedil;&otilde;es
	  detalhadas sobre a infraestrutura do <quote>Ports</quote>,
	  de forma que voc&ecirc; pode ocasionalmente corrigir um port
	  quebrado ou ent&atilde;o submeter o seu
	  pr&oacute;prio!</para>
	</listitem>

	<listitem>
	  <para>
	    Reclamar&mdash;<emphasis>por email apenas</emphasis>!
	    Primeiro envie um email para o respons&aacute;vel pelo port.
	    Execute <command>make maintainer</command> ou ent&atilde;o leia o
	    arquivo <filename>Makefile</filename> para encontrar o
	    endere&ccedil;o de email do respons&aacute;vel pelo port. Lembre-se de
	    incluir o nome e a vers&atilde;o do port (envie a linha 
	    <literal>&dollar;FreeBSD:</literal>, do arquivo <filename>
	    Makefile</filename>) e a mensagem de erro no emaili que
	    ir&aacute; enviar. Se voc&ecirc; n&atilde;o obtiver uma resposta do
	  respons&aacute;vel, voce pode utilizar o &man.send-pr.1; para
	    enviar um relatorio de falha.</para>
	</listitem>

	<listitem>
	  <para>Pegue o pacote em um servidor de FTP pr&oacute;ximo de voc&ecirc;.
	  A cole&ccedil;&atilde;o de pacotes <quote>master</quote> fica no servidor
	  <hostid role="fqdn">ftp.FreeBSD.org</hostid>, no diret&oacute;rio
	  <ulink url="ftp://ftp.FreeBSD.org/pub/FreeBSD/ports/packages/">
	  packages</ulink>, mas tenha certeza de verificar o seu
	  mirror local <emphasis>antes</emphasis>! Esta abordagem &eacute;
	  muito garantida de que vai funcionar do que tentar compilar
	  o aplicativo apartir do c&oacute;digo fonte, al&eacute;m de ser muito mais
	  r&aacute;pida tamb&eacute;m. Utilize o utilit&aacute;rio &man.pkg.add.1; para
	  instalar aplicativos no seu sistema.</para>
	</listitem>
      </orderedlist>
  </sect1>

</chapter>

<!--
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
