<!--
     The FreeBSD Documentation Project
-->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;

<!ENTITY % trademarks PUBLIC "-//FreeBSD//ENTITIES DocBook Trademark Entities//EN">
%trademarks;
]>

<article>
  <articleinfo>
    <title>Dialup firewalling com FreeBSD</title>

    <authorgroup>
      <author>
	<firstname>Marc</firstname>
	<surname>Silver</surname>

	<affiliation>
	  <address><email>marcs@draenor.org</email></address>
	</affiliation>
      </author>
    </authorgroup>

    <pubdate>$FreeBSD: doc/en_US.ISO8859-1/articles/dialup-firewall/article.sgml,v 1.32 2003/11/05 10:59:33 ceri Exp $</pubdate>

    <legalnotice id="trademarks" role="trademarks">
      &tm-attrib.freebsd;
      &tm-attrib.general;
    </legalnotice>

    <abstract>
      <para>Este artigo documenta como configurar um firewall
	utilizando uma conex&atilde;o discada com o FreeBSD e o IPFW, e
	especificamente como implementar um firewall de
	filtragem de pacotes em cima de um endere&ccedil;o IP atribuido
	dinamicamente.  Este documento n&atilde;o aborda a configura&ccedil;&atilde;o da sua
	conex&atilde;o PPP propriamente dita.</para>
    </abstract>
  </articleinfo>

  <sect1 id="preface">
    <title>Pref&aacute;cio</title>

    <para>Dialup Firewalling with FreeBSD</para>

     <para>Este documento aborda o processo necess&aacute;rio para
       configurar um firewall de filtragem de pacotes com o freebsd
       quando o seu IP &eacute; atribuido dinamicamente pelo seu provedor.
       Realizei todo o esfor&ccedil;o poss&iacute;vel para fazer este documento t&atilde;o
       informativo e correto quanto poss&iacute;vel, seus emails com
       coment&aacute;rios e sugest&otilde;es s&atilde;o bem vindos e devem ser enviados
       para <email>marcs@draenor.org</email>.</para>
   </sect1>

  <sect1 id="kernel">
    <title>Op&ccedil;&otilde;es do Kernel</title>

    <para>A primeira coisa que voc&ecirc; necessitar&aacute; fazer &eacute; recompilar o
      seu kernel.  Se voc&ecirc; precisa de maiores informa&ccedil;&otilde;es sobre como
      recompilar o kernel, ent&atilde;o o melhor lugar para iniciar &eacute; a
      <ulink URL="../../books/handbook/kernelconfig.html">sess&atilde;o sobre
      configura&ccedil;&atilde;o do kernel no Handbook</ulink>.  Voc&ecirc; precisa
      adicionar as seguintes op&ccedil;&otilde;es ao seu arquivo de configura&ccedil;&atilde;o do
      kernel:</para>

    <variablelist>
      <varlistentry>
	<term><literal>options IPFIREWALL</literal></term>

	<listitem>
	  <para>Habilita o c&oacute;digo de firewall no kernel.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>options IPFW2</literal></term>

	<listitem>
	  <para>Habilita a nova vers&atilde;o do IPFW.</para>
	  <important><para>S&oacute; fa&ccedil;a isso se voc&ecirc; estiver executando o
	  FreeBSD 4.X, este &eacute; o padr&atilde;o nas vers&otilde;es mais recentes do
	  FreeBSD.</para></important>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>options IPFIREWALL_VERBOSE</literal></term>

	<listitem>
	  <para>Envia os pacotes logados para o sistema de log.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>options
	    IPFIREWALL_VERBOSE_LIMIT=<replaceable>100</replaceable></literal></term>

	<listitem>
	  <para>Limita o numero de vezes que uma regra &eacute; logada.  Isto
	    previne que o seu arquivo de log se encha com muitas
	    entradas repetidas.  <replaceable>100</replaceable> &eacute; um
	    valor razo&aacute;vel de se usar, mas voc&ecirc; pode ajust&aacute;-lo baseado
	    nas suas necessidades.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>options IPDIVERT</literal></term>

	<listitem>
	  <para>Habilita o <emphasis>divert</emphasis> sockets, o qual ser&aacute; abordado 
	    mais tarde.</para>
	</listitem>
      </varlistentry>
    </variablelist>

    <para>Existem alguns outros itens <emphasis>opcionais</emphasis>
      os quais voc&ecirc; pode compilar no seu Kernel para algum acr&eacute;scimo de
      seguran&ccedil;a.  Eles n&atilde;o s&atilde;o requeridos para colocar o firewall para
      funcionar, mas alguns usu&aacute;rios mais paran&oacute;icos podem desejar
      utiliz&aacute;-los.</para>
    
    <variablelist>
      <varlistentry>
	<term><literal>options TCP_DROP_SYNFIN</literal></term>

	<listitem>
	  <para>Esta op&ccedil;&atilde;o ignora os pacotes TCP com SYN e FIN.  Isto
	    impede que ferramentas tais como o <filename
	    role="package">security/nmap</filename> de identificar a
	    pilha TCP/IP de uma maquina, mas isto quebra o suporte as
	    extens&otilde;es previstas na RFC1644.  Isto n&atilde;o &eacute; recomendado se
	    a m&aacute;quina for executar um servidor web.</para>
	</listitem>
      </varlistentry>
     </variablelist>

    <para>N&atilde;o reboot ap&oacute;s voc&ecirc; ter recompilado o kernel. N&oacute;s
    precisaremos rebootar apenas uma vez, ao completar a instala&ccedil;&atilde;o do
    firewall.</para>
  </sect1>

  <sect1 id="rcconf">
    <title>Alterando o <filename>/etc/rc.conf</filename> para carregar
      o firewall.</title>

    <para>Agora n&oacute;s precisamos realizar algumas altera&ccedil;&otilde;es no
      <filename>/etc/rc.conf</filename> para instrui-lo sobre o
      firewall.  Simplesmente adicione as seguintes linhas:</para>
    
    <programlisting>firewall_enable="YES"
firewall_script="/etc/firewall/fwrules"
natd_enable="YES"
natd_interface="tun0"
natd_flags="-dynamic"</programlisting>

    <para>Para maiores informa&ccedil;&otilde;es sobre a fun&ccedil;&atilde;o destas instru&ccedil;&otilde;es,
      consulte o <filename>/etc/defaults/rc.conf</filename> e leia o
      &man.rc.conf.5;</para>
  </sect1>

  <sect1>
    <title>Desabilite a tradu&ccedil;&atilde;o de endere&ccedil;os de rede do PPP</title>

    <para>Voc&ecirc; j&aacute; pode estar utilizando a tradu&ccedil;&atilde;o de endere&ccedil;os de
      rede (NAT) integrante do PPP.  Se este &eacute; o caso ent&atilde;o voc&ecirc; ter&aacute;
      que desabilit&aacute;-lo, e ap&oacute;s ir&aacute; utilizar o &man.natd.8; para fazer 
      o mesmo, como mostrado nos exemplos.</para>
    
    <para>Se voc&ecirc; j&aacute; tiver um bloco de entradas para iniciar
      automaticamente o PPP, ele provavelmente ir&aacute; se parecer com
      este:</para>
    
    <programlisting>ppp_enable="YES"
ppp_mode="auto"
ppp_nat="YES"
ppp_profile="<replaceable>profile</replaceable>"</programlisting>

    <para>Voc&ecirc; necessitar&aacute; desabilitar especificamente o
      <literal>ppp_nat</literal> certificando-se de que voc&ecirc; tenha a
      entrada <literal>ppp_nat="NO"</literal> no seu
      <filename>/etc/rc.conf</filename>.  Voc&ecirc; tamb&eacute;m necessitar&aacute;
      remover qualquer entrada <literal>nat enable yes</literal> ou
      <literal>alias enable yes</literal> que voc&ecirc; tenha no seu
      <filename>/etc/ppp/ppp.conf</filename>.</para>
  </sect1>

  <sect1 id="rules">
    <title>O conjunto de regras para o firewall</title>

    <para>N&oacute;s estamos pr&oacute;ximos do final agora.  Tudo o que resta agora
      &eacute; definir as regras do firewall e ent&atilde;o n&oacute;s poderemos rebootar a
      maquina e o firewall dever&aacute; estar de p&eacute; e rodando quando ela
      subir.  Eu fa&ccedil;o desta forma, outras pessoas podem desejar algo ligeiramente
      diferente quando forem implementar as suas proprias regras de
      base.  O que eu tentei fazer foi escrever um conjunto de regras
      que se aplique a maioria dos usu&aacute;rios dialup.  Voc&ecirc; pode
      obviamente modific&aacute;-las adequando-as as suas necessidades,
      utilizando as regras seguintes como ponto de partida para a
      cria&ccedil;&atilde;o das suas proprias regras.  Primeiro, vamos iniciar com
      um firewall fechado b&aacute;sico.  O que voc&ecirc; precisa fazer &eacute; negar
      tudo por padr&atilde;o, e ent&atilde;o liberar o acesso apenas &agrave;s coisas que
      voc&ecirc; realmente precisar.  As regras devem estar dispostas de
      forma a liberar primeiro e ent&atilde;o negar.  A premissa &eacute; que voc&ecirc;
      adicione as regras para o que for liberado, e ent&atilde;o tudo mais &eacute;
      negado. :)</para>
    
    <para>Agora, vamos criar o diret&oacute;rio <filename class="directory">
      /etc/firewall</filename>.  Entre no diret&oacute;rio e edite o arquivo
      <filename>fwrules</filename> como n&oacute;s especificamos no
      <filename>rc.conf</filename>.  Por favor observe que voc&ecirc; pode
      alterar este nome de arquivo para qualquer coisa que deseje.
      Este guia apenas d&aacute; apenas um exemplo de nome de arquivo.</para>
    
    <para>Agora, vamos examinar um arquivo com exemplos de regras de
      firewall, as quais est&atilde;o devidamente comentadas.</para>
    
    <programlisting>
# Define o caminho completo do comando de firewall (assim como no
# /etc/rc.firewall) para facilitar a referencia. Ajuda a tornar o
# script mais simples de ser lido.
fwcmd="/sbin/ipfw"

# For&ccedil;a uma limpeza das regras atuais antes de recarregar.
$fwcmd -f flush

# Desvia todos os pacotes atrav&eacute;s da interface de tunel.
$fwcmd add divert natd all from any to any via tun0

# Libera todas as conex&otilde;es que possuem uma regra din&acirc;mica construida
# para ela, mas nega as conex&otilde;es estabelecidas que n&atilde;o possuirem uma
# regra din&acirc;mica.  Consulte o ipfw(8) para maiores detalhes.
$fwcmd add check-state
$fwcmd add deny tcp from any to any established

# Libera todas as conex&otilde;es do localhost
$fwcmd add allow tcp from me to any out via lo0 setup keep-state
$fwcmd add deny  tcp from me to any out via lo0
$fwcmd add allow ip  from me to any out via lo0 keep-state

# Libera todas as conex&otilde;es iniciadas a partir da minha placa de rede
$fwcmd add allow tcp from me to any out xmit any setup keep-state
$fwcmd add deny  tcp from me to any
$fwcmd add allow ip from me to any out xmit any keep-state

# O acesso de qualquer pessoa na internet esta liberado para os
# seguintes servi&ccedil;os na maquina.  Este exemplo libera especificamente
# conex&otilde;es destinadas ao sshd e a um servidor web.
$fwcmd add allow tcp from any to me dst-port 22,80 in recv any setup keep-state

# Isto envia um RESET para todos os pacotes de ident.
$fwcmd add reset log tcp from any to me 113 in recv any

# Habilita o ICMP: remova o tipo 8 se voc&ecirc; n&atilde;o desejar que 
# seu servidor responda a pings
$fwcmd add allow icmp from any to any icmptypes 0,3,8,11,12,13,14

# Nege todo o restante.
$fwcmd add deny log ip from any to any</programlisting>

    <para>Agora voc&ecirc; tem um firewall completamente funcional o qual
      ir&aacute; permitir conex&otilde;es nas portas 22 e 80 e ir&aacute; logar qualquer
      outra tentativa de conex&atilde;o.  Agora, voc&ecirc; j&aacute; esta apto a rebootar o
      seu equipamento em seguran&ccedil;a e o seu firewall deveria subir
      perfeitamente.  Se voc&ecirc; achar que isto esta incorreto de alguma
      forma ou experimentar algum problema, ou tiver alguma sugest&atilde;o
      para melhorar esta p&aacute;gina, por favor envie-me um email.</para>
    
  </sect1>

  <sect1>
    <title>Perguntas</title>

    <qandaset>
      <qandaentry>
	<question>
	  <para>porque voc&ecirc; esta utilizando o &man.natd.8; e o
	    &man.ipfw.8; quando voc&ecirc; poderia estar utilizando os filtros
	    integrantes do &man.ppp.8;?</para>
	</question>

	<answer>
	  <para>Eu tenho que ser honesto e dizer que n&atilde;o existe
	    nenhuma raz&atilde;o especial para o porque eu estou utilizando o
	    <command>ipfw</command> e o <command>natd</command> ao inv&eacute;s
	    de utilizar o recurso de filtragem nativo do
	    <command>ppp</command>.  Nas discuss&otilde;es que eu tive
	    com outras pessoas sobre este assunto, o consenso parece
	    ser de que enquanto o <command>ipfw</command> &eacute; certamente mais
	    poderoso e mais configur&aacute;vel do que a capacidade nativa de
	    filtragem do <command>ppp</command>, o que ele compensa na
	    funcionalidade perde em na facilidade de se customizar.
	    Uma das raz&otilde;es de porque eu o utilizo &eacute; porque eu
	    prefiro ter a filtragem de pacotes realizada a n&iacute;vel de
	    kernel do que a n&iacute;vel de um programa
	    <literal>userland</literal>.</para>
	</answer>
      </qandaentry>

      <qandaentry>
        <question>
	  <para>Eu recebo mensagens do tipo <errorname>limit 100
	    reached on entry 2800</errorname> e depois disso eu nunca
	    mais vejo entradas de nega&ccedil;&atilde;o no meu log.  O meu firewall
	    continua funcionando ?</para>
        </question>

	<answer>
	  <para>Isto significa somente que a contagem m&aacute;xima de log
	    para esta regra foi atingida.  A regra propriamente dita
	    continua funcionando, mas n&atilde;o ser&aacute; mais logada at&eacute; que
	    voc&ecirc; resete a contagem do log.  Voc&ecirc; pode resetar esta
	    contagem com o comando <command>ipfw resetlog</command>.
	    Alternativamente, voc&ecirc; pode aumentar o limite de log no
	    seu arquivo de configura&ccedil;&atilde;o do kernel com a op&ccedil;&atilde;o
	    <option>IPFIREWALL_VERBOSE_LIMIT</option> como descrito
	    anteriormente.  Voc&ecirc; tamb&eacute;m pode alterar este limite (sem
	    ter que recompilar seu kernel e sem ter que rebootar)
	    utilizando o &man.sysctl.8; para ajustar o valor da
	    vari&aacute;vel net.inet.ip.fw.verbose_limit.</para>
        </answer>
      </qandaentry>

      <qandaentry>
	<question>
	  <para>Se eu estou utilizando internamente um endere&ccedil;o
	  privado, como por exemplo da rede 192.168.0.0, eu posso
	  adicionar uma linha de comando semelhante a <literal>$fwcmd
	  add deny all from any to 192.168.0.0:255.255.0.0 via 
	  tun0</literal> as regras do firewall para prevenir
	  tentativas externas de conex&atilde;o as m&aacute;quinas internas?</para>
	</question>

	<answer>
	  <para>A resposta simples &eacute; n&atilde;o.  A raz&atilde;o para isto &eacute; que o
	    <command>natd</command> est&aacute; fazendo a tradu&ccedil;&atilde;o de endere&ccedil;os
	    para <emphasis>qualquer</emphasis> coisa que esteja sendo 
	    desviada atrav&eacute;s do dispositivo <devicename>tun0</devicename>.  
	    Tanto quanto os pacotes entrantes falar&atilde;o apenas com o IP
	    atribuido dinamicamente e <emphasis>n&atilde;o</emphasis> com a
	    rede interna.  De qualquer forma, observe que voc&ecirc; pode
	    adicionar uma regra semelhante a <literal>$fwcmd add deny
	    all from 192.168.0.4:255.255.0.0 to any via tun0</literal>,
	    ao seu firewall para negar o acesso de um equipamento da
	    sua rede interna a um endere&ccedil;o fora dela.</para>
	</answer>
      </qandaentry>

      <qandaentry>
	<question>
	  <para>Deve haver algo errado.  Eu segui as suas instru&ccedil;&otilde;es a
	    risca e agora estou fechado fora.</para>
        </question>

	<answer>
	  <para>Este tutorial assum que voc&ecirc; est&aacute; executando o
	    <emphasis>userland-ppp</emphasis>, ent&atilde;o o conjunto de
	    regras disponibilizado opera com a interface
	    <devicename>tun0</devicename> , a qual corresponde a
	    primeira conex&atilde;o realizada com o &man.ppp.8; (tamb&eacute;m
	    conhecido como <emphasis>user-ppp</emphasis>).  Conex&otilde;es
	    adicionais ir&atilde;o utilizar <devicename>tun1</devicename>,
	    <devicename>tun2</devicename>, etc.</para>
	  
	  <para>Voc&ecirc; tamb&eacute;m deve observar que o &man.pppd.8; por sua
	    vez utiliza a interface  <devicename>ppp0</devicename>,
	    assim se voc&ecirc; iniciar a conex&atilde;o com o &man.pppd.8; voc&ecirc;
	    precisa subistituir as ocorrencias de <devicename>tun0i
	    </devicename> nas regras por <devicename>ppp0</devicename>.  
	    Uma forma r&aacute;pida de editar as regras do firewall para
	    refletir esta mudan&ccedil;a &eacute; mostrada abaixo.  O arquivo
	    original de regras deve ser backupeado como
	    <filename>fwrules_tun0</filename>.</para>
	  
	  <screen>	    &prompt.user; <userinput>cd /etc/firewall</userinput>
	    /etc/firewall&prompt.user; <userinput>su</userinput>
	    <prompt>Password:</prompt>
	    /etc/firewall&prompt.root; <userinput>mv fwrules fwrules_tun0</userinput>
	    /etc/firewall&prompt.root; <userinput>cat fwrules_tun0 | sed s/tun0/ppp0/g > fwrules</userinput>
	  </screen>

	  <para>Para saber se voc&ecirc; est&aacute; utilizando o &man.ppp.8; ou o
	    &man.pppd.8; voc&ecirc; pode examinar a saida do comando
	    &man.ifconfig.8; quando a conex&atilde;o estiver ativa.  Por
	    exemplo, para uma conex&atilde;o estabelecida com o  &man.pppd.8;
	    voc&ecirc; deve ver algo semelhante a isto (abaixo seguem apenas
	    as linhas relevantes):</para>
	  
	  <screen>	    &prompt.user; <userinput>ifconfig</userinput>
	    <emphasis>(omitido...)</emphasis>
	    ppp0: flags=<replaceable>8051&lt;UP,POINTOPOINT,RUNNING,MULTICAST&gt; mtu 1524</replaceable>
                    inet <replaceable>xxx.xxx.xxx.xxx</replaceable> --&gt; <replaceable>xxx.xxx.xxx.xxx</replaceable> netmask <replaceable>0xff000000</replaceable>
	    <emphasis>(omitido...)</emphasis>
	    </screen>

	  <para>Por outro lado, para uma conex&atilde;o estabelecida com o
	    &man.ppp.8; (<emphasis>user-ppp</emphasis>) voc&ecirc; deve ver
	    alguma coisa semelhante a isto:</para>
	  
	  <screen>	    &prompt.user; <userinput>ifconfig</userinput>
	    <emphasis>(omitido...)</emphasis>
	    ppp0: flags=<replaceable>8010&lt;POINTOPOINT,MULTICAST&gt; mtu 1500</replaceable>
	    <emphasis>(skipped...)</emphasis>
	    tun0: flags=<replaceable>8051&lt;UP,POINTOPOINT,RUNNING,MULTICAST&gt; mtu 1524</replaceable>
	            <emphasis>(IPv6 stuff skipped...)</emphasis>
                    inet <replaceable>xxx.xxx.xxx.xxx</replaceable> --&gt; <replaceable>xxx.xxx.xxx.xxx</replaceable> netmask <replaceable>0xffffff00</replaceable>
                    Opened by PID <replaceable>xxxxx</replaceable>
            <emphasis>(omitido...)</emphasis></screen>
	</answer>
      </qandaentry>
    </qandaset>
  </sect1>
</article>
