<!--
     The FreeBSD Documentation Project

     $FreeBSD: pt_BR.ISO8859-1/books/handbook/install/chapter.sgml,v 1.2 2003/12/12 20:29:49 eksffa Exp $
-->

<chapter id="install">
  <chapterinfo>
    <authorgroup>
      <author>
        <firstname>Jim</firstname>
	<surname>Mock</surname>
	<contrib>Restruturado, reorganizado e parcialmente
	  rescrito por </contrib>
      </author>
    </authorgroup>

    <authorgroup>
      <author>
	<firstname>Randy</firstname>
	<surname>Pratt</surname>
	<contrib>O passeio atrav&eacute;s do sysinstall, imagens da tela, e c&oacute;pia
	 geral por </contrib>
      </author>
    </authorgroup>
    <!-- Janeiro 2000 -->
  </chapterinfo>

  <title>Instalando FreeBSD</title>

  <sect1 id="install-synopsis">
    <title>Sin&oacute;pse</title>

    <indexterm><primary>instala&ccedil;&atilde;o</primary></indexterm>

    <para>FreeBSD &eacute; composto de um programa de f&aacute;cil utiliza&ccedil;&atilde;o,
	em modo texto, chamado de <application>sysinstall</application>.
	Este &eacute; o programa padr&atilde;o de instala&ccedil;&atilde;o para o FreeBSD, apesar
	dos distribuidores terem liberdade para oferecer seu
	pr&oacute;prio programa de instala&ccedil;&atilde;o, se desejado.  Este cap&iacute;tulo
	descreve a utiliza&ccedil;&atilde;o do <application>sysinstall</application>
	para realizar a instala&ccedil;&atilde;o do FreeBSD.</para>

    <para>Ap&oacute;s a leitura deste cap&iacute;tulo, voc&ecirc; saber&aacute;:</para>

    <itemizedlist>
      <listitem>
	<para>Como criar os discos de instala&ccedil;&atilde;o do FreeBSD.</para>
      </listitem>
      
      <listitem>
	<para>Como FreeBSD se refere e faz as subdivis&otilde;es dos discos r&iacute;gidos.</para>
      </listitem>

      <listitem>
	<para>Como iniciar o <application>sysinstall</application>.</para>
      </listitem>

      <listitem>
	<para>As perguntas que o <application>sysinstall</application> far&aacute;
	  durante sua utiliza&ccedil;&atilde;o, o que cada uma significa, e como
	  respond&ecirc;-las.</para>
      </listitem>
    </itemizedlist>

    <para>Antes de ler este cap&iacute;tulo, voc&ecirc; &eacute; aconselhado:</para>

    <itemizedlist>
      <listitem>
	<para>Ler a lista de <foreignphrase>hardware</foreignphrase> suportado
	  que acompanha a vers&atilde;o do FreeBSD que voc&ecirc; est&aacute; instalando, e verificar
	  se os seus equipamentos s&atilde;o suportados.</para>
      </listitem>
    </itemizedlist>

    <note>
      <para>Em geral, estas instru&ccedil;&otilde;es de instala&ccedil;&atilde;o s&atilde;o escritas
	para computadores de arquitetura &i386; (<quote>compat&iacute;veis PC
	</quote>).  Onde necess&aacute;rio, ser&atilde;o listadas instru&ccedil;&otilde;es 
	espec&iacute;ficas para outras plataformas (por exemplo, Alpha).
	Embora este guia seja mantido o mais atualizado o poss&iacute;vel, 
	poder&atilde;o ser encontradas algumas pequenas diferen&ccedil;as entre
	a aplica&ccedil;&atilde;o instaladora e o que &eacute; apresentado neste
	documento.  &Eacute; aconselh&aacute;vel que este cap&iacute;tulo seja utilizado
	como um guia geral ao inv&eacute;s de um rigoroso passo a passo 
	de instala&ccedil;&atilde;o.</para>
    </note>

  </sect1>

  <sect1 id="install-pre">
    <title>Tarefas de pr&eacute;-instala&ccedil;&atilde;o</title>

    <sect2 id="install-inventory">
      <title>Invent&aacute;rio de seu computador</title>

      <para>Antes de instalar o FreeBSD, &eacute; aconselh&aacute;vel tentar levantar
	todas as informa&ccedil;&otilde;es sobre os componentes presentes em
	seu computador.  As rotinas de instala&ccedil;&atilde;o do FreeBSD mostrar&atilde;o
	estes componentes (discos r&iacute;gidos, placas de rede, dispositivos
	de CDROM, e v&aacute;rios outros) com seus respectivos n&uacute;meros de modelo
	e fabrica&ccedil;&atilde;o.  O FreeBSD tentar&aacute; tamb&eacute;m determinar a
	configura&ccedil;&atilde;o correta para estes dispositivos, o que inclui
	informa&ccedil;&otilde;es sobre IRQ e utiliza&ccedil;&atilde;o de endere&ccedil;os de E/S.  Devido
	aos caprichos de alguns equipamentos para PC, esse processo
	n&atilde;o &eacute; sempre realizado com sucesso, e pode ser necess&aacute;rio
	corrigir as defini&ccedil;&otilde;es do FreeBSD na sua configura&ccedil;&atilde;o.</para>

      <para>Caso tenha um outro sistema operacional instalado, como
	&windows; ou Linux, &eacute; uma boa id&eacute;ia utilizar os recursos
	oferecidos por estes sistemas para saber como seu equipamento
	j&aacute; est&aacute; configurado.  Caso n&atilde;o esteja certo das configura&ccedil;&otilde;es
	de alguma placa de expans&atilde;o, pode ser poss&iacute;vel encontra-las
	impressas na pr&oacute;pria placa. Valores populares para endere&ccedil;os
	de interrup&ccedil;&atilde;o (IRQ) s&atilde;o 3, 5 e 7, e o endere&ccedil;amento de E/S
	normalmente &eacute; definido em n&uacute;meros hexadecimais, como
	0x330.</para>

      <para>Recomendamos que voc&ecirc; imprima ou escreva estas informa&ccedil;&otilde;es
	antes de iniciar o processo de instala&ccedil;&atilde;o do FreeBSD.
	A utiliza&ccedil;&atilde;o de uma tabela, como abaixo, pode ajudar:</para>

      <table pgwide="1" frame="none">
	<title>Modelo de Invent&aacute;rio de Dispositivos</title>

	<tgroup cols="4">
          <colspec colwidth="2*">
          <colspec colwidth="1*">
          <colspec colwidth="1*">
          <colspec colwidth="4*">
	  <thead>
	    <row>
	      <entry>Nome do dispositivo</entry>

	      <entry>IRQ</entry>

	      <entry>Endere&ccedil;o(s) de E/S</entry>

	      <entry>Notas</entry>
	    </row>
	  </thead>

	  <tbody>
	    <row>
	      <entry>Primeiro disco r&iacute;gido</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>Disco de 40&nbsp;GB, marca Seagate, primeira IDE prim&aacute;ria</entry>
	    </row>

	    <row>
	      <entry>CDROM</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>Primeira IDE secund&aacute;ria</entry>
	    </row>

	    <row>
	      <entry>Segundo disco r&iacute;gido</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>Disco de 20&nbsp;GB, marca IBM, segunda IDE prim&aacute;ria</entry>
	    </row>

	    <row>
	      <entry>Primeira controladora IDE</entry>

	      <entry>14</entry>

	      <entry>0x1f0</entry>

	      <entry></entry>
	    </row>

	    <row>
	      <entry>Placa de rede</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>&intel; 10/100</entry>
	    </row>

	    <row>
	      <entry>Modem</entry>

	      <entry>N/A</entry>

	      <entry>N/A</entry>

	      <entry>&tm.3com; 56K faxmodem, na COM1</entry>
	    </row>

	    <row>
	      <entry>&hellip;</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>
    </sect2>

    <sect2>
      <title>Fa&ccedil;a c&oacute;pias de seguran&ccedil;a de seus dados</title>
      
      <para>Caso a esta&ccedil;&atilde;o onde voc&ecirc; instalar&aacute; o FreeBSD contenha
	dados relevantes, garanta que voc&ecirc; tenha c&oacute;pias de
	seguran&ccedil;a (<foreignphrase>backup</foreignphrase>) destes dados,
	e que as c&oacute;pias de seguran&ccedil;a tenham sido testadas antes
	de iniciar a instala&ccedil;&atilde;o do FreeBSD.  A rotina de instala&ccedil;&atilde;o
	do FreeBSD pedir&aacute; confirma&ccedil;&atilde;o antes de escrever
	quaisquer dados no seu disco, mas uma vez iniciado, este
	processo n&atilde;o pode ser desfeito.</para>
    </sect2>

    <sect2 id="install-where">
      <title>Decida onde instalar o FreeBSD</title>

      <para>Se voc&ecirc; deseja que o FreeBSD utilize todo o seu disco r&iacute;gido,
	ent&atilde;o n&atilde;o h&aacute; com o que se preocupar neste momento &mdash; voc&ecirc; pode
	pular esta se&ccedil;&atilde;o.</para>

      <para>Contudo, se voc&ecirc; precisa que o FreeBSD co-exista com outro
	sistema operacional, ent&atilde;o &eacute; necess&aacute;rio uma certa compreens&atilde;o
	sobre como os dados s&atilde;o dispostos em disco, e como isso pode
	afetar voc&ecirc;.</para>

      <sect3 id="install-where-i386">
	<title>Disposi&ccedil;&otilde;es de disco no &i386;</title>

      <para>Um disco de PC pode ser dividido em partes separadas.  Tais
	partes s&atilde;o chamadas de <firstterm>parti&ccedil;&otilde;es</firstterm>.  A forma
	como o PC &eacute; projetado possibilita que apenas quatro parti&ccedil;&otilde;es
	sejam suportadas por disco.  Estas parti&ccedil;&otilde;es s&atilde;o chamadas de
	<firstterm>parti&ccedil;&otilde;es prim&aacute;rias</firstterm>.  Como paliativo
	para esta limita&ccedil;&atilde;o foi criado um novo tipo de parti&ccedil;&otilde;es, chamado
	de <firstterm>parti&ccedil;&otilde;es extendidas</firstterm>.  Um disco pode
	conter apenas uma parti&ccedil;&atilde;o extendida.  Parti&ccedil;&otilde;es especiais, chamadas
	de <firstterm>parti&ccedil;&otilde;es l&oacute;gicas</firstterm> podem ser criadas
	dentro destas parti&ccedil;&otilde;es extendidas.</para>

      <para>Cada parti&ccedil;&atilde;o possui um identificador &uacute;nico, chamado de <firstterm>
	partition ID</firstterm>, que &eacute; um
	n&uacute;mero utilizado para identificar o tipo de dado naquela parti&ccedil;&atilde;o.
	Parti&ccedil;&otilde;es FreeBSD tem o ID de identifica&ccedil;&atilde;o n&uacute;mero <literal>165
	</literal>.</para>

      <para>De forma geral, cada sistema operacional utilizado identificar&aacute;
	as parti&ccedil;&otilde;es de forma particular.  Por exemplo, DOS e seus descendentes
	como &windows; atribuem a cada parti&ccedil;&atilde;o prim&aacute;ria e l&oacute;gica uma
	<firstterm>letra de dispositivo</firstterm>, come&ccedil;ando a partir do
	<devicename>C:</devicename>.</para>

      <para>FreeBSD deve obrigat&oacute;riamente ser instalado em uma parti&ccedil;&atilde;o
	prim&aacute;ria.  FreeBSD pode manter todos seus dados, incluindo qualquer
	arquivo que voc&ecirc; crie nesta &uacute;nica parti&ccedil;&atilde;o.  Contudo, se voc&ecirc;
	possuir m&uacute;ltiplos discos, voc&ecirc; pode criar uma parti&ccedil;&atilde;o
	FreeBSD em cada um deles, ou apenas em alguns.  Quando
	instalar o FreeBSD, ao menos uma parti&ccedil;&atilde;o deve estar
	dispon&iacute;vel.  Pode ser uma parti&ccedil;&atilde;o vazia, que voc&ecirc; preparou,
	ou ent&atilde;o pode ser uma parti&ccedil;&atilde;o j&aacute; existente contendo
	dados que n&atilde;o s&atilde;o mais necess&aacute;rios.</para>

      <para>Caso esteja utilizando todas as parti&ccedil;&otilde;es prim&aacute;rias
	de todos seus discos, ent&atilde;o ser&aacute; necess&aacute;rio liberar uma
	delas para o FreeBSD, utilizando as ferramentas
	pelo sistema operacional que voc&ecirc; utiliza (por exemplo, 
	<command>fdisk</command> no DOS ou &windows;).</para>

      <para>Se voc&ecirc; tem uma parti&ccedil;&atilde;o sobressalente, pode 
	utiliza-la. Contudo, pode ser necess&aacute;rio modificar
	primeiro uma ou mais das suas parti&ccedil;&otilde;es atuais.</para>

      <para>A instala&ccedil;&atilde;o m&iacute;nima do FreeBSD ocupa apenas 100&nbsp;MB de espa&ccedil;o
	em disco.  Contudo, esta &eacute; uma instala&ccedil;&atilde;o <emphasis>extremamente</emphasis>
	m&iacute;nima, n&atilde;o deixando quase espa&ccedil;o algum para seus pr&oacute;prios
	arquivos.  Um valor m&iacute;nimo mais realista &eacute; 250&nbsp;MB sem ambiente
	gr&aacute;fico, ou 350 MB (ou at&eacute; mais) se deseja o ambiente gr&aacute;fico.
	Se voc&ecirc; planeja instalar muitas aplica&ccedil;&otilde;es de terceiros
	tamb&eacute;m, ent&atilde;o ser&aacute; necess&aacute;rio mais espa&ccedil;o.</para>

      <para>Voc&ecirc; pode utilizar alguma ferramenta comercial como <application>
	&partitionmagic;</application> para redimensionar suas
	parti&ccedil;&otilde;es de forma a criar algum espa&ccedil;o para o FreeBSD.  O
	diret&oacute;rio <filename>tools</filename> no CDROM cont&eacute;m dois programas
	gratu&iacute;tos que podem realizar esta tarefa, chamados de
	<application>FIPS</application> e
	<application>PResizer</application>.  
	<application>FIPS</application>,
	<application>PResizer</application>, e
	<application>&partitionmagic;</application> pode redimensionar
	parti&ccedil;&otilde;es <acronym>FAT16</acronym> e <acronym>FAT32</acronym>
	&mdash; usadas do &ms-dos; ao &windows; ME.
	<application>&partitionmagic;</application> &eacute; a &uacute;nica ferramenta
	capaz de redimensionar sistema de arquivos <acronym>NTFS</acronym>.
	Documenta&ccedil;&otilde;es sobre ambas aplica&ccedil;&otilde;es est&atilde;o dispon&iacute;veis no mesmo
	diret&oacute;rio.</para>

      <warning>
	<para>: O uso incorreto destas ferramentas podem apagar os dados
	  em seu disco.  Garanta que existam c&oacute;pias de seguran&ccedil;as recentes
	  e funcionais antes de utiliza-las.</para>
      </warning>

      <example>
	<title>Utilizando como est&aacute;, uma parti&ccedil;&atilde;o j&aacute; existente</title>

	<para>Suponha que voc&ecirc; tenha um computador com um &uacute;nico
	disco r&iacute;gido de 4&nbsp;GB que j&aacute; tem uma vers&atilde;o do &windows;
	instalada, e voc&ecirc; separou separou o disco em dois dispositivos,
	o dispositivo <devicename>C:</devicename> e o <devicename>D:</devicename>
	cada qual com 2 GB de tamanho.  Voc&ecirc; disp&otilde;e de 1GB de dados no
	<devicename>C:</devicename> e 0.5&nbsp;GB de dados no
	<devicename>D:</devicename>.</para>

	<para>Isto significa que seu disco tem duas parti&ccedil;&otilde;es,
	uma por letra de dispositivo.  Voc&ecirc; pode copiar todos os dados
	atuais da <devicename>D:</devicename> na <devicename>C:</devicename>
	o que liberar&aacute; a segunda parti&ccedil;&atilde;o, que estar&aacute; pronta
	para o FreeBSD.</para>
      </example>

      <example>
	<title>Redimensionando uma parti&ccedil;&atilde;o existente</title>

	<para>Suponha que voc&ecirc; tem um computador com um &uacute;nico disco	
	r&iacute;gido de 4&nbsp;GB que j&aacute; tem uma vers&atilde;o do &windows; instalada.
	Ao instalar o &windows; voc&ecirc; criou uma &uacute;nica parti&ccedil;&atilde;o,
	atribuindo ao seu dispositivo <devicename>C:</devicename> o
	tamanho de 4&nbsp;G.  Atualmente tem 1.5GB de espa&ccedil;o em uso
	e voc&ecirc; deseja alocar 2 GB de espa&ccedil;o para o FreeBSD.</para>

	<para>Para instalar o FreeBSD ser&aacute; preciso:</para>

	<orderedlist>
	  <listitem>
	    <para>Fazer c&oacute;pia de seguran&ccedil;a dos dados de seu &windows; e reinstalar
		o &windows; definindo uma parti&ccedil;&atilde;o de 2 GB de espa&ccedil;o no
		momento da instala&ccedil;&atilde;o,</para>
	  </listitem>

	  <listitem>
	    <para>Utilizar uma das ferramentas como o <application>&partitionmagic;
		</application>, descrito anteriormente para redimensionar sua
		parti&ccedil;&atilde;o &windows;.</para>
	  </listitem>
	</orderedlist>
      </example>

      </sect3>

      <sect3>
	<title>Disposi&ccedil;&otilde;es de Disco no Alpha</title>

	<indexterm><primary>Alpha</primary></indexterm>

	<para>Ser&aacute; necess&aacute;rio um disco dedicado para o FreeBSD
	  em um Alpha.  N&atilde;o &eacute; poss&iacute;vel compartilhar o disco
	  com outro sistema operacional hoje.  Dependendo da 
	  m&aacute;quina Alpha espec&iacute;fica que voc&ecirc; tem em m&atilde;os, o
	  disco pode ser SCSI ou IDE, com tanto que sua
	  m&aacute;quina seja capaz de inicializar por meio
	  deste.</para>

	<para>Seguindo as conven&ccedil;&otilde;es do manual da Digital / Compaq
	  todas as entradas referentes ao SRM ser&atilde;o apresentadas
	  em letras mai&uacute;sculas.  O SRM n&atilde;o faz distin&ccedil;&atilde;o entre
	  mai&uacute;sculas e min&uacute;sculas.</para>

	<para>Para encontrar os nomes e tipos de discos
	  dispon&iacute;veis na m&aacute;quina, use o comando <literal>SHOW DEVICE
	  </literal> na tela do console SRM:</para>

	<screen>&gt;&gt;&gt;<userinput>SHOW DEVICE</userinput>
dka0.0.0.4.0		DKA0           TOSHIBA CD-ROM XM-57	3476
dkc0.0.0.1009.0		DKC0                       RZ1BB-BS		0658
dkc100.1.0.1009.0		DKC100             SEAGATE ST34501W 	0015
dva0.0.0.0.1		DVA0
ewa0.0.0.3.0		EWA0              00-00-F8-75-6D-01
pkc0.7.0.1009.0		PKC0                  SCSI Bus ID 7		5.27
pqa0.0.0.4.0		PQA0                       PCI EIDE
pqb0.0.1.4.0		PQB0                       PCI EIDE</screen>

	<para>Este exemplo &eacute; de uma <foreignphrase>Digital Personal
	  Workstation</foreignphrase> modelo 433au e apresenta
	  tr&ecirc;s discos ligados na esta&ccedil;&atilde;o.  O primeiro &eacute; um CDROM chamado
	  de <devicename>DKA0</devicename> e os outros dois s&atilde;o 
	  discos r&iacute;gidos, e s&atilde;o chamados <devicename>DKC0</devicename> e
	  <devicename>DKC100</devicename> respectivamente.</para>

	<para>Discos cujos nomes est&atilde;o dispostos no formato <devicename>DKx</devicename>
	  s&atilde;o discos SCSI.  Por exemplo, <devicename>DKA100</devicename>
	  se refere ao disco SCSI com ID SCSI n&uacute;mero 1 no primeiro barramento SCSI
	  (A), enquanto <devicename>DKC300</devicename> se refere a um disco SCSI
	  com ID SCSI n&uacute;mero 3 no terceiro barramento SCSI (C).  O dispositivo
	  <devicename>
	  PKx</devicename> se refere &agrave; controladora SCSI.  Como foi visto
	  na sa&iacute;da do comando <literal>SHOW DEVICE</literal>, dispositivos de
	  CDROM SCSI s&atilde;o tratados como disco r&iacute;gido SCSI qualquer.</para>

	<para>Discos IDE tem nomes similares a <devicename>DQx</devicename>,
	  enquanto <devicename>PQx</devicename> &eacute; a controladora IDE
	  associada.</para>

      </sect3>
    </sect2>

    <sect2>
      <title>Obtenha detalhes de configura&ccedil;&atilde;o da interface de rede</title>

      <para>Caso voc&ecirc; pretenda se conectar em rede como parte do processo
	de instala&ccedil;&atilde;o de seu FreeBSD (por exemplo, caso a realiza&ccedil;&atilde;o
	seja feita a partir de um s&iacute;tio FTP ou servidor NFS), ent&atilde;o 
	&eacute; necess&aacute;rio conhecer a configura&ccedil;&atilde;o de sua rede.  Voc&ecirc;
	ser&aacute; indagado por estas informa&ccedil;&otilde;es durante a instala&ccedil;&atilde;o do FreeBSD,
	de forma que o sistema possa se conectar &agrave; rede e concluir
	a instala&ccedil;&atilde;o.</para>

      <sect3>
	<title>Conectando-se a uma rede <literal>Ethernet</literal> ou um modem DSL ou cabo.</title>

	<para>Se voc&ecirc; se conecta &agrave; uma rede Ethernet, ou tem uma conex&atilde;o
	Internet com uma placa de rede via cabo ou DSL, ent&atilde;o ser&aacute; necess&aacute;rio
	saber as seguintes informa&ccedil;&otilde;es:</para>

	<orderedlist>
	  <listitem>
	    <para>Endere&ccedil;o IP</para>
	  </listitem>

	  <listitem>
	    <para>Endere&ccedil;o IP do <foreignphrase>gateway</foreignphrase> padr&atilde;o</para>
	  </listitem>

	  <listitem>
	    <para>Nome da esta&ccedil;&atilde;o (<literal>hostname</literal>)</para>
	  </listitem>

	  <listitem>
	    <para>Endere&ccedil;o IP do servidor DNS</para>
	  </listitem>

	  <listitem>
	    <para>M&aacute;scara de subrede</para>
	  </listitem>
	</orderedlist>

	<para>Caso n&atilde;o saiba tais informa&ccedil;&otilde;es, pergunte ao seu
	  administrador de sistemas ou provedor de servi&ccedil;os.  Eles
	  podem dizer que tais informa&ccedil;&otilde;es s&atilde;o atribu&iacute;das
	  automaticamente, usando <firstterm>DHCP</firstterm>.
	  Se for o caso, anote isto.</para>
      </sect3>

      <sect3>
	<title>Conectando-se por meio de um modem</title>

	<para>Se voc&ecirc; disca para um provedor de servi&ccedil;os Internet (<acronym>
	  ISP</acronym>) utilizando um modem convencional, ainda &eacute;
	  poss&iacute;vel instalar o FreeBSD na internet, contudo isso demandar&aacute;
	  algum tempo a mais.</para>

	<para>Ser&aacute; necess&aacute;rio saber:</para>

	<orderedlist>
	  <listitem>
	    <para>O n&uacute;mero de telefone do seu ISP</para>
	  </listitem>

	  <listitem>
	    <para>A porta COM onde seu modem est&aacute; ligado</para>
	  </listitem>

	  <listitem>
	    <para>Usu&aacute;rio e senha da conta no seu provedor</para>
	  </listitem>
	</orderedlist>
      </sect3>
    </sect2>
    <sect2>
      <title>Verifique a Errata do FreeBSD</title>
      
      <para>Mesmo considerando que o projeto FreeBSD se esmera para
	garantir que cada vers&atilde;o do FreeBSD seja t&atilde;o est&aacute;vel
	quanto for poss&iacute;vel, falhas ocasionalmente podem
	abalar este processo.  Em situa&ccedil;&otilde;es extremamente raras
	tais falhas podem afetar o processo de instala&ccedil;&atilde;o do
	FreeBSD.  Conforme estes problemas s&atilde;o descobertos
	e corrigidos, eles s&atilde;o anotados na <ulink
	url="http://www.freebsd.org/releases/&rel.current;R/errata.html">
	Errata do FreeBSD</ulink>, que pode ser encontrada no s&iacute;tio WWW
	do FreeBSD.  Voc&ecirc; deve verificar esta errata antes de iniciar a
	instala&ccedil;&atilde;o para saber se existem problemas com os quais voc&ecirc;
	deve ficar atento.</para>

      <para>Informa&ccedil;&otilde;es sobre todas as vers&otilde;es, incluindo
	a errata para cada uma, podem ser encontradas na
	se&ccedil;&atilde;o de <ulink
	url="../../../../releases/index.html">informa&ccedil;&atilde;o de
	vers&otilde;es</ulink> do 
	<ulink
	  url="../../../../index.html">s&iacute;tio WWW do FreeBSD</ulink>.</para>
    </sect2>

    <sect2>
      <title>Ontenha os arquivos de instala&ccedil;&atilde;o do FreeBSD</title>

      <para>O processo de instala&ccedil;&atilde;o do FreeBSD pode instalar o sistema
	&agrave; partir de arquivos armazenados nos seguintes locais:</para>

      <itemizedlist>
	<title>M&iacute;dia Local</title>
	
	<listitem>
	  <para>Um CDROM ou DVD</para>
	</listitem>

	<listitem>
	  <para>Uma parti&ccedil;&atilde;o DOS no mesmo computador</para>
	</listitem>

	<listitem>
	  <para>Fita SCSI ou QIC</para>
	</listitem>

	<listitem>
	  <para>Disquetes</para>
	</listitem>
      </itemizedlist>

      <itemizedlist>
	<title>Rede</title>

	<listitem>
	  <para>S&iacute;tio FTP atr&aacute;s de um firewall, ou usando um <foreignphrase>
	   proxy</foreignphrase> HTTP, se necess&aacute;rio</para>
	</listitem>

	<listitem>
	  <para>Servidor NFS</para>
	</listitem>

	<listitem>
	  <para>Conex&atilde;o paralela ou serial dedicada</para>
	</listitem>
      </itemizedlist>

      <para>Caso tenha adquirido FreeBSD em CD ou DVD, ent&atilde;o
	voc&ecirc; j&aacute; tem tudo que precisa, e pode pular para a pr&oacute;xima
	se&ccedil;&atilde;o (<link linkend="install-floppies">Preparando a m&iacute;dia
	de inicializa&ccedil;&atilde;o (<foreignphrase>Boot</foreignphrase>)</link>).</para>

      <para>Caso n&atilde;o tenha obtivo os arquivos de instala&ccedil;&atilde;o do FreeBSD,
	voc&ecirc; pode se adiantar para <xref linkend="install-diff-media">
	que explica como preparar o FreeBSD para a instala&ccedil;&atilde;o
	por qualquer das m&iacute;dias acima citadas.  Ap&oacute;s a leitura
	desta se&ccedil;&atilde;o, volte a este ponto e leia 
	<xref linkend="install-floppies">.</para>
    </sect2>

    <sect2 id="install-floppies">
      <title>Preparando a m&iacute;dia de inicializa&ccedil;&atilde;o (<foreignphrase>Boot</foreignphrase>)</title>
      
      <para>O processo de instala&ccedil;&agrave;o do FreeBSD come&ccedil;a ao iniciar o
	computador (dar <foreignphrase>boot</foreignphrase>) com
	o instalador do sistema ( n&atilde;o &eacute; um programa para
	ser executado a partir de outro sistema operacional ).  O
	computador normalmente &eacute; inicializado a partir do sistema
	operacional que j&aacute; est&aacute; instalado em seu disco, mas tamb&eacute;m
	&eacute; poss&iacute;vel configurar o sistema de modo a fazer uso de um disquete
	<quote>inicializ&aacute;vel</quote>.  Os computadores mais recentes
	podem ser inicializados &agrave; partir de um CD do FreeBSD no dispositivo de
	de CDROM.</para>

      <tip>
	<para>Caso tenha o FreeBSD em CDROM ou DVD (indiferentemente
	se voc&ecirc; comprou o disco ou o fez manualmente), e seu computador
	permite a inicializa&ccedil;&atilde;o por estes dispositivos (normalmente
	a op&ccedil;&atilde;o no <acronym>BIOS</acronym> chamada de <quote>Boot Order</quote>
	ou similar), ent&atilde;o voc&ecirc; pode pular esta se&ccedil;&atilde;o. As imagens de CDROM
	e DVD do FreeBSD s&atilde;o inicializ&aacute;veis (<quote>boot&aacute;veis</quote>) e 
	podem ser utilizadas para instalar o FreeBSD sem qualquer 
	outro procedimento especial.</para>
      </tip>
    
      <para>Para criar disquetes de inicializa&ccedil;&atilde;o, siga os seguintes passos:</para>

      <procedure>
	<step>
	  <title>Adquira as imagens de disquetes de inicializa&ccedil;&atilde;o</title>
	  
	  <para>Os discos de inicializa&ccedil;&atilde;o est&atilde;o dispon&iacute;veis a partir
	    de sua m&iacute;dia de instala&ccedil;&atilde;o, no diret&oacute;rio <filename>floppies/</filename>
	    e podem tamb&eacute;m ser baixadas &agrave; partir do <ulink
	    url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/&rel.current;-RELEASE/floppies/">
	    diret&oacute;rio de imagens de disquetes</ulink> para a aquitetura &i386; e
	    a partir do <ulink
	    url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/alpha/&rel.current;-RELEASE/floppies/">
	    diret&oacute;rio de imagens de disquetes</ulink> para a aquitetura Alpha.</para>

	  <para>As imagens de disquete tem a extens&atilde;o <filename>.flp</filename>.
		O diret&oacute;rio <filename>floppies/</filename> tem uma s&eacute;rie de imagens
		distintas, e as que voc&ecirc; vai precisar usar dependem da vers&atilde;o do
		FreeBSD que voc&ecirc; pretende instalar, e em alguns casos, dos
		equipamentos onde voc&ecirc; ir&aacute; realizar a instala&ccedil;&atilde;o.  Na maioria
		dos casos ser&atilde;o necess&aacute;rias apenas duas imagens, <filename>kern.flp</filename>
		e <filename>mfsroot.flp</filename>.  Alguns dispositivos de controle
		adicionais poder&atilde;o ser necess&aacute;rios em alguns sistemas.  Estes
		dispositivos est&atilde;o dispon&iacute;veis na imagem <filename>drivers.flp</filename>.
		Verifique o arquivo <filename>README.TXT</filename> no mesmo
		diret&oacute;rio para obter as informa&ccedil;&otilde;es mais atualizadas sobre
		estas imagens de disquetes.</para>

	  <important>
	    <para>O programa FTP que voc&ecirc; for utilizar deve estar ativo
		em <emphasis>modo bin&aacute;rio</emphasis> no momento de baixar
		as imagens de disquete da Internet.  Alguns navegadores
		WWW conhecidamente utilizam modo texto <emphasis>text</emphasis>
		(ou <emphasis>ASCII</emphasis>), o que se tornar&aacute; claro
		quando perceber que n&atilde;o pode inicializar o sistema por meio
		destes discos.</para>
	  </important>
	</step>

	<step>
	  <title>Preparando os disquetes</title>
	  
	  <para>&Eacute; necess&aacute;rio preparar um disquete por imagem
	    que voc&ecirc; baixou da Internet.  &Eacute; imperativo que tais
	    discos estejam livres de defeitos.  A melhor maneira
	    de tirar isso a limpo &eacute; formatando os discos.  N&atilde;o
	    confie em disquetes pr&eacute;-formatados.  O utilit&aacute;rio
	    de formata&ccedil;&atilde;o do &windows; n&atilde;o informar&aacute; sobre a
	    presen&ccedil;a de blocos defeituosos no disquete, esta
	    ferramenta apenas os marca como <quote>bad</quote>
	    (defeituoso) e os ignora, portanto n&atilde;o confie
	    nela tamb&eacute;m.  &Eacute; aconselhado utilizar disquetes novos
	    caso esta seja sua op&ccedil;&atilde;o de instala&ccedil;&atilde;o.</para>

	  <important>
	    <para>Ao instalar o FreeBSD, se o programa de instala&ccedil;&atilde;o
	      travar, congelar ou falhar, uma das primeiras coisas
	      &agrave; se suspeitar s&atilde;o os disquetes.  Grave as imagens
	      em um novo disquete e inicie o processo de
	      instala&ccedil;&atilde;o novamente.</para>
	  </important>
	</step>

	<step>
	  <title>Gravando as imagens nos disquetes</title>

	  <para>Os arquivos <filename>.flp</filename> <emphasis>
	    n&atilde;o</emphasis> s&atilde;o arquivos comuns os quais basta
	    copi&aacute;-los para o disco.  S&atilde;o imagens do conte&uacute;do completo
	    do disco.  Isto significa que voc&ecirc; <emphasis>n&atilde;o pode
	    </emphasis> apenas copiar os arquivos de um disco para
	    outro.  Ao inv&eacute;s disso &eacute; necess&aacute;rio utilizar ferramentas
	    espec&iacute;ficas para escrever as imagens diretamente no 
	    disco.</para>

	  <indexterm><primary>DOS</primary></indexterm>
	  <para>Caso esteja criando os disquetes a partir de um computador
	   que roda &ms-dos;/&windows;, disponibilizamos uma ferramenta 
	   que faz este servi&ccedil;o, chamada de <command>fdimage</command>.</para>

	  <para>Caso esteja utilizando as imagens de disquetes dispon&iacute;veis
	    no CDROM, e seu dispositivo de CDROM tem a letra <devicename>E:
	    </devicename>, basta executar este comando:</para>

	  <screen><prompt>E:\&gt;</prompt> <userinput>tools\fdimage floppies\kern.flp A:</userinput></screen>

	  <para>Repita este comando para cada imagem <filename>.flp</filename>
	    trocando o disquete a cada vez, e garantindo que cada um
	    esteja sendo rotulado com o nome da imagem que acabou de ser utilizada.
	    Ajuste a linha de comando conforme necess&aacute;rio, dependendo onde as
	    imagens <filename>.flp</filename> est&atilde;o localizadas.  Caso voc&ecirc;
	    n&atilde;o disponha do CDROM, o programa <command>fdimage</command> pode ser baixado
	    da Internet &agrave; partir do <ulink
	    url="ftp://ftp.FreeBSD.org/pub/FreeBSD/tools/">diret&oacute;rio
	    <filename class="directory">tools</filename></ulink> no s&iacute;tio FTP do FreeBSD.</para>
	  
	  <para>Caso esteja gravando os disquetes a partir de um sistema &unix; (como
	    um outro sistema FreeBSD por exemplo) pode utilizar o comando &man.dd.1;
	    para gravar a imagem. No FreeBSD bastaria executar:</para>
	  
	  <screen>&prompt.root; <userinput>dd if=kern.flp of=/dev/fd0</userinput></screen>

	  <para>No FreeBSD, <filename>/dev/fd0</filename> se refere ao
	    primeiro dispositivo de disquete (o <devicename>A:</devicename>).
	    <filename>/dev/fd1</filename> seria o dispositivo 
	    <devicename>B:</devicename> e assim sucetivamente.  Outras variantes &unix;
	    podem ter nomes distintos para os dispositivos de disquetes, e ser&aacute; necess&aacute;rio
	    verificar a documenta&ccedil;&atilde;o do sistema conforme for necess&aacute;rio.</para>
	</step>
      </procedure>

      <para>Agora voc&ecirc; est&aacute; pronto para iniciar a instala&ccedil;&atilde;o do FreeBSD.</para>
    </sect2>
  </sect1>

  <sect1 id="install-start">
    <title>Iniciando a instala&ccedil;&atilde;o</title>

    <important>
      <para>Por padr&atilde;o, o programa de instala&ccedil;&atilde;o n&atilde;o far&aacute; qualquer modifica&ccedil;&atilde;o
	em seus discos at&eacute; que voc&ecirc; veja a seguinte mensagem:</para>

      <literallayout class="monospaced">Last Chance: Are you SURE you want continue the installation?

If you're running this on a disk with data you wish to save then WE
STRONGLY ENCOURAGE YOU TO MAKE PROPER BACKUPS before proceeding!

We can take no responsibility for lost disk contents!</literallayout>

      <para>A instala&ccedil;&atilde;o pode ser interrompida a qualquer instante,
	antes desta advert&ecirc;ncia final, sem modificar qualquer conte&uacute;do em
	seu disco r&iacute;gido.  Se voc&ecirc; estiver em d&uacute;vida sobre ter configurado
	algo incorretamente, pode simplesmente desligar o computador
	antes deste ponto, e dano algum ser&aacute; causado.</para>
    </important>

    <sect2 id="install-starting">
      <title>Booting</title>

      <sect3 id="install-starting-i386">
        <title>Processo de inicializa&ccedil;ao no &i386;</title>

      <procedure>
	<step>
	  <para>Inicie com seu computador desligado.</para>
	</step>

	<step>
	  <para>Ligue o computador.  Durate sua inicializa&ccedil;&atilde;o ele mostrar&aacute;
	    uma op&ccedil;&atilde;o para entrar no menu de configura&ccedil;&atilde;o do sistema, ou
	    o <acronym>BIOS</acronym>, normalmente conseguido ao utilizar
	    teclas como <keycap>F2</keycap>, <keycap>F10</keycap>,
	    <keycap>Del, </keycap>ou
	    <keycombo action="simul">
	      <keycap>Alt</keycap>
	      <keycap>S</keycap>
	    </keycombo>.  Utilize o conjunto de teclas que for indicado na tela.
	    Em alguns casos o computador poder&aacute; exibir uma tela gr&aacute;fica ao
	    iniciar.  Normalmente basta pressionar <keycap>Esc</keycap> para
	    eliminar a inagem gr&aacute;fica e permitir que voc&ecirc; visualize as mensagens
	    necess&aacute;rias.</para>
	</step>

	<step>
	  <para>Encontre as configura&ccedil;&otilde;es que controlam o dispositivo
	   de inicializa&ccedil;&atilde;o do sistema.  Normalmente esta op&ccedil;&atilde;o &eacute; intitulada
	   <quote>Boot Order</quote> e costuma ser apresentada como
	   uma lista de dispositivos como 
	   <literal>Floppy</literal>, <literal>CDROM</literal>,
	   <literal>First Hard Disk</literal>, e assim por diante.</para>

	  <para>Caso seja necess&aacute;rio praparar disquetes de inicializa&ccedil;&atilde;o,
	   garanta que a op&ccedil;&atilde;o de disquetes seja selecionado.  Caso esteja
	   iniciando o sistema pelo CDROM garanta ent&atilde;o que esteja seja
	   o dispositivo selecionado.  Em caso de d&uacute;vida consulte o manual
	   do seu computador e/ou da placa-m&atilde;e.</para>

	  <para>Fa&ccedil;a a modifica&ccedil;&atilde;o, salve e saia do <acronym>BIOS</acronym>.
	   O computador dever&aacute; se reiniciar.</para>
	</step>

	<step>
	  <para>Caso tenha necessidade de preparar disquetes de inicializa&ccedil;&agrave;o
	   como foi descrito em 
	   <xref linkend="install-floppies">, ent&atilde;o um deles ser&aacute; o primeiro
	    disco de inicializa&ccedil;&atilde;o; na verdade o disco contendo a imagem
	    <filename>kern.flp</filename>.  Insira este disco no seu dispositivo
	    de disquetes.</para>

	  <para>Caso esteja iniciando o sistema a partir do CDROM,  ser&aacute;
	   necess&aacute;rio ligar o computador e inserir o CDROM na primeira
	   oportunidade.</para>

	  <para>Caso o computador inicie normalmente e carrege o sistema
	   operacional j&aacute; instalado, ent&atilde;o alguma destas situa&ccedil;&otilde;es est&atilde;o
	   ocorrendo:</para>

	  <orderedlist>
	    <listitem>
	      <para>Os discos n&atilde;o foram insedidos &agrave; tempo durante o processo
		de inicializa&ccedil;&atilde;o.  Mantenha-os inseridos e reinicie seu
		computador.</para>
	    </listitem>

	    <listitem>
	      <para>As modifica&ccedil;&otilde;es anteriormente realizadas no <acronym>BIOS</acronym>
		n&atilde;o funcionaram corretamente.  Refa&ccedil;a este passo at&eacute; que a op&ccedil;&atilde;o 				correta seja encontrada.</para>
	    </listitem>

	    <listitem>
	      <para>Seu <acronym>BIOS</acronym> em particular n&atilde;o suporte
		inicializa&ccedil;&atilde;o do sistema &agrave; partir da m&iacute;dia desejada.</para>
	    </listitem>
	</orderedlist>
	</step>
    
	<step>
	  <para>O FreeBSD come&ccedil;ar&aacute; a ser iniciado.  Caso esteja iniciando o sistema
	    &agrave; partir do CDROM voc&ecirc; ver&aacute; algumas mensagens similares a estas (as
	    informa&ccedil;&otilde;es sobre a vers&atilde;o do sistema foram omitidas):</para>
	  
	  <screen>Verifying DMI Pool Data ........
Boot from ATAPI CD-ROM :
 1. FD 2.88MB  System Type-(00)
Uncompressing ... done

BTX loader 1.00 BTX version is 1.01
Console: internal video/keyboard
BIOS drive A: is disk0
BIOS drive B: is disk1
BIOS drive C: is disk2
BIOS drive C: is disk3
BIOS 639kB/261120kB available memory

FreeBSD/i386 bootstrap loader, Revision 0.8

/kernel text=0x277391 data=0x3268c+0x332a8 |

|
Hit [Enter] to boot immediately, or any other key for command prompt.
Booting [kernel] in 9 seconds... _</screen>
	
	  <para>Caso esteja iniciando &agrave; partir de disquetes, voc&ecirc;
	   ver&aacute; algumas mensagens similares a estas (as
            informa&ccedil;&otilde;es sobre a vers&atilde;o do sistema foram omitidas):</para>
	
	  <screen>Verifying DMI Pool Data ........ 

BTX loader 1.00  BTX version is 1.01 
Console: internal video/keyboard 
BIOS drive A: is disk0 
BIOS drive C: is disk1 
BIOS 639kB/261120kB available memory 

FreeBSD/i386 bootstrap loader, Revision 0.8 

/kernel text=0x277391 data=0x3268c+0x332a8 |

Please insert MFS root floppy and press enter:</screen>

	  <para>Siga as instru&ccedil;&otilde;es acima, removendo o disco
	   com a imagem <filename>kern.flp</filename> e inserindo
	   o disco com a imagem <filename>mfsroot.flp</filename>, e depois
	   aperte <keycap>Enter</keycap>.</para>
	</step>

	<step>
	  <para>Indiferente se o sistema foi iniciado por disquete
	   ou CDROM, o processo de <foreignphrase>boot</foreignphrase> chegar&aacute;
	   a este ponto:</para>

	  <screen>Hit [Enter] to boot immediately, or any other key for command prompt. 
Booting [kernel] in 9 seconds... _</screen>

	  <para>Espere dez segundos ou aperte <keycap>Enter</keycap>.  Isto
	    iniciar&aacute; o menu de configura&ccedil;&atilde;o do kernel.</para>
	</step>
      </procedure>

      </sect3>
      <sect3>
        <title>Processo de inicializa&ccedil;&atilde;o no Alpha</title>

	<indexterm><primary>Alpha</primary></indexterm>

      <procedure>
	<step>
	  <para>Comece com seu sistema desligado.</para>
	</step>

	<step>
	  <para>Ligue o computador e espere pela tela do monitor
	    de inicializa&ccedil;&atilde;o.</para>
        </step>

	<step>
	  <para>Caso tenha sido preciso fazer discos de inicializa&ccedil;&atilde;o, como
	    descrito em <xref linkend="install-floppies"> ent&atilde;o um dos discos
	    ser&aacute; o primeiro disco de inicializa&ccedil;&atilde;o; na verdade o disco
	    gerado a partir da imagem do <filename>kern.flp</filename>.  Insira
	    este disco no seu dispositivo de disquetes e digite o seguinte comando para 
	    carreg&aacute;-lo (substituindo o nome do seu dispositivo de disco caso
	    necess&aacute;rio):</para>

	  <screen>&gt;&gt;&gt;<userinput>BOOT DVA0 -FLAGS '' -FILE ''</userinput></screen>

	  <para>Caso esteja iniciando &agrave; partir do CDROM, insira o CDROM no dispositivo
	   e digite o seguinte comando para iniciar a instala&ccedil;&atilde;o (substituindo o nome
	   apropriado para o dispositivo de CDROM, se necess&aacute;rio):</para>

          <screen>&gt;&gt;&gt;<userinput>BOOT DKA0 -FLAGS '' -FILE ''</userinput></screen>
	</step>
    
	<step>
	  <para>O FreeBSD vai come&ccedil;ar a ser iniciado.  Caso esteja iniciando
	  o sistema &agrave; partir de um disquete, em dado momento ser&aacute; apresentada
	  a mensagem:</para>

	  <screen>Please insert MFS root floppy and press enter:</screen>

	  <para>Siga as instru&ccedil;&ograve;es acima, removendo o disco com a imagem do
	    <filename>kern.flp</filename> e inserindo o disco com
	    a imagem do <filename>mfsroot.flp</filename> e aperte
	    <keycap>Enter</keycap>.</para>
	</step>

	<step>

	<para>Indiferente se o sistema foi iniciado por disquete
	    ou CDROM, o processo de <foreignphrase>boot</foreignphrase> chegar&aacute;
	    a este ponto:</para>

	  <screen>Hit [Enter] to boot immediately, or any other key for command prompt. 
Booting [kernel] in 9 seconds... _</screen>

	   <para>Espere dez segundos ou aperte <keycap>Enter</keycap>.  Isto
	   iniciar&aacute; o menu de configura&ccedil;&atilde;o do kernel.</para>
	</step>
      </procedure>

      </sect3>

    </sect2>

    <sect2 id="start-userconfig">
      <title>Configura&ccedil;&atilde;o do Kernel</title>

      <note><para>&Agrave; partir da s&eacute;rie 5 do FreeBSD, o menu de configura&ccedil;&atilde;p
	do kernel foi aposentado, em favor do novo m&eacute;todo &man.device.hints.5;. 
	Para mais informa&ccedil;&otilde;es sobre o &man.device.hints.5; por gentileza visite
	<xref linkend="device-hints"></para></note>

      <para>O <firstterm>kernel</firstterm> &eacute; o n&uacute;cleo do sistema operacional.
	Ele &eacute; o respons&aacute;vel por in&uacute;meras fun&ccedil;&otilde;es fundamentais, incluindo acesso
	&agrave; todos os dispositivos de controle que possam existir em seu sistema, como
	disco r&iacute;gido, placas de rede, placas de som e outros.  Todo equipamento
	suportado pelo kernel do FreeBSD tem um dispositivo associado &agrave; ele.  Cada
	dispositivo tem um nome de duas ou tr&ecirc;s letras, como <devicename>sa</devicename>
	para o dispositivo de acesso sequencial SCSI, ou <devicename>sio</devicename>
	para o dispositivo de E/S serial (que gerencia portas COM).</para>

      <para>Quando o kernel &eacute; carregado, cada dispositivo varre seu sistema
	para tentar identificar se o equipamento que ele controle existe na
	m&aacute;quina.  Caso exista, o dispositivo configura o equipamento e o torna
	dispon&iacute;vel para o kernel.</para>

      <para>Esta verifica&ccedil;&atilde;o normalmente &eacute; chamada de <firstterm>device
	probing</firstterm> (identifica&ccedil;&atilde;o de dispositivos).  Infelizmente
	nem sempre &eacute; poss&iacute;vel realiza-la de forma segura.  Alguns dispositivos
	de controle n&atilde;o coexistem de forma cordial e a identifica&ccedil;&atilde;o de um
	equipamento pode levar um outro &agrave; um estado inconsistente de disponibilidade.
	Esta &eacute; uma limita&ccedil;&atilde;o b&aacute;sica da concep&ccedil;&atilde;o do <acronym>PC</acronym>.</para>

      <para>Muitos dispositivos mais antigos s&atilde;o chamados de dispositivos ISA,
	que operam de forma diferente dos dispositivos PCI, mais atuais.  
	A especifica&ccedil;&atilde;o ISA obriga que
	algumas informa&ccedil;&otilde;es sejam afixadas &agrave; placa, tipicamente linha de 
	pedidos de interrup&ccedil;&atilde;o (IRQ) e endere&ccedil;o de E/S que o equipamento
	utiliza.  Estas informa&ccedil;&otilde;es normalmente podem ser configuradas
	utilizando <firstterm>jumpers</firstterm> f&iacute;sicos na placa, ou
	utilit&aacute;rios baseados em DOS para este fim espec&iacute;fico.</para>

      <para>Isso sempre foi origem de problemas, porque n&atilde;o &eacute; poss&iacute;vel ter
	dois dispositivos ISA que compartilhem a mesma IRQ ou endere&ccedil;o de
	mem&oacute;ria.</para>

      <para>Os equipamentos mais novos seguem as especifica&ccedil;&otilde;es PCI, que n&atilde;o
	necessitam destas informa&ccedil;&otilde;es afixadas, porque o equipamento supostamente
	deve cooperar com o <acronym>BIOS</acronym> que indica quais recursos
	o dispositivo deve utilizar.</para>

      <para>Caso tenha algum equipamento ISA no seu computador, o dispositivo
	de controle do FreeBSD para este dispositivo ter&aacute; que ser configurado
	com a IRQ e o endere&ccedil;o de E/S de acordo com o definido no 
	equipamento.  &Eacute; por isso que fazer um invent&aacute;rio de seus equipamentos
	(veja <xref linkend="install-inventory">) pode se tornar muito &uacute;til.</para>

      <para>Infelizmente, as IRQs e endere&ccedil;os de mem&oacute;ria padr&atilde;o utilizados
	por alguns dispositivos costumam entrar em conflito.  Isso se deve 
	ao fato de alguns equipamentos ISA serem vendidos com
	configura&ccedil;&otilde;es conflitantes por padr&atilde;o.  O padr&atilde;o no dispositivo
	de controle do kernel do FreeBSD s&atilde;o deliberadamente definidos como
	espelho dos padr&otilde;es do fabricante, de forma que o maior n&uacute;mero
	possivel de dispositivos funcionar&atilde;o sem necessitar modifica&ccedil;&otilde;es.</para>

      <para>Normalmente isso n&atilde;o &eacute; um problema para o uso di&aacute;rio do FreeBSD.
	Normalmente seu computador n&atilde;o ter&aacute; dois dispositivos que conflitam,
	pois se houver algum deles n&atilde;o ir&aacute; funcionar (indiferente do
	sistema operacional que voc&ecirc; estiver usando).</para>

      <para>Normalmente o problema ocorre ao instalar o FreeBSD pela	
	primeira vez, porque o kernel utilizado durante a instala&ccedil;&atilde;o
	cont&eacute;m o maior n&uacute;mero poss&iacute;vel de dispositivos, de forma que
	a instala&ccedil;&atilde;o possa suportar um gande n&uacute;mero de equipamentos
	distintos.  Isso significa que alguns destes equipamentos podem
	ter configura&ccedil;&ograve;es conflitantes.  Os equipamentos s&atilde;o reconhecidos
	em uma ordem estrita, e se existir um dispositivo que for 
	reconhecido depois, ent&atilde;o pode acontecer do mesmo n&atilde;o funcionar
	corretamente durante a instala&ccedil;&atilde;o do FreeBSD.</para>

      <para>Por tal motivo, a primeira coisa que voc&ecirc; tem a possibilidade
	de fazer ao instalar o FreeBSD &eacute; analisar a lista de dispositivos
	suportados pelo kernel, desabilitar ou habilita-los, caso voc&ecirc;
	n&atilde;o tenha equipamentos compat&iacute;veis com aquele suporte, ou confirmar
	e modificar a configura&ccedil;&atilde;o de recursos do mesmo, caso o padr&atilde;o
	esteja incorreto.</para>

      <para>Na verdade isso parece mais complicado do que na realidade &eacute;.</para>

      <para><xref linkend="kernel-config"> apresenta o primeiro menu de
	configura&ccedil;&atilde;o do kernel.  Recomendamos que sua escolha seja a op&ccedil;&atilde;o
	de modo visual, a <guimenuitem>Start kernel configuration in full-screen visual
	  mode</guimenuitem>, pois apresenta a interface mais f&aacute;cil
	para novos usu&aacute;rios.</para>

      <figure id="kernel-config">
	<title>Menu de Configura&ccedil;&atilde;o do Kernel</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/userconfig" format="PNG">
	  </imageobject>

	  <textobject>
	    <screen>&txt.install.userconfig;</screen>
	  </textobject>
	</mediaobject>
      </figure>

      <para>A tela de configura&ccedil;&atilde;o do kernel (<xref linkend="fig-userconfig">)
	&eacute; dividida em quatro se&ccedil;&otilde;es:</para>

      <orderedlist>
	<listitem>
	  <para>Uma lista agrupada de todos os dispositivos que est&atilde;o
	   atualmente definidos como <quote>ativos</quote> (<literal>
	   active</literal>, subdivididos em grupos como
	   <literal>Storage</literal> e <literal>Network</literal>.  Cada
	   dispositivo &eacute; apresentado com uma descri&ccedil;&atilde;o, o nome do dispositivo
	   e os endere&ccedil;os de IRQ e mem&oacute;ria utilizados pelo mesmo.  Ainda, se
	   um dispositivo ativo conflitar com outro tamb&eacute;m ativo, a express&atilde;o
	   <literal>CONF</literal> &eacute; apresentada pr&oacute;xima ao nome do dispositivo.
	   A se&ccedil;&atilde;o tamb&eacute;m mostra o n&uacute;mero total de equipamentos conflitantes cujo
	   suporte est&aacute; marcado como ativo.</para>
	</listitem>

	<listitem>
	  <para>Dispositivos marcados inativo permanecem no kernel, mas n&atilde;o
	   tentar&atilde;o reconhecer os equipamentos em quest&atilde;o quando o
	   kernel carregar.  Eles s&atilde;o divididos em grupos com o mesmo nome 
	   disposto na lista de dispositivos ativos.</para>
	</listitem>

	<listitem>
	  <para>Mais informa&ccedil;&otilde;es sobre o dispositivo selecionado, incluindo IRQ
	   e endere&ccedil;o de mem&oacute;ria e E/S.</para>
	</listitem>

	<listitem>
	  <para>Informa&ccedil;&otilde;es sobre as teclas de comando v&aacute;lidas nesta tela.</para>
	</listitem>
      </orderedlist>

      <figure id="fig-userconfig">
	<title>A interface visual do dispositivo de configura&ccedil;&atilde;o do kernel</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/userconfig2" format="PNG">
	  </imageobject>

          <textobject>
            <screen>&txt.install.userconfig2;</screen>
          </textobject>
        </mediaobject>
      </figure>

      <para>N&atilde;o se preocupe se houverem conflitos listados,
	isso &eacute; esperado uma vez que todos dispositivos est&atilde;o habilitados,
	e como j&aacute; foi explicado, algums ter&atilde;o as mesmas configura&ccedil;&otilde;es de
	recursos que outros.</para>

      <para>Agora voc&ecirc; deve utilizar a lista de dispositivos afim
	de resolver os conflitos pendentes.</para>

      <procedure>
	<title>Resolvendo conflitos de dispositivos</title>

	<step>
	  <para>Aperte <keycap>X</keycap>.  Este comando ir&aacute; expandir completamente
	   a lista de dispositivos de forma que voc&ecirc; possa visualiza-los.  Ser&aacute; preciso
	   usar as teclas de setinhas para paginar atrav&eacute;s da lista de dispositivos
	   ativos.</para>

	  <para><xref linkend="hardware-conflicts"> apresenta o resultado de
	   ter pressionado a tecla <keycap>X</keycap>.  </para>

	  <figure id="hardware-conflicts">
	    <title>Lista de dispositivos expandida</title>

	    <mediaobject>
	      <imageobject>
		<imagedata fileref="install/hdwrconf" format="PNG">
	      </imageobject>
	    </mediaobject>
	  </figure>
	</step>

	<step>
	  <para>Desabilite todos os dispositivos de controle para equipamentos
	    que voc&ecirc; n&atilde;o possui.  Para desabilitar um dispositivo, selecione-o
	    (ficar&aacute; clareado) com as teclas de setinhas e aperte 
	    <keycap>Del</keycap>.  O dispositivo ser&aacute; movido para a lista de
	    inativos, <literal>Inactive Drivers</literal>.</para>

	  <para>Caso inadivertidamente voc&ecirc; remova o suporte de um
	   dispositivo que &eacute; necess&aacute;rio, aperte <keycap>Tab</keycap> para 
	   alternar para o menu de dispositivos inativos, <literal>Inactive
	   Drivers</literal>, selecione o controlador desabilitado e pressione
	   <keycap>Enter</keycap> para coloca-lo de volta na lista de
	   controladores ativos.</para>

	  <warning>
	    <para> N&atilde;o desabilite <devicename>sc0</devicename>.  Ele controla o
	    suporte &agrave; unidade de sa&iacute;da padr&atilde;o, o monitor, e ele &eacute; completamente
	    necess&aacute;rio, a n&atilde;o ser que voc&ecirc; esteja instalando o sistema por meio
	    de um cabo serial.</para>
	  </warning>

	  <warning>
	    <para> Apenas desabilite <devicename>atkbd0</devicename> se estiver
	    usando um teclado USB.  Se tiver teclado tradicional ent&atilde;o mantenha
	    <devicename>atkbd0</devicename>, o dispositivo de entrada padr&atilde;o.</para>
	  </warning>
	</step>

	<step>
	  <para>Se n&atilde;o existirem conflitos listados, voc&ecirc; pode pular o pr&oacute;ximo passo.
	   Do contr&aacute;rio os conflitos restantes devem ser examinados.  Se eles n&atilde;o
	   tem indica&ccedil;&atilde;o de um conflito permitido - <foreignphrase>allowed 
	   conflict</foreignphrase> - na &aacute;rea de mensagem, o endere&ccedil;o de IRQ
	   ou de mem&oacute;ria dever&atilde;o ser modificados, <emphasis>ou</emphasis> a IRQ e
	   endere&ccedil;o de <foreignphrase>hardware</foreignphrase> dever&atilde;o
	   ser trocados.</para>

	  <para>Para modificar a configura&ccedil;&atilde;o do dispositivo pela IRQ e endere&ccedil;o
	   de E/S do equipamento, selecione o &iacute;tem em quest&atilde;o e aperte <keycap>
	   Enter</keycap>.  O cursor ir&aacute; para a terceira se&ccedil;&atilde;o da tela e voc&ecirc;
	   pode modificar estes valores.  Dever&aacute; informar as informa&ccedil;&otilde;es de
	   recursos conseguidas quando o inventar&aacute;rio dos equipamentos foi
	   realizado.  Pressione a tecla <keycap>Q</keycap> para terminar a
	   edi&ccedil;&atilde;o da configura&ccedil;&atilde;o do dispositivo e voltar para a lista de
	   &iacute;tens ativos.</para>
	  
	  <para>Se voc&ecirc; n&atilde;o tem a menor id&eacute;ia de que valores devem ser
	   definidos, experimente usar <literal>-1</literal>.  Alguns dispositivos
	   de controle do FreeBSD podem, de forma segura, varrer os equipamentos em
	   busca das configura&ccedil;&otilde;es corretas de cada dispositivo, e a op&ccedil;&atilde;o
	   <literal>-1</literal> indica que ele deve faz&ecirc;-lo.</para>

	  <para>O procedimento para modificar o endere&ccedil;o de acesso &agrave; mem&oacute;ria
	   varia de dispositivo para dispositivo.  Para alguns equipamentos pode ser
	   necess&aacute;ro remover fisicamente a placa e configurar os <foreignphrase>
	   jumpers</foreignphrase> ou os alternadores <acronym>DIP</acronym> (
	   <acronym>DIP</acronym> switches).  Outras placas oferecem
	   um disquete DOS que contem programas para reconfigura-la.  Em todos
	   os casos voc&ecirc; deve se referir &agrave; documenta&ccedil;&atilde;o que acompanha o
	   equipamento.  Obviamente isto implicar&aacute; na reinicializa&ccedil;&atilde;o
	   do seu computador, de forma que ser&aacute; preciso voltar &agrave; rotina de
	   instala&ccedil;&atilde;o do FreeBSD depois que esta placa tenha sido 
	   reconfigurada.</para>
	</step>

	<step>
	  <para>Quando todos conflitos estiverem sanados, a tela
	  estar&aacute; similar a <xref linkend="userconfig-done">.</para>

	  <figure id="userconfig-done">
	    <title>Configura&ccedil;&atilde;o de dispositivos sem conflitos</title>

	    <mediaobject>
	      <imageobject>
		<imagedata fileref="install/probstart" format="PNG">
	      </imageobject>
	    </mediaobject>
	  </figure>

	  <para>Como voc&ecirc; pode ter reparado, a lista de dispositivos ativos
	    agora est&aacute; bem menor, apenas com os &iacute;tens para os equipamentos
	    que realmente existem est&atilde;o listados.</para>
	  
	  <para>Agora &eacute; poss&iacute;vel salvar tais modifica&ccedil;&otilde;es e ir para o pr&oacute;ximo
	   passo do processo de instala&ccedil;&atilde;o.  Aperte <keycap>Q</keycap> para sair
	   da interface de configura&ccedil;&atilde;o de dispositivos.  A seguinte mensagem
	   surgir&aacute;:</para>

	  <screen>Save these parameters before exiting? ([Y]es/[N]o/[C]ancel)</screen>

	  <para>Responda <keycap>Y</keycap> (SIM) para salvar os par&acirc;metros
	   em mem&oacute;ria (eles ser&atilde;o salvos em disco quando a instala&ccedil;&atilde;o for
	   conclu&iacute;da) e o reconhecimento dos equipamentos ser&aacute; iniciado.  Ap&oacute;s
	   apresentar os resultados do reconhecimento em mensagens de texto 
	   preto e branco, o <application>sysinstall</application> ir&aacute;
	   iniciar e apresentar&aacute; seu menu principal
	   (<xref linkend="sysinstall-main">).</para>

	  <figure id="sysinstall-main">
	    <title>Menu principal do Sysinstall</title>
	    
	    <mediaobject>
	      <imageobject>
		<imagedata fileref="install/main1" format="PNG">
	      </imageobject>
	    </mediaobject>
	  </figure>
	</step>
      </procedure>
    </sect2>

    <sect2 id="view-probe">
      <title>Revisando o resultado do reconhecimento de dispositivos</title>

      <para>As &uacute;ltimas centenas de linhas que foram apresentadas na tela s&atilde;o
	armazenadas e podem ser revisadas.</para>

      <para>Para revisar o <foreignphrase>buffer</foreignphrase>, aperte <keycap>Scroll Lock</keycap>.
	Esta tecla ativa o paginamento da tela.  Voc&ecirc; pode utilizar as teclas de
	setinhas ou <keycap>PageUp</keycap> e <keycap>PageDown</keycap> para visualizar
	os resultados do processo de reconhecimento de dispositivos.  Aperte <keycap>
	Scroll Lock</keycap> novamente para desativar o paginamento.</para>

      <para>Fa&ccedil;a isso agora para revisar o texto que foi paginado para cima da tela quando
	o kernel estava sendo carregado e os dispositivos de controle sendo reconhecidos.
	Voc&ecirc; ver&aacute; informa&ccedil;&otilde;es textuais similares &agrave; <xref linkend="install-dev-probe">,
	embora o conte&uacute;do preciso ser&aacute; diferente dependendo de quais dispositivos
	existirem no seu computador.</para>

      <figure id="install-dev-probe">
	<title>Resultados t&iacute;picos do reconhecimento de dispositivos</title>

	<screen>avail memory = 253050880 (247120K bytes) 
Preloaded elf kernel "kernel" at 0xc0817000.
Preloaded mfs_root "/mfsroot" at 0xc0817084.
md0: Preloaded image &lt;/mfsroot&gt; 4423680 bytes at 0xc03ddcd4

md1: Malloc disk
Using $PIR table, 4 entries at 0xc00fde60
npx0: &lt;math processor&gt; on motherboard   
npx0: INT 16 interface   
pcib0: &lt;Host to PCI bridge&gt; on motherboard
pci0: &lt;PCI bus&gt; on pcib0
pcib1:&lt;VIA 82C598MVP (Apollo MVP3) PCI-PCI (AGP) bridge&gt; at device 1.0 on pci0
pci1: &lt;PCI bus&gt; on pcib1
pci1: &lt;Matrox MGA G200 AGP graphics accelerator&gt; at 0.0 irq 11
isab0: &lt;VIA 82C586 PCI-ISA bridge&gt; at device 7.0 on pci0
isa0: &lt;iSA bus&gt; on isab0
atapci0: &lt;VIA 82C586 ATA33 controller&gt; port 0xe000-0xe00f at device 7.1 on pci0
ata0: at 0x1f0 irq 14 on atapci0
ata1: at 0x170 irq 15 on atapci0
uhci0 &lt;VIA 83C572 USB controller&gt; port 0xe400-0xe41f irq 10 at device 7.2 on pci
0
usb0: &lt;VIA 83572 USB controller&gt; on uhci0
usb0: USB revision 1.0
uhub0: VIA UHCI root hub, class 9/0, rev 1.00/1.00, addr1
uhub0: 2 ports with 2 removable, self powered
pci0: &lt;unknown card&gt; (vendor=0x1106, dev=0x3040) at 7.3
dc0: &lt;ADMtek AN985 10/100BaseTX&gt; port 0xe800-0xe8ff mem 0xdb000000-0xeb0003ff ir
q 11 at device 8.0 on pci0
dc0: Ethernet address: 00:04:5a:74:6b:b5
miibus0: &lt;MII bus&gt; on dc0
ukphy0: &lt;Generic IEEE 802.3u media interface&gt; on miibus0
ukphy0: 10baseT, 10baseT-FDX, 100baseTX, 100baseTX-FDX, auto
ed0: &lt;NE2000 PCI Ethernet (RealTek 8029)&gt; port 0xec00-0xec1f irq 9 at device 10.
0 on pci0
ed0 address 52:54:05:de:73:1b, type NE2000 (16 bit)
isa0: too many dependant configs (8)
isa0: unexpected small tag 14
orm0: &lt;Option ROM&gt; at iomem 0xc0000-0xc7fff on isa0
fdc0: &lt;NEC 72065B or clone&gt; at port 0x3f0-0x3f5,0x3f7 irq 6 drq2 on isa0
fdc0: FIFO enabled, 8 bytes threshold
fd0: &lt;1440-KB 3.5" drive&gt; on fdc0 drive 0
atkbdc0: &lt;Keyboard controller (i8042)&gt; at port 0x60,0x64 on isa0
atkbd0: &lt;AT Keyboard&gt; flags 0x1 irq1 on atkbdc0
kbd0 at atkbd0
psm0: &lt;PS/2 Mouse&gt; irq 12 on atkbdc0
psm0: model Generic PS/@ mouse, device ID 0
vga0: &lt;Generic ISA VGA&gt; at port 0x3c0-0x3df iomem 0xa0000-0xbffff on isa0
sc0: &lt;System console&gt; at flags 0x100 on isa0
sc0: VGA &lt;16 virtual consoles, flags=0x300&gt;
sio0 at port 0x3f8-0x3ff irq 4 flags 0x10 on isa0
sio0: type 16550A
sio1 at port 0x2f8-0x2ff irq 3 on isa0
sio1: type 16550A
ppc0: &lt;Parallel port&gt; at port 0x378-0x37f irq 7 on isa0
pppc0: SMC-like chipset (ECP/EPP/PS2/NIBBLE) in COMPATIBLE mode
ppc0: FIFO with 16/16/15 bytes threshold
plip0: &lt;PLIP network interface&gt; on ppbus0
ad0: 8063MB &lt;IBM-DHEA-38451&gt; [16383/16/63] at ata0-master UDMA33
acd0: CD-RW &lt;LITE-ON LTR-1210B&gt; at ata1-slave PIO4
Mounting root from ufs:/dev/md0c
/stand/sysinstall running as init on vty0</screen>
      </figure>

      <para>Verifique os resultados do reconhecimento cuidadosamente para garantir que
	o FreeBSD encontrou todos os dispositivos que voc&ecirc; esperava.  Se algum
	equipamento n&atilde;o foi encontrando, ele n&atilde;o ser&aacute; listado.  Se o &iacute;tem em
	quest&atilde;o precisou ter seus recursos de IRQ e endere&ccedil;o de mem&oacute;ria 
	configurados, verifique se estes valores foram definidos corretamente.</para>

      <para>Caso seja necess&aacute;rio modifcar as configura&ccedil;&otilde;es do reconhecimento
	de dispositivos, &eacute; simples sair do <application>sysinstall</application>
	e recome&ccedil;ar o processo de instala&ccedil;&atilde;o.  Esta tamb&eacute;m &eacute; uma &oacute;tima
	forma de se tornar mais familiar com o processo.</para>

      <figure id="sysinstall-exit">
	<title>Selecione a sa&iacute;da do Sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/sysinstall-exit" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Utilize as teclas de setas para selecionar a op&ccedil;&atilde;o 
	<guimenuitem>Exit Install</guimenuitem> do menu principal de
	instala&ccedil;&atilde;o.  A seguinte mensagem ser&aacute; exibida:</para>


      <screen>                      User Confirmation Requested 
         Are you sure you wish to exit? The system will reboot 
           (be sure to remove any floppies from the drives).

                            [ Yes ]    No</screen>

      <para>O programa de instala&ccedil;&atilde;o ser&aacute; reiniciado se o CDROM for
	mantido no leitor de CD e a op&ccedil;&atilde;o <guibutton>[Yes]</guibutton>
	for selecionada.</para>

      <para>Se estiver iniciando o sistema por disquetes, ser&aacute; necess&aacute;rio
	retirar o disco do <filename>mfsroot.flp</filename> e troca-lo
	pelo <filename>kern.flp</filename> antes da reinicializa&ccedil;&atilde;o.</para>
    </sect2>
  </sect1>

  <sect1 id="using-sysinstall">
    <title>Introdu&ccedil;&atilde;o ao Sysinstall</title>

    <para>O utilit&aacute;rio <application>sysinstall</application> &eacute; o programa de
	instala&ccedil;&atilde;o oferecido pelo Projeto FreeBSD.  &Eacute; baseado em console e &eacute;
	dividido em v&aacute;rios menus e telas que podem ser utilizados para
	configurar e controlar o processo de instala&ccedil;&atilde;o.</para>

    <para>O sistema de menu do <application>sysinstall</application> &eacute; controlado
	pelas teclas de flechas, <keycap>Enter</keycap>, <keycap>Space</keycap>, e
	outras teclas.  Descri&ccedil;&atilde;o detalhada destas teclas e o que elas fazem
	est&aacute; dispon&iacute;vel nas informa&ccedil;&otilde;es de utiliza&ccedil;&atilde;o do <application>sysinstall
	</application>.</para>

    <para>Para visualizar tais informa&ccedil;&otilde;es, garanta que a op&ccedil;&atilde;o
	<guimenuitem>Usage</guimenuitem> est&aacute; marcada, no menu do programa, e que
	o &iacute;tem <guibutton>[Select]</guibutton> est&aacute; selecionado, como
	apresentados em <xref
      linkend="sysinstall-main3">, depois aperte <keycap>Enter</keycap>.</para>

    <para>As instru&ccedil;&otilde;es para utilizar esse sistema de menu
	ser&atilde;o apresentadas.  Depois de revisa-las, aperte <keycap>Enter</keycap>
	para voltar ao menu principal.</para>

    <figure id="sysinstall-main3">
      <title>Selecionando a op&ccedil;&atilde;o <foreignphrase>Usage</foreignphrase> do menu do Sysinstall</title>

      <mediaobject>
	<imageobject>
	  <imagedata fileref="install/main1" format="PNG">
	</imageobject>
      </mediaobject>
    </figure>

    <sect2 id="select-doc">
      <title>Selecionando o menu de documenta&ccedil;&atilde;o</title>

      <para>No menu principal, selecione a op&ccedil;&atilde;o <guimenuitem>Doc</guimenuitem>
	com as setas e aperte <keycap>Enter</keycap>.</para>

      <figure id="main-doc">
	<title>Selecionando o menu de documenta&ccedil;&atilde;o</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/main-doc" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Isso apresentar&aacute; o menu de documenta&ccedil;&atilde;o.</para>

      <figure id="docmenu1">
	<title>Menu de documenta&ccedil;&atilde;o do sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/docmenu1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>&Eacute; importante ler os documentos disponibilizados pelo menu em quest&atilde;o.</para>

      <para>Para visualizar algum dos documentos, selecione-o com as setas e aperte
	<keycap>Enter</keycap>.  Quando terminar a leitura do documento, pressione
	<keycap>Enter</keycap> novamente para retornar ao menu de
	documenta&ccedil;&atilde;o.</para>

      <para>Para voltar ao menu principal de instala&ccedil;&atilde;o, selecione
	<guimenuitem>Exit</guimenuitem> com as teclas de setas e pressione
	<keycap>Enter</keycap>.</para>
    </sect2>

    <sect2 id="keymap">
      <title>Selecionando o menu de mapeamento do teclado</title>

      <para>Para modificar o mapeamento de teclado, utilize as teclas
	de setinhas do menu e tecle <keycap>Enter</keycap>.  Isso &eacute;
	necess&aacute;rio se o seu teclado n&atilde;o for padr&atilde;o ou for
	n&atilde;o-US.</para>

      <figure id="sysinstall-keymap">
	<title>Menu principal do Sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/main-keymap" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>O mapeamento distinto do teclado pode ser selecionado
	escolhendo o &iacute;tem em quest&atilde;o no menu principal e 
	pressionando <keycap>Space</keycap>.  Apertar  <keycap>Space</keycap>
	novamente remove a sele&ccedil;&atilde;o deste &iacute;tem.  Quando terminado, escolha
	a op&ccedil;&atilde;o &gui.ok; utilizando as teclas de setinhas e aperte
	<keycap>Enter</keycap>.</para>

      <para>Uma lista parcial &eacute; apresentada na representa&ccedil;&atilde;o desta tela. Selecionar
	&gui.cancel; apertando <keycap>Tab</keycap> for&ccedil;ar&aacute; a utiliza&ccedil;&atilde;o
	do mapeamento padr&atilde;o, e voltar&aacute; ao menu principal de 
	instala&ccedil;&atilde;o.</para>

      <figure id="sysinstall-keymap-menu">
	<title>Menu de mapeamento do teclado do Sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/keymap" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

    </sect2>

    <sect2 id="viewsetoptions">
      <title>Tela de op&ccedil;&otilde;es de instala&ccedil;&atilde;o</title>

    <para>Selecione <guimenuitem>Options</guimenuitem> e aperte
	<keycap>Enter</keycap>.</para>

    <figure id="sysinstall-options">
      <title>Menu principal do Sysinstall</title>

      <mediaobject>
        <imageobject>
	  <imagedata fileref="install/main-options" format="PNG">
	</imageobject>
      </mediaobject>
    </figure>

      <figure id="options">
	<title>Op&ccedil;&otilde;es do Sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/options" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Os valores padr&atilde;o normalmente s&atilde;o o bastante para a maioria dos
	usu&aacute;rios, e n&atilde;o tem a necessidade de serem modificados.  O nome do
	<foreignphrase>release</foreignphrase> (<foreignphrase>release
	name</foreignphrase>) ir&aacute; variar de acordo com a vers&atilde;o do sistema
	que est&aacute; sendo instalada.</para>

      <para>A descri&ccedil;&atilde;o do &iacute;tem selecionado aparecer&aacute; na base da tela, 
	em cores azuis.  Note que uma das op&ccedil;&otilde;es &eacute; <guimenuitem>Use
	Defaults</guimenuitem> que tem a fun&ccedil;&atilde;o de redefinir todos
	os &iacute;tens para seus valores padr&atilde;o.</para>

      <para>Aperte <keycap>F1</keycap> para ler a tela de ajuda
	sobre as v&aacute;rias op&ccedil;&otilde;es.</para>

      <para>Ao apertar a tecla <keycap>Q</keycap> o foco volta ao menu principal
	de instala&ccedil;&atilde;o.</para>
    </sect2>

    <sect2 id="start-install">
      <title>Iniciando a instala&ccedil;&atilde;o padr&atilde;o</title>

      <para>A instala&ccedil;&atilde;o padr&atilde;o (<guimenuitem>Standard</guimenuitem>) &eacute; a op&ccedil;&atilde;o recomendada
	aos usu&aacute;rios rec&eacute;m chegados ao ambiente &unix; ou FreeBSD.  Utilize as teclas
	de setinhas para selecionar a op&ccedil;&atilde;o <guimenuitem>Standard</guimenuitem> e
	ent&atilde;o aperte <keycap>Enter</keycap> para iniciar a instala&ccedil;&atilde;o.</para>

      <figure id="sysinstall-standard">
	<title>Iniciando a instala&ccedil;&atilde;o padr&atilde;o</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/main-std" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
    </sect2>
  </sect1>

  <sect1 id="install-steps">
    <title>Alocando espa&ccedil;o em disco</title>

    <para>A primeira tarefa &eacute; alocar espa&ccedil;o em disco para o FreeBSD e rotular
	este espa&ccedil;o de forma que o <application>sysinstall</application> possa
	prepar&aacute;-lo.  Para fazer isso &eacute; necess&aacute;rio saber como o FreeBSD
	pretende encontrar as informa&ccedil;&otilde;es em disco.</para>

    <sect2 id="install-drive-bios-numbering">
      <title>Numera&ccedil;&atilde;o dos discos no <acronym>BIOS</acronym></title>

      <para>Antes de instalar e configurar o FreeBSD em seu sistema, existe
	um &iacute;tem fundamental com o qual voc&ecirc; deve ter aten&ccedil;&atilde;o, especialmente
	se possuir multiplos discos r&iacute;gidos.</para>

      <indexterm><primary>DOS</primary></indexterm>
      <indexterm><primary>Microsoft Windows</primary></indexterm>
      <para>Em um PC que utiliza um sistema operacional dependente do <acronym>BIOS
	</acronym> (<foreignphrase>BIOS-dependent OS</foreignphrase>) como
	&ms-dos; ou &microsoft.windows;, o <acronym>BIOS</acronym> &eacute; capaz
	de abstrair a ordem normal dos discos, e o sistema operacional
	reconhece tal modifica&ccedil;&atilde;o.  Isso permite que o usu&aacute;rio inicie o distema
	&agrave; partir de um disco qualquer, ao inv&eacute;s do chamado <quote>prim&aacute;rio 
	mestre</quote>.  Isso &eacute; especialmente conveniente para usu&aacute;rios
	que acreditam que a forma mais r&aacute;pida e barata de manter o
	backup de um sistema &eacute; comprando um segundo disco r&iacute;gido id&ecirc;ntico ao
	primeiro e realizar rotinas de copias do primeiro disco no segundo, 
	utilizando os programas <application><trademark class="registered">
	Ghost</trademark></application> ou <application>XCOPY</application>.
	Dessa forma, se o primeiro dispositivo falhar ou for atacado por um
	v&iacute;rus, ou mesmo se for danificado por defeito no sistema operacional,
	&eacute; f&aacute;cil recuperar o sistema simplesmente instruindo o <acronym>BIOS</acronym>
	para modificar a unidade de inicializa&ccedil;&atilde;o.  &Eacute; como mudar os cabos
	do disco, mas sem ter que abrir o gabinente.</para>

      <indexterm><primary>SCSI</primary></indexterm>
      <indexterm><primary>BIOS</primary></indexterm>
      <para>Sistemas mais caros com controladoras SCSI costumam
	incluir extens&otilde;es no <acronym>BIOS</acronym> que permitem que
	os discos SCSI sejam reordenados de forma similar para v&aacute;rios
	discos.</para>

      <para>Usu&aacute;rios que tem costume de tirar vantagens destas caracter&iacute;sticas
	podem se surpreender ao perceber que o resultado no FreeBSD n&atilde;o
	&eacute; como o esperado.  FreeBSD n&atilde;o utiliza o <acronym>BIOS</acronym>
	dessa forma e simplesmente ignora o <quote>mapeamento l&oacute;gico 
	dos dispositivos no <acronym>BIOS</acronym></quote>.  Isso pode
	levar o usu&aacute;rio &agrave; situa&ccedil;&otilde;es perplexas especialmente quando a
	geometria dos discos &eacute; exatamente igual e foram clonados
	de um para outro disco.</para>

      <para>Ao usar o FreeBSD, sempre restaure a numera&ccedil;&atilde;o
	usual do <acronym>BIOS</acronym> antes de iniciar a instala&ccedil;&atilde;o do sistema
	e mantenha-a desta forma.  Se for necess&aacute;rio alternar entre os discos,
	ent&atilde;o fa&ccedil;a-o da forma dif&iacute;cil, abrindo o gabinete e modificando
	os <foreignphrase>jumpers</foreignphrase> e cabos.</para>

      <sidebar>
	<title>Ilustrando as excepcionais aventuras dos arquivos de Bill
	 e Fred:</title>
      
	<para>Bill resolve destruir outra m&aacute;quina Wintel para montar
	outro servidor FreeBSD para o Fred.  Bill configura um &uacute;nico
	disco SCSI na unidade SCSI n&uacute;mero zero, e instala FreeBSD
	nela.</para>

	<para>Fred passa a utilizar o sistema, mas depois de v&aacute;rios dias
	nota que o disco SCSI antigo passa e reportar v&aacute;rios erros l&oacute;gicos
	e relato este fato ao Bill.</para>

	<para>Depois de v&aacute;rios dias mais, Bill decide que &eacute; hora de
	resolver a situa&ccedil;&atilde;o, ent&atilde;o ele consegue um disco SCSI id&ecirc;ntico
	no <quote>armaz&eacute;m</quote> de discos na sala dos fundos.  Uma
	varredura inicial de superf&iacute;cie indica que o dispositivo
	funciona corretamente, ent&atilde;o Bill instala este disco SCSI
	na unidade n&uacute;mero quatro e faz uma imagem c&oacute;pia dos dados no
	disco da unidade zero para o disco na quatro.  Agora o dispositivo
	est&aacute; instalado e funcionando corretamente.  Bill decide ent&atilde;o
	utilizar o disco e faz uso da op&ccedil;&atilde;o no <acronym>BIOS</acronym> SCSI
	para re-ordenar os dispositivos de disco de forma que o sistema
	inicialize &agrave; partir da unidade quatro.  FreeBSD inicia e 
	entra no ar de forma correta.</para>

	<para>Fred continua seu trabalho por v&aacute;rios dias afinco, e logo Bill
	e Fred decidem que &eacute; hora de uma nova aventura -- hora de atualizar
	para uma vers&atilde;o mais recente do FreeBSD.  Bill retira a unidade zero
	SCSI e troca ela por um outro disco id&ecirc;ntico, l&aacute; do mesmo <quote>
	armazem</quote>.  Bill reinstala o FreeBSD no novo disco na unidade
	zero utilizando os disquetes m&aacute;gicos de FTP via Internet do Fred.
	A instala&ccedil;&atilde;o termina corretamente.</para>

	<para>Fred utiliza a nova vers&atilde;o do FreeBSD por alguns dias e se certifica
	que ela &eacute; boa o bastante para colocar no departamento de engenharia.  &Eacute;
	hora de copiar todo seu trabalho do sistema antigo.  Fred monta
	a unidade SCSI quatro (a &uacute;ltima c&oacute;pia da vers&atilde;o anterior do FreeBSD).
	Fred quase desmaia ao constar que nenhum de seus t&atilde;o preciosos dados
	de trabalho est&aacute; presente na unidade SCSI quatro.</para>

	<para>Onde os dados foram parar?</para>

	<para>Quando Bill fez uma c&oacute;pia do disco SCSI original da unidade zero
	na unidade SCSI quatro, a unidade quatro se tornou o <quote>novo clone
	</quote>.  Quando Bill re-ordenou o <acronym>BIOS</acronym> SCSI
	de forma que pudesse iniciar a partir da unidade quatro, ele estava
	apenas enganando a s&iacute; mesmo.  FreeBSD continuava rodando &agrave; partir
	da unidade SCSI zero.  Realizar esse tipo de modifica&ccedil;&atilde;o no
	<acronym>BIOS</acronym> faz com que todo o c&oacute;digo do carregador (
	<foreignphrase>Loader</foreignphrase>) e do setor de inicizalica&ccedil;&atilde;o
	seja iniciado do disco selecionado, mas quando o FreeBSD decola, 
	a ordem das unidades &eacute; ignorada e o FreeBSD reconhece a numera&ccedil;&atilde;o
	f&iacute;sica (original) dos discos.  Nesta ilustra&ccedil;&atilde;o o sistema continua
	sendo utilizado &agrave; partir da unidade zero, e todos os dados do Fred
	continuavam l&aacute;, e n&atilde;o na unidade SCSI n&uacute;mero quatro.  O fato de o
	sistema parecer estar sendo executado na unidade 4 era apenas
	artif&iacute;cio da expectativas humanas.</para>

	<para>Felizmente, ficamos felizes de mencionar que nenhum byte sequer
	foi perdido ou danificado com isso.  A unidade SCSI zero antiga foi 
	realinhada, e todo o trabalho de Fred voltou &agrave;s suas m&atilde;os (e agora
	Bill sabe que ele pode contar al&eacute;m de zero).</para>

	<para>Embora discos SCSI tenham sido utilizados nesta ilustra&ccedil;&atilde;o,
	o conceito se aplica igualmente &agrave; dispositivos IDE.</para>
      </sidebar>
    </sect2>

    <sect2 id="main-fdisk">
      <title>Criando parti&ccedil;&otilde;es com FDisk</title>

      <note>
	<para>Nenhuma altera&ccedil;&atilde;o que seja realizada neste momento ser&aacute;
	escrita em disco.  Se voc&ecirc; acreditar que tenha cometido
	algum erro e deseja iniciar o processo novamente, pode utilizar
	o menu para sair do <application>sysinstall</application> e
	come&ccedil;ar de novo, ou apertar <keycap>U</keycap> para utilizar
	a op&ccedil;&atilde;o de <quote>desfazer</quote> (<foreignphrase>
	Undo</foreignphrase>).  Se voc&ecirc; ficar confuso e n&atilde;o
	estiver certo sobre como sair, lembre-se que voc&ecirc; pode sempre
	desligar seu computador.</para>
      </note>

      <para>Ap&oacute;s selecionar a instala&ccedil;&atilde;o padr&atilde;o do <application>
	sysinstall</application> voc&ecirc; ver&aacute; esta mensagem:</para>

      <screen>                                 Message
 In the next menu, you will need to set up a DOS-style ("fdisk")
 partitioning scheme for your hard disk. If you simply wish to devote
 all disk space to FreeBSD (overwriting anything else that might be on
 the disk(s) selected) then use the (A)ll command to select the default
 partitioning scheme followed by a (Q)uit. If you wish to allocate only
 free space to FreeBSD, move to a partition marked "unused" and use the
 (C)reate command. 
                                [  OK  ] 

                      [ Press enter or space ]</screen>

      <para>Aperte <keycap>Enter</keycap> como indicado.  Voc&ecirc; ver&aacute; uma lista
	de discos r&iacute;gidos que o kernel encontrou quando foi carregado.
	<xref linkend="sysinstall-fdisk-drive1"> apresenta um exemplo de
	sistema com dois discos IDE.  Eles foram chamados de 
	<devicename>ad0</devicename> e <devicename>ad2</devicename>.</para>

      <figure id="sysinstall-fdisk-drive1">
	<title>Selecione o disco para o FDisk</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-drive1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Voc&ecirc; deve estar se perguntando por qu&ecirc; <devicename>ad1</devicename>
	n&atilde;o &eacute; listado aqui.  Por qu&ecirc; ela foi pulada?</para>

      <para>Considere o que aconteceria se voc&ecirc; disposse de dois discos
	IDE, um como prim&aacute;rio na primeira controlada IDE, e um como
	prim&aacute;rio na segunda controladora IDE.  Se o FreeBSD os numerasse
	conforme os encontrasse, como dispositivo <devicename>ad0</devicename>
	e <devicename>ad1</devicename>, ent&atilde;o tudo funcionaria.</para>

      <para>Mas ent&atilde;o, se voc&ecirc; adicionasse um terceiro disco, como secund&aacute;rio
	na primeira controladora IDE, seriam agora <devicename>ad1</devicename>,
	e o ad1 anterior seria chamado de <devicename>ad2</devicename>.  
	Considerando que o nome dos dispositivos (como, por exemplo
	<devicename>ad1s1a</devicename>) s&atilde;o utilizados para identificar
	os sistemas de arquivos, repentinamente voc&ecirc; pode perceber que
	seus sistemas de arquivos n&atilde;o est&atilde;o mais dispostos corretamente,
	e teria que modificar sua configura&ccedil;&atilde;o do FreeBSD.</para>
      
      <para>Para resolver isso, o kernel pode ser configurado
	para nomear discos IDE com base em sua disposi&ccedil;&atilde;o f&iacute;sica, e n&atilde;o
	na ordem em que eles s&atilde;o encontrados.  Com este esquema, o disco
	prim&aacute;rio na segunda controladora IDE ser&aacute; <emphasis>sempre</emphasis> 
	o <devicename>ad2</devicename>, mesmo que n&atilde;o existam dispositivos
	<devicename>ad0</devicename> ou <devicename>ad1
	</devicename>.</para>

      <para>Esta &eacute; a configura&ccedil;&atilde;o padr&atilde;o no kernel do FreeBSD, 
	que nesta tela apresenta <devicename>ad0</devicename> e
	<devicename>ad2</devicename>.  A esta&ccedil;&atilde;o de onde este <foreignphrase>
	screenshot</foreignphrase> foi tirado dispunha de dois discos IDE nos
	dois canais prim&aacute;rios de cada controladora IDE, e nenhum disco nos canais
	secund&aacute;rios.</para>

      <para>Voc&ecirc; deve escolher o disco onde o FreeBSD deve ser instalado, e
	depois disso apertar &gui.ok;.
	O <application>FDisk</application> ser&aacute; iniciado, com uma
	interface similar &agrave; esta apresentada na <xref linkend="sysinstall-fdisk1">.</para>

      <para>A tela do <application>FDisk</application> est&aacute; dividida em
	tr&ecirc;s se&ccedil;&otilde;es.</para>

      <para>A primeira se&ccedil;&atilde;o cobre as duas primeiras linhas da aplica&ccedil;&atilde;o,
	e mostra os detalhes do disco atualmente selecionado, incluindo
	a nomenclautra FreeBSD para o nome, a geometria de disco e o tamanho
	total do mesmo.</para>

      <para>A segunda se&ccedil;&atilde;o apresenta as parti&ccedil;&otilde;es que est&atilde;o no disco, onde
	elas iniciam e terminam, qual seu tamanho, o nome que o FreeBSD
	atribui &agrave; elas, e suas descri&ccedil;&otilde;es e sub-tipos.  Este exemplo
	apresenta duas pequenas parti&ccedil;&otilde;es n&atilde;o utilizadas, que s&atilde;o
	artif&iacute;cios do esquema de disposi&ccedil;&atilde;o de discos no PC.  Tamb&eacute;m
	apresenta uma grande parti&ccedil;&atilde;o <acronym>FAT</acronym>, que quase
	sempre aparece como <devicename>C:</devicename> no &ms-dos; / &windows;
	e uma parti&ccedil;&atilde;o extendida, que pode conter outras letras de dispositivos
	para o &ms-dos; / &windows;.</para>

      <para>A terceira se&ccedil;&atilde;o apresenta os comandos que s&atilde;o disponibilizados
	pelo <application>FDisk</application>.</para>

      <figure id="sysinstall-fdisk1">
	<title>Parti&ccedil;&otilde;es t&iacute;picas do Fdisk antes de sua edi&ccedil;&atilde;o</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-edit1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>O que voc&ecirc; for fazer agora depende de como voc&ecirc; pretende
	particionar seu disco.</para>

      <para>Se a inten&ccedil;&atilde;o &eacute; utilizar o FreeBSD no disco todo (o que
	ir&aacute; apagar todos outros dados presentes no disco ao confirmar
	a continuidade do processo de instala&ccedil;&atilde;o no <application>sysinstall
	</application>) basta apertar a tecla <keycap>A</keycap> que
	significa <quote>utilizar o disco inteiro</quote> 
	(<guimenuitem>Use Entire Disk</guimenuitem>).  As parti&ccedil;&otilde;e
	existentes ser&atilde;o apagadas e substituidas por uma pequena 
	&aacute;rea marcada como <literal>unused</literal> (mais uma vez,
	caracter&iacute;stica das disposi&ccedil;&otilde;es do PC), e uma grande
	parti&ccedil;&atilde;o para o FreeBSD.  Ao fazer isso, &eacute; aconselh&aacute;vel
	selecionar a nova parti&ccedil;&atilde;o FreeBSD com as setas, e apertar
	a tecla <keycap>S</keycap> para marcar a parti&ccedil;&atilde;o como
	inicializ&aacute;vel.  A tela ter&aacute; apar&ecirc;ncia similar &agrave;
	<xref linkend="sysinstall-fdisk2">.  Note a op&ccedil;&atilde;o
	<literal>A</literal> na coluna <literal>Flags</literal>, que indica
	que esta parti&ccedil;&atilde;o &eacute; uma parti&ccedil;&atilde;o <quote>ativa</quote> (<emphasis>
	active</emphasis>) e servir&aacute; como dispositivo de
	inicializa&ccedil;ao.</para>

      <para>Se a inten&ccedil;&atilde;o &eacute; apagar uma parti&ccedil;&atilde;o existente de forma a
	conseguir espa&ccedil;o em disco para o FreeBSD, ent&atilde;o voc&ecirc; deve
	selecionar a parti&ccedil;&atilde;o e apertar <keycap>D</keycap>.  Em seguida	
	pode fazer uso da tecla <keycap>C</keycap> e responder qual
	o tamanho pretendido para a nova parti&ccedil;&atilde;o que voc&ecirc; pretende
	criar.  Entre com o valor apropriado e aperte <keycap>Enter</keycap>.
	O valor padr&atilde;o aqui indica o tamanho m&aacute;ximo poss&iacute;vel para esta
	parti&ccedil;&atilde;o, que na realidade &eacute; o maior bloco cont&iacute;guo de 
	espa&ccedil;ao n&atilde;o alocado, ou o tamanho do disco inteiro.</para>
      
      <para>Se j&aacute; existe espa&ccedil;o para o FreeBSD (por exemplo, se voc&ecirc;
	garantiu espa&ccedil;o com alguma aplica&ccedil;&atilde;o como o
	<application>&partitionmagic;</application>) ent&atilde;o pode
	utilizar a tecla <keycap>C</keycap> para criar uma nova parti&ccedil;&atilde;o.
	Mais uma vez, ser&aacute; necess&aacute;rio informar o tamanho da nova
	parti&ccedil;&atilde;o &agrave; ser criada.</para>

      <figure id="sysinstall-fdisk2">
	<title>Parti&ccedil;&atilde;o FDisk utilizando todo o disco</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-edit2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Ao terminar, aperte <keycap>Q</keycap>.  Suas modifica&ccedil;&otilde;es
	ser&atilde;o salvas pelo <application>sysinstall</application>, mas 
	por enquanto n&atilde;o ser&atilde;o efetivamente aplicadas em disco.</para>
    </sect2>

    <sect2 id="bootmgr">
      <title>Instale um Gerenciador de Inicializa&ccedil;&atilde;o (<foreignphrase>
	Boot Manager</foreignphrase>)</title>

      <para>Agora voc&ecirc; tem a op&ccedil;&atilde;o de instalar um gerenciador do
	processo de inicializa&ccedil;&atilde;o do sistema, ou um gerenciador de
	<foreignphrase>Boot</foreignphrase> como &eacute; conhecido.  &Eacute;
	indicado instalar o gerenciador de inicializa&ccedil;&atilde;o nativo
	do FreeBSD, se:</para>

      <itemizedlist>
	<listitem>
	  <para>Voc&ecirc; tem mais de um disco, e instalou o FreeBSD em algum disco
	   que n&atilde;o seja o primeiro.</para>
	</listitem>

	<listitem>
	  <para>Voc&ecirc; instalou o FreeBSD em conjunto com outro sistema
	  operacional, no mesmo disco, e deseja escolher em que momento
	  o FreeBSD ou o outro sistema devem ser carregados.</para>
	</listitem>
      </itemizedlist>

      <para>Se o FreeBSD ser&aacute; o &uacute;nico sistema operacional nesta
	esta&ccedil;&atilde;o, instalado no primeiro disco r&iacute;gido, o inicializador
	padr&atilde;o do FreeBSD (op&ccedil;&atilde;o <guimenuitem>Standard</guimenuitem>)
	&eacute; o recomendado.  Escolha a op&ccedil;&atilde;o <guimenuitem>None</guimenuitem>
	se a inten&ccedil;&atilde;o for utilizar um outro gerenciador de inicializa&ccedil;&atilde;o
	n&atilde;o nativo, ou se deseja n&atilde;o modificar o setor mestre de
	inicializa&ccedil;&atilde;o do disco.</para>

      <para>Escolha sua op&ccedil;&atilde;o e aperte <keycap>Enter</keycap>.</para>

      <figure id="sysinstall-bootmgr">
	<title>Menu do <foreignphrase>
	Boot Manager</foreignphrase> do FreeBSD</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/boot-mgr" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>A tela de ajuda oferecida ao pressionar <keycap>F1</keycap>,
	oferece algumas informa&ccedil;&otilde;es sobre os problemas impl&iacute;citos
	no compartilhamento de discos r&iacute;gidos entre m&uacute;ltiplos
	sistemas operacionais.</para>
    </sect2>

    <sect2>
      <title>Criando parti&ccedil;&otilde;es em outro disco</title>

      <para>Se houver mais de um disco, o menu voltar&aacute; &agrave; tela
	de sele&ccedil;&atilde;o de unidades de armazenamento ap&oacute;s a sele&ccedil;&atilde;o do
	gerenciador de inicializa&ccedil;&atilde;o.  Se a inten&ccedil;&atilde;o for instalar FreeBSD
	em mais de um disco, ent&atilde;o pode selecionar o outro disco e
	repetir o processo de particionamento usando o 
	<application>FDisk</application>.</para>

      <important>
	<para>Se estiver instalando o FreeBSD em um disco diferente do
	primeiro, ent&atilde;o o gerenciador de inicializa&ccedil;&atilde;o do FreeBSD deve
	ser instalado em ambos os discos.</para>
      </important>

      <figure id="sysinstall-fdisk-drive2">
	<title>Sair da sele&ccedil;&atilde;o de discos</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/fdisk-drive2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>A tecla <keycap>Tab</keycap> alterna entre as op&ccedil;&otilde;es
	&gui.ok; e 
	&gui.cancel;.</para>

      <para>Aperte a tecla <keycap>Tab</keycap> uma &uacute;nica vez para
	selecionar &gui.ok; e depois aperte
	<keycap>Enter</keycap>
	para continuar a instala&ccedil;&atilde;o.</para>
    </sect2>

    <sect2 id="disklabeleditor">
      <title>Criando parti&ccedil;&otilde;es com o
	<application>Disklabel</application></title>
      
      <para>Agora voc&ecirc; deve criar subparti&ccedil;&otilde;es dentro de cada parti&ccedil;&atilde;o
	prim&aacute;ria que voc&ecirc; acabou de criar.  Lembre-se que cada parti&ccedil;&atilde;o
	&eacute; identificada com letras de <literal>a</literal> &agrave; <literal>h
	</literal>, e que as parti&ccedil;&otilde;es <literal>b</literal>, <literal>c
	</literal> e <literal>d</literal> tem significados convencionais
	que devem ser notados aqui.</para>

      <para>Algumas aplica&ccedil;&otilde;es se beneficiam de alguns esquemas
	particulares de particionamento, especialmente se voc&ecirc;
	est&aacute; utilizando parti&ccedil;&otilde;es de tal disposi&ccedil;&atilde;o que utilize
	mais de um disco r&iacute;bido.  Contudo, para sua primeira
	instala&ccedil;&atilde;o, voc&ecirc; n&atilde;o precisa se empenhar tanto na defini&ccedil;&atilde;o
	do particionamento do seu FreeBSD.  &Eacute; mais importante instalar o
	FreeBSD e aprender a utiliza-lo.  Voc&ecirc; pode sempre reinstalar
	o sistema e modificar o esquema de particonamento v&aacute;rias
	vezes, at&eacute; se tornar familiar o suficiente com o sistema
	operacional e seu processo de instala&ccedil;&atilde;o, para a&iacute; sim
	passar a otimizar seu particionamento.</para>

      <para>O esquema atual apresenta quatro parti&ccedil;&otilde;es &mdash; uma para
	o espa&ccedil;o de <literal>swap</literal>, e tr&ecirc;s para sistemas
	de arquivos.</para>

      <table frame="none">
	<title>Disposi&ccedil;&atilde;o de parti&ccedil;&otilde;es para o primeiro disco</title>

	<tgroup cols="4">
          <colspec colwidth="1*">
          <colspec colwidth="1*">
          <colspec colwidth="1*">
          <colspec colwidth="4*">

	  <thead>
	    <row>
	      <entry>Parti&ccedil;&atilde;o</entry>
	      
	      <entry>Sistema de arquivos</entry>

	      <entry>Tamanho</entry>

	      <entry>Descri&ccedil;&atilde;o</entry>
	    </row>
	  </thead>

	  <tbody>
	    <row>
	      <entry><literal>a</literal></entry>

	      <entry><filename>/</filename></entry>

	      <entry>100&nbsp;MB</entry>

	      <entry>Este &eacute; o sistema de arquivos raiz.  Todos os outros
		sistemas de arquivos ser&atilde;o montados em algum ponto
		abaixo deste.  N&atilde;o &eacute; necess&aacute;rio armazenar muitos dados
		neste sistema de arquivos.  Em uma instala&ccedil;&atilde;o regular
		do FreeBSD, ser&atilde;o utilizados cerca de 40&nbsp;MB de
		dados aqui.  O espa&ccedil;o restante &eacute; para dados tempor&aacute;rios
		e tamb&eacute;m oferece espa&ccedil;o para expans&atilde;o se eventualmente
		vers&otilde;es futuras do FreeBSD precisarem de mais espa&ccedil;o na
		<filename>/</filename>.</entry>
	    </row>

	    <row>
	      <entry><literal>b</literal></entry>

	      <entry>N/D</entry>

	      <entry>2-3 x RAM</entry>

	      <entry><para>O espa&ccedil;o de <literal>swap</literal> do sistema &eacute;
		  mantido nesta parti&ccedil;&atilde;o.  Escolher a quantidade correta de
		  espa&ccedil;o para <literal>swap</literal> &eacute; uma quest&atilde;o um tanto
		  quanto art&iacute;stica.  Uma boa regra base &eacute; multiplicar entre
		  duas e tr&ecirc;s vezes o espa&ccedil;o total de mem&oacute;ria f&iacute;sica (RAM)
		  dispon&iacute;vel.  &Eacute; recomendado que, se voc&ecirc; tem menos de 32 MB
		  de mem&oacute;ria, que defina ao menos 64 MB de <literal>swap
		  </literal>.</para><para>Se voc&ecirc; disp&otilde;e de mais de um disco, pode colocar
		  uma parti&ccedil;&atilde;o de <literal>swap</literal> em cada.  
		  FreeBSD vai utilizar ambas para <literal>swap</literal>,
		  e o fato do acesso estar distribu&iacute;do em mais de uma
		  parti&ccedil;&atilde;o de troca, em discos distintos, a velocidade
		  efetiva da a&ccedil;&atilde;o de <literal>swap</literal> &eacute; incrementada.
		  Neste caso, calcule o espa&ccedil;o total de <literal>swap</literal>
		  necess&aacute;rio e divida pela quantidade de discos dispon&iacute;veis (
		  digamos, 128 MB em dois discos), alocando a quantidade
		  resultante em cada um, nesse exemplo, 64 MB de <literal>swap
		  </literal> em cada disco.</para></entry>
	    </row>

	    <row>
	      <entry><literal>e</literal></entry>

	      <entry><filename>/var</filename></entry>

	      <entry>50&nbsp;MB</entry>

	      <entry>O diret&oacute;rio <filename>/var</filename> cont&eacute;m arquivos
		que s&atilde;o constantemente acessados; arquivos de <literal>logs
		</literal>, e outros arquivos administrativos.  A maioria
		destes arquivos s&atilde;o de escrita ou leitura intensivas no
		dia-a-dia da utiliza&ccedil;&atilde;o do FreeBSD.  Adicionar tais
		arquivos a outro sistema de arquivos permite que o acesso a 
		estes arquivos seja otimizado sem afetar outros arquivos
		e diret&oacute;rios que n&atilde;o tem o mesmo padr&atilde;o de acesso.</entry>
	    </row>

	    <row>
	      <entry><literal>f</literal></entry>

	      <entry><filename>/usr</filename></entry>

	      <entry>Restante do disco</entry>

	      <entry>Todos seus outros arquivos ser&atilde;o armazenados tipicamente
		sob o <filename>/usr</filename> e seus subdiret&oacute;rios.</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>
      
      <para>Se o FreeBSD for ser instalado em um servidor com mais de um disco
	&eacute; ideal criar parti&ccedil;&otilde;es nos outros discos tamb&eacute;m.  A forma mais b&aacute;sica
	de faz&ecirc;-lo &eacute; criar duas parti&ccedil;&otilde;es no m&iacute;nimo nos discos auxiliares
	uma para a <literal>swap</literal> e uma para ao menos um sistema
	de arquivos.</para>

      <table frame="none">
	<title>Disposi&ccedil;&atilde;o de parti&ccedil;&otilde;es para discos subsequentes</title>

	<tgroup cols="4">
          <colspec colwidth="1*">
          <colspec colwidth="1*">
          <colspec colwidth="2*">
          <colspec colwidth="3*">

	  <thead>
	    <row>
	      <entry>Parti&ccedil;&atilde;o</entry>
	      
	      <entry>Sistema de arquivos</entry>

	      <entry>Tamanho</entry>

	      <entry>Descri&ccedil;&atilde;o</entry>
	    </row>
	  </thead>

	  <tbody>
	    <row>
	      <entry><literal>b</literal></entry>

	      <entry>N/D</entry>

	      <entry>Ver descri&ccedil;&otilde;es</entry>

	      <entry>Como discutido, o espa&ccedil;o de <literal>swap</literal> pode ser
		dividido em cada disco.  Mesmo considerando que a
		parti&ccedil;&atilde;o <literal>a</literal> esteja livre, a conven&ccedil;&atilde;o dita
		que as parti&ccedil;&otilde;es de troca (<literal>swap</literal>) devem
		ficar na parti&ccedil;&atilde;o <literal>b</literal>.</entry>
	    </row>

	    <row>
	      <entry><literal>e</literal></entry>

	      <entry>/disk<replaceable>n</replaceable></entry>

	      <entry>Restante do disk</entry>

	      <entry>O restante do disco &eacute; utilizado por
		uma parti&ccedil;&atilde;o grande.  Esta parti&ccedil;&atilde;o poderia
		ser a <literal>a</literal>, ao inv&eacute;s da parti&ccedil;&atilde;o
		<literal>e</literal>.  Contudo, por conven&ccedil;&atilde;o
		a parti&ccedil;&atilde;o <literal>a</literal> &eacute; reservada ao
		sistema de arquivos raiz  (<filename>/</filename>).
		Voc&ecirc; n&atilde;o tem obriga&ccedil;&atilde;o de seguir este padr&atilde;o, mas o
		<application>sysinstall</application> o faz, de forma
		que seguir este padr&atilde;o torna sua instala&ccedil;&atilde;o mais limpa.
		Voc&ecirc; pode escolher montar este sistema de arquivos
		em qualquer local; este exemplo sugere que eles sejam
		montados como os diret&oacute;rios <filename>/disk<replaceable>
		n</replaceable></filename>, onde <replaceable>n</replaceable>
		corresponde ao n&uacute;mero que muda de acordo com a ordem de cada
		disco.  Mas voc&ecirc; est&aacute; livre para utilizar um outro esquema,
		se preferir.</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>

      <para>Tendo definido a disposi&ccedil;&atilde;o de seu esquema de particionamento,
	voc&ecirc; pode cria-lo utilizando o <application>sysinstall</application>.
	Voc&ecirc; ver&aacute; a seguinte mensagem:</para>

      <screen>                                 Message
 Now, you need to create BSD partitions inside of the fdisk
 partition(s) just created. If you have a reasonable amount of disk
 space (200MB or more) and don't have any special requirements, simply
 use the (A)uto command to allocate space automatically. If you have
 more specific needs or just don't care for the layout chosen by
 (A)uto, press F1 for more information on manual layout.  

                                [  OK  ]
                          [ Press enter or space ]</screen>

      <para>Aperte <keycap>Enter</keycap> para iniciar o editor de
	parti&ccedil;&otilde;es do FreeBSD, chamado <application>Disklabel</application>.</para>

      <para><xref linkend="sysinstall-label"> apresenta o resultado da primeira
	execu&ccedil;&atilde;o do <application>Disklabel</application>.  A tela &eacute; dividida
	em tr&ecirc;s se&ccedil;&otilde;es.</para>

      <para>As primeiras linhas mostra o nome do disco onde voc&ecirc; est&aacute; trabalhando
	e a parti&ccedil;&atilde;o onde est&aacute; o sistema de arquivos que ser&aacute; criado (neste 
	instante o <application>Disklabel</application> chama-o de <quote>Nome
	da Parti&ccedil;&atilde;o</quote>, ou <literal>Partition name</literal>, ao inv&eacute;s do
	nome da subparti&ccedil;&atilde;o).
	A tela apresenta tamb&eacute;m a quantidade de espa&ccedil;o livre dispon&iacute;vel na
	parti&ccedil;&atilde;o prim&aacute;ria, ou seja o espa&ccedil;o definido ao FreeBSD, mas que ainda
	n&atilde;o foi definido atribu&iacute;do a nenhuma parti&ccedil;&atilde;o.</para>

      <para>O meio da tela apresenta as parti&ccedil;&otilde;es que foram criadas, o nome
	do sistema de arquivos em cada parti&ccedil;&atilde;o, seu tamanho e algumas op&ccedil;&otilde;es
	sobre a cria&ccedil;&atilde;o do sistema de arquivos.</para>

      <para>A base da tela, na terceira imagem, apresenta as teclas de
	comandos que s&atilde;o validas no <application>Disklabel</application>.</para>

      <figure id="sysinstall-label">
	<title>Editor Disklabel do Sysinstall</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-ed1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>O <application>Disklabel</application> pode criar parti&ccedil;&otilde;es
	automaticamente e atribuir espa&ccedil;o padr&atilde;o para cada uma.  Experimente
	esta op&ccedil;&atilde;o agora, pressionando a tecla <keycap>A</keycap>.  Voc&ecirc;
	vai ver mensagens similares as que s&atilde;o apresentadas na
	<xref linkend="sysinstall-label2">.  Dependendo do tamanho do
	disco que voc&ecirc; tem dispon&iacute;vel, os valores padr&atilde;o v&atilde;o variar para
	o tamanho apropriado.  Mas isso n&atilde;o importa, afinal voc&ecirc; n&atilde;o tem
	que aceitar o padr&atilde;o.</para>

	<note>
	  <para>A partir do FreeBSD&nbsp;4.5, o particionamento padr&atilde;o atribui
	  uma parti&ccedil;&atilde;o dedicada ao diret&oacute;rio <filename>/tmp</filename>
	  ao inv&eacute;s de fazer parte do sistema de arquivos raiz
	  (<filename>/</filename>).  Entre outras justificativas, 
	  isso ajuda a evitar que a raiz seja lotada de arquivos
	  tempor&aacute;rios.</para>
	</note>

      <figure id="sysinstall-label2">
	<title>Editor Disklabel do Sysinstall com padr&otilde;es autom&aacute;ticos</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-auto" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Se sua escolha for n&atilde;o utilizar o particionamento padr&atilde;o,
	e voc&ecirc; pretende substitui-lo com sua propria defini&ccedil;&atilde;o, use
	as teclas indicativas para selecionar a primeira parti&ccedil;&atilde;o, 
	aperte <keycap>D</keycap> para apaga-la.  Repita isto para apagar
	todas as parti&ccedil;&otilde;es sugeridas.</para>

      <para>Para criar a primeira parti&ccedil;&atilde;o (<literal>a</literal>, montada como
	<filename>/</filename> &mdash; raiz), garanta que a parti&ccedil;&atilde;o apropriada
	no topo da tela est&aacute; selecionada e aperte <keycap>C</keycap>.  Uma caixa
	de di&aacute;logos aparecer&aacute; perguntando qual o tamanho desejado para a nova
	parti&ccedil;&atilde;o (como apresentado em <xref linkend="sysinstall-label-add">).  Voc&ecirc;
	pode definir o n&uacute;mero de blocos que deseja usar, ou um valor seguido por
	<literal>M</literal> para indicar <quote>megabytes</quote>,
	<literal>G</literal> para <quote>gigabytes</quote>, ou <literal>C</literal>
	para cilindros.</para>

      <note><para>A partir do FreeBSD&nbsp;5.X os usu&aacute;rios podem escolher
	o uso do <acronym>UFS2</acronym> utilizando a op&ccedil;&atilde;o <literal>Custom Newfs</literal>
	(<keycap>Z</keycap>), criar r&oacute;tulos com <literal>Auto Defaults
	</literal> e modifica-los com a op&ccedil;&atilde;o <literal>Custom Newfs</literal>
	ou adicionar <option>-O 2</option> durante a cria&ccedil;&atilde;o regular do
	sistema de arquivos.  N&atilde;o se esque&ccedil;a de manter a op&ccedil;&atilde;o
	<option>-U</option> para indicar o uso do <literal>SoftUpdates</literal>
	se voc&ecirc; fizer uso da op&ccedil;&atilde;o de customiza&ccedil;&atilde;o do <command>newfs</command>,
	<literal>Custom Newfs</literal>!</para></note>

      <figure id="sysinstall-label-add">
	<title>Liberando espa&ccedil;o para a parti&ccedil;&atilde;o raiz</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-root1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>O tamanho padr&atilde;o apresentado criar&aacute; uma parti&ccedil;&atilde;o que ocupa
	o restante do disco.  Se estiver usando os tamanhos de parti&ccedil;&otilde;es
	descritos no exemplo, apague a defini&ccedil;&atilde;o existente utilizando
	<keycap>Backspace</keycap> e digite <userinput>64M</userinput>,
	como apresentando na <xref linkend="sysinstall-label-add2">.  Em
	seguida aperte &gui.ok;.</para>
      
      <figure id="sysinstall-label-add2">
	<title>Editando o tamanho da parti&ccedil;&atilde;o raiz</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-root2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Tendo escolhido o tamanho da parti&ccedil;&atilde;o, o instalador
	solicitar&aacute; que voc&ecirc; informe se a parti&ccedil;&atilde;o vai conter um
	sistema de arquivos ou espa&ccedil;o para <literal>swap</literal>.
	A caixa de di&aacute;logo &eacute; a apresentada em <xref
	linkend="sysinstall-label-type">.  A primeira parti&ccedil;&atilde;o ter&aacute;
	um sistema de arquivos, ent&atilde;o marque o &iacute;tem
	<guimenuitem>FS</guimenuitem> e aperte
	<keycap>Enter</keycap>.</para>

      <figure id="sysinstall-label-type">
	<title>Escolhendo o tipo da parti&ccedil;&atilde;o raiz</title>
	
	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-fs" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
      
      <para>Finalmente, por estar criando um sistema de arquivos, &eacute;
	necess&aacute;rio informar ao <application>Disklabel</application>
	onde o sistema de arquivos em quest&atilde;o deve ser montado.  A caixa
	de di&aacute;logo &eacute; apresentada na
	<xref linkend="sysinstall-label-mount">.  O ponto de montagem
	para a parti&ccedil;&atilde;o raiz &eacute; <filename>/</filename>, portanto
	digite <userinput>/</userinput> e aperte <keycap>Enter</keycap>.</para>

      <figure id="sysinstall-label-mount">
	<title>Escolhendo o ponto de montagem raiz</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-root3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>A tela ser&aacute; atualizada para apresentar as parti&ccedil;&otilde;es rec&eacute;m criadas.
	Este processo deve ser repetido para as outras parti&ccedil;&otilde;es.  Quando
	for criar a parti&ccedil;&atilde;o <literal>swap</literal> o sistema n&atilde;o pedir&aacute;
	o ponto de montagem da parti&ccedil;&atilde;o.  Ao criar a parti&ccedil;&atilde;o final, o
	<filename>/usr</filename>, voc&ecirc; pode manter o tamanho sugerido
	intacto, para utilizar o resto do disco.</para>

      <para>A tela final do editor <quote>DiskLabel</quote> do
	FreeBSD ter&aacute; apar&ecirc;ncia similar a <xref
	linkend="sysinstall-label4">, embora os valores escolhidos
	por voc&ecirc; podem estar diferentes.  Aperte
	<keycap>Q</keycap> para terminar.</para>

      <figure id="sysinstall-label4">
	<title>Editor Disklabel do Sysinstall</title>
	
	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/disklabel-ed2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
    </sect2>
  </sect1>

  <sect1 id="install-choosing">
    <title>Escolhendo o que instalar</title>

    <sect2 id="distset">
      <title>Selecione o conjunto de distribui&ccedil;&atilde;o</title>

      <para>Decidir que conjunto de distribui&ccedil;&atilde;o instalar depende
	muito da inten&ccedil;&atilde;o de uso do sistema e da quantidade de
	espa&ccedil;o em disco dispon&iacute;vel.  As op&ccedil;&otilde;es predefinidas v&atilde;o
	da menor instala&ccedil;&atilde;o poss&iacute;vel &agrave; instalar tudo que estiver
	dispon&iacute;vel.  Usu&aacute;rios ainda n&atilde;o familiarizados com o
	ambiente &unix; ou FreeBSD costumam escolher entre 
	esses dois extremos.  Customizar o conjunto de instala&ccedil;&atilde;o 
	tipicamente &eacute; uma tarefa para usu&aacute;rios mais experientes.</para>

      <para>Aperte <keycap>F1</keycap> para obter mais informa&ccedil;&otilde;es sobre
	cada conjunto de distribui&ccedil;&atilde;o e seu conte&uacute;do.  Ao terminar a
	leitura do arquivo de ajuda, aperte <keycap>Enter</keycap> para
	voltar ao menu de sele&ccedil;&atilde;o de distribui&ccedil;&otilde;es.</para>

      <para>Se uma interface gr&aacute;fica com o usu&aacute;rio for desej&aacute;vel, as
	dsitribui&ccedil;&otilde;es precedidas por um <literal>X</literal> devem ser
	escolhidas.  A configura&ccedil;&atilde;o do <application>&xfree86;</application>
	e sele&ccedil;&atilde;o de um <firstterm>desktop</firstterm> padr&atilde;o faz
	parte dos passos de p&oacute;s-instala&ccedil;&atilde;o do sistema.</para>

      <para>A vers&atilde;o padr&atilde;o do <application>&xfree86;</application> que est&aacute;
	instalada depende da vers&atilde;o do FreeBSD que voc&ecirc; est&aacute; instalando.  Em
	vers&otilde;es do FreeBSD anteriores &agrave; 4.6 o <application>&xfree86;
	3.X</application> &eacute; o instalado.  Para o FreeBSD&nbsp;4.6 e posteriores,
	<application>&xfree86; 4.X</application> &eacute; a s&eacute;rie instalada.</para>

      <para>Voc&ecirc; deve verificar se sua placa de v&iacute;deo &eacute; suportada no
	s&iacute;tio WWW do <ulink url="http://www.xfree86.org/">&xfree86;
	</ulink>e.  Se a placa n&atilde;o for suportada pela vers&atilde;o padr&atilde;o
	que o FreeBSD instalar&aacute;, voc&ecirc; deve desmarcar a distribui&ccedil;&atilde;o
	em quest&atilde;o em favor de uma distribui&ccedil;&atilde;o sem a instala&ccedil;&atilde;o do X.
	Ap&oacute;s a instala&ccedil;&atilde;o do sistema, instale e configure a vers&atilde;o apropriada
	do <application>&xfree86;</application> usando a cole&ccedil;&atilde;o de
	<literal>ports</literal>.</para>

      <para>Se a compila&ccedil;&atilde;o de um novo kernel &eacute; prevista, selecione
	uma op&ccedil;&atilde;o que inclua o c&oacute;digo fonte.  Para mais detalhes sobre
	os motivos pelos quais um kernel customizado deve ser compilado
	ou sobre como compilar um novo kernel, veja a
	<xref linkend="kernelconfig">.</para>

      <para>Obviamente o sistema mais vers&aacute;til &eacute; o que inclui
	tudo que estiver dispon&iacute;vel.  Se tiver espa&ccedil;o em disco
	adequado, selecione a op&ccedil;&atilde;o <guimenuitem>All</guimenuitem>
	como apresentado em <xref linkend="distribution-set1">
	utilizando as teclas indicadoras e aperte <keycap>Enter
	</keycap>.  Se existir preocupa&ccedil;&atilde;o sobre o espa&ccedil;o em disco
	considere utilizar a op&ccedil;&atilde;o que melhor se adequar &agrave;
	sua situa&ccedil;&atilde;o.  N&atilde;o perca tempo tentando encontrar
	o conjunto perfeito de aplica&ccedil;&otilde;es, tendo em vista que
	outras distribui&ccedil;&otilde;es podem ser adicionadas
	ap&oacute;s a instala&ccedil;&atilde;o.</para>

      <figure id="distribution-set1">
	<title>Escolha de distribui&ccedil;&otilde;es</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/dist-set" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>
    </sect2>

    <sect2 id="portscol">
      <title>Instalando a Cole&ccedil;&atilde;o de Ports</title>

      <para>Ap&oacute;s escolher a distribui&ccedil;&atilde;o desejada, &eacute; apresentada
	a oportunidade de instalar a <quote>Cole&ccedil;&atilde;o de <literal>Ports</literal>
	do FreeBSD</quote>.  A cole&ccedil;&atilde;o de <literal>ports</literal>
	&eacute; uma maneira pr&aacute;tica e conveniente de instalar programas.
	A cole&ccedil;&atilde;o de <literal>ports</literal> n&atilde;o cont&eacute;m
	os c&oacute;digos fontes necess&aacute;rios para compilar os
	programas.  Ao inv&eacute;s disto, uma cole&ccedil;&atilde;o de arquivos
	automatiza o <foreignphrase>download</foreignphrase>, 
	compila&ccedil;&atilde;o e instala&ccedil;&atilde;o e pacotes de programas
	de terceiros.  O <xref linkend="ports"> discuste
	a utiliza&ccedil;&atilde;o da cole&ccedil;&atilde;o de <literal>ports
	</literal>.</para>

      <para>O programa de instala&ccedil;&atilde;o n&atilde;o verifica se voc&ecirc;
	tem espa&ccedil;o o bastante para instalar a
	cole&ccedil;&atilde;o de <literal>ports</literal>. Selecione esta
	op&ccedil;&atilde;o apenas se voc&ecirc; realmente tiver espa&ccedil;o o bastante. Por volta
	do FreeBSD &rel.current;, A Cole&ccedil;&atilde;o de <literal>Ports
	</literal> do FreeBSD requer at&eacute; &ports.size de espa&ccedil;o em disco.
	A cada nova vers&atilde;o do FreeBSD um valor maior pode
	seguramente ser assumido.</para>

<screen>                         User Confirmation Requested
 Would you like to install the FreeBSD ports collection? 

 This will give you ready access to over &os.numports; ported software packages,
 at a cost of around &ports.size; of disk space when "clean" and possibly much
 more than that if a lot of the distribution tarballs are loaded
 (unless you have the extra CDs from a FreeBSD CD/DVD distribution
 available and can mount it on /cdrom, in which case this is far less
 of a problem). 

 The ports collection is a very valuable resource and well worth having
 on your /usr partition, so it is advisable to say Yes to this option. 

 For more information on the ports collection & the latest ports,
 visit: 
     http://www.FreeBSD.org/ports  

                              [ Yes ]     No</screen>

      <para>Selecione <guibutton>[ Yes ]</guibutton> com as teclas indicativas
	para instalar a cole&ccedil;&atilde;o de <literal>ports</literal> ou
	<guibutton>[ No ]</guibutton> para pular esta op&ccedil;&atilde;o.  Aperte
	<keycap>Enter</keycap> para continuar.  O menu de sele&ccedil;&atilde;o
	de distribui&ccedil;&atilde;o aparecer&aacute; novamente.</para>

      <figure id="distribution-set2">
	<title>Confirmar distribui&ccedil;&otilde;es</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/dist-set2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Se estiver satisfeito com as op&ccedil;&otilde;es, selecione
	a op&ccedil;&atilde;o	<guimenuitem>Exit</guimenuitem> com as setas,
	garanta que &gui.ok; est&aacute; destacado, e aperte
	<keycap>Enter</keycap> para continuar.</para>

    </sect2>
  </sect1>

  <sect1 id="install-media">
    <title>Escolhendo a m&iacute;dia de instala&ccedil;&atilde;o</title>

    <para>Se a instala&ccedil;&atilde;o estiver sendo realizada &agrave; partir de CDROM ou DVD
	use as setas indicativas para destacar a op&ccedil;&atilde;o
      <guimenuitem>Install from a FreeBSD CD/DVD</guimenuitem>.  Garanta que
	a op&ccedil;&atilde;o &gui.ok; est&aacute; marcada e aparte <keycap>Enter</keycap>
	para continuar com o processo de instala&ccedil;&atilde;o.</para>
    
    <para>Para outros m&eacute;todos de instala&ccedil;&atilde;o, selecione a 
	op&ccedil;&atilde;o apropriada e siga as instru&ccedil;&otilde;es.</para>

    <para>Aperte <keycap>F1</keycap> para visualizar a ajuda instant&acirc;nea
	sobre as m&iacute;dias de instala&ccedil;&atilde;o.  Aperte <keycap>Enter</keycap> para
	voltar ao menu de sele&ccedil;&atilde;o de m&iacute;dias.</para>

    <figure id="choose-media">
      <title>Escolha a m&iacute;dia de instala&ccedil;&atilde;o</title>

      <mediaobject>
	<imageobject>
	  <imagedata fileref="install/media" format="PNG">
	</imageobject>
      </mediaobject>
    </figure>

    <note>
      <title>Modos de instala&ccedil;&atilde;o FTP</title>

      <indexterm>
	<primary>instala&ccedil;&atilde;o</primary>
	<secondary>rede</secondary>
	<tertiary>FTP</tertiary>
      </indexterm>
      
      <para>Existem tr&ecirc;s modos de instala&ccedil;&atilde;o FTP que voc&ecirc;
	pode escolher: FTP ativo, FTP passivo e FTP via proxy.</para>

      <variablelist>
	<varlistentry>
	  <term>FTP Ativo: <guimenuitem>Instala&ccedil;&atilde;o &agrave; partir
		de um servidor FTP</guimenuitem></term>
	  
	  <listitem>
	    <para>Esta op&ccedil;&atilde;o far&aacute; toda transfer&ecirc;ncia FTP ser realizada
		em modo <quote>ativo</quote>.  N&atilde;o funcionar&aacute;
		atr&aacute;s de um <foreignphrase>firewall</foreignphrase>, mas
		frequentemente funcionar&aacute; com servidores FTP antigos, que
		n&atilde;o suportam modo passivo.  Se sua conex&atilde;o travar em
		modo passivo (o padr&atilde;o), tente modo ativo!</para>
	  </listitem>
	</varlistentry>
	
	<varlistentry>
	  <term>FTP Passivo: <guimenuitem>Instala&ccedil;&atilde;o &agrave; partir de um servidor
		FTP atrav&eacute;s de um</guimenuitem> <foreignphrase>firewall</foreignphrase></term>
	  
	  <listitem>
	    <indexterm>
	      <primary>FTP</primary>
	      <secondary>modo passivo</secondary>
	    </indexterm>

	    <para>Essa op&ccedil;&atilde;o instrui o <application>sysinstall</application> a
		utilizar modo <quote>Passivo</quote> para todas opera&ccedil;&otilde;es FTP.
		Isso permite que o usu&aacute;rio passe atrav&eacute;s de <foreignphrase>
		firewall</foreignphrase> que n&atilde;o permite conex&otilde;es entrantes
		em portas TCP rand&ocirc;micas.</para>
	  </listitem>
	</varlistentry>
	
	<varlistentry>
	  <term>FTP atrav&eacute;s de proxy HTTP: <guimenuitem>Instala&ccedil;&atilde;o &agrave; partir
		de um servidor FTP atrv&eacute;s de um proxy HTTP </guimenuitem></term>
	    
	  <listitem>
	    <indexterm>
	      <primary>FTP</primary>
	      <secondary>atrav&eacute;s de <literal>proxy</literal> HTTP</secondary>
	    </indexterm>
	    
	    <para>Essa op&ccedil;&atilde;o instrui o <application>sysinstall</application> &agrave;
		utilizar um protocolo HTTP (como se fosse um navegador)
		para se conectar em um <literal>proxy</literal> e realizar
		opera&ccedil;&otilde;es FTP.  O <literal>proxy</literal> traduzir&aacute; as
		solicita&ccedil;&otilde;es e as encaminhar&aacute; ao servidor FTP.  Isso
		permite que usu&aacute;rios passem por um <foreignphrase>firewall</foreignphrase>
		que n&atilde;o permite FTP, mas oferece um <literal>proxy</literal>
		HTTP.  Neste caso &eacute; necess&aacute;rio especificar o <literal>proxy</literal>
		al&eacute;m do servidor FTP.</para>
	  </listitem>
	</varlistentry>
      </variablelist>
      
      <para>Para o servidor FTP normalmente basta definir o nome do
	servidor desejado como parte do nome de usu&aacute;rio, ap&oacute;s um
	caract&eacute;r <quote>@</quote>.  O servidor <literal>proxy</literal>
	<quote>simula</quote> o servidor real.  Por exemplo, vamos assumir que
	voc&ecirc; deseja instalar o sistema &agrave; partir de <hostid role="fqdn">
	ftp.FreeBSD.org</hostid>, usando o <literal>proxy</literal> FTP no
	servidor <hostid role="fqdn">algum.exemplo.com</hostid>, que escuta
	na porta 1024.</para>
      
      <para>Nesse caso, voc&ecirc; vai no menu de op&ccedil;&otilde;es, define o usu&aacute;rio FTP
	como sendo <literal>ftp@ftp.FreeBSD.org</literal>, e define
	seu endere&ccedil;o de correio eletr&ocirc;nico como sendo a senha.  Como
	m&iacute;dia de instala&ccedil;&atilde;o, especifique FTP (ou FTP passivo, se o
	<literal>proxy</literal> o suportar), e a URL
	<literal>ftp://foo.example.com:1234/pub/FreeBSD</literal>.</para>

      <para>Partindo do princ&iacute;pio que <filename>/pub/FreeBSD</filename> em 
	<hostid role="fqdn">ftp.FreeBSD.org</hostid> &eacute; acessado via
	procura&ccedil;&atilde;o (<literal>proxy</literal>), voc&ecirc; poder&aacute; instalar o 
	sistema &agrave; partir <emphasis>daquela</emphasis> m&aacute;quina (que
	ir&aacute; acessar os arquivos de <hostid role="fqdn">ftp.FreeBSD.org
	</hostid> conforme seu processo de instala&ccedil;&atilde;o os requisita).</para>
    </note>
  </sect1>

  <sect1 id="install-final-warning">
    <title>Efetivando a instala&ccedil;&atilde;o</title>

    <para>Se desejado, a instala&ccedil;&atilde;o pode continuar agora.  Esta tamb&eacute;m &eacute; a &uacute;ltima
	chance que voc&ecirc; tem para abortar a instala&ccedil;&atilde;o e prevenir qualquer
	modifica&ccedil;&atilde;o no disco r&iacute;gido.</para>

    <screen>                       User Confirmation Requested
 Last Chance! Are you SURE you want to continue the installation? 

 If you're running this on a disk with data you wish to save then WE
 STRONGLY ENCOURAGE YOU TO MAKE PROPER BACKUPS before proceeding! 

 We can take no responsibility for lost disk contents!  

                             [ Yes ]    No</screen>

    <para>Selecione <guibutton>[ Yes ]</guibutton> e aperte 
      <keycap>Enter</keycap> para continuar.</para>

    <para>O tempo de instala&ccedil;&atilde;o ir&aacute; variar de acordo com o conjunto
	de distribui&ccedil;&atilde;o escolhido, o tipo de m&iacute;dia e a velocidade do
	computador.  Haver&aacute; uma s&eacute;rie de mensagens sendo apresentadas
	na tela indicando o estado do processo.</para>
    
    <para>A instala&ccedil;&atilde;o estar&aacute; terminada quando a seguinte mensagem for
	apresentada:</para>

    <screen>                               Message 

Congratulations! You now have FreeBSD installed on your system. 

We will now move on to the final configuration questions. 
For any option you do not wish to configure, simply select No. 

If you wish to re-enter this utility after the system is up, you may
do so by typing: /stand/sysinstall .  

                                 [ OK ] 

                      [  Press enter to continue  ]</screen>

    <para>Aperte <keycap>Enter</keycap> para seguir para as 
	configura&ccedil;&otilde;es de p&oacute;s instala&ccedil;&atilde;o.</para>

    <para>Selecionando <guibutton>[ No ]</guibutton> e apertando
	<keycap>Enter</keycap> ir&aacute; abortar a instala&ccedil;&atilde;o, de forma que
	modifica&ccedil;&atilde;o alguma ser&aacute; realizada em seu sistema.  A
	mensagem &agrave; seguir aparecer&aacute;:</para>

    <screen>                                Message
Installation complete with some errors.  You may wish to scroll
through the debugging messages on VTY1 with the scroll-lock feature. 
You can also choose "No" at the next prompt and go back into the
installation menus to retry whichever operations have failed. 

                                 [ OK ]</screen>

    <para>Essa mensagem &eacute; apresentada porque nada foi instalado.
	Apertar <keycap>Enter</keycap> far&aacute; o programa voltar ao
	menu principal de instala&ccedil;&atilde;o e sair do processo.</para>
  </sect1>

  <sect1 id="install-post">
    <title>P&oacute;s-Instala&ccedil;&atilde;o</title>

    <para>Ap&oacute;s a instala&ccedil;&atilde;o bem sucedida do sistema operacional,
	&eacute; iniciada a configura&ccedil;&atilde;o de uma s&eacute;rie de op&ccedil;&otilde;es.  Cada
	op&ccedil;&atilde;o pode ser configurado revisitando as op&ccedil;&otilde;es
	de configura&ccedil;&atilde;o antes de iniciar o rec&eacute;m instalado
	sistema FreeBSD, ou com o sistema j&aacute; instalado
	chamando o comando <command>/stand/sysinstall</command>
	e selecionando a guia <guimenuitem>Configure</guimenuitem>.</para>

    <sect2 id="inst-network-dev">
      <title>Configura&ccedil;&atilde;o dos dispositivos de rede</title>

      <para>Caso tenha configurado PPP para instala&ccedil;&atilde;o FTP anteriormente,
	esta tela n&atilde;o estar&aacute; dispon&iacute;vel, mas pode ser configurada
	posteriormente como ser&aacute; descrito.</para>

      <para>Para obter informa&ccedil;&otilde;es detalhadas sobre Redes Locais, e 
	aobre como configurar o FreeBSD para agir como
	routeador/<foreignphrase>gateway</foreignphrase>, refira-se
	ao cap&iacute;tulo de	<link linkend="advanced-networking">
	Advanced Networking</link>.</para>

      <screen>                      User Confirmation Requested 
   Would you like to configure any Ethernet or SLIP/PPP network devices?

                             [ Yes ]   No</screen>

      <para>Para configurar um dispositivo de rede, selecione
	a op&ccedil;&atilde;o <guibutton>[ Yes ]</guibutton> e aperte <keycap>Enter</keycap>.
	Ou ent&atilde;o selecione <guibutton>[ No ]</guibutton> para continuar.</para>

      <figure id="ed-config1">
	<title>Selecionando dispositivos de rede</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/ed0-conf" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Selecione a interface &agrave; ser configurado com as teclas indicativas
	e aperte <keycap>Enter</keycap>.</para>

      <screen>                      User Confirmation Requested 
       Do you want to try IPv6 configuration of the interface?

                              Yes   [ No ]</screen>

      <para>Nesta rede local privada, o protocolo de endere&ccedil;amento de Internet atual
	(<acronym>IPv4</acronym>) &eacute; suficiente, e selecionar a op&ccedil;&atilde;o <guibutton>[ No ]</guibutton>
	e apertar <keycap>Enter</keycap> satisfaz a necessidade.</para>

      <para>Caso esteja conectado &agrave; uma rede <acronym>IPv6</acronym> com
	um servidor <acronym>RA</acronym>, selecione a op&ccedil;&atilde;o
	<guibutton>[ Yes ]</guibutton> e aperte <keycap>Enter</keycap>.
	Levar&aacute; alguns segundos a busca por servidores RA.</para>

      <screen>                             User Confirmation Requested 
        Do you want to try DHCP configuration of the interface?

                              Yes   [ No ]</screen>

      <para>Caso <acronym>DHCP</acronym> (Protocolo de Configura&ccedil;&atilde;o Din&acirc;mica
	de Esta&ccedil;&otilde;es) n&atilde;o seja necess&aacute;rio, selecione
	a op&ccedil;&atilde;o <guibutton>[ No ]</guibutton> com as teclas
	indicativas e aperte <keycap>Enter</keycap>.</para>

      <para>Caso selecione <guibutton>[ Yes ]</guibutton> o programa
	<application>dhclient</application> ser&aacute; executado, e
	se a busca pelo servidor <acronym>DHCP</acronym> tiver
	sucesso, a configura&ccedil;&atilde;o da rede ser&aacute; automaticamente
	preenchida.  Refira-se &agrave; <xref linkend="network-dhcp"> para
	obter maiores informa&ccedil;&otilde;es.</para>

      <para>A pr&oacute;xima tela de configura&ccedil;&atilde;o da rede
	apresenta a configura&ccedil;&atilde;o do dispositivo de rede em um sistema que
	far&aacute; papel de servidor de liga&ccedil;&atilde;o (<foreignphrase>gateway</foreignphrase>)
	em uma rede local.</para>

      <figure id="ed-config2">
	<title>Ajustando configura&ccedil;&atilde;o de rede para ed0</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/ed0-conf2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Utilize a tecla <keycap>Tab</keycap> para selecionar os campos de
	informa&ccedil;&otilde;es e prencha os dados de forma apropriada:</para>

      <variablelist>
	<varlistentry>
	  <term>Host</term>

	  <listitem>
	    <para>O nome completamente qualificado da esta&ccedil;&atilde;o, como
		por exemplo <hostid role="fqdn">k6-2.example.com</hostid> neste
		caso.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Dom&iacute;nio</term>

	  <listitem>
	    <para>O nome do dom&iacute;nio onde sua esta&ccedil;&atilde;o est&aacute;
		localizada, como <hostid role="domainname">example.com
	</hostid> neste caso.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Gateway IPv4</term>

	  <listitem>
	    <para>Endere&ccedil;o IP da esta&ccedil;&atilde;o que encaminhar&aacute; pacotes para um
		destino n&atilde;o local.  &Eacute; necess&aacute;rio preencher este campo se
		a m&aacute;quina em quest&atilde;o for um cliente de rede.  <emphasis>
		Mantenha este campo em branco</emphasis> se a pr&oacute;pria esta&ccedil;&atilde;o
		for o <foreignphrase>gateway</foreignphrase> para a
		Internet, &agrave; partir de sua rede. O <foreignphrase>gateway</foreignphrase>
		IPv4 tamb&eacute;m &eacute; chamado de <foreignphrase>gateway</foreignphrase>
		padr&atilde;o ou rota padr&atilde;o.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Servidor de nomes</term>

	  <listitem>
	    <para>Endere&ccedil;o IP de seu servidor DNS local.  N&atilde;o h&aacute; servidor
		de nomes nesta rede local, de forma que o endere&ccedil;o IP
		do servidor DNS do provedor 
		(<hostid role="ipaddr">208.163.10.2</hostid>) foi utilizado.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Endere&ccedil;o IPv4</term>

	  <listitem>
	    <para>O endere&ccedil;o IP desta interface &eacute;
	      <hostid role="ipaddr">192.168.0.1</hostid></para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Netmask</term>

	  <listitem>
	    <para>O bloco de endere&ccedil;amento utilizado nesta rede
		&eacute; um bloco de classe C
		(<hostid role="ipaddr">192.168.0.0</hostid> -
		<hostid role="ipaddr">192.168.255.255</hostid>).
		A m&aacute;scara de rede padr&atilde;o para classe C &eacute;
	      (<hostid role="netmask">255.255.255.0</hostid>).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Op&ccedil;&otilde;es extra para o ifconfig</term>

	  <listitem>
	    <para>Qualquer op&ccedil;&atilde;o espec&iacute;fica de uma interface de rede
		que possa ser definida com <command>ifconfig</command>
		pode ser adicionada aqui.  Neste caso n&atilde;o havia nenhuma
		op&ccedil;&atilde;o necess&aacute;ria.</para>
	  </listitem>
	</varlistentry>

      </variablelist>

      <para>Use a tecla <keycap>Tab</keycap> para selecionar &gui.ok;
	quando terminar, e aperte <keycap>Enter</keycap>.</para>


      <screen>                      User Confirmation Requested 
        Would you like to Bring Up the ed0 interface right now?

                             [ Yes ]   No</screen>

      <para>Escolhendo <guibutton>[ Yes ]</guibutton> e apertando 
	<keycap>Enter</keycap> a m&aacute;quina estar&aacute; colocada 
	na rede e pronta para uso.  Entretanto, 
	esta op&ccedil;&atilde;o s&oacute; estar&aacute; plenamente 
	operacional ap&oacute;s um <foreignphrase>reboot</foreignphrase>.</para>
    </sect2>

    <sect2 id="gateway">
      <title>Configura&ccedil;&atilde;o do <foreignphrase>gateway</foreignphrase></title>

      <screen>                       User Confirmation Requested 
       Do you want this machine to function as a network gateway?

                              [ Yes ]    No</screen>

      <para>Se a m&aacute;quina em quest&atilde;o for atuar como <foreignphrase>gateway</foreignphrase>
	para a rede local e encaminhar pacotes entre outras redes,
	escolha <guibutton>[ Yes ]</guibutton> e aperte <keycap>Enter</keycap>.
	Se a m&aacute;quina for apenas um n&oacute; da rede, escolha <guibutton>[ No ]
	</guibutton> e aperte <keycap>Enter</keycap> para continuar.</para>
    </sect2>

    <sect2 id="inetd-services">
      <title>Configura&ccedil;&atilde;o de Servi&ccedil;os de Internet</title>

      <screen>                      User Confirmation Requested
Do you want to configure inetd and the network services that it provides?

                               Yes   [ No ]</screen>

      <para>Se selecionar <guibutton>[ No ]</guibutton> v&aacute;rios servi&ccedil;os
	populares como <application>telnetd</application> n&atilde;o
	ser&atilde;o habilitados.  Isso significa que usu&aacute;rios remotos n&atilde;o poder&atilde;o
	acessar esta m&aacute;quina via <application>telnet</application>.  Os
	usu&aacute;rios locais continuar&atilde;o podendo acessar esta&ccedil;&otilde;es
	remotas via <application>telnet</application>.</para>

     <para>Estes servi&ccedil;os podem ser habilitados ap&oacute;s a
	instala&ccedil;&atilde;o, editando o arquivo <filename>/etc/inetd.conf</filename>
	com seu editor de texto favorito.
	Veja <xref linkend="network-inetd-overview"> para obter mais
	informa&ccedil;&otilde;es.</para>

      <para>Selecione <guibutton>[ Yes ]</guibutton> caso deseje
	configurar estes servi&ccedil;os durante a instala&ccedil;&atilde;o.  Uma
	informa&ccedil;&atilde;o adicional ser&aacute; apresentada:</para>

      <screen>                      User Confirmation Requested
The Internet Super Server (inetd) allows a number of simple Internet
services to be enabled, including finger, ftp and telnetd.  Enabling
these services may increase risk of security problems by increasing
the exposure of your system.

With this in mind, do you wish to enable inetd?

                             [ Yes ]   No</screen>

      <para>Selecione <guibutton>[ Yes ]</guibutton> para continuar.</para>

      <screen>                      User Confirmation Requested
inetd(8) relies on its configuration file, /etc/inetd.conf, to determine
which of its Internet services will be available.  The default FreeBSD
inetd.conf(5) leaves all services disabled by default, so they must be
specifically enabled in the configuration file before they will
function, even once inetd(8) is enabled.  Note that services for
IPv6 must be separately enabled from IPv4 services.

Select [Yes] now to invoke an editor on /etc/inetd.conf, or [No] to
use the current settings.

                             [ Yes ]   No</screen>

      <para>Ao escolher <guibutton>[ Yes ]</guibutton> voc&ecirc; poder&aacute;
	adicionar servi&ccedil;os que ser&atilde;o automaticamente iniciados,
	apagando os caracteres <literal>#</literal> ao in&iacute;cio
	de cada linha.</para>

      <figure id="inetd-edit">
	<title>Editando o arquivo <filename>inetd.conf</filename></title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/edit-inetd-conf" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Ap&oacute;s adicionar os servi&ccedil;os desejados, aperte <keycap>Esc
	</keycap> para visualizar um novo menu que permite 
	sair do editor e salvar as modifica&ccedil;&otilde;es.</para>

    </sect2>

    <sect2 id="ftpanon">
      <title>FTP An&ocirc;nimo</title>

      <screen>                      User Confirmation Requested
 Do you want to have anonymous FTP access to this machine? 

                              Yes    [ No ]</screen>

      <sect3 id="deny-anon">
	<title>Negar FTP an&ocirc;nimo</title>
      
	<para>Selecionar a op&ccedil;&atilde;o padr&atilde;o, <guibutton>[ No ]</guibutton> e apertar
	<keycap>Enter</keycap> ainda permitir&aacute; que usu&aacute;rios tenham contas
	autenticadas por senhas e utilizar FTP para acessar a
	esta&ccedil;&atilde;o.</para>
      </sect3>

      <sect3 id="ftpallow">
	<title>Permitir FTP an&ocirc;nimo</title>

	<para>Qualquer pessoa poder&aacute; acessar a esta&ccedil;&atilde;o, se 
	voc&ecirc; optar por permitir conex&otilde;es FTP an&ocirc;nimas.  As 
	implica&ccedil;&otilde;es de seguran&ccedil;a devem ser consideradas antes
	de habilitar esta op&ccedil;&atilde;o.  Para mais informa&ccedil;&otilde;es
	sobre seguran&ccedil;a, veja <xref linkend="security">.</para>

	<para>Para permitir FTP an&ocirc;nimo, use as flechas indicativas
	para selecionar <guibutton>[ Yes ]</guibutton> e aperte
	<keycap>Enter</keycap>.  A tela seguinte (ou similar)
	ir&aacute; apresentar:</para>

	<figure id="anon-ftp2">
	  <title>Configura&ccedil;&atilde;o padr&atilde;o para FTP an&ocirc;nimo</title>

	  <mediaobject>
	    <imageobject>
	      <imagedata fileref="install/ftp-anon1" format="PNG">
	    </imageobject>
	  </mediaobject>
	</figure>

	<para>Apertar <keycap>F1</keycap> apresentar&aacute; a tela de ajuda:</para>

	<screen>This screen allows you to configure the anonymous FTP user.

The following configuration values are editable:

UID:     The user ID you wish to assign to the anonymous FTP user.
         All files uploaded will be owned by this ID.

Group:   Which group you wish the anonymous FTP user to be in.

Comment: String describing this user in /etc/passwd


FTP Root Directory:

        Where files available for anonymous FTP will be kept.

Upload subdirectory:

        Where files uploaded by anonymous FTP users will go.</screen>

	<para>O diret&oacute;rio de FTP raiz ser&aacute; colocado sob
	<filename>/var</filename> por padr&atilde;o.  Caso voc&ecirc; ainda n&atilde;o
	tenha bastante experi&ecirc;ncia, para antecipar
	suas necessidades de utiliza&ccedil;&atilde;o do FTP, o diret&oacute;rio
	<filename>/usr</filename> pode ser utilizado como
	base para o Diret&oacute;rio Raiz de FTP, ficando
	<filename>/usr/ftp</filename>.</para>

	<para>Quando estiver satisfeito com os valores, aperte
	<keycap>Enter</keycap> para continuar.</para>

	<screen>                          User Confirmation Requested 
         Create a welcome message file for anonymous FTP users?

                              [ Yes ]    No</screen>

	<para>Ao selecionar <guibutton>[ Yes ]</guibutton> e apertar
	<keycap>Enter</keycap>, um editor de texto ser&aacute;
	automaticamente iniciado, permitindo que voc&ecirc;
	edite a mensagem de boas-vindas ao FTP.</para>

	<figure id="anon-ftp4">
	  <title>Editando a mensagem de boas-vindas do FTP</title>

	  <mediaobject>
	    <imageobject>
	      <imagedata fileref="install/ftp-anon2" format="PNG">
	    </imageobject>
	  </mediaobject>
	</figure>

	<para>Este &eacute; o editor de texto <command>ee</command>.  Use as
	 instru&ccedil;&otilde;es para modificar a mensagem ou modifique-a posteriormente
	 com o editor de sua escolha.  Preste aten&ccedil;&atilde;o no nome/localiza&ccedil;&atilde;o
	 do arquivo, na base da tela do editor de textos.</para>

	<para>Aperte <keycap>Esc</keycap> e um menu surgir&aacute; com
	 a op&ccedil;&atilde;o padr&atilde;o definida como <guimenuitem>a) leave editor</guimenuitem>.
	 Aperte <keycap>Enter</keycap> para sair e continuar, e aperte
	 <keycap>Enter</keycap> novamente para salvar as altera&ccedil;&otilde;es,
	 caso tenha feito alguma.</para>
      </sect3>
    </sect2>

    <sect2 id="nfsconf">
      <title>Sistema de arquivos de rede</title>

      <para>O sistema de arquivos de rede (<foreignphrase>Network File System</foreignphrase>
	- <acronym>NFS</acronym>) permite compartilhar arquivos atrav&eacute;s de uma rede.
	Uma esta&ccedil;&atilde;o pode ser configurada como servidor, como cliente, ou ambos.  Por
	gentileza, refira-se &agrave; <xref linkend="network-nfs"> para obter
	mais informa&ccedil;&otilde;es.</para>

      <sect3 id="nsf-server-options">
	<title>Servidor NFS</title>

	<screen>                       User Confirmation Requested
 Do you want to configure this machine as an NFS server? 

                              Yes    [ No ]</screen>

	<para>Se n&atilde;o houver necessidades de um
	 servidor de sistema de arquivos de rede, selecione
	 <guibutton>[ No ]</guibutton> e aperte <keycap>Enter</keycap>.</para>

	<para>Caso <guibutton>[ Yes ]</guibutton> seja escolhido, uma
	 mensagem ser&aacute; apresentada, indicando que o arquivo <filename>exports
	 </filename> deve ser criado.</para>

	<screen>                               Message
Operating as an NFS server means that you must first configure an
/etc/exports file to indicate which hosts are allowed certain kinds of
access to your local filesystems.
Press [Enter] now to invoke an editor on /etc/exports
                               [ OK ]</screen>

	<para>Aperte <keycap>Enter</keycap> para continuar.  Um editor
	 de texto ser&aacute; iniciado, permitindo a cria&ccedil;&atilde;o do arquivo
	 <filename>exports</filename> bem como sua edi&ccedil;&atilde;o.</para>

	<figure id="nfs-server-edit">
	  <title>Editando o arquivo <filename>exports</filename></title>

	  <mediaobject>
	    <imageobject>
	      <imagedata fileref="install/nfs-server-edit" format="PNG">
	    </imageobject>
	  </mediaobject>
	</figure>

	<para>Utilize as instru&ccedil;&otilde;es em quest&atilde;o para
	 adiconar os sistemas de arquivos exportados no momento,
	 ou posteriormente, com um editor de texto de sua escolha.
	 Note a localiza&ccedil;&atilde;o /nome do arquivo na base da tela
	 do editor de textos.</para>

	<para>Aperte <keycap>Esc</keycap> e um menu ir&aacute; surgir na op&ccedil;&atilde;o
	 padr&atilde;o, <guimenuitem>a) leave editor</guimenuitem>.  Aperte
	 <keycap>Enter</keycap> para sair e continuar.</para>
      </sect3>

      <sect3 id="nfs-client-options">
	<title>Cliente NFS</title>

	<para>O cliente NFS permite que sua esta&ccedil;&atilde;o acesse servidores NFS.</para>

	<screen>                       User Confirmation Requested
 Do you want to configure this machine as an NFS client? 

                              Yes   [ No ]</screen>

	<para>Com as teclas de setas, escolha <guibutton>[ Yes ]</guibutton>
	  ou <guibutton>[ No ]</guibutton> como preferir, e aperte
	  <keycap>Enter</keycap>.</para>
      </sect3>
    </sect2>

    <sect2 id="securityprofile">
      <title>Perfil de Seguran&ccedil;a</title>

      <para>Um <quote>Perfil de Seguran&ccedil;a</quote> (<foreignphrase>
	security profile</foreignphrase>) &eacute; um conjunto
	de op&ccedil;&ograve;es de seguran&ccedil;a que tem o objetivo de tentar
	atingir o &iacute;ndice desejado de seguran&ccedil;a e conveni&ecirc;ncia,
	iniciando e desligando certos programas e configura&ccedil;&ograve;es.
	Quanto maior o perfil de seguran&ccedil;a, menos programas
	ser&atilde;o iniciados por padr&atilde;o.  Este &eacute; um dos princ&iacute;pios
	b&aacute;sicos de seguran&ccedil;a: n&atilde;o execute nada a n&atilde;o ser o
	necess&aacute;rio.</para>

      <para>Por gentileza, perceba que o perfil de seguran&ccedil;a n&atilde;o
	passa de uma configura&ccedil;&atilde;o padr&atilde;o.  Todos programas podem
	ser habilitados e desabilitados ap&oacute;s a instala&ccedil;&atilde;o,
	bastando adicionar as linhas adequadas ao arquivo
	<filename>/etc/rc.conf</filename>.  Para obter mais
	informa&ccedil;&otilde;es, por gentileza refira-se &agrave; p&aacute;gina de
	manual &man.rc.conf.5;.</para>

      <para>A tabela a seguir descreve o que cada
	perfil de seguran&ccedil;a faz.  As colunas s&atilde;o as escolhas para
	seus perf&iacute;s, e as linhas s&atilde;o os programas ou
	fun&ccedil;&otilde;es que o perfil habilita ou desabilita.</para>

      <table>
	<title>Perf&iacute;s de seguran&ccedil;a dispon&iacute;veis</title>

	<tgroup cols=3>
	  <thead>
	    <row>
	      <entry></entry>

	      <entry>Extremo</entry>

	      <entry>Moderado</entry>
	    </row>
	  </thead>

	  <tbody>

	    <row>
	      <entry>&man.sendmail.8;</entry>

	      <entry>N&Atilde;O</entry>

	      <entry>SIM</entry>
	    </row>

	    <row>
	      <entry>&man.sshd.8;</entry>

	      <entry>N&Atilde;O</entry>

	      <entry>SIM</entry>
	    </row>

	    <row>
	      <entry>&man.portmap.8;</entry>

	      <entry>N&Atilde;O</entry>

	      <entry>TALVEZ
		<footnote>
		  <para>A op&ccedil;&atilde;o &eacute; habilitada apenas se a esta&ccedil;&atilde;o
			foi configurada como servidor ou cliente NFS
			anteriormente durante a instala&ccedil;&atilde;o.</para>
		</footnote>
	      </entry>
	    </row>

	    <row>
	      <entry>Servidor NFS</entry>

	      <entry>N&Atilde;O</entry>

	      <entry>SIM</entry>
	    </row>

	    <row>
	      <entry>&man.securelevel.8;</entry>

	      <entry>SIM
		<footnote>
		  <para>Se voc&ecirc; escolher um perfim de seguran&ccedil;a que
		  define o n&iacute;vel de seguran&ccedil;a (<literal>securelevel</literal>),
		  em <quote>Alto (High)</quote> ou <quote>Extremo (Exreme)</quote>
		  deve ficar atento &agrave;s implica&ccedil;&otilde;es.  Por gentileza, leia a
		  p&aacute;gina de manual &man.init.8; e preste aten&ccedil;&atilde;o
		  especial aos significados dos n&iacute;veis de seguran&ccedil;a, ou
		  voc&ecirc; ter&aacute; alguns problemas posteriormente!</para>
		</footnote>
	      </entry>

	      <entry>NO</entry>
	    </row>
	  </tbody>
	</tgroup>
      </table>

      <screen>                       User Confirmation Requested
 Do you want to select a default security profile for this host (select
 No for "medium" security)? 

                            [ Yes ]    No</screen>

      <para>Selecionar <guibutton>[ No ]</guibutton> e apertar
	<keycap>Enter</keycap> definir&aacute; o n&iacute;vel de seguran&ccedil;a em m&eacute;dio.</para>

      <para>Selecionar <guibutton>[ Yes ]</guibutton> e apertar
	<keycap>Enter</keycap> permitir&aacute; a sele&ccedil;&atilde;o de um perfil de seguran&ccedil;a
	diferente.</para>

      <figure id="security-profile">
	<title>Op&ccedil;&otilde;es do Perfil de Seguran&ccedil;a</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/security" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Aperte <keycap>F1</keycap> para apresentar a ajuda.  Aperte
	<keycap>Enter</keycap> para voltar ao menu de sele&ccedil;&atilde;o.</para>

      <para>Utilize as teclas indicativas para escolher a op&ccedil;&atilde;o m&eacute;dia (<guimenuitem>
	Medium</guimenuitem>) a n&atilde;o ser que esteja certo de outro n&iacute;vel que
	atenda suas necessidades. Com o &gui.ok; destacado, aperte
	<keycap>Enter</keycap>.</para>

      <para>Uma mensagem de confirma&ccedil;&atilde;o apropriada ser&aacute; apresentada,
	dependendo de que defini&ccedil;&atilde;o de seguran&ccedil;a fora escolhida.</para>

      <screen>                                 Message

Moderate security settings have been selected.

Sendmail and SSHd have been enabled, securelevels are
disabled, and NFS server setting have been left intact.
PLEASE NOTE that this still does not save you from having
to properly secure your system in other ways or exercise
due diligence in your administration, this simply picks
a standard set of out-of-box defaults to start with.

To change any of these settings later, edit /etc/rc.conf

                                  [OK]</screen>

      <screen>                                 Message

Extreme security settings have been selected.

Sendmail, SSHd, and NFS services have been disabled, and
securelevels have been enabled.
PLEASE NOTE that this still does not save you from having
to properly secure your system in other ways or exercise
due diligence in your administration, this simply picks
a more secure set of out-of-box defaults to start with.

To change any of these settings later, edit /etc/rc.conf

                                  [OK]</screen>

      <para>Aperte <keycap>Enter</keycap> para continuar com
	a configura&ccedil;&atilde;o da p&oacute;s-instala&ccedil;&atilde;o.</para>

      <warning>
	<para> O perfil de seguran&ccedil;a n&atilde;o &eacute; <quote>Tiro e Queda</quote>!  
	 Mesmo se
	 as defini&ccedil;&otilde;es extremas forem utilizadas, &eacute; necess&aacute;rio
	 manter-se atualizado com os problemas de seguran&ccedil;as, lendo
	 as <ulink
	 url="../handbook/eresources.html#ERESOURCES-MAIL">listas
	 de discuss&atilde;o</ulink> apropriadas, utilizando boas senhas
	 e mailing geralmente aderindo &agrave; boas pr&aacute;ticas de
	 seguran&ccedil;a.  A op&ccedil;&atilde;o apenas define um &iacute;ndice de configuran&ccedil;a
	 conveniente j&aacute; na instala&ccedil;&atilde;o.</para>
      </warning>

    </sect2>

    <sect2 id="console">
      <title>Configura&ccedil;&otilde;es do console do sistema</title>

      <para>Existem v&aacute;rias op&ccedil;&otilde;es dispon&iacute;veis para a customiza&ccedil;&atilde;o
	do console do sistema.</para>

      <screen>                      User Confirmation Requested 
       Would you like to customize your system console settings?

                              [ Yes ]  No</screen>

      <para>Para visualizar e configurar tais op&ccedil;&otilde;es, 
	selecione <guibutton>[ Yes ]</guibutton> e aperte
	<keycap>Enter</keycap>.</para>

      <figure id="saver-options">
	<title>Op&ccedil;&otilde;es de configura&ccedil;&atilde;o do console do sistema</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Uma das op&ccedil;&otilde;es normalmente utilizadas &eacute; a prote&ccedil;&atilde;o de tela.
	Use as setas para selecionar <guimenuitem>Saver</guimenuitem> e aperte
	<keycap>Enter</keycap>.</para>

      <figure id="saver-select">
	<title>Op&ccedil;&otilde;es da prote&ccedil;&atilde;o de tela</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Escolha o protetor de tela desejado usando as setas, e aperte
	<keycap>Enter</keycap>.  O menu de configura&ccedil;&atilde;o do console do
	sistema ir&aacute; resurgir.</para>

      <para>O intervalo temporal padr&atilde;o &eacute; 300 segundos.  Para modifica-lo
	selecione <guimenuitem>Saver</guimenuitem> novamente.  No menu
	de op&ccedil;&otilde;es do protetor de tela selecione <guimenuitem>Timeout</guimenuitem>
	e aperte <keycap>Enter</keycap>.  Um menu ir&aacute; surgir:</para>

      <figure id="saver-timeout">
	<title>Tempo para prote&ccedil;&atilde;o de tela</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>O valor pode ser modificado, em seguida aperte &gui.ok;
	e <keycap>Enter</keycap> para voltar ao menu
	de op&ccedil;&otilde;es do protetor de tela.</para>

      <figure id="saver-exit">
	<title>Saida da configura&ccedil;&atilde;o do console do sistema</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/console-saver4" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Selecione <guimenuitem>Exit</guimenuitem> e aperte
	<keycap>Enter</keycap> para continuar ao menude
	configura&ccedil;&atilde;o de	p&oacute;s-instala&ccedil;&atilde;o.</para>
    </sect2>

    <sect2 id="timezone">
      <title>Definindo Zona Temporal (Time Zone)</title>

      <para>Definir a zona temporal de sua esta&ccedil;&atilde;o possibilitar&aacute;
	que ela corrija automaticamente seus hor&aacute;rios para
	os padr&otilde;es regionais, e realizar fun&ccedil;&otilde;es de hor&aacute;rio
	de forma apropriada.</para>

      <para>O exemplo apresentado &eacute; para uma esta&ccedil;&atilde;o
	localizada na faixa de hor&aacute;rio do Leste dos Estados Unidos.
	Sua op&ccedil;&atilde;o vai variar de acordo com sua localiza&ccedil;&atilde;o geogr&aacute;fica.</para>

      <screen>                      User Confirmation Requested 
          Would you like to set this machine's time zone now?

                            [ Yes ]   No</screen>

      <para>Selecione <guibutton>[ Yes ]</guibutton> e aperte
	<keycap>Enter</keycap> para selecionar o fuso-hor&aacute;rio.</para>

      <screen>                       User Confirmation Requested
 Is this machine's CMOS clock set to UTC? If it is set to local time
 or you don't know, please choose NO here! 

                              Yes   [ No ]</screen>

      <para>Selecione <guibutton>[ Yes ]</guibutton> 
	ou <guibutton>[ No ]</guibutton> de acordo com a forma
	como o rel&oacute;gio a sua m&aacute;quina est&aacute; configurado, e aperte
	<keycap>Enter</keycap>.</para>

      <figure id="set-timezone-region">
	<title>Selecione sua regi&atilde;o</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/timezone1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>A regi&atilde;o apropriada &eacute; selecionada usando as setas e apertando
	<keycap>Enter</keycap>.</para>

      <figure id="set-timezone-country">
	<title>Selecione seu pa&iacute;s</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/timezone2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Selecione o pa&iacute;s apropriado com as teclas de setas
	e aperte <keycap>Enter</keycap>.</para>

      <figure id="set-timezone-locality">
	<title>Selecione o Fuso-Hor&aacute;rio</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/timezone3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>A zona temporal apropriada pode ser selecionada com
	as teclas indicativas e apertando <keycap>Enter</keycap>.</para>

      <screen>                            Confirmation 
            Does the abbreviation 'EDT' look reasonable?

                            [ Yes ]   No</screen>

      <para>Confirme a abrevia&ccedil;&atilde;o para a zona temporal em quest&atilde;o
	se estiver correta.  Aperte <keycap>Enter</keycap> para
	continuar com a configura&ccedil;&atilde;o p&oacute;s-instala&ccedil;&atilde;o.</para>
    </sect2>

    <sect2 id="linuxcomp">
      <title>Compatibilidade Linux</title>

      <screen>                      User Confirmation Requested 
          Would you like to enable Linux binary compatibility?

                            [ Yes ]   No</screen>

      <para>Selecionando <guibutton>[ Yes ]</guibutton> e apertando
	<keycap>Enter</keycap> permitir&aacute; a execu&ccedil;&atilde;o de aplica&ccedil;&otilde;es
	Linux no FreeBSD.  A instala&ccedil;&atilde;o adicionar&aacute; os pacotes
	apropriados para viabilizar a compatibilidade Linux.</para>

      <para>Se voc&ecirc; estiver instalando o sistema por FTP, a 
	esta&ccedil;&atilde;o necessitar&aacute; estar conectada &agrave; Internet.  As vezes um
	s&iacute;tio FTP remoto n&atilde;o ter&aacute; todas distribui&ccedil;&otilde;es como a 
	compatibilidade bin&aacute;ria Linux.  Esta compatibilidade pode
	ser instalada posteriormente, se desejado.</para>
    </sect2>

    <sect2 id="mouse">
      <title>Configura&ccedil;&otilde;es do Mouse</title>

      <para>Esta op&ccedil;&atilde;o permitir&aacute; que o usu&aacute;rio copie e cole texto
	no console e aplica&ccedil;&otilde;es, com <firstterm>mouse</firstterm> de 3 bot&otilde;es.
	Se voc&ecirc; estiver utilizando um mouse de 2 bot&otilde;es, refira-se &agrave; p&aacute;gina
	de manual &man.moused.8;, ap&oacute;s a instala&ccedil;&atilde;o, para obter detalhes sobre como
	emular o terceiro bot&atilde;o.  Este exemplo aborda um mouse n&atilde;o-USB
	(como um mouse PS/2 ou serial - COM):</para>

      <screen>                      User Confirmation Requested 
         Does this system have a non-USB mouse attached to it?

                            [ Yes ]    No </screen>

      <para>Selecione <guibutton>[ Yes ]</guibutton> para configurar
	um mouse n&atilde;o-USB ou <guibutton>[ No ]</guibutton> para um que seja
	USB, em seguida aperte <keycap>Enter</keycap>.</para>

      <figure id="mouse-protocol">
	<title>Selecione o tipo do protocolo de mouse</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Utilize as setas para escolher <guimenuitem>Type</guimenuitem> e aperte
	<keycap>Enter</keycap>.</para>

      <figure id="set-mouse-protocol">
	<title>Definindo o protocolo do mouse</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>O mouse utilizado neste exemplo &eacute; um PS/2, ent&atilde;o o padr&atilde;o,
	<guimenuitem>Auto</guimenuitem> &eacute; bastante apropriado.  Para modificar
	o protocolo utilize as setas para escolher outra op&ccedil;&atilde;o.  Garanta que
	&gui.ok; est&aacute; marcado e apertte <keycap>Enter</keycap> para sair deste
	menu.</para>

      <figure id="config-mouse-port">
	<title>Configure a porta do mouse</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Utilize as flechinhas para escolher <guimenuitem>Port</guimenuitem> e
	aperte <keycap>Enter</keycap>.</para>

      <figure id="set-mouse-port">
	<title>Definindo a porta do mouse</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse4" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Este sistema possui um mouse PS/2, de forma que
	<guimenuitem>PS/2</guimenuitem> &eacute; a op&ccedil;&atilde;o mais apropriada.  Modifique
	a porta com as setas e aperte <keycap>Enter</keycap> caso
	necess&aacute;rio.</para>

      <figure id="test-daemon">
	<title>Habilite o <literal>daemon</literal> do mouse</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse5" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Por &uacute;ltimo, use as setas e escolha
	<guimenuitem>Enable</guimenuitem>, em seguida aperte
	<keycap>Enter</keycap> para habilitar e testar o
	<literal>daemon</literal> do mouse.</para>


      <figure id="test-mouse-daemon">
	<title>Teste o <literal>daemon</literal> do mouse</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mouse6" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Movimente o mouse pela tela e verifique se o cursor
	responde apropriadamente.  Se estiver funcional, selecione
	<guibutton>Yes</guibutton> e tecle <keycap>Enter</keycap>.  Do
	contr&aacute;rio, o mouse n&atilde;o est&aacute; corretamente configurado &mdash;
	selecione <guibutton>No</guibutton> e tente utilizar outras
	op&ccedil;&otilde;es de configura&ccedil;&atilde;o.</para>

      <para>Selecione <guimenuitem>Exit</guimenuitem> com as setas e aperte
	<keycap>Enter</keycap> para voltar ao menu de configura&ccedil;&atilde;o.</para>
    </sect2>

    <sect2 id="network-services">
      <title>Configurando servi&ccedil;os adicionais de rede</title>

      <para>Configurar servi&ccedil;os de rede pode ser uma tarefa
	&aacute;rdua &agrave; novos usu&aacute;rios, se eles carecem de conhecimento
	nessa &aacute;rea.  Rede, incluindo a Internet, &eacute; cr&iacute;tico
	&agrave; todo sistema operacional moderno, incluindo &os;;
	resultado isso &eacute; que &eacute; bastante &uacute;til entender as
	capacidades de rede do &os; de forma extensa.  Fazer esta
	configura&ccedil;&atilde;o durante a instala&ccedil;&atilde;o garantir&aacute; que os usu&aacute;rios
	obtenham alguma compreens&atilde;o dos v&aacute;rios servi&ccedil;os de rede
	que lhes est&atilde;o disponiveis.</para>

      <para>Servi&ccedil;os de rede s&atilde;o programas que aceitam
	entrada de dados de qualquer parte na rede.  Todo esfor&ccedil;o
	&eacute; feito para garantir que estes programas n&atilde;o causar&atilde;o
	situa&ccedil;&otilde;es <quote>danosas</quote> ao sistema.  Infelizmente,
	programadores n&atilde;o s&atilde;o perfeitos e em dado momento pode acontecer
	de existirem falhas nos servi&ccedil;os de rede que sejam vulner&aacute;veis
	e que possibilitem que usu&aacute;rios mal intencionados fa&ccedil;am coisas
	ruins.  &Eacute; importante que voc&ecirc; habilite apenas os servi&ccedil;os
	de rede que voc&ecirc; sabe que precisa.  Se houver d&uacute;vida, &eacute;
	melhor n&atilde;o habilitar o servi&ccedil;o at&eacute; descobrir que precisa dele.
	&Eacute; sempre poss&iacute;vel habilitar o servi&ccedil;o mais tarde, re-executando
	o <application>sysinstall</application> ou utilizando as
	funcionalidades dispon&iacute;veis no arquivo <filename>/etc/rc.conf
	</filename>.</para>

      <para>Ao selecionar a op&ccedil;&atilde;o <quote>Networking</quote> um menu similar ao
	seguinte, ser&aacute; apresentado:</para>

      <figure id="network-configuration">
	<title>Configura&ccedil;&atilde;o de alto-n&iacute;vel da rede</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/net-config-menu1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>A primeira op&ccedil;&atilde;o, Interfaces, foi previamente coberta
	durante a se&ccedil;&atilde;o de configura&ccedil;&atilde;o dos dispositivos de rede; embora
	esta op&ccedil;&atilde;o possa seguramente ser ignorada.</para>

      <para>Selecionar a op&ccedil;&atilde;o <option>AMD</option> inicia o
	suporte ao utilit&aacute;rio de montagem autom&aacute;tica
	do <acronym>BSD</acronym>.  Normalmente esta op&ccedil;&atilde;o
	&eacute; usada em conjunto com o protocolo <acronym>NFS</acronym>
	(veja abaixo) para automatizar a montagem remota de
	sistema de arquivos.  Nenhuma configura&ccedil;&atilde;o especial &eacute;
	necess&aacute;ria.</para>

      <para>O pr&oacute;ximo da linha s&atilde;o as op&ccedil;&otilde;es do <acronym>AMD</acronym>
	(<acronym>AMD</acronym> <foreignphrase>flags</foreignphrase>)
	Ao selecionar esta op&ccedil;&atilde;o, um menu ir&aacute; surgir pedindo para
	voc&ecirc; preencher informa&ccedil;&otilde;es espec&iacute;ficas sobre as op&ccedil;&otilde;es 
	<acronym>AMD</acronym> desejadas.  O menu j&aacute; cont&eacute;m 
	algumas op&ccedil;&otilde;es padr&atilde;o:</para>

      <screen>-a /.amd_mnt -l syslog /host /etc/amd.map /net /etc/amd.map</screen>

      <para>A op&ccedil;&atilde;o <literal>-a</literal> define a localiza&ccedil;&atilde;o padr&atilde;o
	de montagem, que &eacute; definido aqui como sendo
	<filename>/.amd_mnt</filename>.  A op&ccedil;&atilde;o <literal>-l</literal>
	especifica o arquivo de <filename>log</filename> padr&atilde;o;
	contudo, quando se define <command>syslogd</command>, toda 
	atividade de log ser&aacute; atribuida &agrave; esta aplica&ccedil;&atilde;o.  O diret&oacute;rio
	<filename role="directory">/host</filename> &eacute; utilizado para
	montar um sistema de arquivos exportado &agrave; partir de uma esta&ccedil;&atilde;o
	remota, enquanto o diret&oacute;rio <filename role="directory">
	/net</filename> &eacute; usado para montar um sistema de arquivos
	exportado com base em um endere&ccedil;o <acronym>IP</acronym>.
	O arquivo <filename>/etc/amd.map</filename> define as
	op&ccedil;&otilde;es padr&atilde;o para as exporta&ccedil;&otilde;es <acronym>AMD</acronym>.</para>

      <para>O <acronym>FTP</acronym> an&ocirc;nimo permite conex&otilde;es
	an&ocirc;nimas &agrave; um servidor <acronym>FTP</acronym>.  Fique atento
	aos riscos de seguran&ccedil;a envolvidos com esta op&ccedil;&atilde;o.  Outro menu
	ser&aacute; apresentado para explicar os riscos de seguran&ccedil;a e
	configura&ccedil;&otilde;es em quest&atilde;o.</para>

      <para>O menu de configura&ccedil;&atilde;o <option>Gateway</option> definir&aacute;
	a esta&ccedil;&atilde;o como um servidor de liga&ccedil;&atilde;o, como previamente explicado.
	Esta op&ccedil;&atilde;o pode ser utilizada para desabilitar a op&ccedil;&atilde;o de
	<foreignphrase>gateway</foreignphrase> caso ela tenha sido
	habilitada acidentalmente durante o processo de
	instala&ccedil;&atilde;o.</para>

      <para>A op&ccedil;&atilde;o <option>Inetd</option> pode ser usada para configurar
	ou completamente desabilitar o <literal>daemon</literal> 
	&man.inetd.8; foi discutido anteriormente.</para>

      <para>A op&ccedil;&atilde;o <option>Mail</option> &eacute; utilizada para configurar o
	agente de transfer&ecirc;ncia de correio (<acronym>MTA</acronym> - <foreignphrase>
	Mail Transfer Agent</foreignphrase>) padr&atilde;o do sistema.  Selecionar
	esta op&ccedil;&atilde;o o levar&aacute; ao seguinte menu:</para>

      <figure id="mta-selection">
	<title>Selecione o MTA padr&atilde;o</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mta-main" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Aqui voc&ecirc; pode escolher qual
	<acronym>MTA</acronym> instalar e definir como padr&atilde;o.  Um
	<acronym>MTA</acronym> nada mais &eacute; do que um servidor de
	correio que entrega mensagens &agrave; usu&aacute;rios no sistema local
	e na Internet.</para>

      <para>Ao selecionar <application>Sendmail</application> o popular
	servidor <application>Sendmail</application> ser&aacute; instalado,
	que &eacute; o padr&atilde;o no &os;.  A op&ccedil;&atilde;o <option>Sendmail local</option>
	define que o <application>Sendmail</application> continuar&aacute;
	sendo o <acronym>MTA</acronym> padr&atilde;o, mas ir&aacute; desabilitar a
	funcionalidade de receber mensagens vindas da Internet.  As 
	outras op&ccedil;&otilde;es aqui, <application>Postfix</application> e
	<application>Exim</application> agem de forma similar
	ao <application>Sendmail</application>.  Ambos entregam
	mensagens de correio eletr&ocirc;nico; contudo, alguns usu&aacute;rios
	os preferem como alternativas ao <acronym>MTA</acronym>
	<application>Sendmail</application>.</para>

      <para>Ap&oacute;s escolher um <acronym>MTA</acronym> ou escolher n&atilde;o
	iniciar nenhum, o menu de configura&ccedil;&atilde;o da rede aparecer&aacute;
	com a pr&oacute;xima op&ccedil;&atilde;o, o cliente <acronym>NFS</acronym>.</para>

      <para>O cliente <acronym>NFS</acronym> configurar&aacute; o sistema
	de forma que ele possa se comunicar com um servidor
	atrav&eacute;s de <acronym>NFS</acronym>.  Um servidor <acronym>NFS
	</acronym> torna sistemas de arquivos dispon&iacute;veis &agrave;
	outras esta&ccedil;&otilde;es na rede atrav&eacute;s do protocolo <acronym>NFS
	</acronym>.  Se a m&aacute;quina que voc&ecirc; est&aacute; trabalhando for
	uma m&aacute;quina isolada, mantenha esta op&ccedil;&atilde;o desativada.
	O sistema poder&aacute; solicitar maiores configura&ccedil;&otilde;es mais
	tarde; veja <xref linkend="network-nfs"> para obter mais
	informa&ccedil;&ograve;es sobre configura&ccedil;&otilde;es cliente e servieor.</para>

      <para>Abaixo desta op&ccedil;&atilde;o est&aacute; a op&ccedil;&atilde;o de servidor <acronym>NFS</acronym>
	que permite que o sistema seja ajustado como tal.  As informa&ccedil;&otilde;es
	necess&aacute;rias para iniciar as chamadas remotas de procedimentos,
	<acronym>RPC</acronym>, s&atilde;o adicionadas com esta op&ccedil;&atilde;o.  
	O <acronym>RPC</acronym> &eacute; utilizado para coordenar as conex&otilde;es
	entre esta&ccedil;&otilde;es e programas.</para>

      <para>Na pr&oacute;xima linha est&aacute; a op&ccedil;&atilde;o <option>Ntpdate</option> que
	trata da sincroniza&ccedil;&atilde;o de hora.  Ao seleciona-la, um menu como
	o seguinte ser&aacute; apresentado:</para>

      <figure id="Ntpdate-config">
	<title>Configura&ccedil;&atilde;o Ntpdate</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/ntp-config" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Neste menu, selecione o servidor que for mais pr&oacute;ximo
	de sua localiza&ccedil;&atilde;o.  Um servidor mais pr&oacute;ximo tornar&aacute;
	a sincronia de hor&aacute;rios mais precisa, pois um servidor
	distante pode provocar lat&ecirc;ncia na conex&atilde;o.</para>

      <para>A op&ccedil;&atilde;o seguinte &eacute; <acronym>PCNFSD</acronym>. Seleciona-la
	instalar&aacute; o pacote <filename role="package">net/pcnfsd</filename>
	&agrave; partir da cole&ccedil;&atilde;o de <literal>ports</literal>.  &Eacute; uma
	aplica&ccedil;&atilde;o &uacute;til que oferece servi&ccedil;os de autentica&ccedil;&atilde;o
	<acronym>NFS</acronym> em sistemas que s&atilde;o incapazes de
	oferecer tais servi&ccedil;os por si s&oacute;, como o sistema operacional
	<acronym>DOS</acronym> da Microsoft.</para>

      <para>Agora ser&aacute; necess&aacute;rio paginar um pouco a tela para
	visualizar as outras op&ccedil;&otilde;es:</para>

      <figure id="Network-configuration-cont">
	<title>Configura&ccedil;&atilde;o da rede em baixo n&iacute;vel</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/net-config-menu2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Os utilit&aacute;rios &man.rpcbind.8;, &man.rpc.statd.8;, e
	&man.rpc.lockd.8; s&atilde;o todos utilizados para chamadas remotas
	de procedimento (<acronym>RPC</acronym>).
	O utilit&aacute;rio <command>rpcbind.8</command> gerencia a comunica&ccedil;&atilde;o
	entre servidores e clientes <acronym>NFS</acronym>, e &eacute;
	necess&aacute;rio para que os servidores <acronym>NFS</acronym> operem
	de forma correta.  O <literal>daemon</literal> <command>rpc.statd
	</command> interage com o <command>rpc.statd</command> em outra
	esta&ccedil;&atilde;o, para prover monitora&ccedil;&atilde;o do estado da conex&atilde;o.  O estado
	relatado normalmente &eacute; mantido no arquivo
	<filename>/var/db/statd.status</filename>.  A op&ccedil;&atilde;o final aqui
	listada &eacute; <command>rpc.lockd</command> que, ao ser selecionada,
	prov&ecirc; servi&ccedil;o de restri&ccedil;&atilde;o de acesso aos arquivos.  Normalmente ele
	&eacute; utilizado em conjunto com o <command>rpc.statd</command> para monitorar
	quais esta&ccedil;&otilde;es est&atilde;o requisitando acesso simultaneo aos arquivos e
	com que frequ&ecirc;ncia os requisita.  Enquanto estas &uacute;ltimas duas
	op&ccedil;&otilde;es s&atilde;o sensacionais para depura&ccedil;&atilde;o, n&atilde;o s&atilde;o necess&aacute;rias para
	o correto funcionamento de clientes e servidores <acronym>NFS
	</acronym>.</para>

      <para>Um pouco mais abaixo na lista de op&ccedil;&otilde;es, est&aacute; o &iacute;tem
	<option>Routed</option>, que na verdade n&atilde;o passa de um
	<literal>daemon</literal> de roteamento.  O
	&man.routed.8; gerencia tabela de roteamentos na rede, descobre
	roteadores <literal>multicast</literal> e distribui uma
	c&oacute;pia de sua tabela de roteamento &agrave; qualquer esta&ccedil;&atilde;o fisicamente
	conectada &agrave; rede, que tenha fun&ccedil;&atilde;o de <foreignphrase>gateway
	</foreignphrase> (veja as p&aacute;ginas de manual &man.icmp.4 e
	&man.udp.4;).  Ao ser selecionada, um menu ser&aacute; apresentado
	solicitando a localiza&ccedil;&atilde;o padr&atilde;o para o utilit&aacute;rio.
	A localiza&ccedil;&atilde;o padr&atilde;o j&aacute; est&aacute; definida, e pode ser selecionada
	com a tecla <keycap>Enter</keycap>.  Em seguida voc&ecirc; ver&aacute; um
	outro menu, desta feita solicitando op&ccedil;&otilde;es extras &agrave; serem
	passadas ao <command>routed</command>.  A op&ccedil;&atilde;o padr&atilde;o &eacute;
	<literal>-q</literal> e j&aacute; deve estar dispon&iacute;vel na
	tela.</para>

      <para>Na linha seguinte est&aacute; a op&ccedil;&atilde;o <option>Rwhod</option> que inicia
	a aplica&ccedil;&atilde;o &man.rwhod.8; durante a inicializa&ccedil;&atilde;o do sistema.
	O utilit&aacute;rio <command>rwhod</command> envia mensagens do sistema
	em <literal>broadcast</literal> para toda a rede, periodicamente, ou
	adquire tais informa&ccedil;&otilde;es quando operando em modo <quote>consumidor
	</quote>.  Mais informa&ccedil;&ograve;es podem ser encontradas nas p&aacute;ginas
	de manual &man.ruptime.1; e &man.rwho.1;.</para>

      <para>A pr&oacute;xima op&ccedil;&atilde;o na lista &eacute; o <literal>daemon</literal> 
	&man.sshd.8;.  Trata-se do servidor de terminal seguro do
	<application>OpenSSH</application> e &eacute; altamente 
	recomend&aacute;vel em substitui&ccedil;&atilde;o aos tradicionais servidores
	<command>telnet</command> e <acronym>FTP</acronym>.  O servidor
	<command>sshd</command> &eacute; utilizado para estabelecer uma liga&ccedil;&atilde;o
	segura entre uma esta&ccedil;&atilde;o e outra, por meio de conex&otilde;es
	criptografadas.</para>

      <para>Finalmente, a op&ccedil;&atilde;o de Extens&otilde;es <acronym>TCP</acronym>.
	Ela habilita as extens&otilde;es <acronym>TCP</acronym> definidas
	na <acronym>RFC</acronym>&nbsp;1323 e
	<acronym>RFC</acronym>&nbsp;1644.  Em v&aacute;rias esta&ccedil;&otilde;es estas
	extens&otilde;es podem aumentar a velocidade das conex&otilde;es, mas em
	outras pode causar interrup&ccedil;&atilde;o da conex&atilde;o.  Estas extens&otilde;es
	n&atilde;o s&atilde;o recomendadas para servidores, mas podem trazer
	bons benef&iacute;cios em esta&ccedil;&otilde;es cliente.</para>

      <para>Agora que voc&ecirc; configurou os servi&ccedil;os de rede, pode paginar
	at&eacute; o &iacute;tem mais alto e escolher a op&ccedil;&atilde;o <option>Exit</option>
	e continuar para a pr&oacute;xima se&ccedil;&atilde;o de configura&ccedil;&atilde;o.</para>

    </sect2>

    <sect2 id="x-server">
      <title>Configura&ccedil;&atilde;o do servidor X</title>

      <para>Para utilizar uma interface gr&aacute;fica com o usu&aacute;rio, como o
	<application>KDE</application>, <application>GNOME</application>,
	ou v&aacute;rios outros, o servidor X necessitar&aacute; ser configurado.</para>

      <note>
	<para>Para utulizar o <application>&xfree86;</application> como usu&aacute;rio
	 n&atilde;o <username>root</username> ser&aacute; necess&aacute;rio ter o pacote
	 <filename role="package">x11/wrapper</filename> instalado.
	 Ele &eacute; instalado por padr&atilde;o &agrave; partir do FreeBSD 4.7.  Em vers&otilde;es
	 anteriores ao 4.7, ele deve ser adicionado por meio do menu
	 de sele&ccedil;&atilde;o de pacotes.</para>
      </note>

      <para>Para ver se sua placa de v&iacute;deo &eacute; suportada, verifique o s&iacute;tio WWW
	do <ulink url="http://www.xfree86.org/">&xfree86;</ulink>.</para>

      <screen>                      User Confirmation Requested 
        Would you like to configure your X server at this time?

                            [ Yes ]   No</screen>

      <warning>
	<para> &Eacute; necess&aacute;rio conhecer as especifica&ccedil;&otilde;es do seu monitor
	e informa&ccedil;&otilde;es sobre sua placa de v&iacute;deo.  Danos no equipamento
	podem eventualmente ocorrer caso as configura&ccedil;&otilde;es estejam
	incorretas.  Caso voc&ecirc; n&atilde;o tenha estas informa&ccedil;&ograve;es, selecione
	<guibutton>[ No ]</guibutton> e fa&ccedil;a a configura&ccedil;&atilde;o de
	v&iacute;deo depois que a instala&ccedil;&atilde;o for conclu&iacute;da, quando tiver
	estas informa&ccedil;&otilde;es em m&atilde;os.  Pode utilizar o
	<command>/stand/sysinstall</command>, selecionando a
	op&ccedil;&atilde;o <guimenuitem>Configure</guimenuitem> e depois disso,
	<guimenuitem>XFree86</guimenuitem>, para retornar &agrave; este processo
	de configura&ccedil;&atilde;o a qualquer momento depois do sistema instalado.
	Configura&ccedil;&agrave;o impr&oacute;pria do servidor X neste momento pode causar
	instabilidade na m&aacute;quina.  Normalmente &eacute; aconselh&aacute;vel
	configurar o servidor X uma vez que a instala&ccedil;&atilde;o esteja
	terminada.</para>
      </warning>

      <para>Caso tenha as informa&ccedil;&otilde;es sobre o monitor e placa de rede,
	escolha <guibutton>[ Yes ]</guibutton> e aperte <keycap>Enter</keycap>
	para proceder &agrave; configura&ccedil;&atilde;o do servidor X.</para>

      <figure id="xserver2">
	<title>Menu de sele&ccedil;&atilde;o do m&eacute;todo de configura&ccedil;&atilde;o</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/xf86setup" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Existem diversas formas de configurar o servidor X.
	Use as teclas indicativas e selecione um dos m&eacute;todos dispon&iacute;veis
	no <command>sysinstall</command>, e aperte <keycap>Enter</keycap>.
	Leia todas as instru&ccedil;&otilde;es cuidadosamente.</para>

      <para>Os m&eacute;todos <application>xf86cfg</application> e 
	<application>xf86cfg -textmode</application> podem fazer a tela
	ficar escura e demorar alguns poucos segundos para iniciar.
	Seja paciente.</para>


      <para>&Agrave; seguir ser&aacute; apresentada uma ilustra&ccedil;&atilde;o da ferramenta
	de configura&ccedil;&atilde;o <application>xf86config</application>.  As 
	op&ccedil;&otilde;es de configura&ccedil;&atilde;o que voc&ecirc; fizer depender&atilde;o do equipamento
	dispon&iacute;vel na sua m&aacute;quina, de forma que suas escolhas certamente
	ser&atilde;o diferentes das apresentadas:</para>

      <screen>                                Message
 You have configured and been running the mouse daemon. 
 Choose "/dev/sysmouse" as the mouse port and "SysMouse" or
 "MouseSystems" as the mouse protocol in the X configuration utility. 

                                 [ OK ]

                      [ Press enter to continue ]</screen>

      <para>Indica que a configura&ccedil;&atilde;o pr&eacute;via do <literal>daemon</literal>
	do mouse foi detectada.  Aperte <keycap>Enter</keycap> para continuar.</para>

      <para>Ao iniciar o <application>xf86config</application>, uma breve introdu&ccedil;&atilde;o
	ser&aacute; apresentada:</para>

      <screen>This program will create a basic XF86Config file, based on menu selections you
make.

The XF86Config file usually resides in /usr/X11R6/etc/X11 or /etc/X11. A sample
XF86Config file is supplied with XFree86; it is configured for a standard
VGA card and monitor with 640x480 resolution. This program will ask for a
pathname when it is ready to write the file.

You can either take the sample XF86Config as a base and edit it for your
configuration, or let this program produce a base XF86Config file for your
configuration and fine-tune it.

Before continuing with this program, make sure you know what video card
you have, and preferably also the chipset it uses and the amount of video
memory on your video card. SuperProbe may be able to help with this.

Press enter to continue, or ctrl-c to abort.</screen>

      <para>Apertando <keycap>Enter</keycap>, a configura&ccedil;&atilde;o do mouse
	ser&aacute; iniciada.  Garanta que as instru&ccedil;&otilde;es sejam seguidas
	e use o &iacute;tem <quote>Mouse Systems</quote> como protocolo de mouse
	e <devicename>/dev/sysmouse</devicename> como porta para o mesmo,
	se o seu dispositivo de mouse for PS/2 como no modelo
	ilustrado anteriormente.</para>

      <screen>First specify a mouse protocol type. Choose one from the following list:

 1.  Microsoft compatible (2-button protocol)
 2.  Mouse Systems (3-button protocol) & FreeBSD moused protocol
 3.  Bus Mouse
 4.  PS/2 Mouse
 5.  Logitech Mouse (serial, old type, Logitech protocol)
 6.  Logitech MouseMan (Microsoft compatible)
 7.  MM Series
 8.  MM HitTablet
 9.  Microsoft IntelliMouse

If you have a two-button mouse, it is most likely of type 1, and if you have
a three-button mouse, it can probably support both protocol 1 and 2. There are
two main varieties of the latter type: mice with a switch to select the
protocol, and mice that default to 1 and require a button to be held at
boot-time to select protocol 2. Some mice can be convinced to do 2 by sending
a special sequence to the serial port (see the ClearDTR/ClearRTS options).

Enter a protocol number: 2

You have selected a Mouse Systems protocol mouse. If your mouse is normally
in Microsoft-compatible mode, enabling the ClearDTR and ClearRTS options
may cause it to switch to Mouse Systems mode when the server starts.

Please answer the following question with either 'y' or 'n'.
Do you want to enable ClearDTR and ClearRTS? n

You have selected a three-button mouse protocol. It is recommended that you
do not enable Emulate3Buttons, unless the third button doesn't work.

Please answer the following question with either 'y' or 'n'.
Do you want to enable Emulate3Buttons? y

Now give the full device name that the mouse is connected to, for example
/dev/tty00. Just pressing enter will use the default, /dev/mouse.
On FreeBSD, the default is /dev/sysmouse.

Mouse device: /dev/sysmouse</screen>

      <para>O teclado deve ser configurado no pr&oacute;ximo &iacute;tem.  Um modelo gen&eacute;rico
	de 1001 teclas &eacute; apresentado como modelo ilustrativo.  Qualquer nome
	pode ser usado como variante, ou simplesmente aperte <keycap>Enter
	</keycap> para aceitar o valor padr&atilde;o.</para>

      <screen>Please select one of the following keyboard types that is the better
description of your keyboard. If nothing really matches,
choose 1 (Generic 101-key PC)

  1  Generic 101-key PC                                
  2  Generic 102-key (Intl) PC                         
  3  Generic 104-key PC                                
  4  Generic 105-key (Intl) PC                         
  5  Dell 101-key PC                                   
  6  Everex STEPnote                                   
  7  Keytronic FlexPro                                 
  8  Microsoft Natural                                 
  9  Northgate OmniKey 101                             
 10  Winbook Model XP5                                 
 11  Japanese 106-key                                  
 12  PC-98xx Series                                    
 13  Brazilian ABNT2                                   
 14  HP Internet                                       
 15  Logitech iTouch                                   
 16  Logitech Cordless Desktop Pro                     
 17  Logitech Internet Keyboard                        
 18  Logitech Internet Navigator Keyboard              
 19  Compaq Internet                                   
 20  Microsoft Natural Pro                             
 21  Genius Comfy KB-16M                               
 22  IBM Rapid Access                                  
 23  IBM Rapid Access II                               
 24  Chicony Internet Keyboard                         
 25  Dell Internet Keyboard                            

Enter a number to choose the keyboard.

1


Please select the layout corresponding to your keyboard


  1  U.S. English                                      
  2  U.S. English w/ ISO9995-3                         
  3  U.S. English w/ deadkeys                          
  4  Albanian                                          
  5  Arabic                                            
  6  Armenian                                          
  7  Azerbaidjani                                      
  8  Belarusian                                        
  9  Belgian                                           
 10  Bengali                                           
 11  Brazilian                                         
 12  Bulgarian                                         
 13  Burmese                                           
 14  Canadian                                          
 15  Croatian                                          
 16  Czech                                             
 17  Czech (qwerty)                                    
 18  Danish                                            

Enter a number to choose the country.
Press enter for the next page

1


Please enter a variant name for 'us' layout. Or just press enter
for default variant

us


Please answer the following question with either 'y' or 'n'.
Do you want to select additional XKB options (group switcher,
group indicator, etc.)? n</screen>

      <para>Em seguida, vamos para a configura&ccedil;&atilde;o do monitor. Jamais
	exceda as taxa de frequ&ecirc;ncia de seu equipamento.  Danos poder&atilde;o
	ocorrer.  Caso tenha alguma d&uacute;vida, realize esta configura&ccedil;&atilde;o
	depois que tiver estas informa&ccedil;&otilde;es em m&atilde;os.</para>

      <screen>Now we want to set the specifications of the monitor. The two critical
parameters are the vertical refresh rate, which is the rate at which the
whole screen is refreshed, and most importantly the horizontal sync rate,
which is the rate at which scanlines are displayed.

The valid range for horizontal sync and vertical sync should be documented
in the manual of your monitor. If in doubt, check the monitor database
/usr/X11R6/lib/X11/doc/Monitors to see if your monitor is there.

Press enter to continue, or ctrl-c to abort.



You must indicate the horizontal sync range of your monitor. You can either
select one of the predefined ranges below that correspond to industry-
standard monitor types, or give a specific range.

It is VERY IMPORTANT that you do not specify a monitor type with a horizontal
sync range that is beyond the capabilities of your monitor. If in doubt,
choose a conservative setting.

    hsync in kHz; monitor type with characteristic modes
 1  31.5; Standard VGA, 640x480 @ 60 Hz
 2  31.5 - 35.1; Super VGA, 800x600 @ 56 Hz
 3  31.5, 35.5; 8514 Compatible, 1024x768 @ 87 Hz interlaced (no 800x600)
 4  31.5, 35.15, 35.5; Super VGA, 1024x768 @ 87 Hz interlaced, 800x600 @ 56 Hz
 5  31.5 - 37.9; Extended Super VGA, 800x600 @ 60 Hz, 640x480 @ 72 Hz
 6  31.5 - 48.5; Non-Interlaced SVGA, 1024x768 @ 60 Hz, 800x600 @ 72 Hz
 7  31.5 - 57.0; High Frequency SVGA, 1024x768 @ 70 Hz
 8  31.5 - 64.3; Monitor that can do 1280x1024 @ 60 Hz
 9  31.5 - 79.0; Monitor that can do 1280x1024 @ 74 Hz
10  31.5 - 82.0; Monitor that can do 1280x1024 @ 76 Hz
11  Enter your own horizontal sync range

Enter your choice (1-11): 6

You must indicate the vertical sync range of your monitor. You can either
select one of the predefined ranges below that correspond to industry-
standard monitor types, or give a specific range. For interlaced modes,
the number that counts is the high one (e.g. 87 Hz rather than 43 Hz).

 1  50-70
 2  50-90
 3  50-100
 4  40-150
 5  Enter your own vertical sync range

Enter your choice: 2

You must now enter a few identification/description strings, namely an
identifier, a vendor name, and a model name. Just pressing enter will fill
in default names.

The strings are free-form, spaces are allowed.
Enter an identifier for your monitor definition: Hitachi</screen>

      <para>A sele&ccedil;&atilde;o de uma placa de rede &agrave; partir de uma lista de
	equipamentos dispon&iacute;veis, &eacute; a pr&oacute;xima op&ccedil;&atilde;o.  Se voc&ecirc; passar
	da sua placa na lista, continue e aperte <keycap>Enter</keycap>
	e a lista comecar&aacute; desde o princ&iacute;pio novamente.  Apenas um trecho
	da lista ser&aacute; apresentada:</para>

      <screen>Now we must configure video card specific settings. At this point you can
choose to make a selection out of a database of video card definitions.
Because there can be variation in Ramdacs and clock generators even
between cards of the same model, it is not sensible to blindly copy
the settings (e.g. a Device section). For this reason, after you make a
selection, you will still be asked about the components of the card, with
the settings from the chosen database entry presented as a strong hint.

The database entries include information about the chipset, what driver to
run, the Ramdac and ClockChip, and comments that will be included in the
Device section. However, a lot of definitions only hint about what driver
to run (based on the chipset the card uses) and are untested.

If you can't find your card in the database, there's nothing to worry about.
You should only choose a database entry that is exactly the same model as
your card; choosing one that looks similar is just a bad idea (e.g. a
GemStone Snail 64 may be as different from a GemStone Snail 64+ in terms of
hardware as can be).

Do you want to look at the card database? y



288  Matrox Millennium G200 8MB                        mgag200
289  Matrox Millennium G200 SD 16MB                    mgag200
290  Matrox Millennium G200 SD 4MB                     mgag200
291  Matrox Millennium G200 SD 8MB                     mgag200
292  Matrox Millennium G400                            mgag400
293  Matrox Millennium II 16MB                         mga2164w
294  Matrox Millennium II 4MB                          mga2164w
295  Matrox Millennium II 8MB                          mga2164w
296  Matrox Mystique                                   mga1064sg
297  Matrox Mystique G200 16MB                         mgag200
298  Matrox Mystique G200 4MB                          mgag200
299  Matrox Mystique G200 8MB                          mgag200
300  Matrox Productiva G100 4MB                        mgag100
301  Matrox Productiva G100 8MB                        mgag100
302  MediaGX                                           mediagx
303  MediaVision Proaxcel 128                          ET6000
304  Mirage Z-128                                      ET6000
305  Miro CRYSTAL VRX                                  Verite 1000

Enter a number to choose the corresponding card definition.
Press enter for the next page, q to continue configuration.

288

Your selected card definition:

Identifier: Matrox Millennium G200 8MB
Chipset:    mgag200
Driver:     mga
Do NOT probe clocks or use any Clocks line.

Press enter to continue, or ctrl-c to abort.



Now you must give information about your video card. This will be used for
the "Device" section of your video card in XF86Config.

You must indicate how much video memory you have. It is probably a good
idea to use the same approximate amount as that detected by the server you
intend to use. If you encounter problems that are due to the used server
not supporting the amount memory you have (e.g. ATI Mach64 is limited to
1024K with the SVGA server), specify the maximum amount supported by the
server.

How much video memory do you have on your video card:

 1  256K
 2  512K
 3  1024K
 4  2048K
 5  4096K
 6  Other

Enter your choice: 6

Amount of video memory in Kbytes: 8192

You must now enter a few identification/description strings, namely an
identifier, a vendor name, and a model name. Just pressing enter will fill
in default names (possibly from a card definition).

Your card definition is Matrox Millennium G200 8MB.

The strings are free-form, spaces are allowed.
Enter an identifier for your video card definition:</screen>

	<para>Em seguida, os modos de v&iacute;deo s&atilde;o definidos para
	as resolu&ccedil;&otilde;es desejadas.  Normalmente as varia&ccedil;&ograve;es &uacute;teis s&atilde;o
	640x480, 800x600 e1024x768, mas todos dependem da placa de
	v&iacute;deo os suportar, bem o monitor, e principalmente, se for
	adequado ao conforto visual.  Ao selecionar a escala de cores,
	escolha o modo mais alto que sua placa suportar.</para>

      <screen>For each depth, a list of modes (resolutions) is defined. The default
resolution that the server will start-up with will be the first listed
mode that can be supported by the monitor and card.
Currently it is set to:

"640x480" "800x600" "1024x768" "1280x1024" for 8-bit
"640x480" "800x600" "1024x768" "1280x1024" for 16-bit
"640x480" "800x600" "1024x768" "1280x1024" for 24-bit

Modes that cannot be supported due to monitor or clock constraints will
be automatically skipped by the server.

 1  Change the modes for 8-bit (256 colors)
 2  Change the modes for 16-bit (32K/64K colors)
 3  Change the modes for 24-bit (24-bit color)
 4  The modes are OK, continue.

Enter your choice: 2

Select modes from the following list:

 1  "640x400"
 2  "640x480"
 3  "800x600"
 4  "1024x768"
 5  "1280x1024"
 6  "320x200"
 7  "320x240"
 8  "400x300"
 9  "1152x864"
 a  "1600x1200"
 b  "1800x1400"
 c  "512x384"

Please type the digits corresponding to the modes that you want to select.
For example, 432 selects "1024x768" "800x600" "640x480", with a
default mode of 1024x768.

Which modes? 432

You can have a virtual screen (desktop), which is screen area that is larger
than the physical screen and which is panned by moving the mouse to the edge
of the screen. If you don't want virtual desktop at a certain resolution,
you cannot have modes listed that are larger. Each color depth can have a
differently-sized virtual screen

Please answer the following question with either 'y' or 'n'.
Do you want a virtual screen that is larger than the physical screen? n



For each depth, a list of modes (resolutions) is defined. The default
resolution that the server will start-up with will be the first listed
mode that can be supported by the monitor and card.
Currently it is set to:

"640x480" "800x600" "1024x768" "1280x1024" for 8-bit
"1024x768" "800x600" "640x480" for 16-bit
"640x480" "800x600" "1024x768" "1280x1024" for 24-bit

Modes that cannot be supported due to monitor or clock constraints will
be automatically skipped by the server.

 1  Change the modes for 8-bit (256 colors)
 2  Change the modes for 16-bit (32K/64K colors)
 3  Change the modes for 24-bit (24-bit color)
 4  The modes are OK, continue.

Enter your choice: 4



Please specify which color depth you want to use by default:

  1  1 bit (monochrome)                                
  2  4 bits (16 colors)                                
  3  8 bits (256 colors)                               
  4  16 bits (65536 colors)                            
  5  24 bits (16 million colors)                       

Enter a number to choose the default depth.

4</screen>

      <para>Finalmente, a configura&ccedil;&atilde;o deve ser salva.  Garanta que 
	<filename>/etc/XF86Config</filename> &eacute; a localiza&ccedil;&atilde;o padr&atilde;o
	na hora de salvar seu arquivo de configura&ccedil;&atilde;o.</para>

      <screen>I am going to write the XF86Config file now. Make sure you don't accidently
overwrite a previously configured one.

Shall I write it to /etc/X11/XF86Config? y</screen>

      <para>Caso a configura&ccedil;&atilde;o falhe, voc&ecirc; pode tentar
	configurar a interface gr&aacute;fica novamente, selecionando
	<guimenuitem>[ Yes ]</guimenuitem> quando a seguinte mensagem
	surgir:</para>

      <screen>          User Confirmation Requested
The XFree86 configuration process seems to have
failed.  Would you like to try again?

             [ Yes ]         No</screen>

      <para>Caso tenha dificuldades com a configura&ccedil;&atilde;o do
	<application>&xfree86;</application>, selecione
	<guimenuitem>[ No ]</guimenuitem> e aperte <keycap>Enter</keycap>
	e continue o processo de instala&ccedil;&atilde;o.  Ap&oacute;s a instala&ccedil;&atilde;o, utilize
	o <command>xf86cfg -textmode</command> ou <command>xf86config</command>
	para acessar a lista de utilit&aacute;rios para configura&ccedil;&atilde;o em modo texto,
	lembrando que voc&ecirc; deve estar logado como usu&aacute;rio 
	<username>root</username>.  Existe um m&eacute;todo adicional de configura&ccedil;&atilde;o
	do <application>&xfree86;</application> descrito no <xref linkend="x11">.
	Se sua escolha for n&atilde;o configurar o <application>&xfree86;</application>
	agora, o menu seguinte ser&aacute; a sele&ccedil;&atilde;o de pacotes.</para>

      <para>Por padr&atilde;o, o servidor gr&aacute;fico pode ser interrompido
	a qualquer momento, com a sequ&ecirc;ncia de teclas <keycombo action='simul'>
	<keycap>Ctrl</keycap><keycap>Alt</keycap>
	<keycap>Backspace</keycap></keycombo>.  Se algo errado acontecer
	voc&ecirc; pode utilizar esta op&ccedil;&atilde;o para evitar que seu equipamento
	seja danificado.</para>

      <para>As configura&ccedil;&ograve;es padr&atilde;o que permitem a altern&acirc;ncia
	entre motods de v&iacute;deo pode ser utilizada, com 
	a sequ&ecirc;ncia de teclas
	<keycombo action='simul'>
	  <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>+</keycap>
	</keycombo> ou
	<keycombo action='simul'>
	  <keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>-</keycap>
	</keycombo>.   
      </para>

      <para>Ap&oacute;s a instala&ccedil;&atilde;o, o monitor pode ser ajustado em sua
	altura, largura, ou centraliza&ccedil;&atilde;o, por meio do <application>xvidtune
	</application> depois que o <application>&xfree86;</application>
	estiver instalado.</para>

      <para>Existem advert&ecirc;ncias que s&atilde;o apresentadas com configura&ccedil;&otilde;es
	impr&oacute;prias puderem danificar seu equipamento.  Considere-as.  N&atilde;o
	fa&ccedil;a nada se tiver d&uacute;vidas sobre a integridade de seu <literal>
	hardware</literal>.  Ao inv&eacute;s disso, use os controles do monitor
	para ajustar a visualiza&ccedil;&atilde;o do X Window.  Podem haver diferen&ccedil;as
	de tamanho no monitor ao alternar entre a interface gr&aacute;fica e 
	a interface de modo texto, mas isso ainda &eacute; melhor do que causar
	danos &agrave; seu equipamento.</para>

      <para>Leia a p&aacute;gina de manual do &man.xvidtune.1; antes de realizar
	qualquer ajuste.</para>

      <para>Ap&oacute;s a configura&ccedil;&atilde;o com sucesso do <application>&xfree86;</application>
	a pr&oacute;xima etapara ser&aacute; a escolha de um gerenciador de janelas 
	padr&atilde;o para seu <foreignphrase>desktop</foreignphrase>.</para>
    </sect2>

    <sect2 id="default-desktop">
      <title>Escolha o <foreignphrase>Desktop</foreignphrase> X padr&atilde;o</title>

      <para>Existe uma variedade de gerenciadores de janelas dispon&iacute;veis.
	Eles variam de ambientes extremamente b&aacute;sicos &agrave; ambientes completos
	de trabalho, com um leque enorme de aplica&ccedil;&otilde;es.  Algumas op&ccedil;&otilde;es 
	necessitam de espa&ccedil;o m&iacute;nimo em disco, e pouca mem&oacute;ria, enquanto
	outros com mais funcionalidades tem necessidade de mais recursos.
	A melhor maneira de definir qual se encaixa melhor com voc&ecirc; &eacute;
	experimentar diferentes op&ccedil;&otilde;es.  Eles est&atilde;o dispon&iacute;veis
	na cole&ccedil;&atilde;o de <literal>ports</literal> ou como
	pacotes, e podem ser adicionados ap&oacute;s a instala&ccedil;&atilde;o.</para>

      <para>Voc&ecirc; pode escolher entre um dos mais populares ambientes
	de trabalho e instalar/configurar como desktop padr&atilde;o.  Com isso
	voc&ecirc; poder&aacute; inicia-lo logo ap&oacute;s a instala&ccedil;&atilde;o.</para>

      <figure id="x-desktop">
	<title>Escolha o <foreignphrase>desktop</foreignphrase> padr&atilde;o</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/desktop" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Use as teclas indicativas para selecionar o seu
	<foreignphrase>desktop</foreignphrase>	preferido, e aperte
	<keycap>Enter</keycap>. A instala&ccedil;&atilde;o do <foreignphrase>desktop</foreignphrase>
	escolhido ocorrer&aacute;.</para>
    </sect2>

    <sect2 id="packages">
    <title>Instala&ccedil;&atilde;o de pacotes</title>

      <para>Pacotes s&atilde;o bin&aacute;rios pr&eacute;-compilados, e s&atilde;o uma maneira
	conveniente de instalar aplica&ccedil;&otilde;es.</para>

      <para>A instala&ccedil;&atilde;o de um pacote ser&aacute; apresentada com o prop&oacute;sito
	de ilustra&ccedil;&atilde;o.  Pacotes adicionais podem ser adicionados tamb&eacute;m
	neste momento, se desejado.  Ap&oacute;s a instala&ccedil;&atilde;o, o
	<command>/stand/sysinstall</command> pode ser usado para
	a instala&ccedil;&atilde;o de pacotes adicionais.</para>

      <screen>                     User Confirmation Requested
 The FreeBSD package collection is a collection of hundreds of
 ready-to-run applications, from text editors to games to WEB servers
 and more. Would you like to browse the collection now? 

                            [ Yes ]   No</screen>

      <para>Selecionar <guimenuitem>[ Yes ]</guimenuitem> e apertar
	<keycap>Enter</keycap> o levar&aacute; &agrave;s telas de sele&ccedil;&atilde;o
	de pacotes:</para>

      <figure id="package-category">
	<title>Selecione a categoria do pacote</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-cat" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Apenas os pacotes dispon&iacute;veis na m&iacute;dia de instala&ccedil;&atilde;o
	em uso estar&atilde;o dispon&iacute;veis para serem adicionados a
	qualquer momento.</para>

      <para>Todos pacotes dispon&iacute;veis ser&atilde;o apresentados sob a categoria
	<guimenuitem>All</guimenuitem>, que voc&ecirc; pode selecionar agora, ou
	ent&atilde;o selecione uma categoria particular.  Selecione a op&ccedil;&atilde;o
	desejado com as teclas indicativas e aperte <keycap>Enter</keycap>.</para>

      <para>Um menu ser&aacute; apresentado, mostrando todos os pacotes
	dispon&iacute;veis para a categoria selecionada:</para>

      <figure id="package-select">
	<title>Sele&ccedil;&atilde;o de pacotes</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-sel" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>O interpretador de comandos <application>bash</application> est&aacute;
	selecionado neste exemplo.  Selecione quantos pacotes desejar, bastando
	para tal marcar o &iacute;tem em quest&atilde;o e apertar a tecla <keycap>Space
	</keycap>.  Uma breve descri&ccedil;&atilde;o de cada pacote aparecer&aacute; na diagonal
	inferior esquerda da tela.</para>

      <para>A tecla <keycap>Tab</keycap> pode ser utilizada para alternar
	o cursor entre o &uacute;ltimo pacote selecionado, a op&ccedil;&atilde;o
	&gui.ok; e a op&ccedil;&atilde;o &gui.cancel;.</para>

      <para>Quando terminar de marcar os pacotes para instala&ccedil;&atilde;o, aperte
	<keycap>Tab</keycap> apenas uma vez para passar &agrave; op&ccedil;&atilde;o &gui.ok; e
	aperte <keycap>Enter</keycap> para voltar ao menu de sele&ccedil;&atilde;o de pacote.</para>

      <para>As teclas de setas esquerda e direita tamb&eacute;m serve para alternar
	entre &gui.ok; e &gui.cancel;.  Este m&eacute;todo pode ser utilizado para selecionar
	&gui.ok; e em seguida apertar <keycap>Enter</keycap> para voltar ao menu
	de sele&ccedil;&atilde;o de pacotes.</para>

      <figure id="package-install">
	<title>Instala&ccedil;&atilde;o de pacotes</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-install" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Use a tecla <keycap>Tab</keycap> e as setas para selecionar <guibutton>[ Install ]</guibutton>
	e aperte <keycap>Enter</keycap>.  Ser&aacute; necess&aacute;rio confirmar que voc&ecirc; deseja
	instalar os pacotes escolhidos:</para>

      <figure id="package-install-confirm">
	<title>Confirmar instala&ccedil;&atilde;o de pacotes</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/pkg-confirm" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>A instala&ccedil;&atilde;o dos pacotes ser&aacute; iniciada t&atilde;o logo &gui.ok; seja
	selecionado e o <keycap>Enter</keycap> seja apertado.  Mensagens de
	instala&ccedil;&atilde;o ser&atilde;o apresentadas at&eacute; que a mesma esteja terminada.
	Preste aten&ccedil;&atilde;o se houverem mensagens de erro.</para>

      <para>A configura&ccedil;&atilde;o final continua assim que os pacotes forem instalados.
	Se voc&ecirc; n&atilde;o selecionou pacote algum, e deseja voltar &agrave; configura&ccedil;&atilde;o final,
	selecione <guibutton>Install</guibutton> de qualquer forma.</para>
    </sect2>

    <sect2 id="addusers">
      <title>Adicionar Usu&aacute;rios e Grupos</title>

      <para>Voc&ecirc; deve adicionar ao menos um usu&aacute;rio durante
	a instala&ccedil;&atilde;o, de forma que voc&ecirc; possa utilizar o sistema sem
	se logar como superusu&aacute;rio, <username>root</username>.  A parti&ccedil;&atilde;o raiz
	normalmente &eacute; pequena, e utilizar aplica&ccedil;&otilde;es como usu&aacute;rio
	<username>root</username> pode rapidamente consumir todo
	seu espa&ccedil;o em disco.  O problema maior &eacute; que como superusu&aacute;rio
	voc&ecirc; pode danificar seu sistema sem querer, como comentado
	na mensagem a seguir:</para>

      <screen>                     User Confirmation Requested
 Would you like to add any initial user accounts to the system? Adding
 at least one account for yourself at this stage is suggested since
 working as the "root" user is dangerous (it is easy to do things which
 adversely affect the entire system). 

                            [ Yes ]   No</screen>

      <para>Selecione <guibutton>[ Yes ]</guibutton> e aperte
	<keycap>Enter</keycap> para continuar com a adi&ccedil;&atilde;o de
	usu&aacute;rio.</para>

      <figure id="add-user2">
	<title>Escolha <quote>User</quote></title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/adduser1" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Escolha a op&ccedil;&atilde;o <guimenuitem>User</guimenuitem> com as setas e
	aperte <keycap>Enter</keycap>.</para>

      <figure id="add-user3">
	<title>Adicionando informa&ccedil;&otilde;es do usu&aacute;rio</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/adduser2" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>As descri&ccedil;&otilde;es a seguir aparecer&atilde;o na base da tela, conforme
	os &iacute;tens v&atilde;o sendo selecionados com o <keycap>Tab</keycap>, de
	forma a auxiliar o usu&aacute;rio no momento de adicionar as
	informa&ccedil;&otilde;es necess&aacute;rias:</para>

      <variablelist>
	<varlistentry>
	  <term>Login ID</term>

	  <listitem>
	    <para>O nome de <literal>login</literal> para o novo usu&aacute;rio (imperativo).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>UID</term>
	
	  <listitem>
	    <para>Identifica&ccedil;&atilde;o numerica para o novo usu&aacute;rio (mantenha o campo
		em branco para defini&ccedil;&atilde;o autom&aacute;tica).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Group</term>

	  <listitem>
	    <para>O nome do grupo que o usu&aacute;rio far&aacute; parte (mantenha o
		campo em branco para uma defini&ccedil;&atilde;o autom&aacute;tica).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Password</term>

	  <listitem>
	    <para>A senha para o novo usu&aacute;rio (defina este campo 
		com cuidado!).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Full name</term>

	  <listitem>
	    <para>Nome completo do novo usu&aacute;rio (coment&aacute;rio).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Member groups</term>

	  <listitem>
	    <para>Grupos auxiliares a que este usu&aacute;rio pertencer&aacute; (ter&aacute; os
		mesmos direitos definidos pra este grupo).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Home directory</term>

	  <listitem>
	    <para>Diret&oacute;rio <literal>home</literal> (mantenha em branco
		para o padr&atilde;o).</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>Login shell</term>
	  <listitem>
	    <para>o interpretador de comandos do usu&aacute;rio (deixe em branco
		para usar o padr&atilde;o, por exemplo <filename>/bin/sh</filename>).</para>
	  </listitem>
	</varlistentry>
      </variablelist>

      <para>O interpretador de comandos (<literal>shell</literal>)foi modificado
	de <filename>/bin/sh</filename> para <filename>
	/usr/local/bin/bash</filename> para usar o interpretador
	<application>bash</application> que foi previamente
	instalado como pacote.  N&atilde;o tente usar um interpretador de comandos que
	ainda n&atilde;o existe no sistema ou voc&ecirc; n&atilde;o conseguir&aacute; se logar.  O 
	interpretador de comando mais utilizado no mundo BSD &eacute; o
	<literal>C shell</literal>, que pode ser compreendido como
	<filename>/bin/tcsh</filename>.</para>

      <para>O usu&aacute;rio tamb&eacute;m foi adicionado ao grupo <groupname>wheel</groupname> 
	de forma que ele possa se tornar superusu&aacute;rio e assumir os
	privil&eacute;gios do <username>root</username>.</para>

      <para>Quando estiver satisfeito, aperte &gui.ok; e
	o menu de gerenciamento de usu&aacute;rio e grupo ser&aacute; 
	apresentado novamente:</para>

      <figure id="add-user4">
	<title>Sair do gerenciamento de usu&aacute;rio e grupo</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/adduser3" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Pode-se adicionar grupos neste momento, caso hajam necessidades
	espec&iacute;ficas.  De outra forma, isso pode ser feito atrav&eacute;s do
	<filename>/stand/sysinstall</filename> depois que a instala&ccedil;&atilde;o
	estiver completa.</para>

      <para>Quando terminar de adicionar os usu&aacute;rios, selecione
	<guimenuitem>Exit</guimenuitem> com as setas e aperte
	<keycap>Enter</keycap>.</para>
    </sect2>

    <sect2 id="rootpass">
      <title>Defina a senha de <username>root</username></title>

      <screen>                        Message
 Now you must set the system manager's password.  
 This is the password you'll use to log in as "root". 

                         [ OK ] 

               [ Press enter to continue ]</screen>

      <para>Aperte <keycap>Enter</keycap> para definir a senha
	de <username>root</username>.</para>

      <para>A senha dever&aacute; ser digitada corretamente duas vezes.
	&Eacute; desnecess&aacute;rio dizer, mas garanta que voc&ecirc; n&atilde;o esquecer&aacute;
	sua senha.</para>

      <screen>Changing local password for root. 
New password : 
Retype new password :</screen>

      <para>A instala&ccedil;&atilde;o continuar&aacute; depois que a senha for
	definida corretamenta.</para>
    </sect2>

    <sect2 id="exit-inst">
      <title>Saindo da instala&ccedil;&atilde;o</title>

      <para>Caso queira configurar algum dispositivo
	de rede adicional ou qualquer outra configura&ccedil;&atilde;o, voc&ecirc;
	pode faze-lo agora ou ap&oacute;s a instala&ccedil;&atilde;o, atrav&eacute;s do
	<filename>/stand/sysinstall</filename>.</para>

      <screen>                     User Confirmation Requested
 Visit the general configuration menu for a chance to set any last
 options? 

                              Yes   [ No ]</screen>

      <para>Selecione <guibutton>[ No ]</guibutton> com a tecla
	indicativa e aperte <keycap>Enter</keycap> para voltar ao menu
	principal de instala&ccedil;&atilde;o.</para>

      <figure id="final-main">
	<title>Sair da instala&ccedil;&atilde;o</title>

	<mediaobject>
	  <imageobject>
	    <imagedata fileref="install/mainexit" format="PNG">
	  </imageobject>
	</mediaobject>
      </figure>

      <para>Escolha<guibutton>[X Exit Install]</guibutton> com as teclas
	indicativas e aperte <keycap>Enter</keycap>.  Ser&aacute; necess&aacute;rio
	confirmar que deseja sair da instala&ccedil;&atilde;o:</para>

      <screen>                     User Confirmation Requested
 Are you sure you wish to exit? The system will reboot (be sure to  
 remove any floppies from the drives). 

                            [ Yes ]   No</screen>

      <para>Escolha <guibutton>[ Yes ]</guibutton> e remova o disquete
	caso voc&ecirc; tenha usado-o como m&iacute;dia de inicializa&ccedil;&atilde;o.  O dispositivo
	de CDROM permanecer&aacute; travado at&eacute; que o sistema comece reinicializar.
	Depois o dispositivo de CDROM ser&aacute; destravado e o disco poder&aacute; ser
	retirado (seja r&aacute;pido).</para>

      <para>O sistema ir&aacute; reiniciar, preste aten&ccedil;&atilde;o a qualquer mensagem de
	erro que possa aparecer.</para>
    </sect2>

    <sect2 id="freebsdboot">
      <title>Inicializa&ccedil;&atilde;o do FreeBSD</title>

      <sect3 id="freebsdboot-i386">
        <title>Inicializa&ccedil;&atilde;o do FreeBSD em &i386;</title>

      <para>Se tudo correr bem, voc&ecirc; ver&aacute; uma s&eacute;rie de mensagens
	na tela, e em dado momento chegar&aacute; ao <literal>prompt</literal>
	de <literal>login</literal>.  Voc&ecirc; pode acompanhar o conte&uacute;do
	das mensagens apertando <keycap>Scroll-Lock</keycap>
	e usando as teclas <keycap>PgUp</keycap> e <keycap>PgDn</keycap>.
	Apertando <keycap>Scroll-Lock</keycap> a tela ser&aacute; destravada
	e retornar&aacute; &agrave; <literal>prompt</literal>.</para>

      <para>A mensagem completa n&atilde;o ser&aacute; apresentada (por limita&ccedil;&atilde;o de <foreignphrase>
	buffer</foreignphrase>) mas pode ser acompanhada por linha de comando
	depois que voc&ecirc; se logar, digitando <command>dmesg</command>no terminal.</para>

      <para>Logue-se com o usu&aacute;rio e senha definidos durante a instala&ccedil;&atilde;o
	do sistema (<username>rpratt</username>, neste exemplo).  Evite logar-se
	como <username>root</username> se n&atilde;o for necess&aacute;rio.</para>

      <para>Mensagens t&iacute;picas de inicializa&ccedil;&atilde;o (informa&ccedil;&atilde;o sobre a vers&atilde;o do sistema
	que est&aacute; sendo inicializada foi omitida):</para>

<screen>Copyright (c) 1992-2002 The FreeBSD Project. 
Copyright (c) 1979, 1980, 1983, 1986, 1988, 1989, 1991, 1992, 1993, 1994
        The Regents of the University of California. All rights reserved. 

Timecounter "i8254"  frequency 1193182 Hz
CPU: AMD-K6(tm) 3D processor (300.68-MHz 586-class CPU)
  Origin = "AuthenticAMD"  Id = 0x580  Stepping = 0
  Features=0x8001bf&lt;FPU,VME,DE,PSE,TSC,MSR,MCE,CX8,MMX&gt; 
  AMD Features=0x80000800&lt;SYSCALL,3DNow!&gt; 
real memory  = 268435456 (262144K bytes) 
config&gt; di sn0 
config&gt; di lnc0 
config&gt; di le0 
config&gt; di ie0 
config&gt; di fe0 
config&gt; di cs0 
config&gt; di bt0  
config&gt; di aic0 
config&gt; di aha0 
config&gt; di adv0 
config&gt; q 
avail memory = 256311296 (250304K bytes)
Preloaded elf kernel "kernel" at 0xc0491000. 
Preloaded userconfig_script "/boot/kernel.conf" at 0xc049109c. 
md0: Malloc disk 
Using $PIR table, 4 entries at 0xc00fde60
npx0: &lt;math processor&gt; on motherboard 
npx0: INT 16 interface 
pcib0: &lt;Host to PCI bridge&gt; on motherboard 
pci0: &lt;PCI bus&gt; on pcib0 
pcib1: &lt;VIA 82C598MVP (Apollo MVP3) PCI-PCI (AGP) bridge&gt; at device 1.0 on pci0 
pci1: &lt;PCI bus&gt; on pcib1 
pci1: &lt;Matrox MGA G200 AGP graphics accelerator&gt; at 0.0 irq 11 
isab0: &lt;VIA 82C586 PCI-ISA bridge&gt; at device 7.0 on pci0 
isa0: &lt;ISA bus&gt; on isab0 
atapci0: &lt;VIA 82C586 ATA33 controller&gt; port 0xe000-0xe00f at device 7.1 on pci0 
ata0: at 0x1f0 irq 14 on atapci0 
ata1: at 0x170 irq 15 on atapci0 
uhci0: &lt;VIA 83C572 USB controller&gt; port 0xe400-0xe41f irq 10 at device 7.2 on pci0 
usb0: &lt;VIA 83C572 USB controller&gt; on uhci0 
usb0: USB revision 1.0 
uhub0: VIA UHCI root hub, class 9/0, rev 1.00/1.00, addr 1 
uhub0: 2 ports with 2 removable, self powered 
chip1: &lt;VIA 82C586B ACPI interface&gt; at device 7.3 on pci0 
ed0: &lt;NE2000 PCI Ethernet (RealTek 8029)&gt; port 0xe800-0xe81f irq 9 at
device 10.0 on pci0 
ed0: address 52:54:05:de:73:1b, type NE2000 (16 bit) 
isa0: too many dependant configs (8) 
isa0: unexpected small tag 14 
fdc0: &lt;NEC 72065B or clone&gt; at port 0x3f0-0x3f5,0x3f7 irq 6 drq 2 on isa0
fdc0: FIFO enabled, 8 bytes threshold 
fd0: &lt;1440-KB 3.5" drive&gt; on fdc0 drive 0 
atkbdc0: &lt;keyboard controller (i8042)&gt; at port 0x60-0x64 on isa0 
atkbd0: &lt;AT Keyboard&gt; flags 0x1 irq 1 on atkbdc0 
kbd0 at atkbd0 
psm0: &lt;PS/2 Mouse&gt; irq 12 on atkbdc0 
psm0: model Generic PS/2 mouse, device ID 0 
vga0: &lt;Generic ISA VGA&gt; at port 0x3c0-0x3df iomem 0xa0000-0xbffff on isa0
sc0: &lt;System console&gt; at flags 0x1 on isa0 
sc0: VGA &lt;16 virtual consoles, flags=0x300&gt; 
sio0 at port 0x3f8-0x3ff irq 4 flags 0x10 on isa0 
sio0: type 16550A 
sio1 at port 0x2f8-0x2ff irq 3 on isa0 
sio1: type 16550A 
ppc0: &lt;Parallel port&gt; at port 0x378-0x37f irq 7 on isa0 
ppc0: SMC-like chipset (ECP/EPP/PS2/NIBBLE) in COMPATIBLE mode 
ppc0: FIFO with 16/16/15 bytes threshold 
ppbus0: IEEE1284 device found /NIBBLE
Probing for PnP devices on ppbus0: 
plip0: &lt;PLIP network interface&gt; on ppbus0 
lpt0: &lt;Printer&gt; on ppbus0 
lpt0: Interrupt-driven port 
ppi0: &lt;Parallel I/O&gt; on ppbus0
ad0: 8063MB &lt;IBM-DHEA-38451&gt; [16383/16/63] at ata0-master using UDMA33 
ad2: 8063MB &lt;IBM-DHEA-38451&gt; [16383/16/63] at ata1-master using UDMA33 
acd0: CDROM &lt;DELTA OTC-H101/ST3 F/W by OIPD&gt; at ata0-slave using PIO4 
Mounting root from ufs:/dev/ad0s1a 
swapon: adding /dev/ad0s1b as swap device 
Automatic boot in progress... 
/dev/ad0s1a: FILESYSTEM CLEAN; SKIPPING CHECKS 
/dev/ad0s1a: clean, 48752 free (552 frags, 6025 blocks, 0.9% fragmentation)
/dev/ad0s1f: FILESYSTEM CLEAN; SKIPPING CHECKS 
/dev/ad0s1f: clean, 128997 free (21 frags, 16122 blocks, 0.0% fragmentation)
/dev/ad0s1g: FILESYSTEM CLEAN; SKIPPING CHECKS
/dev/ad0s1g: clean, 3036299 free (43175 frags, 374073 blocks, 1.3% fragmentation)
/dev/ad0s1e: filesystem CLEAN; SKIPPING CHECKS 
/dev/ad0s1e: clean, 128193 free (17 frags, 16022 blocks, 0.0% fragmentation)
Doing initial network setup: hostname. 
ed0: flags=8843&lt;UP,BROADCAST,RUNNING,SIMPLEX,MULTICAST> mtu 1500
        inet 192.168.0.1 netmask 0xffffff00 broadcast 192.168.0.255
        inet6 fe80::5054::5ff::fede:731b%ed0 prefixlen 64 tentative scopeid 0x1
        ether 52:54:05:de:73:1b
lo0: flags=8049&lt;UP,LOOPBACK,RUNNING,MULTICAST&gt; mtu 16384 
        inet6 fe80::1%lo0 prefixlen 64 scopeid 0x8 
        inet6 ::1 prefixlen 128 
        inet 127.0.0.1 netmask 0xff000000 
Additional routing options: IP gateway=YES TCP keepalive=YES
routing daemons:. 
additional daemons: syslogd. 
Doing additional network setup:. 
Starting final network daemons: creating ssh RSA host key 
Generating public/private rsa1 key pair.
Your identification has been saved in /etc/ssh/ssh_host_key. 
Your public key has been saved in /etc/ssh/ssh_host_key.pub. 
The key fingerprint is: 
cd:76:89:16:69:0e:d0:6e:f8:66:d0:07:26:3c:7e:2d root@k6-2.example.com
 creating ssh DSA host key 
Generating public/private dsa key pair.
Your identification has been saved in /etc/ssh/ssh_host_dsa_key. 
Your public key has been saved in /etc/ssh/ssh_host_dsa_key.pub. 
The key fingerprint is: 
f9:a1:a9:47:c4:ad:f9:8d:52:b8:b8:ff:8c:ad:2d:e6 root@k6-2.example.com.
setting ELF ldconfig path: /usr/lib /usr/lib/compat /usr/X11R6/lib
/usr/local/lib 
a.out ldconfig path: /usr/lib/aout /usr/lib/compat/aout /usr/X11R6/lib/aout 
starting standard daemons: inetd cron sshd usbd sendmail.
Initial rc.i386 initialization:. 
rc.i386 configuring syscons: blank_time screensaver moused. 
Additional ABI support: linux. 
Local package initialization:. 
Additional TCP options:. 

FreeBSD/i386 (k6-2.example.com) (ttyv0)

login: rpratt 
Password:</screen>

      <para>A gera&ccedil;&atilde;o das chaves RSA e DSA podem levar algum tempo em
	esta&ccedil;&otilde;es lentas.  Isso acontece apenas na primeira inicializa&ccedil;&atilde;o
	de um sistema rec&eacute;m instalado.  Inicializa&ccedil;&otilde;es subsequentes
	ser&atilde;o mais r&aacute;pidas.</para>

      <para>Se o servidor X foi configurado e um ambiente de trabalho
	padr&atilde;o foi definido, poder&aacute; ser iniciado digitando
	<command>startx</command> na linha de comando.</para>

      </sect3>

      <sect3>
        <title>Inicializa&ccedil;&atilde;o do FreeBSD em Alpha</title>

	<indexterm><primary>Alpha</primary></indexterm>

        <para>Uma vez terminados os procedimentos de instala&ccedil;&atilde;o,
	 ser&aacute; poss&iacute;vel iniciar o FreeBSD ao digitar algo, no terminal
	 SRM, algo como:</para>

	<screen>&gt;&gt;&gt;<userinput>BOOT DKC0</userinput></screen>

	<para>Isso instrui o sistema interno a iniciar um disco espec&iacute;fico
	 Para garantir que o FreeBSD seja inicializado automaticamente no
	 futuro, utilize estes comandos:</para>

	<screen><prompt>&gt;&gt;&gt;</prompt> <userinput>SET BOOT_OSFLAGS A</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>SET BOOT_FILE ''</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>SET BOOTDEF_DEV DKC0</userinput>
<prompt>&gt;&gt;&gt;</prompt> <userinput>SET AUTO_ACTION BOOT</userinput></screen>

	<para>As mensagens de inicializa&ccedil;&atilde;o ser&atilde;o similares (mas n&atilde;o id&ecirc;nticas) &agrave;
	  aquelas produzidas pelo processo de <literal>boot</literal> no
	  FreeBSD em &i386;.</para>
      </sect3>
    </sect2>

    <sect2 id="shutdown">
      <title>Desligando o FreeBSD</title>

      <para>&Eacute; importante desligar o sistema operacional de forma apropriada.
	N&atilde;o desligue a energia simplesmente.  Primeiro, se torne superusu&aacute;rio
	digitando <command>su</command> na linha de comando e entrando com
	a senha de <username>root</username>.  Isso s&oacute; funcionar&aacute; se
	o usu&aacute;rio for membro do grupo <groupname>wheel</groupname>.
	Do contr&aacute;rio, logue-se como <username>root</username> e use o comando
	<command>shutdown -h now</command>.</para>

      <screen>The operating system has halted. 
Please press any key to reboot.</screen>

      <para>&Eacute; seguro desligar o computador depois que o comando de encerramento
	for dado, e a mensagem <quote>Please press any key to reboot</quote>
	aparecer.  Se alguma tecla for pressionada ao inv&eacute;s do bot&atilde;o de
	energia do computador, o sistema reiniciar&aacute;.</para>

      <para>Ainda seria poss&iacute;vel utilizar a combina&ccedil;&atilde;o de teclas
        <keycombo action="simul">
	  <keycap>Ctrl</keycap>
	  <keycap>Alt</keycap>
	  <keycap>Del</keycap>
	</keycombo>
	para reiniciar o sistema; contudo isso n&atilde;o &eacute; recomendado durante a
	opera&ccedil;&atilde;o normal do sistema.</para>

    </sect2>
  </sect1>

  <sect1 id="install-supported-hardware">
    <title>Hardware Suportado</title>

    <indexterm><primary>hardware</primary></indexterm>
    <para>O FreeBSD atualmente roda em uma variedade de PCs com processadores <quote>
	x86</quote> Intel, AMD, Cyrix ou NexGeon com uma grande variedade de
	barramentos ISA, VLB, EISA e PCI, bem como em uma s&eacute;rie de
	m&aacute;quinas baseadas em processadores Compaq alpha.  Ainda disp&otilde;e de
	suporte &agrave; diversas controladoras SCSI, IDE ou ESDI, placas PCMCIA, 
	dispositivos USB e placas seriais.  O FreeBSD suporta
	tamb&eacute;m o barramento de microcanal da IBM (MCA).</para>

    <para>Uma lista de equipamentos suportados acompanha o FreeBSD em
	cada vers&atilde;o, no documento <quote>Notas de Hardware</quote> do
	FreeBSD.  Este documento normalmente pode ser encontrado no
	arquivo chamado <filename>HARDWARE.TXT</filename>, na raiz do
	CDROM do FreeBSD ou algum s&iacute;tio FTP, ou ainda no menu de
	documenta&ccedil;&atilde;o do <application>sysinstall</application>.  O 
	documento lista, para cada arquitetura, os equipamentos que
	s&atilde;o reconhecidamente suportadados em cada vers&atilde;o do
	FreeBSD.  Copias da lista de equipamentos suportados para
	cada vers&atilde;o e arquitetura do sistema podem ainda ser 
	encontradas na p&aacute;gina de <ulink
	url="http://www.FreeBSD.org/releases/index.html">Informa&ccedil;&atilde;o
	sobre Vers&otilde;es</ulink> do s&iacute;tio WWW do FreeBSD.</para>
  </sect1>

  <sect1 id="install-trouble">
    <title>Resolu&ccedil;&atilde;o de problemas</title>

    <indexterm>
      <primary>installation</primary>
      <secondary>troubleshooting</secondary>
    </indexterm>
    <para>A se&ccedil;&atilde;o &agrave; seguir cobre a resolu&ccedil;&atilde;o b&aacute;sica de
	de problemas durante a instala&ccedil;&atilde;o do FreeBSD, como os problemas
	que normalmente os usu&aacute;rios reportam.  Existem ainda algumas
	quest&otilde;es e respostas para as pessoas que desejam iniciar
	o FreeBSD em conjunto com &ms-dos;.</para>

    <sect2>
      <title>O que fazer se algo der errado</title>

      <para>Devido a v&aacute;rias limita&ccedil;&otilde;es da arquitetura de PC, &eacute;
	imposs&iacute;vel que o reconhecimento de dispositivos seja
	100% confi&aacute;vel, contudo, existem algumas coisas que
	podem ser feitas quando ela falhar.</para>

      <para>Verifique o documento Notas de Hardware da sua
	vers&atilde;o do FreeBSD e garanta que seu equipamento
	&eacute; suportado.</para>

      <para>Se seu equipamento for oficialmente suportado e ainda
	assim voc&ecirc; encontrar incoer&ecirc;ncia em seu controle ou
	qualquer outro problema, resete seu computador, e 
	quando a op&ccedil;&atilde;o de configura&ccedil;&atilde;o visual do kernel for dada,
	escolha-a.  Isso permitir&aacute; que voc&ecirc; defina informa&ccedil;&otilde;es
	de seu equipamento para o sistema.  O <literal>kernel</literal>
	no disco de inicializa&ccedil;&atilde;o &eacute; configurado de forma a oferecer o
	maior suporte poss&iacute;vel a in&uacute;meros equipamentos, sempre
	com pr&eacute;-defini&ccedil;&atilde;o de recursos no padr&atilde;o do fabricante, em
	termos de IRQs e endere&ccedil;os de E/S, bem como canais DMA.
	Se seu equipamento foi reconfigurado, ser&aacute; necess&aacute;rio
	utilizar o editor de configura&ccedil;&otilde;es para informar ao FreeBSD
	como os recursos ser&atilde;o controlados.</para>

      <para>&Eacute; ainda poss&iacute;vel identificar um dispositivo n&atilde;o presente
	que conflita com algum equipamento que j&aacute; &eacute; reconhecido.
	Neste caso, a configura&ccedil;&atilde;o dos <literal>driver</literal>s
	conflitantes devem ser desabilitadas.</para>

      <note>
        <para>Alguns problemas de instala&ccedil;&agrave;o podem ser evitados ou aliviados
	atualizando o <literal>firmware</literal> de v&aacute;rios componentes
	de <literal>hardware</literal>, not&aacute;velmente na maioria dos casos,
	a placa m&atilde;e.  O <literal>firmware</literal> da placa m&atilde;e
	tamb&eacute;m costuma ser chamado de <acronym>BIOS</acronym> e a maioria das
	placas-m&atilde;e ou fabricantes de computadores tem um s&iacute;tio WWW onde
	as informa&ccedil;&otilde;es e arquivos para atualiza&ccedil;&otilde;es podem ser
	encontradas.</para>

        <para>A maioria dos fabricantes aconselham fortemente
	que a atualiza&ccedil;&atilde;o da <acronym>BIOS</acronym> da placa m&atilde;e n&atilde;o
	seja realizada a n&atilde;o ser que exista um bom motivo, como a atualiza&ccedil;&atilde;o
	cr&iacute;tica de in&uacute;meros &iacute;tens.  O processo de atualiza&ccedil;&atilde;o
	<emphasis>pode</emphasis> dar errado, causando danos permanentes 
	ao <foreignphrase>chip</foreignphrase> da <acronym>BIOS</acronym>.</para>
        </note>

      <warning>
        <para> N&atilde;o desabilite qualquer dispositivo que venha a ser
	 utilizado durante a instala&ccedil;&atilde;o, como a sa&iacute;da padr&atilde;o (tela
	 -- <devicename>sc0</devicename>).
	 Se a instala&ccedil;&atilde;o falhar de forma misteriosa depois que
	 voc&ecirc; saiu do editor de configura&ccedil;&atilde;o, voc&ecirc; prov&aacute;velmente
	 removeu ou modificou algo que n&atilde;o deveria.  Reinicie o
	 sistema e tente novamente.</para>
      </warning>

      <para>No modo de configura&ccedil;&atilde;o, voc&ecirc; pode:</para>

      <itemizedlist>
        <listitem>
          <para>Listar dispositivos de controles dispon&iacute;veis no <literal>kernel</literal>.</para>
        </listitem>

        <listitem>
          <para>Desabilitar dispositivos de controle para os equipamentos que
		n&atilde;o est&atilde;o presentes em seu sistema.</para>
        </listitem>

        <listitem>
          <para>Modificar IRQs, DRQs e endere&ccedil;os de E/S utilizados pelo
		dispositivo de controle.</para>
        </listitem>
      </itemizedlist>

      <para>Depois de ajustar o <literal>kernel</literal> para que ele
	esteja de acordo com a configura&ccedil;&atilde;o de seu equipamento, aperte
	<command>Q</command> para iniciar o sistema com as novas
	configura&ccedil;&otilde;es.  Uma vez que a instala&ccedil;&atilde;o esteja terminada, 
	todas modifica&ccedil;&otilde;es que foram feitas se tornar&atilde;o permanentes, de
	forma que voc&ecirc; n&atilde;o tenha que refazer a configura&ccedil;&atilde;o toda vez
	que for iniciar o sistema.  Ainda &eacute; muito prov&aacute;vel que voc&ecirc;
	deseje construir um <link linkend="kernelconfig">
	kernel customizado</link>.</para>
    </sect2>
    
    <sect2>
      <title>Tratando parti&ccedil;&otilde;es &ms-dos; j&aacute; existentes</title>

      <indexterm><primary>DOS</primary></indexterm>
      <para>Muitos usu&aacute;rios costumam querer instalar o &os; em um
	<acronym>PC</acronym> j&aacute; habitado por sistemas operacionais baseados
	em &microsoft;.  Para tais situa&ccedil;&otilde;es, &os; &eacute; acompanhado de um
	utilit&aacute;rio chamado <application>FIPS</application>.  Este utilit&aacute;rio pode ser
	encontrado no diret&oacute;rio <filename>tools</filename> no CD de instala&ccedil;&atilde;o
	do sistema, ou baixado dos v&aacute;rios servidores espelhos do
	&os;s.</para>

      <para>O utilit&aacute;rio <application>FIPS</application> permite que uma
	parti&ccedil;&atilde;o &ms-dos; j&aacute; existente seja redimensionada em duas partes,
	preservando a parti&ccedil;&atilde;o original e permitindo que o sistema seja
	instalado no segundo trecho livre da parti&ccedil;&atilde;o.  Primeiro, voc&ecirc;
	tem que desfragmentar sua parti&ccedil;&atilde;o &ms-dos; usando o <application>
	Desfragmentador de Discos</application> do &windows; (v&aacute; pelo 
	<foreignphrase>Explorer</foreignphrase>, clique no seu disco r&iacute;gido
	com o bot&atilde;o direito do mouse e escolha a op&ccedil;&atilde;o de desfragementar seu disco),
	ou use o <application>Norton Disk Tools</application>.  Agora o programa
	<application>FIPS</application> pode ser executado.  Ele perguntar&aacute;
	as informa&ccedil;&otilde;es necess&aacute;rias, basta seguir as instru&ccedil;&otilde;es na tela.  Depois
	voc&ecirc; pode reiniciar o computador e instalar &os; na
	parti&ccedil;&atilde;o livre.  Veja o menu de distribui&ccedil;&otilde;es de instala&ccedil;&atilde;o
	(<guimenuitem>Distributions</guimenuitem>) para um valor estimado de
	quanto espa&ccedil;o em disco ser&aacute; necess&aacute;rio para o tipo de
	instala&ccedil;&atilde;o que voc&ecirc; deseja.</para>

      <para>Existe ainda um produto muito bom da PowerQuest
	(<ulink url="http://www.powerquest.com/">http://www.powerquest.com</ulink>)
	chamado <application>&partitionmagic;</application>.  Esta aplica&ccedil;&atilde;o &eacute;
	muito mais funcional que o <application>FIPS</application>, e &eacute; altamente
	recomendado se voc&ecirc; planeja adicionar/remover os sistemas com
	certa frequ&ecirc;ncia.  Ele custa dinheiro, portanto se voc&ecirc; planeja instalar
	&os; e mante-lo instalado, <application>FIPS</application>
	vai te atender muito bem.</para>
    </sect2>

    <sect2>
      <title>Utilizando sistema de arquivos do &ms-dos; e do &windows; File Systems</title>

      <para>No momento o &os; n&atilde;o suporte sistema de arquivos comprimidos com
	a aplica&ccedil;&atilde;o <application>Double Space&trade;</application>.  Portanto o
	sistema de arquivos deve ser descomprimido antes que o &os; possa acessa-lo.
	Isso pode ser feito com o <application>Agente de Compress&atilde;o</application>
	localizado no men&uacute; <guimenuitem>Iniciar</guimenuitem>&gt; <guimenuitem>Programas</guimenuitem> &gt;
	<guimenuitem>Ferramentas do sistema</guimenuitem>.</para>

      <para>&os; suporta sistemas de arquivos &ms-dos;.  &Eacute; necess&aacute;rio usar o comando
	&man.mount.msdos.8; (que no &os; 5.X se tornou o &man.mount.msdosfs.8;)
	com os par&acirc;metros usuais.  A utiliza&ccedil;&atilde;o mais comum deste comando &eacute;:</para>

      <screen>&prompt.root; <userinput>mount_msdos /dev/ad0s1 /mnt</userinput></screen>

      <para>Neste exemplo, o sistema de arquivos &ms-dos; est&aacute; localizado na
	primeira parti&ccedil;&atilde;o do disco r&iacute;gido prim&aacute;rio.  Sua situa&ccedil;&atilde;o pode
	ser distinta, verifique a sa&iacute;da do comando 
	<command>dmesg</command>, e do <command>mount</command>.  Eles devem
	produzir informa&ccedil;&otilde;es o bastante para te dar id&eacute;ia sobre a
	disposi&ccedil;&atilde;o do particionamento.</para>

      <note><para>Sistemas de arquivos &ms-dos; extendidos normalmente s&atilde;o mapeados
	depois das parti&ccedil;&otilde;es do &os;.  Em outras palavras, o n&uacute;mero da parti&ccedil;&atilde;o
	podem ser maiores dos que os utilizados pelo &os;.  Por padr&atilde;o a primeira
	parti&ccedil;&atilde;o &ms-dos; se for <filename>/dev/ad0s1</filename> e a
	parti&ccedil;&atilde;o &os; for <filename>/dev/ad0s2</filename> a parti&ccedil;&atilde;o
	extendida &ms-dos; ser&aacute; <filename>/dev/ad0s3</filename>.
	Para alguns, isto pode ser confuso no in&iacute;cio.</para></note>

      <para>Parti&ccedil;&otilde;es NTFS podem ser montados de forma similar,
	usando o comando &man.mount.ntfs.8;.</para>
    </sect2>

    <sect2>
      <title>Perguntas e respostas para usu&aacute;rios de Alpha</title>

      <indexterm><primary>Alpha</primary></indexterm>

      <para>Esta se&ccedil;&atilde;o responde algumas perguntas normalmente
	realizadas sobre a instala&ccedil;&atilde;o do &os; em sistemas
	Alpha.</para>

      <qandaset>
	<qandaentry>
	  <question>
	    <para>Posso iniciar o sistema &agrave; partir do ARC ou do console
		da <acronym>BIOS</acronym> do Alpha?</para>
	  </question>

	  <indexterm><primary>ARC</primary></indexterm>
	  <indexterm><primary>BIOS do Alpha</primary></indexterm>
	  <indexterm><primary>SRM</primary></indexterm>

	  <answer>
	    <para>N&atilde;oo.  &os;, assim como o Tru64 da Compaq e o VMS,
		s&oacute; podem ser iniciados &agrave; partir do console SRM.</para>
	  </answer>
	</qandaentry>

	<qandaentry>
	  <question>
	    <para>Socorro, n&atilde;o tenho espa&ccedil;o dispon&iacute;vel!  Terei que
		apagar todos os meus dados antes?</para>
	  </question>

	  <answer>
	    <para>Infelizmente, sim.</para>
	  </answer>
	</qandaentry>

	<qandaentry>
	  <question>
	    <para>Posso montar meu sistema de arquivos do Tru64 da Compaq ou
		do VMS?</para>
	  </question>

	  <answer>
	    <para>N&atilde;o, n&atilde;o no momento.</para>
	  </answer>
	</qandaentry>
      </qandaset>
    </sect2>
  </sect1>

  <sect1 id="install-advanced">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Valentino</firstname>
	  <surname>Vaschetto</surname>
	  <contrib>Contribui&ccedil;&atilde;o de </contrib>
	</author>
	<!-- Maio de 2001 -->
      </authorgroup>
    </sect1info>

    <title>Guia avan&ccedil;ado de instala&ccedil;&atilde;o</title>

    <para>Essa se&ccedil;&atilde;o descreve as formas de instalar o FreeBSD em
	casos excepcionais.</para>

    <sect2 id="headless-install">
      <title>Instalando FreeBSD em um sistema sem monitor
	e sem teclado</title>

      <indexterm>
        <primary>instala&ccedil;&atilde;o</primary>
        <secondary>decaptada (console serial)</secondary>
      </indexterm>
      <indexterm><primary>console serial</primary></indexterm>
      <para>Esse tipo de instala&ccedil;&atilde;o &eacute; chamada <quote>instala&ccedil;&atilde;o decapitada
	</quote> (<quote>headless install</quote>, em ingl&ecirc;s) porque 
	a esta&ccedil;&atilde;o onde voc&ecirc; quer instalar o FreeBSD n&atilde;o tem um
	monitor, ou nem sequer tem um dispositivo de sa&iacute;da VGA.  Voc&ecirc;
	pergunta, como isso pode ser poss&iacute;vel?  Usando um console serial.
	Um console serial basicamente utiliza uma outra m&aacute;quina	
	para a fun&ccedil;&atilde;o de tela principal e teclado de um sistema.
	Para isso, basta seguir os passos para criar um disquete
	de instala&ccedil;&agrave;o, explicado no <xref linkend="install-floppies">.</para>

      <para>Para modificar estes disquetes e iniciar o sistema em um
	console serial, siga os seguintes passos:</para>

      <procedure>
	<step>
	  <title>Habilitando os disquetes de inicializa&ccedil;&atilde;o em um console serial</title>
  	    <indexterm>
	      <primary><command>mount</command></primary>
	    </indexterm>
	    <para>Se voc&ecirc; iniciar o sistema a partir dos disquetes
		que voc&ecirc; acabou de criar, ele ir&aacute; entrar no modo
		normal de instala&ccedil;&atilde;o.  N&oacute;s queremos que o FreeBSD
		seja iniciado em um console serial, para prosseguirmos
		com nossa instala&ccedil;&atilde;o.  Para isso, monte o disquete
		do <filename>kern.flp</filename> no seu FreeBSD
		usando o comando &man.mount.8;.</para>

            <screen>&prompt.root; <userinput>mount /dev/fd0 /floppy</userinput></screen>

	    <para>Agora que seu disquete est&aacute; montado, entre no diret&oacute;rio	
		em quest&atilde;o:</para>

	    <screen>&prompt.root; <userinput>cd /floppy</userinput></screen>

	    <para>&Eacute; aqui que voc&ecirc; deve configurar o disquete &agrave; iniciar
		o processo de instala&ccedil;&atilde;o por meio de um console serial.
		&Eacute; necess&aacute;rio criar um arquivo chamado <filename>boot.config</filename>
		contendo a linha <literal>/boot/loader -h</literal>.  Tudo que
		este comando faz &eacute; passar uma op&ccedil;&atilde;o ao processo de inicializa&ccedil;&atilde;o
		atrav&eacute;s do carregador do sistema, informando que ele deve carregar
		os componentes em quest&atilde;o, em um console serial.</para>

	    <screen>&prompt.root; <userinput>echo "/boot/loader -h" > boot.config</userinput></screen>

	    <para>Agora que o disquete est&aacute; corretamente configurado, basta desmontar
		o disquete usando o comando &man.umount.8;</para>

            <screen>&prompt.root; <userinput>cd /</userinput>
&prompt.root; <userinput>umount /mnt</userinput></screen>

	    <para>Agora voc&ecirc; pode retirar o disquete do dispositivo.</para>
	  </step>

	  <step>
	    <title>Conectando seu cabo de modem nulo (<foreignphrase>Null Modem Cable</foreignphrase>)</title>

  	    <indexterm><primary>null modem cable</primary></indexterm>
	    <para>Agora &eacute; necess&aacute;rio conectar um cabo de modem nulo entre
		as duas esta&ccedil;&ograve;es.  Conecte o cabo nas portas seriais das
		duas m&aacute;quinas.  <emphasis>Um cabo serial normal n&atilde;o funcionar&aacute; aqui
		</emphasis>, &eacute; necess&aacute;rio um cabo de modem nulo, pois ele
		tem alguns fios cruzados internamente.</para>
	  </step>

	  <step>
	    <title>Iniciando a instala&ccedil;&atilde;o</title>

	    <para>Agora &eacute; hora de prosseguir com a instala&ccedil;&atilde;o.  Coloque o disquete
		gerado com a imagem <filename>kern.flp</filename> no dispositivo
		de disquetes da esta&ccedil;&atilde;o decapitada e ligue a m&aacute;quina.</para>
	  </step>

	  <step>
	    <title>Conectando-se &agrave; sua esta&ccedil;&atilde;o decapitada</title>
	    <indexterm>
	      <primary><command>cu</command></primary>
	    </indexterm>
	    <para>Agora voc&ecirc; deve se conectar &agrave; m&aacute;quina com o comando 
		&man.cu.1;:</para> 

	    <screen>&prompt.root; <userinput>cu -l /dev/cuaa0</userinput></screen>
	  </step>
      </procedure>

      <para>&Eacute; isso!  Agora voc&ecirc; est&aacute; conectado &agrave; esta&ccedil;&atilde;o decapitada
	atrav&eacute;s de sua sess&atilde;o <command>cu</command>.  Ele pedir&aacute; para que
	voc&ecirc; substitua o disco atual pelo <filename>mfsroot.flp</filename>,
	e depois disso possibilitar&aacute; a sele&ccedil;&atilde;o do tipo de terminal
	que deve ser utilizado.  Escolhe o console colorido do FreeBSD
	e continue com sua instala&ccedil;&atilde;o!</para>
    </sect2>
  </sect1>

  <sect1 id="install-diff-media">
    <title>Preparando sua pr&oacute;pria m&iacute;dia de instala&ccedil;&atilde;o</title>

    <note>
      <para>Para evitar redund&acirc;ncias, a express&atilde;o <quote>disco do FreeBSD</quote>
	neste contexto, refere-se ao CDROM ou DVD do FreeBSD que voc&ecirc;
	adquiriu ou criou sozinho.</para>
    </note>

    <para>Pode haver algumas situa&ccedil;&ograve;es onde ser&aacute; preciso criar sua
	pr&oacute;pria m&iacute;dia de instala&ccedil;&atilde;o ou origem.  Pode ser m&iacute;dia f&iacute;sica como
	fita, ou uma origem de onde o <application>sysinstall</application>
	possa acessar todos os arquivos, como um s&iacute;tio FTP local, ou
	uma parti&ccedil;&atilde;o &ms-dos;.</para>

    <para>Por exemplo:</para>

    <itemizedlist>
      <listitem>
	<para>Voc&ecirc; tem in&uacute;meras m&aacute;quinas conectadas &agrave; sua rede local,
	e apenas um disco do FreeBSD.  Voc&ecirc; pretende criar um s&iacute;tio FTP
	local com o conte&uacute;do do disco do FreeBSD, e depois permitir que
	estas m&aacute;quinas usem o s&iacute;tio FTP em quest&atilde;o ao inv&eacute;s de se 
	conectarem na Internet.</para>
      </listitem>

      <listitem>
	<para>Voc&ecirc; tem um disco do FreeBSD, e o FreeBSD n&atilde;o reconhece seu dispositivo
	de CD/DVD, mas o &ms-dos;/&windows; reconhece.  Voc&ecirc; quer copiar os arquivos	
	de instala&ccedil;&atilde;o do FreeBSD para uma parti&ccedil;&atilde;o DOS no mesmo computador
	e ent&atilde;o instalar o FreeBSD &agrave; partir destes arquivos.</para>
      </listitem>

      <listitem>
	<para>O computador onde voc&ecirc; pretende instalar o FreeBSD n&atilde;o tem
	um dispositivo de CD/DVD nem est&aacute; na rede, mas voc&ecirc; pode se conectar
	por cabo paralelo ou serial atrav&eacute;s de um <quote>Laplink</quote>, em
	um computador que tem esses dispositivos.</para>
      </listitem>

      <listitem>
	<para>Voc&ecirc; quer criar uma fita que pode ser utilizada para
	a instala&ccedil;&atilde;o do FreeBSD.</para>
      </listitem>
    </itemizedlist>

    <sect2 id="install-cdrom">
      <title>Criando um CD de instala&ccedil;&atilde;o</title>

      <para>Como parte integrante de cada vers&atilde;o, o projeto FreeBSD
	disponibiliza duas imagens de CD (<quote>imagens ISO</quote>).  Estas
	imagens podem ser gravadas para gerar o disco de instala&ccedil;&atilde;o do FreeBSD.
	Se voc&ecirc; tem um gravador de CD e largura de banda suficiente, esta
	&eacute; a maneira mais f&aacute;cil de instalar o FreeBSD.</para>

      <procedure>
	<step>
	  <title>Baixe a imagem ISO correta</title>

	  <para>As imagens ISO de cada vers&atilde;o podem ser baixadas &agrave;
		partir de <filename>ftp://ftp.FreeBSD.org/pub/FreeBSD/ISO-IMAGES-<replaceable>
		arquitetura</replaceable>/<replaceable>vers&atilde;o</replaceable></filename> ou do
		servidor espelho mais pr&oacute;ximo. Substitua as express&otilde;es
		<replaceable>arquitetura</replaceable> e 
	    <replaceable>vers&atilde;o</replaceable> com os valores apropriados.</para>

	  <para>Este diret&oacute;rio normalmente ter&aacute; as seguintes imagens:</para>

	  <table frame="none">
	    <title>Nomes e significados das imagens ISO do FreeBSD</title>

	    <tgroup cols="2">
	      <thead>
		<row>
		  <entry>Nome do arquivo</entry>

		  <entry>Conte&uacute;do</entry>
		</row>
	      </thead>

	      <tbody>
		<row>
		  <entry><filename><replaceable>vers&atilde;o</replaceable>-mini.iso</filename></entry>
		  
		  <entry>Tudo que voc&ecirc; precisa para instalar o FreeBSD.</entry>
		</row>

		<row>
		  <entry><filename><replaceable>vers&atilde;o</replaceable>-disc1.iso</filename></entry>

		  <entry>Tudo que voc&ecirc; precisa para instalar o FreeBSD, acrescido
			de quantos pacotes adicionais de terceiros couberem no disco.</entry>
		</row>

		<row>
		  <entry><filename><replaceable>vers&atilde;o</replaceable>-disc2.iso</filename></entry>

		  <entry>Um <quote>sistema de arquivos vivo (Live)</quote>, que costuma
			ser usado em conjunto com a op&ccedil;&atilde;o de recupera&ccedil;&atilde;o 
			(<quote>Repair</quote>) do <application>sysinstall</application>.  Uma 
			c&oacute;pia da &aacute;rvore CVS do FreeBSD, e quantos pacotes de terceiros
			couberem no disco.</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </table>

<!-- XXX n&atilde;o existe mais a necessidade de mencionarmos modifica&ccedil;&otilde;es anteriores &agrave; vers&atilde;o 4.4
	  <note>
	    <para>O mini ISO passou a ser produzido apenas &agrave; partir da
		do FreeBSD&nbsp;4.4.  As imagens dos discos dois, tr&ecirc;s e
		quatro passaram a ser produzidas apenas &agrave; partir do
		FreeBSD&nbsp;4.5.</para>
	  </note>
-->

	  <para>Voc&ecirc; <emphasis>deve</emphasis> baixar uma das duas, ou a imagem
		mini ISO ou o disco um.  N&atilde;o baixe ambos, afinal a imagem do
		disco um cont&eacute;m tudo que o mini ISO oferece, e um pouco
		mais.</para>

	  <para>Use o mini ISO se o seu acesso &agrave; Internet &eacute; barato.  Ele permitir&aacute; que
		voc&ecirc; instale o FreeBSD, e todos os pacotes de terceiros voc&ecirc;
		pode baixar e instalar usando o sistema de <literal>ports</literal>
		e <foreignphrase>packages</foreignphrase> (veja <xref linkend="ports">)
		conforme necess&aacute;rio.</para>

	  <para>Use a imagem do disco um, se voc&ecirc; pretende obter uma sele&ccedil;&atilde;o
		razo&aacute;vel de pacotes de terceiros no mesmo disco.</para>

	  <para>As imagens adicionais de disco s&atilde;o &uacute;teis, mas n&atilde;o essenciais,
		especialmente se voc&ecirc; tiver acesso r&aacute;pido &agrave; Internet.</para>
	</step>

	<step>
	  <title>Grave os CDs</title>

	  <para>Voc&ecirc; deve gravar as imagens de CD no disco.  Se voc&ecirc;
		pretende fazer isso em outro sistema FreeBSD, veja
		as informa&ccedil;&otilde;es em <xref linkend="creating-cds"> para
		obter mais informa&ccedil;&otilde;es (em particular, <xref linkend="burncd">
		e <xref linkend="cdrecord">).</para>

	  <para>Se voc&ecirc; pretende faz&ecirc;-lo em outra plataforma, ent&atilde;o ser&aacute; preciso
		usar os utilit&aacute;rios existentes para controlar seu gravador de
		CD na plataforma em quest&atilde;o.  As imagens dispon&iacute;veis est&atilde;o no
		formato ISO padr&atilde;o, que a maioria das aplica&ccedil;&otilde;es para
		grava&ccedil;&atilde;o de CD suportam.</para>
	</step>
      </procedure>
    </sect2>

    <sect2 id="install-ftp">
      <title>Criando um s&iacute;tio FTP local com um disco do FreeBSD</title>
	
      <indexterm>
	<primary>instala&ccedil;&atilde;o</primary>
	<secondary>rede</secondary>
	<tertiary>FTP</tertiary>
      </indexterm>

      <para>Os discos do FreeBSD s&atilde;o dispostos da mesma forma como no s&iacute;tio FTP.
	Isso torna a cria&ccedil;&atilde;o de um s&iacute;tio FTP local muito f&aacute;cil, para poder
	utiliza-lo em outras m&aacute;quinas na sua rede ao instalar o FreeBSD.</para>

      <procedure>
	<step>
	  <para>No servidor FreeBSD onde o s&iacute;tio FTP ficar&aacute; hospedado,
		garanta que o CDROM do FreeBSD est&aacute; no dispositivo,
		e montado no ponto <filename>/cdrom</filename>.</para>

	  <screen>&prompt.root; <userinput>mount /cdrom</userinput></screen>
	</step>

	<step>
	  <para>Crie uma conta para FTP an&ocirc;nimo no
	    <filename>/etc/passwd</filename>.  Para isso, edite o
	    <filename>/etc/passwd</filename> com o comando &man.vipw.8; e
		adicione esta linha:</para>

	  <programlisting>ftp:*:99:99::0:0:FTP:/cdrom:/nonexistent</programlisting>
	</step>

	<step>
	  <para>Garanta que o servi&ccedil;o de FTP est&aacute; habilitado no
	    <filename>/etc/inetd.conf</filename>.</para>
	</step>
      </procedure>

      <para>Qualquer pessoa com conectividade em rede para sua m&aacute;quina
	poder&aacute; escolher o tipo de m&iacute;dia FTP e digitar
	<userinput>ftp://<replaceable>sua m&aacute;quia</replaceable></userinput>
	depois de selecionar a op&ccedil;&atilde;o <quote>Other</quote> no menu de s&iacute;tios
	FTP, durante a instala&ccedil;&atilde;o.</para>

      <warning>
	<para> Essa abordagem est&aacute; OK para qualquer m&aacute;quina na sua rede local,
	e que esteja protegida por seu <literal>firewall</literal>.  Oferecer
	servi&ccedil;os de FTP para outras esta&ccedil;&otilde;es na Internet (e n&atilde;o apenas
	na sua rede local) exp&otilde;e seu computador &agrave; aten&ccedil;&atilde;o de usu&aacute;rios
	mal intencionados, ou apenas indesejados.  Recomendamos fortemente que
	voc&ecirc; siga boas pr&aacute;ticas de seguran&ccedil;a para fazer isso.</para>
      </warning>
    </sect2>

      <sect2>
        <title>Criando disquetes de instala&ccedil;&atilde;o</title>

      <indexterm>
	<primary>instala&ccedil;&atilde;o</primary>
	<secondary>disquetes</secondary>
      </indexterm>

      <para>Se voc&ecirc; tem que instalar o sistema a partir de um disquete (o
	que n&oacute;s <emphasis>n&atilde;o</emphasis> aconselhamos), ou por
	quest&otilde;es de equipamentos n&atilde;o suportados ou simplesmente porque
	voc&ecirc; insiste em fazer as coisas da maneira dif&iacute;cil, primeiro
	voc&ecirc; deve preparar alguns disquetes para a instala&ccedil;&atilde;o.</para>

	<para>No m&iacute;nimo, voc&ecirc; vai precisar de quantos disquetes forem
	  necess&aacute;rios, de 1.44&nbsp;MB ou 1.2&nbsp;MB, para armazenar
	  o diret&oacute;rio <filename>bin</filename> (distribui&ccedil;&atilde;o
	  bin&aacute;ria).  Se voc&ecirc; estiver fazendo os disquetes &agrave;
	  partir do DOS, ent&atilde;o eles <emphasis>DEVEM</emphasis> estar
	  formatados com o comando <command>FORMAT</command> do &ms-dos;.
	  Use o <literal>Explorer</literal> para formatar os discos (clique
	  com o bot&atilde;o direito sobre o dispositivo <devicename>A:</devicename>
	  e escolha <quote>Formatar</quote>.</para>

	<para><emphasis>N&atilde;o</emphasis> confie em disquetes pr&eacute;-formatados
	 de f&aacute;brica.  Formate-os novamente, apenas para garantir.  Muitos
	 problemas j&aacute; foram relatados e descobriu-se depois que o motivo
	 era apenas m&iacute;dias formatadas de maneira impr&oacute;pria, e &eacute; por
	 isso que estamos lembrando voc&ecirc; deste detalhe.</para>

	<para>Se voc&ecirc; estiver criando os disquetes em outra m&aacute;quina,
	 formatar ainda &eacute; uma boa id&eacute;ia, contudo n&atilde;o ser&aacute; necess&aacute;rio
	 colocar um sistema de arquivos DOS em cada disquete.  Voc&ecirc;
	 pode usar os comandos <command>disklabel</command> e <command>
	 newfs</command> para definir UFS como sistema de arquivos, 
	 seguindo a sequ&ecirc;ncia de comandos (para um disquete de 3.5",
	 1.44&nbsp;MB) ilustrada a seguir:</para>

	<screen>&prompt.root; <userinput>fdformat -f 1440 fd0.1440</userinput>
&prompt.root; <userinput>disklabel -w -r fd0.1440 floppy3</userinput>
&prompt.root; <userinput>newfs -t 2 -u 18 -l 1 -i 65536 /dev/fd0</userinput></screen>

	<note>
	  <para>Use <literal>fd0.1200</literal> e
	    <literal>floppy5</literal> para discos de 5.25", 1.2&nbsp;MB.</para>
	</note>

	<para>Depois voc&ecirc; pode monta-los e escrever nos mesmos, como
	qualquer outro sistema de arquivos.</para>

	<para>Depois de ter formatado dos disquetes, ser&aacute; necess&aacute;rio copiar
	 os arquivos para eles.  Os arquivos de distribui&ccedil;&atilde;o s&atilde;o divididos
	 em blocos com tamnhos definidos convenientemente para que cinco
	 deles caibam em um disquete convencional de 1.44&nbsp;MB.  Utilize
	 todos seus disquetes, empacotando quantos arquivos couberem em
	 cada um deles, at&eacute; que voc&ecirc; tenha todas as distribui&ccedil;&otilde;es desej&aacute;veis
	 em disquete, sempre da mesma forma.  Cada distribui&ccedil;&atilde;o deve estar
	 em um subdiret&oacute;rio do disquete, por exemplo:
	  <filename>a:\bin\bin.aa</filename>,
	  <filename>a:\bin\bin.ab</filename>, e assim por diante.</para>

	<para>Uma vez que voc&ecirc; tenha chegado &agrave; tela de sele&ccedil;&atilde;o
	 de m&iacute;dia durante o processo de instala&ccedil;&atilde;o, escolha
	 select <quote>Floppy</quote> e voc&ecirc; ser&aacute; indagado sobre o
	 restante.</para>
      </sect2>

      <sect2 id="install-msdos">
        <title>Instalando a partir de uma parti&ccedil;&atilde;o &ms-dos;</title>

	<indexterm>
	  <primary>instala&ccedil;&atilde;o</primary>
	  <secondary>a partir do MS-DOS</secondary>
	</indexterm>
	<para>Para preparar uma instala&ccedil;&atilde;o &agrave; partir de
	 uma parti&ccedil;&atilde;o &ms-dos;, copie os arquivos da distribui&ccedil;&atilde;o
	 no diret&oacute;rio chamado <filename>freebsd</filename> no diret&oacute;rio
	 raiz da parti&ccedil;&atilde;o.  Por exemplo, <filename>c:\freebsd</filename>.
	 A estrutura de direct&oacute;rio do CD ou do s&iacute;tio FTP devem ser
	 parcialmente reproduzidas neste diret&oacute;rio, ent&atilde;o sugerimos
	 fortemente a utiliza&ccedil;&atilde;o do comando <command>xcopy</command>
	 do &ms-dos;, se estiver fazendo a c&oacute;pia &agrave; partir do CD.
	 Por exemplo, para preparar uma instala&ccedil;&atilde;o m&iacute;nima
	 do FreeBSD:</para>

	<screen><prompt>C:\&gt;</prompt> <userinput>md c:\freebsd</userinput>
<prompt>C:\&gt;</prompt> <userinput>xcopy e:\bin c:\freebsd\bin\ /s</userinput>
<prompt>C:\&gt;</prompt> <userinput>xcopy e:\manpages c:\freebsd\manpages\ /s</userinput></screen>

	<para>Assumindo que <devicename>C:</devicename> &eacute; onde existe
	 espa&ccedil;o livre e <devicename>E:</devicename> &eacute; onde seu CDROM est&aacute;
	 inserido.</para>
	
	<para>Se voc&ecirc; n&atilde;o tem um dispositivo de CD, voc&ecirc; pode baixar a distribui&ccedil;&atilde;o
	 &agrave; partir de <ulink
	  url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/&rel.current;-RELEASE/">ftp.FreeBSD.org</ulink>.
	  Cada distribui&ccedil;&atilde;o est&aacute; em seu pr&oacute;prio diret&oacute;rio; por exemplo, a distribui&ccedil;&atilde;o 
	  <emphasis>base</emphasis> pode ser encontrada no diret&oacute;rio <ulink
	  url="ftp://ftp.FreeBSD.org/pub/FreeBSD/releases/i386/&rel.current;-RELEASE/base/">&rel.current;/base/</ulink>.</para>

	<note>
	  <para>Nas vers&otilde;es 4.X do &os; e anteriores, a distribui&ccedil;&atilde;o
		<quote>base</quote> era chamada de <quote>bin</quote>.  Ajuste
		os comandos e URLs apresentados acima de acordo com a
		vers&atilde;o que voc&ecirc; estiver utilizando.</para>
	</note>
    
	<para>Desejando instalar muitas distribui&ccedil;&otilde;es a partir de uma 
	 parti&ccedil;&atilde;o &ms-dos; ( e tendo espa&ccedil;o livre para isso ),
	  instale cada uma sob o diret&oacute;rio <filename>c:\freebsd</filename> &mdash; A
	  distribui&ccedil;&atilde;o <literal>BIN</literal> &eacute; a &uacute;nica 
	 necess&aacute;ria para uma instala&ccedil;&atilde;o m&iacute;nima.</para>
      </sect2>

      <sect2>
        <title>Criando uma fita de instala&ccedil;&atilde;o</title>

	<indexterm>
	  <primary>instala&ccedil;&atilde;o</primary>
	  <secondary>&agrave; partir de uma fita QIC/SCSI</secondary>
	</indexterm>
	<para>Instalar o sistema &agrave; partir de uma fita
	 prov&aacute;velmente &eacute; o metodo mais f&aacute;cil de todos, bem perto de
	 uma instala&ccedil;&atilde;o FTP ou por CDROM.  O programa de instala&ccedil;&atilde;o
	 espera que os arquivos sejam simplesmente empacotados com
	 o &man.tar.1; e colocados na fita.  Depois de obter todos
	 os arquivos da distribui&ccedil;&atilde;o que voc&ecirc; quer instalar, basta
	 empacot&aacute;-los com o &man.tar.1; na fita:</para>

	<screen>&prompt.root; <userinput>cd /freebsd/distdir</userinput>
&prompt.root; <userinput>tar cvf /dev/rwt0 dist1 ... dist2</userinput></screen>

	<para>Quando voc&ecirc; realizar a instala&ccedil;&atilde;o, dever&aacute; garantir
	 que existe espa&ccedil;o suficiente para um diret&oacute;rio tempor&aacute;rio
	 (que voc&ecirc; poder&aacute; escolher) que acomodar&aacute; <emphasis>todo</emphasis>
	 o conte&uacute;do da fita que voc&ecirc; criou.  Devido &agrave; natureza n&atilde;o
	 aleat&oacute;ria de acesso &agrave;s fitas, este m&eacute;todo de instala&ccedil;&atilde;o
	 requer um espa&ccedil;o consider&aacute;vel para armazenamento tempor&aacute;rio.
	 Voc&ecirc; deve prever a necessidade de tanto espa&ccedil;o tempor&aacute;rio
	 quanto a quantidade de dados gravados na fita.</para>

	<note>
	  <para>Ao iniciar a instala&ccedil;&atilde;o, a fita deve estar no dispositivo
		<emphasis>antes</emphasis> de iniciar o processo de boot
		&agrave; partir do disquete.  A varredura por dispositivos pode,
		do contr&aacute;rio, falhar em procura-lo.</para>
	</note>
      </sect2>

      <sect2>
        <title>Antes de instalar via rede</title>

	<indexterm>
	  <primary>instala&ccedil;&atilde;o</primary>
	  <secondary>rede</secondary>
	  <tertiary>serial (SLIP ou PPP)</tertiary>
	</indexterm>
	<indexterm>
	  <primary>instala&ccedil;&atilde;o</primary>
	  <secondary>rede</secondary>
	  <tertiary>paralela (PLIP)</tertiary>
	</indexterm>
	<indexterm>
	  <primary>instala&ccedil;&atilde;o</primary>
	  <secondary>rede</secondary>
	  <tertiary>Ethernet</tertiary>
	</indexterm>
	<para>Existem tr&ecirc;s tipos de instala&ccedil;&atilde;o por rede
	 dispon&iacute;veis.  Porta serial (PPP ou SLIP), porta paralela (PLIP (cabo
	 <foreignphrase>laplink</foreignphrase>)), ou rede <literal>
	 Ethernet</literal> (qualquer placa de rede padr&atilde;o, incluindo 
	 alguns dispositivos PCMCIA).</para>

	<para>O suporte SLIP &eacute; um tanto primitivo e limitado
	  primariamente &agrave; redes cabeadas, como um cabo serial
	  ligado entre um <foreignphrase>laptop</foreignphrase> e
	  outro computador.  O <literal>link</literal> deve ser
	  cabeado, pois a instala&ccedil;&atilde;o SLIP no momento n&atilde;o oferece
	  recursos para discagem; este suporte &eacute; oferecido com
	  o utilit&aacute;rio <acronym>PPP</acronym>, que deve ser
	  utilizado com prefer&ecirc;ncia sobre SLIP sempre que
	  poss&iacute;vel.</para>

	<para>Se voc&ecirc; estiver usando um modem, ent&atilde;o <acronym>PPP</acronym>
	  certamente &eacute; sua &uacute;nica escolha.  Garanta que voc&ecirc; tem as
	  informa&ccedil;&otilde;es do seu provedor de servi&ccedil;os em m&atilde;os, pois ser&aacute;
	  necess&aacute;rio sab&ecirc;-las bem no in&iacute;cio do processo de
	  instala&ccedil;&atilde;o.</para>

	<para>Se voc&ecirc; usa PAP ou CHAP para se conectar ao seu ISP (em outras
	  palavras, se voc&ecirc; se conecta ao ISP no &windows; sem usar uma
	  rotina), ent&atilde;o tudo que voc&ecirc; precisa fazer &eacute; digitar o comando
	  <command>dial</command> no terminal <application>ppp</application>.
	  Do contr&aacute;rio, ser&aacute; necess&aacute;rio saber como discar para seu ISP,
	  usando ps <quote>comandos AT</quote> espec&iacute;ficos para seu modem,
	  pois o discador PPP prov&ecirc; um emulador de terminal bastante simples.
	  Por gentileza, refira-se ao <link linkend="userppp">handbook</link>
	  do <acronym>PPP</acronym> em modo usu&aacute;rio e &agrave;s entradas da <ulink
	  url="../faq/ppp.html">FAQ</ulink> sobre <acronym>PPP</acronym>.
	  Se voc&ecirc; tiver problemas, as mensagens de <literal>log</literal>
	  podem ser direcionadas &agrave; sua tela, utilizando os comandos
	  <command>set log local ...</command>.</para>

	<para>Se existir uma conex&atilde;o cabeada para outra m&aacute;quina FreeBSD
	  (2.0-RELEASE ou posterior) dispon&iacute;vel, voc&ecirc; deve considerar
	  tamb&eacute;m a instala&ccedil;&atilde;o por meio de um cablo <quote>laplink
	  </quote> na porta parabela.  O tr&aacute;fego de dados em uma porta
	  paralela &eacute; muito maior do que normalmente &eacute; poss&iacute;vel em
	  uma linha serial (cerca de 50&nbsp;kbytes/sec), resultando
	  portando em uma instala&ccedil;&atilde;o mais r&aacute;pida.</para>

	<para>Finalmente, para a instala&ccedil;&atilde;o por rede mais r&aacute;pida 
	  poss&iacute;vel, uma placa de rede <literal>Ethernet</literal>
	  &eacute; sempre uma boa escolha!  FreeBSD suporta a maioria das
	  placas <literal>Ethernet</literal> dispon&iacute;veis para PC; uma
	  tabela das placas suportados (e suas configura&ccedil;&otilde;es
	  usuais) &eacute; disponibilizada nas Notas de Hardware de cada
	  vers&atilde;o do FreeBSD.  Se voc&ecirc; estiver utilizando um dos
	  cart&otilde;es PCMCIA suportados, garanta tamb&eacute;m que ela est&aacute;
	  inserida <emphasis>antes</emphasis> que o <foreignphrase>
	  laptop</foreignphrase> seja ligado!  O FreeBSD n&atilde;o suporta,
	  infelizmente, inser&ccedil;&atilde;o &agrave; quente de cart&otilde;es PCMCIA durante
	  a instala&ccedil;&atilde;o.</para>

	<para>Voc&ecirc; precisar&aacute; tamb&eacute;m saber o seu endere&ccedil;o IP na rede,
	  e o valor da m&aacute;scara de rede para sua classe de endere&ccedil;amento,
	  bem como o nome da sua esta&ccedil;&atilde;o.  Se voc&ecirc; estiver instalando
	  por meio de uma conex&atilde;o <acronym>PPP</acronym> e n&atilde;o tem
	  um endere&ccedil;o IP est&aacute;tico, n&atilde;o tema, o endere&ccedil;o IP &eacute; atribuido
	  automaticamente pelo seu ISP.  Seu administrador de
	  sistemas pode informar que valores usar para uma configura&ccedil;&atilde;o
	  espec&iacute;fica.  Se voc&ecirc; for fazer refer&ecirc;ncia &agrave; outras esta&ccedil;&otilde;es
	  por nome, e n&atilde;o por endere&ccedil;amento IP, ser&aacute; necess&aacute;rio
	  saber o endere&ccedil;o de um servidor de nomes e tamb&eacute;m o endere&ccedil;o
	  do seu <foreignphrase>gateway</foreignphrase> (se voc&ecirc; estiver
	  utilizando PPP, &eacute; o endere&ccedil;o IP da outra ponta do provedor).
	  Se sua inten&ccedil;&atilde;o &eacute; instalar por FTP por meio de um <foreignphrase>
	  proxy</foreignphrase> HTTP, ser&aacute; necess&aacute;rio saber o
	  endere&ccedil;o do <foreignphrase>proxy</foreignphrase>.  Se voc&ecirc; 
	  n&atilde;o faz id&eacute;ia da resposta para algumas ou a maioria destas
	  quest&otilde;es, ent&atilde;o voc&ecirc; deveria conversar com seu administrador
	  de sistemas ou seu ISP <emphasis>antes</emphasis> de tentar
	  esse tipo de instala&ccedil;&atilde;o.</para>

	<sect3>
	  <title>Antes de instalar por NFS</title>

	  <indexterm>
	    <primary>instala&ccedil;&atilde;o</primary>
	    <secondary>rede</secondary>
	    <tertiary>NFS</tertiary>
	  </indexterm>
	  <para>A instala&ccedil;&atilde;o NFS &eacute; trivial.  Basta simplesmente copiar os
	    arquivos da distribui&ccedil;&atilde;o FreeBSD que voc&ecirc; deseja utilizar
	    no servidor NFS e apontar a sele&ccedil;&atilde;o da m&iacute;dia NFS para
	    este servidor.</para>

	  <para>Se o servidor suporta exclusivamente acesso
	    em <quote>portas privilegiadas</quote> (normalmente
	    este &eacute; o padr&atilde;o em esta&ccedil;&otilde;es de trabalho Sun), ser&aacute;
	    necess&aacute;rio definir esta op&ccedil;&atilde;o no menu <quote>Options
	    </quote> antes que a instala&ccedil;&atilde;o possa 
	    prosseguir.</para>

	  <para>Se sua placa de rede <literal>Ethernet</literal> &eacute;
	    de baixa qualidade e sofre com taxas de transfer&ecirc;ncia
	    baixa, voc&ecirc; ainda pode desejar habilitar a op&ccedil;&atilde;o
	    apropriada neste mesmo menu.</para>

	  <para>Para uma instala&ccedil;&atilde;o NFS funcionar, o servidor deve
	    suportar montagem de subdiret&oacute;rios, por exemplo, se
	    o diret&oacute;rio de sua distribui&ccedil;&atilde;o FreeBSD&nbsp;&rel.current;
	    fica localizado em:
	    <filename>ziggy:/usr/archive/stuff/FreeBSD</filename>,
	    ent&atilde;o o servidor <hostid>ziggy</hostid> dever&aacute; permitir
	    montagem direta do <filename>/usr/archive/stuff/FreeBSD</filename>,
	    n&atilde;o apenas do <filename>/usr</filename> ou
	    <filename>/usr/archive/stuff</filename>.</para>

	  <para>No arquivo <filename>/etc/exports</filename> do FreeBSD,
	    este controle &eacute; feito por meio das op&ccedil;&otilde;es <option>-alldirs
	    </option>.  Outros servidores NFS podem manter conven&ccedil;&otilde;es
	    distintas.  Se voc&ecirc; estiver tendo problemas com permiss&otilde;es
	    negadas (<quote>permission denied</quote>) no servidor,
	    &eacute; muito prov&aacute;vel que voc&ecirc; n&atilde;o tenha habilitado estas
	    configura&ccedil;&otilde;es de forma apropriada.</para>
	</sect3>

      </sect2>
  </sect1>
</chapter>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
