<!--
     $FreeBSD: pt_BR.ISO8859-1/books/handbook/preface/preface.sgml,v 1.1.1.1 2003/11/28 01:13:15 ebrandi Exp $
-->

<preface id="book-preface">
  <title>Preface</title>
  
  <bridgehead id="preface-audience" renderas=sect1>Audi&ecirc;ncias
  Pretendidas</bridgehead>

  <para>O rec&eacute;m chegado ao FreeBSD encontrar&aacute; que a primeira se&ccedil;&atilde;o
 deste livro guia o usu&aacute;rio com o processo da instala&ccedil;&atilde;o de FreeBSD
 e introduz delicadamente os conceitos e as conven&ccedil;&otilde;es que underpin o &unix;.  
Trabalhar atrav&eacute;s desta se&ccedil;&atilde;o requer pouco mais do que o desejo explorar, 
e a abilidade fazer exame em conceitos novos da 
placa enquanto s&atilde;o introduzidos.</para>

  <para>Uma vez que voc&ecirc; viajou esta dist&acirc;ncia, a segunda, de longe a maior,
    se&ccedil;&atilde;o do manual &eacute; uma refer&ecirc;ncia detalhada a toda a maneira
 dos t&oacute;picos do interesse aos administradores de sistema do FreeBSD.  Alguns
 destes cap&iacute;tulos podem recomendar que voc&ecirc; fa&ccedil;a alguma leitura pr&eacute;via, e isto
 &eacute; anotado na sinopse no come&ccedil;o de cada cap&iacute;tulo.</para>

  <para>Para uma lista de fontes adicionais da informa&ccedil;&atilde;o, veja por favor <xref
    linkend="bibliography">.</para>

  <bridgehead id="preface-changes" renderas=sect1>Mudan&ccedil;as da primeira
 edi&ccedil;&atilde;o</bridgehead>

    <para>Esta segunda edi&ccedil;&atilde;o &eacute; a culmina&ccedil;&atilde;o sobre de dois anos de
      trabalho pelos membros dedicados do FreeBSD Documentation
      Project.  Os seguintes s&atilde;o as mudan&ccedil;as principais nesta nova
      edi&ccedil;&atilde;o:</para>

<!-- Talk a little about justification and other stylesheet changes? -->

    <itemizedlist>
      <listitem>
	<para>Um &iacute;ndice completo foi adicionado.</para>
      </listitem>
      <listitem>
	<para>Todas as figuras  ASCII foram substitu&iacute;das por diagramas gr&aacute;ficos.</para>
      </listitem>
      <listitem>
	<para>Uma sinopse padr&atilde;o foi adicionado a cada cap&iacute;tulo para
	dar um r&aacute;pido sum&aacute;rio de que informa&ccedil;&atilde;o o cap&iacute;tulo contem,
	e o que o leitor se espera saber.</para>
      </listitem>
      <listitem>
	<para>O conte&uacute;do foi reorganazado logicamente em tr&ecirc;s
	partes: <quote>Come&ccedil;ando a usar</quote>, <quote>Administra&ccedil;&atilde;o Do Sistema</quote>, and
	<quote>Ap&ecirc;ndices</quote>.</para>
      </listitem>
      <listitem>
	<para><xref linkend="install"> (<quote>Instalando o FreeBSD</quote>) foi completamente
	reescrito com muitos <literal>screenshots</literal> para faz&ecirc;-lo muito mais f&aacute;cil para novos
	usu&aacute;rios para agarrar o texto.</para>
      </listitem>
      <listitem>
	<para><xref linkend="basics"> (<quote>B&aacute;sicos &unix;</quote>) foi expandido para conter
	informa&ccedil;&atilde;o adicional sobre processos, daemons, e
	sinais.</para>
      </listitem>
      <listitem>
	<para><xref linkend="ports"> (<quote>Instalando Aplica&ccedil;&otilde;es</quote>) foi expandido
	para conter informa&ccedil;&atilde;o adicional sobre ger&ecirc;nciamento bin&aacute;rio de
	pacote.</para>
      </listitem>
      <listitem>
	<para><xref linkend="x11"> (<quote>The X, sistema de interface gr&aacute;fico</quote>) foi completamente
 	reescrito com uma &ecirc;nfase em uso de modernas tecnologias
	 <foreignphrase>desktop</foreignphrase> como <application>KDE</application> e <application>GNOME</application> no &xfree86; 4.X.</para>
      </listitem>
      <listitem>
	<para><xref linkend="boot"> (<quote>O Processo de carregamento do FreeBSD</quote>) foi
	expandido.</para>
      </listitem>
      <listitem>
        <para><xref linkend="disks"> (<quote>Armazenamento</quote>) foi escrito from what used
        to be dois cap&iacute;tulos separados em <quote>Discos</quote> e <quote>Backups</quote>.  We feel
        that os t&oacute;picos s&atilde;o mais f&aacute;ceis de compreender quando apresentados como um
        &uacute;nico cap&iacute;tulo.  Uma se&ccedil;&atilde;o sobre RAID (ambos hardware e
        software) foi adicionado tamb&eacute;m.</para>
      </listitem>
      <listitem>
	<para><xref linkend="serialcomms"> (<quote>Comunica&ccedil;&otilde;es Seriais</quote>) foi completamente
	reorganizada e atualizada para o FreeBSD 4.X/5.X.</para>
      </listitem>
      <listitem>
	<para><xref linkend="ppp-and-slip"> (<quote>PPP e SLIP</quote>) foi substancialmente
	atua&ccedil;izado.</para>
      </listitem>
      <listitem>
	<para>Muitas se&ccedil;&otilde;es novas foram adicionadas ao <xref linkend="advanced-networking">
	(<quote>Advanced Networking</quote>).</para>
      </listitem>
      <listitem>
	<para><xref linkend="mail"> (<quote>Correio Eletr&ocirc;nico</quote>) foi expandido para
	  incluir mais informa&ccedil;&otilde;es sobre configurando o
	  <application>sendmail</application>.</para>
      </listitem>
      <listitem>
	<para><xref linkend="linuxemu"> (<quote>Compatibilidade Linux</quote>) foi expandido para
	  incluir informa&ccedil;&atilde;o sobre instalando o
	  <application>&oracle;</application> e
	<application>&sap.r3;</application>.</para>
      </listitem>
      <listitem>
	<para>Os seguintes t&oacute;picos novos s&atilde;o cobertos nesta segunda
	edi&ccedil;&atilde;o:</para>
	<itemizedlist>
	  <listitem>
	    <para>Configurando e Ajustando (<xref linkend="config-tuning">).</para>
	  </listitem>
	  <listitem>
           <para>Multimedia (<xref linkend="multimedia">)</para>
	  </listitem>
	</itemizedlist>
      </listitem>
    </itemizedlist>

  <bridgehead id="preface-overview" renderas=sect1>Organiza&ccedil;&atilde;o deste
  Livro</bridgehead>

  <para>Este livro &eacute; dividido em tr&ecirc;s se&ccedil;&otilde;es logicamente distintas.
    A primeira se&ccedil;&atilde;o, <emphasis>Come&ccedil;ando a usar</emphasis>, cobre
    a instala&ccedil;&atilde;o e o uso b&aacute;sico do FreeBSD.  Espera-se que
    o leitor seguir&aacute; estes cap&iacute;tulos em sequencia, possivelmente
    saltando cap&iacute;tulos que cobrem t&oacute;picos familiares.  A segunda se&ccedil;&atilde;o,
    <emphasis>Administra&ccedil;&atilde;o Do Sistema</emphasis>, cobre uma broad
    cole&ccedil;&atilde;o dos assuntos que s&atilde;o do interesse para usu&aacute;rios mais avan&ccedil;ados
    do FreeBSD.  Cada se&ccedil;&atilde;o come&ccedil;a com uma sinopse sucinta que
    descreve o que o cap&iacute;tulo cobre e que o leitor espera
    j&aacute; saber.  Isto &eacute; significa permitir o leitor ocasional to skip
    around para encontrar cap&iacute;tulos do interesse.  A terceira se&ccedil;&atilde;o contem
    ap&ecirc;ndices da informa&ccedil;&atilde;o de refer&ecirc;ncia.</para>

  <variablelist>
    <varlistentry>
      <term><emphasis><xref linkend="introduction">, Introdu&ccedil;&atilde;o</emphasis></term>
      <listitem>
	<para>Introduz FreeBSD a um usu&aacute;rio novo.  Descreve a
	hist&oacute;ria do Projeto FreeBSD, seus objetivos e modelo do desenvolvimento.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="install">, Instala&ccedil;&atilde;o</emphasis></term>
      <listitem>
	<para>Caminha um usu&aacute;rio atrav&eacute;s do processo inteiro da instala&ccedil;&atilde;o.
	Alguns t&oacute;picos avan&ccedil;ados da instala&ccedil;&atilde;o, como instala&ccedil;&atilde;o atrav&eacute;s
	de um console serial, s&atilde;o cobertos tamb&eacute;m.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="basics">, &unix; Basics</emphasis></term>
      <listitem>
	<para>Cobre os comandos e a funcionalidade b&aacute;sicos do
	sistema operacionl FreeBSD.  Se voc&ecirc; for familiar com o Linux ou
	outro sabor do &unix; ent&atilde;o voc&ecirc; pode provavelmente saltar este
	cap&iacute;tulo.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="ports">, Instala&ccedil;&otilde;es de Aplica&ccedil;&otilde;es</emphasis></term>
      <listitem>
	<para>Cobre a instala&ccedil;&atilde;o  de software de terceiros com
	both FreeBSD's innovative <quote>Ports Collection</quote> e pacotes
	bin&aacute;rios padr&atilde;oe.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="x11">, The X, sistema de interface gr&aacu</emphasis></term>
      <listitem>
	<para>Descreve o X, sistema de interface gr&aacu em geral e uso do 
	<application>&xfree86;</application> no FreeBSD em particular.  Tambem descreve comuns
	ambientes <foreignphrase>desktop</foreignphrase> como<application>KDE</application> e <application>GNOME</application>.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="config-tuning">, Configurando e Ajustando</emphasis></term>
      <listitem>
	<para>Descreve os parametros dispon&iacute;veis para os adminitradores de sistema
	 tune um sistema FreeBSD para uma otima
	performace.  Descreve tamb&eacute;m os v&aacute;rios arquivos de configura&ccedil;&atilde;o
	usado no FreeBSD e onde encontra-los.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="boot">, O Processo de carregamento</emphasis></term>
      <listitem>
	<para>Descreve o processo de carregamento FreeBSD e explica
	como controlar este processo com as configura&ccedil;&otilde;es de op&ccedil;&otilde;es.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="users">, Gerenciamento de contas 
   b&aacute;sico e usu&aacute;rios</emphasis></term>
      <listitem>
	<para>Descreve a cri&ccedil;&atilde;o e manipula&ccedil;&atilde;o de contas 
	usu&aacute;rios.  Discute tamb&eacute;m limita&ccedil;&otilde;es de recursos que pode ser
	  ajustes usu&aacute;rios e em outras contas de gerenciamento de tarefas.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="kernelconfig">, Configurando o kernel 
      do FreeBSD</emphasis></term>
      <listitem>
	<para>Explica porque voc&ecirc; p&ocirc;de necessitar configurar um novo kernel
	e fornece instru&ccedil;&otilde;es detalhadas para configura&ccedil;&atilde;o, constru&ccedil;&atilde;o,
	e instala&ccedil;&atilde;o de um kernel customizado.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="security">, Seguran&ccedil;a</emphasis></term>
      <listitem>
	<para>Descreve muitas ferramentas difrentes dispon&iacute;veis  para ajudar manter seu
	sistema FreeBSD seguro, incluindo Kerberos, IPsec, OpenSSH, e
	firewalls de rede.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="printing">, Impress&atilde;o</emphasis></term>
      <listitem>
	<para>Descreve gerenciamento de impressoras no FreeBSD, incluindo
	informa&ccedil;&atilde;o sobre p&aacute;ginas de banner, conta de impress&atilde;o, e
	configura&ccedil;&atilde;o inicial.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="disks">, Armazenamento</emphasis></term>
      <listitem>
	<para>Descreve como  gerneciar meios de armazenamento e sistema de arquivos
  	  com o FreeBSD.  Iste inclui discos f&iacute;sicos, RAID arrays,
  	  midia otica e fita, discos de mem&oacute;ria-backed, e network
  	  filesystems.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="vinum-vinum">, Vinum</emphasis></term>
      <listitem>
	<para>Descreve como usar o Vinum, um gerenciador logico de volume
	  que fornece discos logicos de dispositivose-independentes, e
	  software RAID-0, RAID-1 e RAID-5.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="l10n">, Localization</emphasis></term>
      <listitem>
	<para>Descreve como usar o FreeBSD em outras linguas que
	 Ingl&ecirc;s.  Cobre ambas sistema e nivel de aplica&ccedil;&otilde;es
	localization.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="desktop">,Aplica&ccedil;&otilde;es <foreignphrase>desktop</foreignphrase></emphasis></term>
      <listitem>
        <para>Lista algumas das comuns aplica&ccedil;&otilde;es <foreignphrase>desktop</foreign, como navegadores web
         e suites de produtividade, e decsreve  como instalar-los no
         FreeBSD.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="multimedia">, Multimedia</emphasis></term>
      <listitem>
      <para>Mostra como configurar o suporte a playback  o som e video  para seu
      sistema.  Tambem descrive alguns exemplos de aplica&ccedil;&otilde;es de audio e video.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="serialcomms">, Comunica&ccedil;&otilde;es Seriais</emphasis></term>
      <listitem>
	<para>Explica como conectar terminais e modems ao seu
  	sistema FreeBSD para ambos conex&otilde;es dial in e dial out.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="ppp-and-slip">, PPP e SLIP</emphasis></term>
      <listitem>
	<para>Descreve como usar PPP, SLIP, ou PPP over Ethernet para
	conectar a sistemas remotos com o FreeBSD.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="advanced-networking">, Advanced Networking</emphasis></term>
      <listitem>
	<para>DDescreve muitos t&oacute;picos do networking, incluindo compartilhamento em
	uma conex&atilde;o de Internet com outros computadores em sua LAN, usando
	network filesystems, compartilhando conta information via NIS,
	setting up um servidor de nomes, e muito mais.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="mail">, Correio Eletr&ocirc;nico</emphasis></term>
      <listitem>
	<para>Explica os componentes diferentes de um servidor de email e
	mergulhos em t&oacute;picos simples da configura&ccedil;&atilde;o para o mais popular
	software servidor de mail:
	<application>sendmail</application>.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="cutting-edge">, The Cutting Edge</emphasis></term>
      <listitem>
	<para>Explica as diferen&ccedil;as entre FreeBSD-STABLE,
	FreeBSD-CURRENT, e FreeBSD releases.  Descreve que usu&aacute;rios
	beneficiar&atilde;o seguindo um sistema de desenvolvimento e outlines
	do processo.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="linuxemu">, Compatibilidade Bin&aacute;ria Linux</emphasis></term>
      <listitem>
	<para>Descreve as caracteristicas da compatibilidade com Linux do FreeBSD.
	Fornece tamb&eacute;m instru&ccedil;&otilde;es de instala&ccedil;&atilde;o detalhadas para muitas
	aplica&ccedil;&otilde;es populares de Linux como <application>&oracle;</application>, <application>&sap.r3;</application>, and
	  <application>&mathematica;</application>.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="mirrors">, Obtendo o FreeBSD </emphasis></term>
      <listitem>
	<para>Lista fontes diferentes para obten&ccedil;&atilde;o da midia do FreeBSD em CDROM
	ou DVD t&atilde;o bem como diferentes sites na Internet que permitem
	voce obter e instalar o FreeBSD.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="bibliography">, Bibliografia </emphasis></term>
      <listitem>
	<para>Este livro toca em muitos assuntos diferentes que pode deixar 
	voc&ecirc; faminto para uma explica&ccedil;&atilde;o mais detalhada.  As
	listas bibliografias de muitos livros excelentes que s&atilde;o referenciados 
	no texto.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="eresources">, Recursos na Internet</emphasis></term>
      <listitem>
	<para>Descreve muitos forums dispon&iacute;veis para usu&aacute;rios do FreeBSD
	enviar perguntas e acoplam em conversa&ccedil;&otilde;es t&eacute;cnicas sobre o
	FreeBSD.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><emphasis><xref linkend="pgpkeys">, PGP Keys</emphasis></term>
      <listitem>
	<para>Listas das PGP fingerprints dos diversos Desenvolvedores FreeBSD.</para>
      </listitem>
    </varlistentry>
  </variablelist>

  <bridgehead id="preface-conv" renderas=sect1>Conven&ccedil;&otilde;es usadas
  neste livro</bridgehead>

    <para>Para fornecer um texto consistente e f&aacute;cil de ler, diversos
    conven&ccedil;&otilde;es s&atilde;o seguidas durante todo o livro.</para>

  <bridgehead id="preface-conv-typographic" renderas=sect2>Conven&ccedil;&otilde;es
  Tipogr&aacute;ficas</bridgehead>

  <variablelist>
    <varlistentry>
      <term><emphasis>Italica</emphasis></term>
      <listitem>
	<para>Um fonte <emphasis>italica</emphasis> &eacute; usada para nome de arquivos, URLs,
	  texto enfatizado, e o primeiro uso de termos t&eacute;cnicos.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><varname>Monospace</varname></term>
      <listitem>
	  <para>Uma fonte <varname>monospaced</varname>&eacute;
	  usuda para mensagens de erro, comandos, vari&aacute;veis de ambiente,
	  nomes de ports, hostnames, nome de usu&aacute;rios, nomes de gripos, nomes de
	   dispositivos, variav&eacute;is, e fragmentos de c&oacute;digos.</para>
      </listitem>
    </varlistentry>
    <varlistentry>
      <term><application>Bold</application></term>
      <listitem>
	<para>Uma fonte <application>bold</application> &eacute; usada para
	aplica&ccedil;&otilde;es, comandos, e teclas.</para>
      </listitem>
    </varlistentry>
  </variablelist>

<!-- Var list -->
  <bridgehead id="preface-conv-commands"
  renderas=sect2>User Input</bridgehead>

  <para>Teclas s&atilde;o apresentadas em <keycap>realce</keycap> to stand out from
    outros textos.  Combina&ccedil;&otilde;es de teclas that are meant para ser digitadas
    simultaneamente s&atilde;o apresentadas com `<literal>+</literal>' entre
    as teclas, como:</para>

  <para>
    <keycombo action="simul">
      <keycap>Ctrl</keycap>
      <keycap>Alt</keycap>
      <keycap>Del</keycap>
    </keycombo>
  </para>

  <para>Significa que o usu&Aacute;rio deve digitar as teclas <keycap>Ctrl</keycap>,
    <keycap>Alt</keycap>,e <keycap>Del</keycap> ao mesmo tempo.

  <para>Teclas para ser digitados em sequ&ecirc;ncia estar&atilde;o separadas com 
    virgulas, por exemplo:</para>

  <para>
    <keycombo action="simul">
      <keycap>Ctrl</keycap>
      <keycap>X</keycap>
    </keycombo>,
    <keycombo action="simul">
      <keycap>Ctrl</keycap>
      <keycap>S</keycap>
    </keycombo>
  </para>

  <para>Significaria que o usu&aacute;rio se espera digitar as teclas
    <keycap>Ctrl</keycap> e <keycap>X</keycap> simultaneamentes
    e ent&atilde;o digite as teclas <keycap>Ctrl</keycap> e <keycap>S</keycap>
    simultaneamentes.</para>

<!-- How to type in key stokes, etc.. -->
  <bridgehead id="preface-conv-examples"
  renderas=sect2>Exemplos</bridgehead>

  <para>Exemplos que come&ccedil;am com <devicename>E:\&gt;</devicename>
  indica um comando &ms-dos;.  A menos que de outra maneira noted, estes comandos
  pode ser executado de uma janela <quote>Command Prompt</quote> em um moderno ambiente
   &microsoft.windows;.</para>

  <screen><prompt>E:\&gt;</prompt> <userinput>tools\fdimage floppies\kern.flp A:</userinput></screen>

  <para>Exemplos que come&ccedil;am com &prompt.root; indicam que o comando
    deve ser invocado como o superusu&aacute;rio no FreeBSD.  Voc&ecirc; pode logar como
    <username>root</username> para digitar o comando, ou logar como sua
    conta normal e usar &man.su.1; para ganhar
    privil&eacute;gios superusu&aacute;rio.</para>

  <screen>&prompt.root; <userinput>dd if=kern.flp of=/dev/fd0</userinput></screen>

  <para>Exemplos que come&ccedil;am com &prompt.user; indicam um comando que
    deve ser invocado de uma conta de usu&aacute;rio normal.  A menos que de outra maneira
    noted, C-shell sintaxe &eacute; usado para ajuste vari&aacute;veis de ambiente
    e outros comandos shell.</para>

  <screen>&prompt.user; <userinput>top</userinput></screen>

  <bridgehead id="preface-acknowledgements"
  renderas=sect1>Reconhecimentos</bridgehead>

  <para>O livro que voc&ecirc; est&aacute; segurando representa os esfor&ccedil;os de muitas centenas de
    povos em torno do mundo.  Se enviaram reparos para typos, ou
    submitted cap&iacute;tulos completos, todas as contribui&ccedil;&otilde;es foram
    &uacute;teis.</para>

  <para>Diversas companhias suportaram o desenvolvimento deste
    original pagando autores para trabalhar a tempo integral nele, pagando por
    publica&ccedil;&atilde;o, etc.  Em particular, BSDi (adquirido subseq&uuml;entemente por
    <ulink url="http://www.windriver.com">Wind River Systems</ulink>)
    pagou membros do Projeto de Documenta&ccedil;&atilde;o para trabalhar em
    melhorando este livro a tempo integral que conduzido &agrave; publica&ccedil;&atilde;o da
    primeira edi&ccedil;&atilde;o impressa em Mar&ccedil;o de 2000 (ISBN 1-57176-241-8).  Wind
    River Systems ent&atilde;o pagou diversos autores adicionais to make a
    n&uacute;mero das melhorias a print-output infraestrutura e para adiconar
    cap&iacute;tulos adicionais ao texto.  Este trabalho culminado na
    publica&ccedil;&atilde;o da segunda edi&ccedil;&atilde;o impressa em Novembro de 2001 (ISBN
    1-57176-303-1).</para>

</preface>

<!-- 
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "book" "preface")
     End:
-->
