<!--
     The FreeBSD Documentation Project
     The FreeBSD Brazilian Portuguese Documentation Project

     Original revision: 1.15

     $FreeBSD$
-->

<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;

<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous FreeBSD Entities//EN">
%freebsd;

<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN">
%authors;

<!ENTITY % teams PUBLIC "-//FreeBSD//ENTITIES DocBook Team Entities//EN">
%teams;

<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//EN">
%mailing-lists;

<!ENTITY % release PUBLIC "-//FreeBSD//ENTITIES Release Specification//EN">
%release;
]>

<article>
  <articleinfo>
    <title>Guia dos Novos Adeptos ao FreeBSD 5.0-RELEASE</title>

    <authorgroup>
      <corpauthor>Time de Engenharia de Vers&otilde;es FreeBSD</corpauthor>
    </authorgroup>

    <pubdate>$FreeBSD: freebsdbrasil/early-adopters.sgml,v 1.2 2003/12/11 19:51:46 eksffa Exp $</pubdate>

    <copyright>
      <year>2002</year>
      <year>2003</year>
      <holder role="mailto:re@FreeBSD.org">Time de Engenharia de 
        Vers&otilde;es FreeBSD</holder>
    </copyright>
  </articleinfo>

  <sect1 id="intro">
    <title>Introdu&ccedil;&atilde;o</title>

    <para>FreeBSD 5.0 representa a primeira das novas vers&otilde;es principais do
FreeBSD em cerca de dois anos. Al&eacute;m de v&aacute;rias novas funcionalidades,
ainda cont&eacute;m uma s&eacute;rie de grandes modifica&ccedil;&otilde;es
desenvolvidas na arquitetura subjacente do sistema. Junto com tais avan&ccedil;os,
contudo, est&aacute; um sistema que incopora uma quantidade not&aacute;vel
de c&oacute;digo novo e n&atilde;o-completamente-testado. Comparado &agrave;
linha existente dos <foreignphrase>releases</foreignphrase> 4.<replaceable>X</replaceable>
o 5.0 pode apresentar regress&otilde; quanto &agrave; estabilidade, performance,
e ocasionalmente funcionalidade.</para>

    <para>Por essas ras&otilde;es, o Time de Engenharia de Vers&otilde;es
	(<foreignphrase>The Release Engineering Team</foreignphrase>)
	<emphasis>n&atilde;o</emphasis> aconselha a atualiza&cced
	precipitada (&agrave;s cegas) de vers&otilde;es anteriores do FreeBSD para
	o 5.0. Especificamente, aos usu&aacute;rios mais conservadores, recomendamos
	a utiliza&ccedil;&atilde;o dos <foreignphrase>releases</foreignphrase> 4.
	<replaceable>X</replaceable>(como o 4.7-RELEASE ou o 4.8-RELEASE que est&aacute;
	por vir) &agrave; m&eacute;dio prazo futuro. Sentimos que tais usu&aacute;rios
	provavelmente ser&atilde;o melhor atentidos com a atualiza&ccedil;&atilde;o para 
	a s&eacute;rie 5.<replaceable>X</replaceable> apenas depois que um ramo de 
	desenvolvimento 5-STABLE tiver sido criado; isso deve ser por volta do 5.1-RELEASE
	ou do 5.2-RELEASE.
    </para>

    <para>(FreeBSD 5.0 sofre do que &eacute; chamado a quest&atilde;o da <quote>galinha
	e o ovo</quote>. O projeto como um todo tem o objetivo de produzir um 5.0-RELEASE
	que seja t&atilde;o est&aacute;vel e confi&aacute;vel quanto o poss&iacute;vel.
	Tal estabilidade e confiabilida requer &nbsp;testes amplos, particularmente
	as novas caracter&iacute;sticas do sistema. Contudo, conseguir um n&uacute;mero
	consider&aacute;vel de usu&aacute;rios para testar o sistema, de um ponto
	de vista pr&aacute;tico, implica na necessidade de criar e distribuir uma
	vers&atilde;o de lan&ccedil;amento antes!)</para>

    <para>Esse artigo descreve algumas das quest&otilde;es envolvidas na instala&ccedil;&ati
	e uso do FreeBSD 5.0-RELEASE.Iniciamos com uma breve
	vis&atilde;o geral do processo de lan&ccedil;amento do FreeBSD. Em seguida
	apresentamos algumas das mais not&aacute;veis novas caracter&iacute;sticas
	do FreeBSD 5.0, em conjunto com alguns pontos que podem implicar em alguns
	desconfortos para os usu&aacute;rios inadvertidos. Para aqueles que preferirem
	se manter nas vers&otilde;es baseadas no 4-STABLE, daremos previs&otilde;es
	dos planos de curto &agrave; m&eacute;dio prazo para esse ramo de desenvolvimento.
	Finalmente apresentamos algumas notas quanto &agrave; atualiza&ccedil;&atilde;o
	dos sistemas 4.<replaceable>X</replaceable> existentes para o 5.0.</para>
  </sect1>

  <sect1 id="release-overview">
    <title>Uma Vis&atilde;o Geral do Processo de Lan&ccedil;amento do &os</title>

    <para>&os emprega um modelo de desenvolvimento que utiliza m&uacute;ltiplos
	ramos de desenvolvimento junto ao reposit&oacute;rio do c&oacute;digo fonte.
	O ramo principal &eacute; chamado de <quote>CURRENT</quote>, e &eacute; referenciado
	no reposit&oacute;rio CVS com a indica&ccedil;&atilde;o (<foreignphrase>>tag</foreignphrase>)
	<literal>HEAD</literal>. Novas caracter&iacute;sitcas s&atilde;o adicionadas
	primeiro nesse ramo; apesar disso dizer que o CURRENT &eacute; o primeiro
	ramo &agrave; presenciar novas funcionalidades, tamb&eacute;m significa que
	ocasionalmente ele sofre por falhas, &agrave; medida que novas caracter&iacute;sticas
	s&atilde;o adicionadas e depuradas.</para>

    <para>A maioria dos &os; <quote>releases</quote> s&atilde;o feitos &agrave; 
      partir de um dos muitos ramos <quote>STABLE</quote>. 
      Caracter&iacute;sticas s&atilde;o adicionadas nestes ramos apenas depois
      de uma certa quantidade de testes no CURRENT. No momento, apenas um ramo
      STABLE est&aacute; sob desenvolvimento ativo; esse ramo ramo &eacute; 
      referido como <quote>4-STABLE</quote>, e todos os &os; 
      4.<replaceable>X</replaceable>s&atilde;o baseados neste. Este ramo tem a
      tag <literal>RELENG_4</literal> no reposit&oacute;rio CVS.</para>	   

    <para>&os; 5.0 &eacute; baseado no ramo CURRENT. Este &eacute; o primeiro
      release deste ramo em mais de 2 anos (o &uacute;timo foi o &os; 4.0 
      Mar&ccedil;o de 2000).</para>

    <para>Em um dado momento, ap&oacute;s o lan&ccedil;amento do &os; 5.0,
      um ramo <quote>5-STABLE</quote> ser&aacute; criado no reposit&oacute;rio
      CVS FreeBSD com a tag do ramo indicado <literal>RELENG_5</literal>.
      Os Os &uacute;ltimos dois ramos est&aacute;veis (3-STABLE and 4-STABLE)
      foram criados imediatamente ap&oacute;s seus respectivos lan&ccedil;amentos
      <quote>ponto-zero</quote> (3.0 and 4.0,respectivamente). Em retrospecto, tal pr&aacute;tica
      n&atilde;o deu tempo suficiente para o ramo CURRENT ou para o STABLE se estabilizarem
      efetivamente, depois que os novos ramos foram criados.</para>

    <para>Consequ&ecirc;ntemente, o time de engenharia de vers&otilde;es criar&aacute;
      o ramo 5-STABLE no reposit&oacute;rio CVS apenas depois que concluirem que o
      ramo est&aacute; em um estado relativamente est&aacute;vel, para ser usado
      como base para esse ramo. &Eacute; prov&aacute;vel que existam alguns
      <quote>releases</quote>na s&eacute;rie 5.<replaceable>X</replaceable>antes que
      isso aconte&ccedil;a; nossas estimativa s&atilde;o que o ramo 5-STABLE seja
      criado um pouco ap&oacute;s o 5.1-RELEASE ou o 5.2-RELEASE.</para>

    <para>Mais informa&ccedil;&otilde;es sobre os processos de engenharia de vers&otilde;es
      do &os; podem ser encontradas nas <ulink
      url="http://www.FreeBSD.org/releng/index.html">p&aacute;ginas
      Web sobre Engenharia de Vers&otilde;es</a> e no artigo sobre a <ulink
      url="http://www.freebsd.org/doc/en_US.ISO8859-1/articles/releng/index.html">Engenharia
      de Vers&otilde;es do &os;.</para>

  </sect1>

  <sect1 id="new">
    <title>Novidades</title>

    <para>Uma das grandes atra&ccedil;&otilde;es do &os; 5.0 &eacute; o n&uacute;mero
      de novidades. Tais novidades e funcionalidades geralmente envolvem grandes
      mudan&ccedil;as arquiteturais que n&atilde;o s&atilde;o vi&aacute;veis de
      serem convertidas ("portadas") devolta para o ramo de desenvolvimento do &os;
      4-STABLE. (Em contrastando, muitas melhorias aut&ocirc;nomas, como dispositivos
      de controle ou utilit&aacute;rios do n&iacute;vel de usu&aacute;rio, foram
      convertidas.) Uma lista breve, mas n&atilde;o exaustiva, incl&uacute;:</para>

    <itemizedlist>
      <listitem>
        <para>SMPng: O suporte da <quote>proxima geracao</quote> m&aacute;quinas SMP
          (em andamento). No momento o suporte &agrave; m&uacute;ltiplos processadores
          sendo utilizados ao mesmo tempo, no kernel, &eacute; parcial.</para>
      </listitem>

      <listitem>
        <para>KSE: Kernel Scheduled Entities ou Entidades Agendadas pelo Kernel
          permitem que um &uacute;nico processo tenha m&uacute;ltiplas <foreignphrase>threads</foreignphrase>, 
          no n&iacute;vel de kernel, similar ao Agendamento de Ativa&ccedil;&otildees
          (<foreignphrase>Scheduler Activations</foreignphrase>).</para>
      </listitem>
 
      <listitem>
        <para>Novas arquiteturas: Suporte &agrave;s arquiteturas sparc64 e ia64,
          em adi&ccedil;&atilde;o &agrave;s (anteriormente dispon&iacute;veis) i386,
          pc98 e Alpha.</para>
      </listitem>

      <listitem>
        <para>GCC: A cadeia de ferramentas de compila&ccedil;&atilde;o &eacute;
          baseada agora no GCC 3.2.1, ao inv&eacute;s do GCC 2.95.<replaceable>X</replaceable>.</para>
        </para>
      </listitem> 
 
      <listitem>
        <para>MAC: Suporte &agrave; pol&iacute;ticas Mandat&oacute;rias de Controle
          de Acesso, extens&iacute;veis e carreg&aacute;veis.</para>
      </listitem>

      <listitem>
        <para>GEOM: Um <foreignphrase>framework</foreignphrase>flex&iacute;vel para transforma&ccedil;&ograve;es
          de requisi&ccedil;&otilde;es de E/S. Uma aplica&ccedil;&atilde;o experimental
          de encripta&ccedil;&atilde;o de disco foi desenvolvida, baseada no GEOM.</para>
      </listitem>

      <listitem>
        <para>FFS: O sistema de arquivo FFS (<foreignphrase>Fast Filesystem</foreignphrase>)
          suporta agora opera&ccedil;&otilde;es &man.fsck.8; em segundo plano e <foreignphrase>snapshots</foreignphrase>
          de sistemas de arquivos.
      </listitem>

      <listitem>
        <para>UFS2: Um novo formato UFS2 em-disco foi adicionado, que suporta atributos
          extendidos por-arquivo bem como arquivos de maior tamanho.</para>
      </listitem>

      <listitem>
        <para>Cardbus: Suporte &agrave; dispositivos Cardbus.</para>
      </listitem>

    </itemizedlist>

    <para>Uma lista mais compreensiva das novidades pode ser encontrada nas notas
      de lan&ccedil;amento do &os; 5.0.</para>

  </sect1>

  <sect1 id="drawbacks">
    <title>Consequ&ecirc;ncias da Ado&ccedil;&atilde;o Antecipada</title>

    <para>Junto com as novas caracter&iacute;sticas do &os; 5.0 est&atilde;o algumas
      &aacute;reas que podem causar problemas, ou ao menos propiciar comportamentos
      inesperados. Geralmente, isso se deve ao fato que uma s&eacute;rie das novas
      caracter&iacute;sticas s&atilde;o desenvolvimento em progresso. Uma lista 
      parcial destas &aacute;reas de dificuldade inclui:</para>

    <itemizedlist>

      <listitem>
        <para>Uma s&eacute;rie de caracter&iacute;sticas ainda n&atilde;o est&atilde;o
          terminadas. Exemplos da lista anunciada acima incluem SMPng e KSE.</para>
      </listitem>

      <listitem>
        <para>Devido &agrave; modifica&ccedil;&otilde;es em estrutudas e ABIs/APIs
          de dados do kernel, dispositivos de controle de terceiros ir&atilde;o precisar
          de modifica&ccedil;&otilde;es para funcionar corretamente sob &os; 5.0. Existe
          ainda a possibilidade de outras mudan&ccedil;as menores na ABI/API
          antes da cria&ccedil;&atilde;o do ramo 5-STABLE.</para>
      </listitem>

      <listitem>
        <para>In&uacute;meras partes das funcionalidades do &os; que antes faziam
          parte do sistema base foram movidas para a Cole&ccedil;&atilde;o de Ports.
          Exemplos not&aacute;veis incluem <application>Perl</application>,
          <application>UUCP</application>, e a maioria (mas n&atilde;o todos) dos jogos.
          Apesar destes programas continuarem plenamente suportados, sua remo&ccedil;&atilde;o
          do sistema base pode gerar alguma confus&atilde;o.</para>
      </listitem>
        
      <listitem>
        <para>Alguns pacotes ou Ports n&atilde;o podem ser compilados, ou n&atilde;o
          funcionam corretamente no &os; 5.0, ainda que o fa&ccedil;am sob &os;
          4-STABLE. Geralmente esses problemas s&atilde;o causados pelas modifica&ccedil;&otilde;es
          na cadeia de ferramentas de desenvolvimento do sistema, ou pela limpeza feita
          nos arquivos de cabe&ccedil;alho (<foreignphrase>header files cleanup</foreignphrase>).</para>
      </listitem> 
 
     <listitem> 
       <para>Pelo fato do &os; 5.0 ser o primeiro lan&ccedil;amento do ramo CURRENT
         em quase dois anos, muitas de suas caracter&iacute;sticas est&atilde;o sendo
         expostas pela primeira vez. Muitas destas novidades (como o SMPng) tem impacto
         global no kernel.</para>
     </listitem>

      <listitem>
        <para>Uma certa quantia de c&oacute;digo para depura&ccedil;&atilde;o e diagn&oacute;stico
          continua existindo de forma &agrave; ajudar na identifica&ccedil;&atilde;o
          de problemas nas novas tecnologias do FreeBSD 5.0. Isto pode causar uma performance
          um pouco inferior no &os; 5.0 em rela&ccedil;&atilde;o ao 4-STABLE.</para>
      </listitem>

      <listitem>
        <para>Novidades s&atilde;o adicionadas no ramo de desenvolvimento 4-STABLE
          apenas depois de j&aacute; estarem <quote>acalmadas</quote> no -CURRENT. O &os; 5.0
          n&atilde;o tem a influ&ecirc;ncia estabilizadora proporcionada pelo ramo -STABLE
          (&eacute; prov&aacute;vel que o ramo de desenvolvimento 5-STABLE seja criado
          em algum momento posterior ao 5.1-RELEASE ou 5.2-RELEASE.)</para>
      </listitem>

      <listitem>
	<para>Documenta&ccedil;&atilde;o (como &os; <ulink
          url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/handbook/index.html">Handbook</ulink>
          e <ulink
          url="http://www.FreeBSD.org/doc/en_US.ISO8859-1/books/faq/index.html">FAQ</ulink>)
          pode n&atilde;o refletir as mudan&ccedil;as recentemente feitas no &os; 5.0.</para>
      </listitem>

    </itemizedlist>

    <para> Por v&aacute;rios destes contratempos afetarem a estabilidade do sistema,
      o time de engenharia de vers&otilde;es recomenda que os s&iacute;tios e usu&aacute;rios
      mais conservadores mantenham-se &agrave;s vers&ograve;es baseadas no ramo
      4-STABLE at&eacute; que a s&eacute;rie 5.<replaceable>X</replaceable>esteja mais polida.</para>

  </sect1>

  <sect1 id="plans-stable">
    <title>Planos para o ramo 4-STABLE</title>

    <para>O lan&ccedil;amento do &os; 5.0 n&atilde;o significa o fim do ramo 4-STABLE.
      Existir&aacute; no m&iacute;nimo mais uma vers&atilde;o nesse ramo, chamada
      4.8-RELEASE, atualmente agendado para 1 de Mar&ccedil;o de 2003.</para>
      
    <para>No momento da prepara&ccedil;&atilde;o deste documento, o time de engenharia
      de vers&otilde;es n&atilde;o tem planos definidos para vers&otilde;es futuras
      (p&oacute;s 4.8) no ramo 4-STABLE. Contudo, o 4.9-RELEASE ou at&eacute; mesmo
      4.10-RELEASE s&atilde;o possibilidades. Qualquer lan&ccedil;amento futuro
      deste ramo ir&atilde;o depender de in&uacute;meros fatores. O mais importante
      deles &eacute; a exist&ecirc;ncia e estabilidade do ramo 5-STABLE. Enquanto
      CURRENT n&atilde;o for suficientemente est&aacute;vel para permitir a cria&ccedil;&atilde;o
      do ramo 5-STABLE, poder&aacute; ser necess&aacute;rio e permitido o lan&ccedil;amento
      de mais vers&otilde;es do ramo 4-STABLE. At&eacute; a &uacute;ltima vers&atilde;o
      declarada do ramo 4-STABLE, novas funcionalidades poder&atilde;o ser incorporadas
      do ramo mais alto, conforme &nbsp;decis&atilde;o dos desenvolvedores, de 
      acordo com as pol&iacute;ticas existentes de engenharia de vers&otilde;es.</para>

    <para>Em extens&atilde;o, o time de engenharia de vers&otilde;es levar&aacute;
      em conta a demanda dos usu&aacute;rios para futuros <foreignphrase>releases</foreignphrase>
      4-STABLE. Tal demando, contudo, necessitar&aacute; ser balanceada com os recursos de
      engenharia de vers&otilde;es (em termos de pessoal, recursos computacionais
      e espa&ccedil;o para armazenamento espelhado).</para>

    <para>O Time de Seguran&ccedil;a (<foreignphrase>The Security Officer Team</foreignphrase>) 
      &a.security-officer; continuar&aacute; suportando vers&otilde;es originadas &agrave; partir
      do ramo 4-STABLE de acordo com suas pol&iacute;ticas publicadas, que podem
      ser encontradas na <ulink
      url="http://www.FreeBSD.org/security/index.html">P&aacute;gina de Seguran&ccedil;a</ulink>
      do s&iacute;tio WWW do &os;. Geralmente, as duas vers&otilde;es mais recentes de qualquer
      ramo ser&atilde;o mantidas com suporte, em respeito &agrave; <foreignphrase>advisories</foreignphrase>
      e corre&ccedil;&otilde;es de seguran&ccedil;a. Aos seus crit&eacute;rios,
      a equipe poder&aacute; suportar outras vers&otilde;es.</para>
      
   </sect1>

  <sect1 id="upgrade">
    <title>6 Notas de Atualiza&ccedil;&atilde;o</title>

    <para>Aos usu&aacute;rios que j&aacute; tem um sistema &os; essa se&ccedil;&atilde;o
      oferece algumas notas quanto &agrave; atualiza&ccedil;&atilde;o de um sistema
      FreeBSD 4.<replaceable>X</replaceable> para um 5.<replaceable>X</replaceable>. Como qualquer
      atualiza&ccedil;&atilde;o do &os; &eacute; crucial que as notas de lan&ccedil;amento e a errata
      da vers&atilde;o em quest&atilde;o sejam lidas, bem como o <filename>src/UPDATING</filename>
      para atualiza&ccedil;&otilde;es &agrave; partir do c&oacute;digo fonte.</para>

    <sect2>
      <title>6.1 Atualiza&ccedil;&otilde;es Bin&aacute;rias</title>

      <para>Provavelmente a abordagem mais direta seja <quote>fa&ccedil;a c&oacute;pias
        de seguran&ccedil;a de todos os dados relevantes, reformate, reinstale e 
        restaure todos os dados copiados</quote>. Isto elimina problemas quanto &agrave;
        execut&aacute;veis obsoletos ou incomat&iacute;veis, ou arquivos de configura&ccedil;&atilde;o
        inadequados ao novo sistema.</para>

      <para>At&eacute; esse momento, a op&ccedil;&atilde;o de atualiza&ccedil;&atilde;o
        bin&aacute;ria no &man.sysinstall.8; n&atilde;o foi muito testada quanto &agrave; atualiza&ccedil;&otilde;es
        entre vers&otilde;es principais (<foreignphrase>cross-major-version upgrades</foreignphrase>).
        Utilizar essa funcionalidade n&atilde;o &eacute; recomend&aacute;vel. Em
        particular, porque uma atualiza&ccedil;&atilde;o bin&aacute;ria ir&aacute;
        manter uma s&eacute;rie de arquivos presentes no FreeBSD 4.<replaceable>X</replaceable>mas
        desnecess&aacute;rios no 5.0. Tais arquivos obsoletos podem criar alguns problemas.</para>
 
      <para>Em plataformas i386 e pc98, existe uma aplica&ccedil;&atilde;o, UserConfig,
        no 4-STABLE que permite configura&ccedil;&atilde;o de dispositivos ISA no
        momento da inicializa&ccedil;&atilde;o pela m&iacute;dia de instala&ccedil;&atilde;o.
        No &os; 5.0, tal funcionalidade foi substitu&iacute;da em parte pelo mecanismo
        &man.device.hints.5; (ele permite que os mesms par&acirc;metros sejam especificados, mas com uma
        interface bastante diferente).</para>
           
       <para>Instala&ccedil;&otilde;es bin&aacute;rias baseadas em disquete podem precisar
        que um terceiro (novo) disco seja baixado, que oferece dispositivos de controle
        adicionais, em m&oacute;dulos do kernel. Essa imagem de disquete <filename>drivers.flp</filename>
        geralmente ser&aacute; encontrado no mesmo lugar das imagens <filename>kern.flp</filename> e
        <filename>mfsroot.flp</filename>.</para>

      <para>Instala&ccedil;&otilde;es baseadas no CDROM em arquitetura i386 agora
        faz uso de um <quote>sem-emula&ccedil;&atilde;o</quote> <foreignphrase>boot loader</foreignphrase>.
        Isto permite, entre outras coisas, o uso de um kernel&nbsp; <literal>GENERIC</literal>
        ao inv&eacute;s de um kernel diminu&iacute;do nas imagens de disquete. Em
        teoria, qualquer sistema capaz de carregar os CDROMs de instala&ccedil;&atilde;o
        do Microsoft Windows NT 4 deve conseguir lidar com os CDROMs do FreeBSD 5.0.</part>

    </sect2>

    <sect2>
      <title>6.2 Atualiza&ccedil;&otilde;es &agrave; partir do Fonte</title>

      <para>A leitura do <filename>src/UPDATING</filename> &eacute; absolutamente
        essencial. A se&ccedil;&atilde;o chamada <quote>Atualizando de 4.x-stable para
        current</quote> cont&eacute;m os procedimentos de atualiza&ccedil;&atilde;o passo-a-passo.
        Tais procedimentos devem ser seguidos com exatid&atilde;o, sem os <quote>atalhos</quote>
        que alguns usu&aacute;rios ocasionalmente aplicam.</para>

    </sect2>

    <sect2>
      <title>6.3 Notas Gerais</title>

      <para><application>Perl</application> foi removida do sistema base, e deve ser
        instalado &agrave; partir de um pacote pr&eacute;-compilado ou pela Cole&ccedil;&atilde;o
        de Ports. A cria&ccedil;&atilde;o do Perl como parte do sistema base gerava
        uma s&eacute;rie de dificuldades que tornava a atualiza&ccedil;&atilde;o
        problem&aacute;tica. Os utilit&aacute;rios do sistema base que usavam Perl
        ou foram rescritos (quando ainda aplic&aacute;veis) ou descartados (se obsoletos).
        &man.sysinstall.8; instalar&aacute; agora o pacote Perl como parte da maioria dos 
        conjuntos de distribui&ccedil;&atilde;o, de forma que a maioria dos usu&aacute;rios
        n&atilde;o notem esta mudan&ccedil;a.</para>

        <para>Geralmente &eacute; poss&iacute;vel rodar execut&aacute;veis 4.<replaceable>X</replaceable>
        antigos sob 5.<replaceable>X</replaceable>, mas isto requer que a distribui&ccedil;&atilde;o
        <filename>compat4x</filename> seja instalada. Portanto, usar ports antigos
        <emphasis>pode</emphasis> ser poss&iacute;vel.</para>

      <para>Ao instalar ou atualizar sobre um sistema base 4-STABLE recente, &eacute;
        extremamente importante limpar os arquivos de cabe&ccedil;alho (<foreignphrase>header</foreignphrase>)
        antigos em <filename>/usr/include</filename>. Renomear ou remover este 
        diret&oacute;rio antes da instala&ccedil;&atilde;o bin&aacute;ria ou de um&nbsp;
        <literal>installworld</literal>&eacute; geralmente o suficiente. Se
        este passo n&atilde;o for seguido, pode acontecer confus&atilde;o (especialmente
        com programas C++) j&aacute; que o compilador pode passar a usar uma mistura
        de cabe&ccedil;alhos obsoletos com atuais.</para>

      <para><filename>MAKEDEV</filename> n&atilde;o &eacute; mais dispon&iacute;vel ou requerido.
        FreeBSD &release.5x; usa um dispositivo de filesystem, que cria automaticamente nos
        de dispositivo sob demanda. Para mais informac&ccedil;&otilde;es, veja &man.devfs.5;.</para>

      <para>UFS2 &eacute; o formato em-disco padr&atilde;o para sistemas de arquivos criados
        usando &man.newfs.8;. Para todas as plataformas exceto pc98, &eacute; tamb&eacute;m por padr&atilde;o
        para sistemas de arquivos criados usando a tela de nomea&ccedil;&atilde;o; (<foreignphrase>labeling</foreignphrase>)
        de discos no &man.sysinstall.8;. Devido &os; &release.4x; compreender somente UFS1 (n&atilde;o UFS2),
        as parti&ccedil&otilde;es de disco que precisam ser acessados pelo por ambos os &release.5x; e &release.4x;
        devem ser criadas com UFS1. Isto pode ser especificado usando a op&ccedil;&atilde;o 
        <option>-O1</option> no &man.newfs.8;, ou sob a tela de nomea&ccedil;&atilde;o; (<foreignphrase>labeling</foreignphrase>)
        &man.sysinstall.8;. Esta situa&ccedil;&atilde;o deve surgir muitas vezes com uma &uacute;nica m&aacute;quina
        com <foreignphrase>dual-boot</foreignphrase> &os; &release.4x; e &os; &release.5x;. Note que n&atilde;o h&aacute;
        nenhuma maneira de converter sistema de arquivos entre os dois formatos em-disco (ao inv&&eacute;s de fazer backup
        re-criando o sistema de arquivo, e restaurando).</para>        

    </sect2>

  </sect1>

  <sect1 id="summary">

    <title>7 Sum&aacute;rio</title>

    <para>Enquanto &os; 5.0 cont&eacute;m uma s&eacute;rie de novas e excitantes
      caracter&iacute;sticas, ele pode n&atilde;o ser apropriado para todos os
      usu&aacute;rios no momento. Neste documento, apresentamos algumas informa&ccedil;&otilde;es
      de base sobre a engenharia de vers&otilde;es, algumas das mais novas caracter&iacute;sticas
      mais not&aacute;veis das s&eacute;ries 5.<replaceable>X</replaceable>, e algumas consequ&ecirc;ncias
      da ado&ccedil;&atilde;o antecipada. Tamb&eacute;m apresentamos alguns planos
      futuros quanto ao desenvolvimento do ramo 4-STABLE e algumas dicas de atualiza&ccedil;&atilde;o
      aos novos adeptos.</para>

  </sect1>
</article>
