<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;

<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous FreeBSD Entities//EN">
%freebsd;

<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN">
%authors;

<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//EN">
%mailing-lists;

<!ENTITY % trademarks PUBLIC "-//FreeBSD//ENTITIES DocBook Trademark Entities//EN">
%trademarks;
]>

<article>
  <articleinfo>
    <title>FreeBSD em Laptops</title>

    <pubdate>$FreeBSD: doc/en_US.ISO8859-1/articles/laptop/article.sgml,v 1.19 2003/09/14 11:29:06 simon Exp $</pubdate>

    <abstract>
      <para>FreeBSD trabalha bem em muitos laptops, com algumas
	advert&ecirc;ncias.  Algumas quest&otilde;es
	espec&iacute;ficas para rodar o &os; em laptops,
	relacionando diferentes requerimentos de hardwares de
	desktops, s&atilde;o discutidas abaixo.</para>
    </abstract>

    <legalnotice id="trademarks" role="trademarks">
      &tm-attrib.freebsd;
      &tm-attrib.linux;
      &tm-attrib.microsoft;
      &tm-attrib.xfree86;
      &tm-attrib.general;
    </legalnotice>
  </articleinfo>

    <para>FreeBSD &eacute; frequentemente utilizado como um sistema
      operacional para servidores, mas ele tamb&eacute;m trabalha bem
      em desktops, e se voc&ecirc; quiser utiliz&aacute;-lo no seu
      laptop voc&ecirc; tamb&eacute;m poder&aacute; aproveitar todos
      os benef&iacute;cios usuais, como: layout sistem&aacute;tico,
      de f&aacute;cil administra&ccedil;&atilde;o e
      atualiza&ccedil;&atilde;o, sistema ports/packages para adicionar
      software, e mais.  (Outros benef&iacute;cios, como estabilidade,
      performance de rede, e performance dentro de um carregamento
      pesado, podem n&atilde;o ser t&atilde;o &oacute;bvios em um
      laptop, claro.)  Entretanto, instalar isto em laptops geralmente
      envolve problemas que n&atilde;o s&atilde;o encontrados
      em m&aacute;quinas desktop e n&atilde;o s&atilde;o normalmente
      discutidos (laptops, s&atilde;o mais uniformes do que desktops,
      s&atilde;o ajustados para &microsoft.windows;).  Este artigo
      aponta &agrave; discuss&atilde;o
      dessas quest&otilde;es.  Muitas pessoas t&ecirc;m tamb&eacute;m
      documentado suas experi&ecirc;ncias no &os; com modelos
      espec&iacute;ficos de laptop em p&aacute;ginas da web que
      n&atilde;o fazem parte da documenta&ccedil;&atilde;o do &os;.
      Voc&ecirc; pode muito bem achar mais informa&ccedil;&otilde;es
      se digitar o nome do modelo do seu laptop e a palavra
      <quote>&os;</quote> num mecanismo de busca de sua
      prefer&ecirc;ncia.  Adicionalmente, este &eacute; um
      banco-de-dados on-line espec&iacute;fico do &os; que aponta para
      pegar informa&ccedil;&otilde;es de edi&ccedil;&otilde;es do
      hardware com laptops,
      <ulink url="http://gerda.univie.ac.at/freebsd-laptops/">
      A lista de Compatibilidade de Laptop do FreeBSD</ulink>
      .</para>


    <para>Para comunica&ccedil;&atilde;o com outros usu&aacute;rios do
      &os; em laptop, verifique a lista &a.mobile.name;.</para>

  <sect1>
    <title>&xfree86;</title>

    <para>Vers&otilde;es recentes do <application>&xfree86;
      </application> trabalham com muitos adaptadores gr&aacute;ficos
      dispon&iacute;veis em laptops nos dias de hoje.  A
      acelera&ccedil;&atilde;o pode n&atilde;o ser suportada, mas uma
      configura&ccedil;&atilde;o gen&eacute;rica SVGA deve funcionar.
      <para>

    <para>Verifique a documenta&ccedil;&atilde;o do seu laptop para a
      placa que voc&ecirc; possui e verifique na
      documenta&ccedil;&atilde;o do <application>&xfree86;
      </application> ou na p&aacute;gina <ulink
      url="http://www.xfree86.org/current/Status.html">Status de
      Drives para &xfree86;</ulink> para ver se ela &eacute;
      especificamente suportada.  Se n&atilde;o for suportada, use um
      dispositivo gen&eacute;rico (n&atilde;o v&aacute; para um nome
      que apenas lhe pare&ccedil;a similar).  No <application>
      &xfree86;</application> vers&atilde;o 4, voc&ecirc; pode tentar
      sua sorte com o comando <userinput>XFree86 -configure
      </userinput> que auto-detecta v&aacute;rias
      configura&ccedil;&otilde;es.</para>

    <para>O problema geralmente &eacute; a configura&ccedil;&atilde;o
      do monitor.  Recursos comuns para <application>&xfree86;
      </application> t&ecirc;m seu foco nos monitores CRT; pegar um
      modeline apropriado para um monitor LCD pode ser complicado.
      Voc&ecirc; pode estar com sorte e n&atilde;o necessitar
      especificar um modeline, ou somente necessitar especificar os
      valores <literal>HorizSync</literal> e <literal>VertRefresh
      </literal> apropriados.  Se isso n&atilde;o funcionar, a
      melhor op&ccedil;&atilde;o &eacute; verificar os recursos da web
      destinados &agrave; configura&ccedil;&atilde;o do X em laptops
      (esses s&atilde;o sites frequentemente orientados para Linux,
      mas isso n&atilde;o faz diferen&ccedil;a porque ambos usam
      <application> &xfree86;</application>), e copiar um modeline
      postado por algu&eacute;m para o hardware similar ao seu.</para>

    <para>Muitos laptops v&ecirc;m com dois bot&otilde;es nos seus
      dispositivos de apontar (mouse), no qual &eacute; um pouco
      problem&aacute;tico no X (j&aacute; que o bot&atilde;o do meio
      &eacute; normalmente usado para colar texto); voc&ecirc; pode
      mapear um clique simult&acirc;neo dos bot&otilde;es
      esquerdo-direito na configura&ccedil;&atilde;o do seu X para
      servir como um clique do bot&atilde;o do meio, na linha</para>

    <programlisting>
      Option "Emulate3Buttons"
    </programlisting>

    <para>no arquivo <filename>XF86Config</filename> na
      se&ccedil;&atilde;o <literal>InputDevice</literal> (para
      <application>&xfree86;</application> vers&atilde;o 4; para
      vers&atilde;o 3, coloque a linha <literal>Emulate3Buttons
      </literal>, sem aspas, na se&ccedil;&atilde;o<literal>
      Pointer</literal>.).</para>
  </sect1>

  <sect1>
    <title>Modems</title>
    <para>
      Laptops normalmente v&ecirc;m com modems internos (on-board).
      Infelizmente, isto significa quase sempre que s&atilde;o
      <quote>winmodems</quote>, na qual suas
      funcionalidades s&atilde;o implementadas no software, para qual
      somente drives &windows; est&atilde;o normalmente
      dispon&iacute;veis (embora uns poucos drivers estejam sendo
      mostrados para outros sistemas operacionais; por exemplo, se o
      seu modem tem um Lucent LT chipset ele pode ser suportado pelo
      port <filename role="package">comms/ltmdm</filename>.).  Se este
      &eacute; o caso, voc&ecirc; necessita comprar um modem externo:
      a op&ccedil;&atilde;o mais compacta &eacute; provavelmente um
      modem PC Card (PCMCIA), discutido abaixo, mas modems seriais ou
      USB podem ser mais baratos.  Geralmente, modems normais
      (n&atilde;o-winmodems) devem trabalhar bem.</para>

  </sect1>

  <sect1>
    <title>Dispositivos PCMCIA (PC Card)</title>

    <para>Muitos laptops v&ecirc;m com slots PCMCIA (tamb&eacute;m
      chamado PC Card); estes s&atilde;o bem suportados dentro do
      &os;.  Olhe atrav&eacute;s das suas menssagens de boot-up
      (usando &man.dmesg.8;) e veja se eles foram detectados
      corretamente (eles devem aparecer como <devicename>pccard0
      </devicename>, <devicename>pccard1</devicename> etc e
      dispositivos como <devicename>pcic0</devicename>).</para>

    <para>&os;&nbsp;4.X suporta cart&otilde;es PCMCIA 16-bit e o
      &os;&nbsp;5.X suporta ambos os cart&otilde;es, 16-bit e 32-bit
      (<quote>CardBus</quote>).  O banco-de-dados sobre cart&otilde;es
      suportados est&aacute; no arquivo <filename>/etc/defaults/
      pccard.conf</filename>.  Olhe atrav&eacute;s disso, e de
      prefer&ecirc;ncia compre cart&otilde;es listados nele.
      Cart&otilde;es n&atilde;o listados podem tamb&eacute;m trabalhar
      como dispositivos <quote>gen&eacute;ricos</quote>: em particular
      muitos modems (16-bit) devem trabalhar bem, se ele n&atilde;o
      for um winmodem (estes existem mesmo como PC Cards, ent&atilde;o
      preste aten&ccedil;&atilde;o nisso).  Se o seu for reconhecido
      como um modem gen&eacute;rico, note que o arquivo padr&atilde;o
      <filename>pccard.conf</filename> especifica um tempo delay de 10
      segundos (para evitar congelamento em certos modems); isto pode
      ser uma precau&ccedil;&atilde;o para o seu modem, no entanto
      voc&ecirc; pode querer mexer nisso, reduzindo ou removendo
      isso totalmente.</para>

    <para>Algumas partes do <filename>pccard.conf</filename> podem ser
      editadas.  Verifique a linha irq, e esteja certo antes de
      remover qualquer n&uacute;mero que atualmente esteja sendo
      usado: em particular, se voc&ecirc; tem um cart&atilde;o de som
      on-board, remova a irq 5 (se n&atilde;o voc&ecirc; pode
      experimentar valores quando voc&ecirc; inserir o cart&atilde;o).
      Verifique tamb&eacute;m o cart&atilde;o de mem&oacute;ria
      dispon&iacute;vel;  se seus valores do cart&atilde;o n&atilde;o
      est&atilde;o sendo detectados, tente alterar isso para um dos
      outros valores (listados na p&aacute;gina de manual
      &man.pccardc.8;).</para>

    <para>Se isto n&atilde;o est&aacute; rodando atualmente,
      inicie o daemon &man.pccardd.8;.  (Para habilitar isso em tempo
      de boot, adicione <programlisting>pccard_enable="YES"
      </programlisting> para o arquivo <filename>/etc/rc.conf
      </filename>.)  Agora seu cart&atilde;o deve ser detectado quando
      voc&ecirc; inserir ou remov&ecirc;-lo, e voc&ecirc; deve
      acompanhar o log de mensagens sobre os novos dispositivos sendo
      habilitados.</para>

    <para>Algumas mudan&ccedil;as principais no c&oacute;digo do
      pccard foram feitas antes da libera&ccedil;&atilde;o do
      &os;&nbsp;4.4 (incluindo o roteamento das
      interrup&ccedil;&otilde;es, para m&aacute;quinas onde o &os;
      n&atilde;o &eacute; capaz de usar a BIOS PCI).  Se voc&ecirc;
      tiver problemas, tente atualizar o seu sistema.</para>

  </sect1>

  <sect1>

    <title>Gerenciamento de energia</title>

    <para>Infelizmente, isso n&atilde;o &eacute; muito seguramente
      suportado no FreeBSD.  Se voc&ecirc; tiver com sorte, muitas
      fun&ccedil;&otilde;es podem funcionar confiantemente; no
      entanto elas podem n&atilde;o trabalhar no seu todo.</para>

    <para>Para tornar as coisas um pouco mais complexas, existem
      dois padr&otilde;es para o gerenciamento de energia: APM e ACPI,
      o &uacute;ltimo substituindo o anterior e incluindo mais
      caracter&iacute;sticas, mas tamb&eacute;m introduzindo mais
      problemas.</para>

    <para>Muitos laptops suportam ambos APM e ACPI (at&eacute; um
      determinado grau), outros somente suportam um deles, assim as
      possibilidades s&atilde;o que voc&ecirc; tenha que experimentar
      ambos para ter um gerenciamento de energia confi&aacute;vel em
      seu laptop.</para>

    <note>
      <para>Voc&ecirc; n&atilde;o pode ter APM e ACPI habilitados ao
	mesmo tempo, mesmo se o seu laptop tenha suporte para ambos.
	</para>
    </note>

    <sect2>
      <title>APM</title>

      <para>A BIOS APM (Gerenciamento de Energia Avan&ccedil;ado)
	providencia suporte para v&aacute;rias caracter&iacute;sticas
	de gerenciamento de energia, tais como: modo espera,
	suspens&atilde;o, hiberna&ccedil;&atilde;o, retardamento do
	Clock da CPU etc.  e est&aacute; dispon&iacute;vel dentro do
	&os;&nbsp;4.X e &os;&nbsp;5.X.
	</para>

      <para>Para habilitar o suporte APM, voc&ecirc; pode compilar o
	kernel com suporte ao gerenciamento de energia (<literal>
	device apm0</literal> no &os;&nbsp;4.X e <literal>device apm
	</literal> no &os;&nbsp;5.X).  Um m&oacute;dulo do kernel para
	APM est&aacute; dispon&iacute;vel dentro &os;&nbsp;5.X, para
	simplificar o carregamento do m&oacute;dulo APM do kernel no
	boot, adicionando a linha <literal>apm_load="YES" </literal>
	para <filename>/boot/loader.conf</filename>.</para>

      <para>No &os;&nbsp;5.X, voc&ecirc; tamb&eacute;m pode setar
	<literal>hint.apm.0.disabled="0"</literal> no
	<filename>/boot/device.hints</filename>.</para>

      <para>Voc&ecirc; pode iniciar o APM em tempo de boot tendo
	<literal>apm_enable="YES"</literal> no
	<filename>/etc/rc.conf</filename>.  Voc&ecirc; pode
	tamb&eacute;m querer iniciar o deamon &man.apmd.8; adicionando
	<literal>apmd_enable="YES"</literal> para o arquivo <filename>
	/etc/rc.conf</filename>, o qual cuida dos v&aacute;rios
	eventos do APM que s&atilde;o afixados &agrave; BIOS,
	ent&atilde;o voc&ecirc; pode ter no seu laptop supens&atilde;o
	/resumo pressionando algumas teclas de fun&ccedil;&otilde;es
	chaves no teclado ou fechando/abrindo a tampa do laptop.
	</para>

      <para>Os comandos APM est&atilde;o listados na p&aacute;gina do
	manual &man.apm.8;.  Por exemplo, <command>apm -b</command>
	retorna para voc&ecirc; o status da bateria. (ou 255 se
	n&atilde;o suportado), <command>apm -Z</command> coloca o laptop
	em modo espera, <command>apm -z</command> (ou <command>zzz
	</command>) suspende isso.  Pata reiniciar e desligar a
	m&aacute;quina, use o comando <command>shutdown -p</command>.
	Entretanto, algumas ou todas estas fun&ccedil;&otilde;es podem
	n&atilde;o trabalhar muito bem ou no seu todo.</para>

      <para>Voc&ecirc; pode achar que suspens&atilde;o/modo espera do
	laptop trabalha no modo console mas n&atilde;o dentro do X
	(isto &eacute;, a tela n&atilde;o vai aparecer agora); se
	voc&ecirc; est&aacute; rodando &os;&nbsp;5.X, uma
	solu&ccedil;&atilde;o para isto pode ser colocar
	<literal>options SC_NO_SUSPEND_VTYSWITCH</literal> no
	arquivo de configura&ccedil;&atilde;o do kernel e recompilar
	o mesmo.  Um outro jeito &eacute; trocar para um console
	virtual (usando <keycombo action="simul"> <keycap>Ctrl
	</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo>
	ou outra fun&ccedil;&atilde;o chave) e ele executa &man.apm.8;
	.  Voc&ecirc; pode automatizar isso com &man.vidcontrol.1;,
	se voc&ecirc; estiver rodando &man.apmd.8;.  Simplismente
	edite <filename>/etc/apmd.conf</filename> e altere isso para:
	</para>

      <programlisting>apm_event SUSPENDREQ {
 exec "vidcontrol -s 1 &lt; /dev/console";
 exec "/etc/rc.suspend";
}

apm_event USERSUSPENDREQ {
 exec "vidcontrol -s 1 &lt; /dev/console";
 exec "sync && sync && sync";
 exec "sleep 1";
 exec "apm -z";
}

apm_event NORMRESUME, STANDBYRESUME {
 exec "/etc/rc.resume";
 exec "vidcontrol -s 9 &lt; /dev/console";
}</programlisting>
    </sect2>

    <sect2>
      <title>ACPI</title>

      <para>ACPI (Configura&ccedil;&atilde;o Avan&ccedil;ada e
	Interface de Gerenciamento de Energia) providencia
	n&atilde;o somente o gerenciamento de energia, mas
	tamb&eacute;m descobre a plataforma do hardware (substituindo
	PnP e a BIOS PCI).  ACPI somente &eacute; dispon&iacute;vel
	dentro do &os;&nbsp;5.X e &eacute; habilitado por
	padr&atilde;o, ent&atilde;o voc&ecirc; n&atilde;o precisa
	fazer nenhuma coisa em especial para ter isso rodando.
	Voc&ecirc; pode controlar o comportamento da ACPI com
	&man.acpiconf.8;.</para>

      <para>Infelizmente, os fabricantes enviam seus laptops com
	execu&ccedil;&otilde;es quebradas da ACPI, assim tendo ACPI
	habilitado somente causa mais problemas do que est&aacute;
	sendo &uacute;til, at&eacute; o ponto que voc&ecirc;
	n&atilde;o pode mais carregar o &os; em algumas
	m&aacute;quinas com APCI habilitado.</para>

      <para>Se ACPI est&aacute; causando problemas, voc&ecirc; pode
	verificar se o fabricante do seu laptop tem lan&ccedil;ado
	uma nova vers&atilde;o da BIOS que conserta alguns bugs.
	Desde o &os; a implementa&ccedil;&atilde;o ACPI est&aacute;
	ainda envolvendo muitos c&oacute;digos, voc&ecirc; pode
	tamb&eacute;m querer atualizar seu sistema; existem chances
	do seu problema ter sido resolvido.</para>

      <para>Se voc&ecirc; quiser desabilitar a ACPI simplesmente
	adicione <literal>hint.acpi.0.disabled="1"</literal> para o
	arquivo <filename>/boot/device.hints</filename>.  Voc&ecirc;
	pode desabilitar a ACPI temporariamente no prompt de boot
	colocando <literal>unset acpi_load</literal>, se voc&ecirc;
	est&aacute; tendo problemas carregando uma m&aacute;quina com
	ACPI habilitado. &os;&nbsp;5.1-RELEASE e superiores v&ecirc;m
	com um menu boot-time que controla como o &os; est&aacute;
	carregando.  Uma das op&ccedil;&otilde;es propostas &eacute;
	desligar a ACPI.  Ent&atilde;o para desabilitar a ACPI
	selecione <guimenuitem>2.  Boot &os; with ACPI disabled
	</guimenuitem> no menu.</para>
    </sect2>

    <sect2>
      <title>Monitor de Gerenciamento de Energia</title>

    <para>O sistema X window (<application>&xfree86;</application>)
      tamb&eacute;m inclui um monitor de gerenciamento de energia
      (olhe na p&aacute;gina do manual &man.xset.1;, e procure por
      <quote>dpms</quote> nele).  Voc&ecirc; pode querer investigar
      isso. Entretanto, isso tamb&eacute;m trabalha inconsistentemente
      em laptops: isso geralmente desliga o monitor mas n&atilde;o
      desliga o led luminoso.</para>
    </sect2>

  </sect1>
</article>
