<!--
     The FreeBSD Documentation Project

     $FreeBSD: pt_BR.ISO8859-1/books/handbook/users/chapter.sgml,v 1.15 2003/12/11 12:03:45 gamk Exp $
-->

<chapter id="users">
  <chapterinfo>
    <authorgroup>
      <author>
	<firstname>Neil</firstname>
	<surname>Blakey-Milner</surname>
	<contrib>Contrição de </contrib>
      </author>
    </authorgroup>
    <!-- Fev 2000 -->
  </chapterinfo>

  <title>Usu&aacute;rios e Administra&ccedil;&atilde;o B&aacute;sica de contas</title>

  <sect1 id="users-synopsis">
    <title>Sin&oacute;pse</title>

    <para>O FreeBSD permite que v&aacute;rias pessoas usem o computador ao mesmo tempo.
      Obviamente, somente um daqueles usu&aacute;rios pode sentar-se na frente da tela e
      do teclado ao mesmo tempo.
      <footnote>
	<para>Bem, a não ser que você conectar múltiplos terminais ao sistema, mas iremos
	abordar isso no <xref linkend="serialcomms">.</para>
      </footnote>, mas qualquer n&uacute;mero de usu&aacute;rios pode logar-se atrav&eacute;z de uma rede.
      Para usar o sistema, cada usu&aacute;rio deve ter uma conta.</para>

    <para>Depois de ler este cap&iacute;tulo, voc&ecirc; ir&aacute; saber:</para>

    <itemizedlist>
      <listitem>
	<para>A diferen&ccedil;a entre v&aacute;rias contas de usu&aacute;rios no sistema FreeBSD.</para>
      </listitem>

      <listitem>
	<para>Como adicionar uma conta de usu&aacute;rio.</para>
      </listitem>

      <listitem>
	<para>Como remover uma conta de usu&aacute;rio.</para>
      </listitem>

      <listitem>
	<para>Como alterar os detalhes de uma conta de usu&aacute;rio, como o nome
	completo do usu&aacute;rio, ou a <foreignphrase>shell</foreignphrase> preferida.</para>
      </listitem>

      <listitem>
	<para>Como ajustar os limites b&aacute;sicos de cada conta, para controlar os
	recursos tais como mem&oacute;ria e tempo de uso da CPU, à que usu&aacute;rios e grupos
	de podem acessar.</para>
      </listitem>

      <listitem>
	<para>Como usar grupos para facilitar a administra&ccedil;&atilde;o de contas.</para>
      </listitem>
    </itemizedlist>

    <para>Antes de ler este cap&iacute;tulo, voc&ecirc; deve:</para>

    <itemizedlist>
      <listitem>
	<para>Entender o b&aacute;sico de &unix, e FreeBSD (<xref
	    linkend="basics">).</para>
      </listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="users-introduction">
    <title>Introdu&ccedil;&atilde;o</title>

    <para>Todo o acesso ao sistema &eacute; feito atrav&eacute;z das contas, e
      todos os processos s&atilde;o executados por usu&aacute;rios, dessa forma, administra&ccedil;&atilde;o
	de contas e usuários s&atilde;o integralmente importantes em sistemas FreeBSD.</para>

    <para>Todas as contas em um sistema FreeBSD tem determinadas informa&ccedil;&otilde;es
       associada à mesma, de forma à identifica-la.</para>

    <variablelist>
      <varlistentry>
	<term>Nome do usu&aacute;rio</term>

	<listitem>
	  <para>O nome do usu&aacute;rio ser&aacute; digitado no terminal de <prompt>login:</prompt>.
	    Os nomes de usu&aacute;rios devem ser unicos em um computador, n&atilde;o podendo
	    haver dois usu&aacute;rios com o mesmo nome.  H&aacute; uma série de regras para criar
	    nomes v&aacute;lidos de usu&aacute;rios, documentadas na &man.passwd.5;; voc&ecirc; normalmente
	    poderiam ser utilizados nomes de usu&aacute;rios com oito caracteres
	    todos minúsculos.</para>
	</listitem>
      </varlistentry>


      <varlistentry>
	<term>Senha</term>

	<listitem>
	  <para>Cada conta tem uma senha associada com ela.  A Senha pode ser
	     vazia, neste caso nenhuma senha ser&aacute; solicitada para acessar o
	     sistema.  Isso normalmente &eacute; uma id&eacute;ia muito ruim; todas as contas
	     devem ter uma senha.</para>
	 </listitem>
      </varlistentry>

      <varlistentry>
	<term>ID do Usu&aacute;rio (UID)</term>

	<listitem>
	  <para>O UID &eacute; um n&uacute;mero que varia de 0 à 65536 usado para identificar de forma
	    &uacute;nica os usu&aacute;rios no sistema.  Internamento, o FreeBSD usa o UID
	    para identificar usu&aacute;rios&mdash; qualquer comando do FreeBSD ser&aacute;
	    liberado para um usu&aacute;rio espec&iacute;fico convertendo seu UID depois de
	    utilizar o comando.  Isso significa que voc&ecirc; pode ter contas com
	    diferentes nomes de usu&aacute;rios mas com o mesmo UID.  Ambos, para
	    o FreeBSD s&atilde;o um só usu&aacute;rio. &Eacute; improv&aacute;vel que voc&ecirc; tenha necessidade
	    de fazer isso um dia.</para>
	</listitem>
      </varlistentry>


      <varlistentry>
	<term>ID de Grupo (GID)</term>

	<listitem>
	  <para>O GID &eacute; um n&uacute;mero que varia de 0 à 65536, usado para identificar de forma
	    &uacute;nica o grupo prim&aacute;rio ao qual o usu&aacute;rio pertence.  Os grupos s&atilde;o um mecanismo
	    para controlar o acesso aos recursos baseados em GID ao inv&eacute;z de UID.
	    Isto pode reduzir significativamente o tamanho de arquivos de configura&ccedil;&otilde;es.
	    Um usu&aacute;rio pode tamb&eacute;m pertencer a mais de um grupo.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term>Classe de Login</term>

	<listitem>
	  <para>Classe de login s&atilde;o uma exten&ccedil;&atilde;o para o mecanismo de grupos que
	    fornecem flexibilidade adicional para adaptar o sistema à diferentes
	    usuários.</para>
	</listitem>
      </varlistentry>


      <varlistentry>
	<term>Tempo de altera&ccedil;&atilde;o da senha</term>

	<listitem>
	  <para>Por padr&atilde;o o FreeBSD n&atilde;o for&ccedil;a os usu&aacute;rios a trocar as suas senhas
	    periodicamente.  Voc&ecirc; pode fazer isto para cada usu&aacute;rio, for&ccedil;ando alguns
	    ou todos usu&aacute;rios terem que mudar suas senhas após um determinado período de tempo.</para>
	</listitem>
      </varlistentry>


      <varlistentry>
	<term>Tempo de expira&ccedil;&atilde;o da conta</term>

	<listitem>
	  <para>Por padr&atilde;o o FreeBSD n&atilde;o expira as contas.  Se voc&ecirc; estiver
	    criando uma conta que voc&ecirc; sabe que tem um tempo limitado de uso,
	    por exemplo, em uma escola onde voc&ecirc; tem contas para os estudantes,
	    voc&ecirc; pode especificar quando a conta deve expirar.  Ap&oacute;s a expira&ccedil;&atilde;o deste tempo
	    o cliente n&atilde;o poder&aacute; logar-se no sistema, embora diret&oacute;rios e arquivos do
	    usuário em questão, permanecer&atilde;o intocados.</para>
	 </listitem>
      </varlistentry>


      <varlistentry>
	<term>Nome completo dos usu&aacute;rios</term>

	<listitem>
	  <para>O nome &uacute;nico do usu&aacute;rio identifica a conta do mesmo, internamente, para o FreeBSD, mas
	    n&atilde;o reflete necessariamente o nome real do usu&aacute;rio.  Esta informa&ccedil;&atilde;o
	    pode, opcionalmente, ser associada com a conta.</para>
	</listitem>
      </varlistentry>


      <varlistentry>
	<term>Diret&oacute;rio <foreignphrase>Home</foreignphrase></term>

	<listitem>
	  <para>O Diret&oacute;rio <foreignphrase>Home</foreignphrase> &eacute; o caminho completo
	    para o diret&oacute;rio do sistema em que o usu&aacute;rio logar&aacute;.  Uma conven&ccedil;&atilde;o
	    comum indica que todos diretórios <foreignphrase>home</foreignphrase> dos usu&aacute;rios devam
	    ficar sob <filename>/home/<replaceable>usu&aacute;rio</replaceable></filename>.
	    O usu&aacute;rio armazenaria seus arquivos pessoais em seu diret&oacute;rio <foreignphrase>home</foreignphrase>, e
	    todos os diret&oacute;rios que puder criar dentro deste.</para>
	 </listitem>
      </varlistentry>



      <varlistentry>
	<term><foreignphrase>Shell</foreignphrase> do usu&aacute;rio</term>

	<listitem>
	  <para>A <foreignphrase>shell</foreignphrase> fornece o ambiente padrão para o usu&aacute;rio interagir com
	    o sistema.  Existem muitos tipos distintos de <foreignphrase>shell</foreignphrase>, e os usu&aacute;rios
	    experientes ter&atilde;o suas pr&oacute;prias prefer&ecirc;ncias, que podem ser refletidas
	    junto aos ajustes de cada conta.</para>
	</listitem>
      </varlistentry>
    </variablelist>


    <para>Existem três tipos de contas: o <link
	linkend="users-superuser">super usu&aacute;rio</link>, <link
	linkend="users-system">usu&aacute;rios do sistema</link>, e <link
	linkend="users-user">usu&aacute;rios</link>.  A conta <quote>super usu&aacute;rio</quote>,
      normalmente chamada de <username>root</username>, &eacute; usada para
      administrar o sistema sem limita&ccedil;&atilde;o de privilégios.  Os <quote>usu&aacute;rios do
      sistema</quote> executam servi&ccedil;os.  Finalmente, contas de <quote>usu&aacute;rios</quote> s&atilde;o usadas por
      pessoas, que poder&atilde;o logar-se ao sistema, ler e-mail, e assim por diante.</para>
  </sect1>

  <sect1 id="users-superuser">
    <title>O super usu&aacute;rio</title>

    <indexterm>
      <primary>contas</primary>
      <secondary>super usu&aacute;rio (root)</secondary>
    </indexterm>
    <para>A conta <quote>super usu&aacute;rio</quote>, normalmente chamada
      <username>root</username>, é usada para configurar e facilitar
      a administra&ccedil;&atilde;o do sistema, e n&atilde;o deve ser usada para tarefas
      cotidianas como envio e recebimento de e-mail, explora&ccedil;&atilde;o geral
      do sistema, ou para programa&ccedil;&atilde;o.</para>


    <para>Isto &eacute; porque o super usu&aacute;rio, ao contr&aacute;rio dos usu&aacute;rios normais,
      podem operar sem limites, e o emprego errado dos privilégios de super usu&aacute;rio pode
      resultar em um espetacular desastre.  As contas de usu&aacute;rios comuns s&atilde;o
      incapazes de destruir o sistema atrav&eacute;z de um erro, de forma que é geralmente
      melhor usar um usu&aacute;rio normal quando poss&iacute;vel, a menos que voc&ecirc;
      necessite privil&eacute;gios a mais.</para>


    <para>Voc&ecirc; deve sempre dobrar e triplicar a atenção com os comandos
      que voc&ecirc; emite com o super usu&aacute;rio, desde que um espa&ccedil;o extra ou um
      caracter faltante podem significar a perda irrepar&aacute;vel dos dados.</para>


    <para>Assim, a primeira coisa que voc&ecirc; deve fazer ap&oacute;s ter lido este
      cap&iacute;tulo &eacute; criar um usu&aacute;rio sem privil&eacute;gios para voc&ecirc; mesmo para
      uso geral, se ainda não o tiver.  Isto aplica-se igualmente se voc&ecirc; est&aacute;
      utilizando o sistema em ambiente multi-usu&aacute;rios ou mono-usu&aacute;rio.
      Mais tarde neste cap&iacute;tulo, n&oacute;s discutiremos como criar usuários adicionais,
      e como alternar entre o usu&aacute;rio e o super usu&aacute;rio.</para>
  </sect1>

  <sect1 id="users-system">
    <title>Contas do sistema</title>

    <indexterm>
      <primary>contas</primary>
      <secondary>sistema</secondary>
    </indexterm>

    <para>Contas de <quote>usu&aacute;rios do sistema</quote> s&atilde;o utilizadas para executar servi&ccedil;os como DNS,
      correio, servidores web, e assim por diante.  A raz&atilde;o para isso &eacute;
      seguran&ccedil;a, se todos os servi&ccedil;os rodassem com os privilégios de super usu&aacute;rios,
      poderiam agir sem restri&ccedil;&otilde;es.</para>

    <indexterm>
      <primary>conta</primary>
      <secondary><username>daemon</username></secondary>
    </indexterm>
    <indexterm>
      <primary>conta</primary>
      <secondary><username>operator</username></secondary>
    </indexterm>
    <para>Exemplos de usu&aacute;rios de sistema s&atilde;o <username>daemon</username>,
      <username>operator</username>, <username>bind</username> (para o Serviço de Nomes
	de Domínio), e <username>news</username>.  Frequentemente os administradores
      de sistemas criam a conta <username>httpd</username> para rodar um servidor de web.</para>

    <indexterm>
      <primary>contas</primary>
      <secondary><username>nobody</username></secondary>
    </indexterm>
    <para><username>nobody</username> &eacute; o usu&aacute;rio gen&eacute;rico sem privil&eacute;gios do
      sistema de usu&aacute;rios.  Entretanto, &eacute; importante manter na sua mente que quanto mais
      servi&ccedil;os usarem <username>nobody</username>, mais arquivos e processos ir&atilde;o
      associar-se a ele, sendo assim, este usuário se tornará cada vez mais provilegiado, se muitos
	serviços utilizarem este usuário como padrão.</para>
  </sect1>

  <sect1 id="users-user">
    <title>Contas de usu&aacute;rios</title>

    <indexterm>
      <primary>contas</primary>
      <secondary>usu&aacute;rios</secondary>
    </indexterm>
    <para>As <quote>contas de usu&aacute;rios</quote> são a primeira etapa para os
	usários, pessoas reais, acessarem o sistema.  Estas contas isolam o usu&aacute;rio
	e seu ambiente, impedindo que os mesmos danifiquem o sistema ou prejudiquem outros usu&aacute;rios,
	e permite que customizem seu ambiente sem afetar outros.</para>

    <para>Cada pessoa que acessa seu sistema deve ter uma conta de usu&aacute;rio.
      Isto permite que voc&ecirc; procure quem est&aacute; fazendo o que, e previna
      que pessoas alterem configurações de outros usu&aacute;rios, leiam e-mails alheios, e assim por diante.</para>

    <para>Cada usu&aacute;rio pode ajustar seu pr&oacute;prio ambiente para acomodar-se
      ao sistema, para utiliza rum interpretador de comandos alternativo, editor padrão distinto,
	atalhos de teclados e até mesmo utilizar outra l&iacute;ngua além da padrão.</para>
  </sect1>

  <sect1 id="users-modifying">
    <title>Modificando contas</title>

    <indexterm>
      <primary>contas</primary>
      <secondary>modificando</secondary>
    </indexterm>

    <para>Existe uma variedade de comandos diferentes dispon&iacute;veis no
      ambiente &unix; para manipular contas de usu&aacute;rios.  Os comandos mais
      comuns estão sumariados abaixo, seguidos por exemplos mais detalhados
      de seu uso.</para>


    <informaltable>
      <tgroup cols="2">
	<thead>
	  <row>
	    <entry>Comando</entry>
	    <entry>Sum&aacute;rio</entry>
	  </row>
	</thead>
	<tbody>
	  <row>
	    <entry>&man.adduser.8;</entry>
	    <entry>O comando recomendado para adicionar novos usu&aacute;rios.</entry>
	  </row>
	  <row>
	    <entry>&man.rmuser.8;</entry>
	    <entry>O comando recomendado para excluir usu&aacute;rios.</entry>
	  </row>
	  <row>
	    <entry>&man.chpass.1;</entry>
	    <entry>Uma ferramenta flexível para alterar informa&ccedil;&otilde;es de usu&aacute;rios.</entry>
	  </row>
	  <row>
	    <entry>&man.passwd.1;</entry>
	    <entry>Um simples comando para alterar a senha do usu&aacute;rio</entry>
	  </row>
	  <row>
	    <entry>&man.pw.8;</entry>
	    <entry>Uma podereosa e flex&iacute;vel ferramenta para alterar todos os aspectos
	     das contas de usu&aacute;rios.</entry>
	  </row>
	</tbody>
      </tgroup>
    </informaltable>

    <sect2 id="users-adduser">
      <title><command>adduser</command></title>

      <indexterm>
	<primary>contas</primary>
	<secondary>adicionando</secondary>
      </indexterm>
      <indexterm>
	<primary><command>adduser</command></primary>
      </indexterm>
      <indexterm>
	<primary><filename class=directory>/usr/share/skel</filename></primary>
      </indexterm>
      <indexterm><primary>diret&oacute;rio esqueleto</primary></indexterm>
       <para>&man.adduser.8; &eacute; um programa simples para adicionar novos usu&aacute;rios.
	 Cria entradas nos arquivos <filename>passwd</filename> e
	 <filename>group</filename>.  Criar&aacute; tamb&eacute;m um diret&oacute;rio home para o
	 usu&aacute;rio novo, copia os arquivos de configura&ccedil;&atilde;o padr&atilde;o
	 (<quote>dotfiles</quote>) de <filename>/usr/share/skel</filename>, e
	 pode opcionalmente enviar ao usu&aacute;rio novo uma mensagem de boas vindas.</para>

       <para>No &os;&nbsp;5.0, o &man.adduser.8; foi rescrito de rotinas em linguagem Perl para
	 um <quote>shell script</quote> que trabalha em conjunto com o &man.pw.8;,
	 assim seu uso &eacute; ligeiramente diferente no &os; 4.X e no &os; 5.X.</para>


      <para>Para criar a configura&ccedil;&atilde;o inicial, use
       	<command>adduser -s -config_create</command>.
	<footnote>
	  <para>A opção <option>-s</option> faz o &man.adduser.8; por padr&atilde;o ficar em
	  modo silencioso.  Usaremos <option>-v</option> mais tarde quando quizermos
	  modificar estes padr&otilde;es.</para>
	</footnote>
	Em seguida, configuramos os padr&otilde;es do &man.adduser.8;, e criamos
	a nossa primeira conta de usu&aacute;rio, uma vez que utilizar
	a conta <username>root</username> para uso normal &eacute; um péssimo hábito.</para>


      <example>
	<title>Configurando <command>adduser</command> e adicionando um
	  usu&aacute;rio no &os;&nbsp;4.X</title>

	<screen>&prompt.root; <userinput>adduser -v</userinput>
Use option ``-silent'' if you don't want to see all warnings and questions.
Check /etc/shells
Check /etc/master.passwd
Check /etc/group
Enter your default shell: csh date no sh tcsh zsh [sh]: <userinput>zsh</userinput>
Your default shell is: zsh -&gt; /usr/local/bin/zsh
Enter your default HOME partition: [/home]:
Copy dotfiles from: /usr/share/skel no [/usr/share/skel]:
Send message from file: /etc/adduser.message no
[/etc/adduser.message]: <userinput>no</userinput>
Do not send message
Use passwords (y/n) [y]: <userinput>y</userinput>

Write your changes to /etc/adduser.conf? (y/n) [n]: <userinput>y</userinput>

Ok, let's go.
Don't worry about mistakes.  I will give you the chance later to correct any input.
Enter username [a-z0-9_-]: <userinput>jua</userinput>
Enter full name []: <userinput>J.  Usuario Aleatorio</userinput>
Enter shell csh date no sh tcsh zsh [zsh]:
Enter home directory (full path) [/home/jua]:
Uid [1001]:
Enter login class: default []:
Login group jua [jua]:
Login group is ``jua''.  Invite jua into other groups: guest no
[no]: <userinput>wheel</userinput>
Enter password []:
Enter password again []:

Name:	  jua
Password: ****
Fullname: J.  Usuario Aleatorio
Uid:	  1001
Gid:	  1001 (jua)
Class:	
Groups:	  jua wheel
HOME:     /home/jua
Shell:	  /usr/local/bin/zsh
OK? (y/n) [y]: <userinput>y</userinput>
Added user ``jua''
Copy files from /usr/share/skel to /home/ua
Add another user? (y/n) [y]: <userinput>n</userinput>
Goodbye!
&prompt.root;</screen>
      </example>

      <para>Em resumo, n&oacute;s mudamos a shell padr&atilde;o para <application>zsh</application>
      (uma shell adicional encontrada na cole&ccedil;&atilde;o de ports), e desligamos o envio
      de um e-mail de boas vindas para o usu&aacute;rio adicionado.  N&oacute;s salvamos as configura&ccedil;&otilde;es,
      criamos uma conta com o nome de <username>jua</username>, e certificamos que
      <username>jua</username> faz parte do grupo <username>wheel</username> (de
      modo que possa assumir os privilégios do usuário <username>root</username> com o comando &man.su.1;.)</para>
      <note>
	<para>A senha que voc&ecirc; digita n&atilde;o aparece, nem são mostrados asteriscos.
	Certifique-se que voc&ecirc; n&atilde;o digitou dias vezes a senha errôneamente.
</para>
      </note>

      <note>
	<para>Use o &man.adduser.8; sem argumentos de agora em diante,
	e voc&ecirc; n&atilde;o ter&aacute; que redefinir as opções padrão.  Se o programa solicitar
	que os padrões sejam modificados, saia dele, e tente a op&ccedil;&atilde;o <option>-s</option>.</para>
      </note>


      <example>
	<title>Adicionando um usu&aacute;rio em &os;&nbsp;5.X</title>

	<screen>&prompt.root; <userinput>adduser</userinput>
Username: <userinput>jua</userinput>
Full name: <userinput>J.  Usuario Aleatorio</userinput>
Uid (Leave empty for default):
Login group [jua]:
Login group is jua.  Invite jua into other groups? []: <userinput>wheel</userinput>
Login class [default]:
Shell (sh csh tcsh zsh nologin) [sh]: <userinput>zsh</userinput>
Home directory [/home/jua]:
Use password-based authentication? [yes]:
Use an empty password? (yes/no) [no]:
Use a random password? (yes/no) [no]:
Enter password:
Enter password again:
Lock out the account after creation? [no]:
Username   : jua
Password   : ****
Full Name  : J. Usuario Aleatorio
Uid	: 1001
Class      :
Groups     : jia wheel
Home       : /home/jua
Shell      : /usr/local/bin/zsh
Locked     : no
OK? (yes/no): <userinput>yes</userinput>
adduser: INFO: Successfully added (jua) to the user database.
Add another user? (yes/no): <userinput>no</userinput>
Goodbye!
&prompt.root;</screen>
      </example>
    </sect2>

    <sect2 id="users-rmuser">
      <title><command>rmuser</command></title>

      <indexterm><primary><command>rmuser</command></primary></indexterm>
      <indexterm>
	<primary>contas</primary>
	<secondary>removendo</secondary>
      </indexterm>

      <para>Voc&ecirc; pode utilizar o &man.rmuser.8; para remover completamente um usu&aacute;rio
	do sistema. &man.rmuser.8; executa as seguintes etapas:</para>

      <procedure>
	<step>
	  <para>Remove as entradas &man.crontab.1; do usu&aacute;rio (se houver alguma).</para>
	</step>
	<step>
	  <para>Remove todos os trabalhos pendentes no &man.at.1;, que pertencem ao usu&aacute;rio.</para>
	</step>
	<step>
	  <para>Mata todos os processos controlados pelo usu&aacute;rio.</para>
	</step>
	<step>
	  <para>Remove o usu&aacute;rio do arquivo de senha local do sistema</para>
	</step>
	<step>
	  <para>Remove o diret&oacute;rio home do usu&aacute;rio (se este for de autoridade do usu&aacute;rio)</para>
	</step>
	<step>
	  <para>Remove o arquivo de armazenamento de mensagens de correio eletrônico que pertence ao usu&aacute;rio, em
	    <filename>/var/mail</filename>.</para>
	</step>
	<step>
	  <para>Remove todos os arquivos de posse do usu&aacute;rio nas áreas
	    tempor&aacute;rias de grava&ccedil;&atilde;o de arquivos, como <filename>/tmp</filename>.</para>
	</step>
	<step>
	  <para>Finalmente, remove o nome do usu&aacute;rio de todos os grupos que ele
	    pertence, em <filename>/etc/group</filename>.
	
	    <note>
	      <para>Se um grupo se tornar vazio e o nome do grupo for o mesmo que
		o nome do usu&aacute;rio, o grupo ser&aacute; removido; isto inclui
	       os grupos originais que é opcionalmente criado para cada usuário pelo &man.adduser.8;.</para>
	    </note>

	</para>
	</step>
      </procedure>

      <para>&man.rmuser.8; n&atilde;o pode ser usado para remover contas de super usu&aacute;rios,
	pois isso aponta indícios de modificações prejudiciais no sistema.</para>

      <para>Por padr&atilde;o, a aplicação funciona em modo interativo, e tenta confirmar
	que você está certo do que está fazendo.</para>

      <example>
	<title><command>rmuser</command> Remo&ccedil;&atilde;o interativa de contas</title>

	<screen>&prompt.root; <userinput>rmuser jua</userinput>
Matching password entry:
jua:*:1001:1001::0:0:J. Usuario Aleatorio:/home/jru:/usr/local/bin/zsh
Is this the entry you wish to remove? <userinput>y</userinput>
Remove user's home directory (/home/jua)? <userinput>y</userinput>
Updating password file, updating databases, done.
Updating group file: trusted (removing group jua -- personal group is empty) done.
Removing user's incoming mail file /var/mail/jua: done.
Removing files belonging to jua from /tmp: done.
Removing files belonging to jua from /var/tmp: done.
Removing files belonging to jua from /var/tmp/vi.recover: done.
&prompt.root;</screen>
      </example>
    </sect2>

    <sect2 id="users-chpass">
      <title><command>chpass</command></title>

      <indexterm><primary><command>chpass</command></primary></indexterm>
       <para>O &man.chpass.1; modifica informa&ccedil;&otilde;es da base de dados do usu&aacute;rio tais como
	senhas, interpretadores de comandos e informa&ccedil;&otilde;es pessoais.</para>

       <para>Apenas administradores do sistema, como o super usu&aacute;rio, podem alterar
	 informa&ccedil;&otilde;es e senhas de outros usu&aacute;rios com &man.chpass.1;.</para>

      <para>Quando passado sem op&ccedil;&otilde;es, com exce&ccedil;&atilde;o de um usu&aacute;rio opcional,
	&man.chpass.1; abrir&aacute; um editor contendo as informa&ccedil;&otilde;es do usu&aacute;rio.
	Quando o usu&aacute;rio sair do editor, a base de dados do usu&aacute;rio ser&aacute;
	atualizada com as novas informa&ccedil;&otilde;es.</para>

      <note>
	<para>No &os;&nbsp;5.X, voc&ecirc; será questionado sobre a senha senha depois que
	  sair do editor, caso você não seja um super usu&aacute;rio.</para>
      </note>

      <example>
	<title>Usando o <command>chpass</command> de forma interativa pelo super usu&aacute;rio</title>

	<screen>#Changing user database information for jua.
Login: jua
Password: *
Uid [#]: 1001
Gid [# or name]: 1001
Change [month day year]:
Expire [month day year]:
Class:
Home directory: /home/jua
Shell: /usr/local/bin/zsh
Full Name: J. Usuario Aleatorio
Office Location:
Office Phone:
Home Phone:
Other information:</screen>
      </example>

      <para>O usu&aacute;rio normal pode alterar somente um subconjunto pequeno
	destas informa&ccedil;&otilde;es, e somente para ele mesmo.</para>

      <example>
	<title>Usando o <command>chpass</command> de forma interativa por um usu&aacute;rio normal</title>

	<screen>#Changing user database information for jua.
Shell: /usr/local/bin/zsh
Full Name: J. Usuario Aleatorio
Office Location:
Office Phone:
Home Phone:
Other information:</screen>
      </example>

      <note>
	<para>&man.chfn.1; e &man.chsh.1; s&atilde;o sinônimos de &man.chpass.1;. São links simbólicos
	  para esta aplicação. Da mesma forma, &man.ypchpass.1;, &man.ypchfn.1;, e &man.ypchsh.1; também o são.
	  O suporte à NIS &eacute; autom&aacute;tico, de forma que especificar <literal>yp</literal> antes do comando 
	  torna-se dispensável.  Se isso parece confuso para voc&ecirc;, n&atilde;o se preocupe pois o assunto <acronym>NIS</acronym>
	  ser&aacute; abordado em <xref linkend="advanced-networking">.</para>
       </note>


    </sect2>
    <sect2 id="users-passwd">
      <title><command>passwd</command></title>

      <indexterm><primary><command>passwd</command></primary></indexterm>
      <indexterm>
	<primary>contas</primary>
	<secondary>alterando a senha</secondary>
      </indexterm>
       <para>O comando &man.passwd.1; &eacute; a maneira usual de modificar sua pr&oacute;pria senha,
	ou a senha de um outro usu&aacute;rio, caso você tenha privilégios de administrador.</para>

      <note>
	 <para>Os usu&aacute;rios comuns devem digitar sua senha original, antes de definir a nova
	   senha, para impedir que uma pessoa desautorizada modifique-a, quando o verdadeiro dono
	   estiver ausente mas manteve o console aberto.</para>
      </note>

      <example>
	<title>Alterando sua senha</title>

	<screen>&prompt.user; <userinput>passwd</userinput>
Changing local password for jua.
Old password:
New password:
Retype new password:
passwd: updating the database...
passwd: done</screen>
      </example>

      <example>
	<title>Alterando a senha de outro usu&aacute;rio, tendo os privilégios do super usu&aacute;rio</title>

	<screen>&prompt.root; <userinput>passwd jua</userinput>
Changing local password for jua.
New password:
Retype new password:
passwd: updating the database...
passwd: done</screen>
      </example>

      <note>
	<para>O &man.chpass.1;, bem como &man.yppasswd.1;, também é um link simbólico
	para &man.passwd.1;, de forma que o <acronym>NIS</acronym> possa trabalhar com um ou outro comando.</para>
      </note>
    </sect2>


    <sect2 id="users-pw">
      <title><command>pw</command></title>
      <indexterm><primary><command>pw</command></primary></indexterm>

      <para>&man.pw.8; &eacute; um comando utilit&aacute;rio cuja função é criar, remover, alterar e
	apresentar usu&aacute;rios e grupos.  Ele funciona como um <foreignphrase>front end</foreignphrase>
	para os arquivos de usu&aacute;rios e grupos do sistema. O &man.pw.8 tem um
	conjunto muito completo de op&ccedil;&otilde;es e comandos que o torna apropriado para o
	uso em scripts shell, mas os usu&aacute;rios novos podem acha-lo mais complexo do que
	os outros comandos apresentados aqui.</para>
    </sect2>

  </sect1>

  <sect1 id="users-limiting">
    <title>Limitando usu&aacute;rios</title>

    <indexterm><primary>limitando usu&aacute;rios</primary></indexterm>
    <indexterm>
      <primary>contas</primary>
      <secondary>limitando</secondary>
    </indexterm>

    <para>A habilidade de limitar seus usuários no sistema pode fatalmente
      já ter vindo em sua mente.  FreeBSD fornece diversas maneiras de um
      administrador limitar a quantidade de recursos do sistema que um
      indiv&iacute;duo pode usar.  Estes limites s&atilde;o divididos em duas se&ccedil;&otilde;es: quotas
      do disco, e outros limites de recursos.</para>

    <indexterm><primary>quotas</primary></indexterm>
    <indexterm>
      <primary>limitando usu&aacute;rios</primary>
      <secondary>quotas</secondary>
    </indexterm>
    <indexterm><primary>quotas de disco</primary></indexterm>

    <para>As quotas de disco limitam o uso do disco aos usu&aacute;rios, e
      fornecem uma maneira de verificar rapidamente esse uso sem calcul&aacute;-lo
      todas as vezes.  As quotas s&atilde;o discutidas em <xref linkend="quotas">.</para>

    <para>Os outros limites de recurso incluem maneiras de limitar a quantidade
      de uso do CPU, mem&oacute;ria e outros recursos que um usu&aacute;rio pode consumir.  Estes
      limites s&atilde;o definidos usando classes de sess&atilde;o e discutidos aqui.</para>

    <indexterm>
      <primary><filename>/etc/login.conf</filename></primary>
    </indexterm>
    <para>As classes de login s&atilde;o definidas em <filename>/etc/login.conf</filename>.  A
	sem&acirc;ntica precisa está além do escopo abordado nesta seção, mas &eacute; descrita em detalhe na p&aacute;gina
	de manual do &man.login.conf.5;. &Eacute; suficiente dizer que cada usu&aacute;rio é relacionado a uma classe
	de contas, a partir do início de sua sess&atilde;o (<literal>default</literal>, por padr&atilde;o), e que cada classe
	dispõe de um conjunto de recursos que são associados a ela.  Uma definição de recurso por seção
	é composta de um par de opções, no formato <literal><replaceable>nome</replaceable>
	=<replaceable>valor</replaceable></literal>, onde <replaceable>nome</replaceable> &eacute; um valor
	previamente conhecido e <replaceable>valor</replaceable> &eacute; um conjunto de caracteres arbitr&aacute;rio processada
	de acordo com o <replaceable>nome</replaceable>.  O ajuste das classe de <literal>login</literal> bem como
	cada um dos recursos que pode ser controlados, são detalhadamente descritos
	na página de manual do &man.login.conf.5;</para>

    <para>Os limites de recurso s&atilde;o distintos de cada definição de <quote>login</quote>
	de uma sessão tradicional em dois pontos.  Primeiro, para cada limite existe o limite
	suave (o atual) e o árduo.  O limite suave pode ser definido pelo usuário ou pela aplicação,
	mas nunca poderá ser maior que o limite árduo.  O segundo, pode ser revogado pelo usuário e ter
	seu valor diminuído, mas nunca pode ser aumentado.  Segundo ponto, a maioria destes limites é contada
	por processo, e não pelo usuário como um todo.  Note que, apesar destas diferenças entre
	a estrutura de recursos e limitações por sessão, este exemplo limitado não ilustra
	<emphasis>realmente</emphasis> o uso efetivo das caracterísitcas de limitação por
	classe de login.</para>

    <para>Dessa forma, seguem abaixo os limites mais comuns, normalmente
	utilizados em classes de utilização de recursos (as outras opções podem ser
	encontradas na página de manual do &man.login.conf.5;).</para>

    <variablelist>
      <varlistentry>
	<term><literal>coredumpsize</literal></term>

	<listitem>
    <indexterm><primary>coredumpsize</primary></indexterm>
    <indexterm>
      <primary>limitando usu&aacute;rios</primary>
      <secondary>coredumpsize</secondary>
    </indexterm>

	  <para>Trata-se do limite de tamanho de um arquivo <literal>core</literal> gerado por um programa,
	    por raz&otilde;es &oacute;bvias, subordinado a outros limites no uso do disco (ex:
	    <literal>filesize</literal>, ou quota de disco).  N&atilde;o obstante, &eacute; usado
	    frequentemente como um m&eacute;todo menos severo de controlar o consumo do espa&ccedil;o
	    de disco: uma vez que usu&aacute;rios n&atilde;o geram os arquivos de core conta própria, e logo,
	    também n&atilde;o os deletam (por n&atilde;o saber que existem) configurar esta opção pode evitar
	    que fiquem sem espa&ccedil;o em disco, devido à falha de alguma aplica&ccedil;&atilde;o com grande
	    demanda por mem&oacute;ria por exemplo (ex: <application>emacs</application>).</para>

	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>cputime</literal></term>

	<listitem>
    <indexterm><primary>cputime</primary></indexterm>
    <indexterm>
      <primary>limitando usu&aacute;rios</primary>
      <secondary>cputime</secondary>
    </indexterm>
	  <para>Indica a quantidade m&aacute;xima de tempo do processador central
	   que o processo de um usu&aacute;rio pode consumir.  Os processos que
	   desrespeitarem ser&atilde;o mortos pelo kernel.
	    <note>
	
	      <para>Este &eacute; um limite de <emphasis>tempo</emphasis> no processador central,
		n&atilde;o porcentagem do processador central como indicado do &man.top.1;
		e &man.ps.1;.  Limitação por porcentagem, no momento que este documento
		foi escrito, não é possível, e seria inviável limitar o fato de que
		um compilador pode facilmente consumir quase 100% de um processador por
		algum tempo.</para>
	    </note>
	</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>filesize</literal></term>

	<listitem>
    <indexterm><primary>filesize</primary></indexterm>
    <indexterm>
      <primary>limitando usu&aacute;rios</primary>
      <secondary>filesize</secondary>
    </indexterm>
	  <para>É o tamanho m&aacute;ximo de um arquivo que um usu&aacute;rio pode
	   possuir.  Ao contr&aacute;rio da  <link linkend="quotas">quota de disco</link>,
	   este limite &eacute; imposto a arquivos individuais, e n&atilde;o a todo o conjunto
	   de arquivos que o usu&aacute;rio possui.
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>maxproc</literal></term>

	<listitem>
    <indexterm><primary>maxproc</primary></indexterm>
	<indexterm>
      <primary>limitando usu&aacute;rios</primary>
      <secondary>maxproc</secondary>
    </indexterm>
	  <para>Este &eacute; o n&uacute;mero m&aacute;ximo de processos que um usu&aacute;rio executar
	    simultâneamente.  Isto inclui processos e primeiro plano e segundo plano.  Por raz&otilde;es
	    &oacute;bvias, este valor n&atilde;o pode ser maior do que o limite do sistema, especificado 
	    pela variável &man.sysctl.8; <varname>kern.maxproc</varname>.  Note tamb&eacute;m que configurar
	    este ítem para um valor pequeno vai prejudicar a produtividade do usu&aacute;rio: &eacute;
	    frequentemente &uacute;til logar-se em múltiplos terminais e executar processos.
	    Algumas tarefas, tais como compilar um programa grande, tamb&eacute;m geram multiplos processos
	   (ex: &man.make.1;, &man.cc.1; e outros intermedi&aacute;rios).</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>memorylocked</literal></term>

	<listitem>
    <indexterm><primary>memorylocked</primary></indexterm>
    <indexterm>
      <primary>limitando usu&aacute;rios</primary>
      <secondary>memorylocked</secondary>
    </indexterm>
	  <para>Trata-se da quantidade m&aacute;xima de mem&oacute;ria que um processo pode
	    solicitar que seja reservado - veja &man.mlock.2;.
	    Alguns programas cr&iacute;ticos do sistema, tais como &man.amd.8;, reservam esta
	    memória em espaço de troca (<acronym>SWAP</acronym>) não contribuindo
	    com a degradação do sistema em tempo real.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>memoryuse</literal></term>

	<listitem>
    <indexterm><primary>memoryuse</primary></indexterm>
    <indexterm>
      <primary>limitando usu&aacute;rios</primary>
      <secondary>memoryuse</secondary>
    </indexterm>
	  <para>Trata-se da quantidade m&aacute;xima de mem&oacute;ria que um processo pode
	    consumir durante todo seu tempo de execussão.  Inclui o uso da mem&oacute;ria principal e a
	    <foreignphrase>swap</foreignphrase>.  Não trata-se de controle total de restri&ccedil;&atilde;o
	    de consumo de mem&oacute;ria, mas &eacute; um bom come&ccedil;o</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>openfiles</literal></term>

	<listitem>
    <indexterm><primary>openfiles</primary></indexterm>
    <indexterm>
      <primary>limitando usu&aacute;rios</primary>
      <secondary>openfiles</secondary>
    </indexterm>
	  <para>Trata-se da quantidade m&aacute;xima de arquivos que um processo pode ter
	    aberto.  No FreeBSD, arquivos s&atilde;o usados tamb&eacute;m para representar
	    <foreignphrase>sockets</foreignphrase> e canais IPC; portanto tenha cuidado
	    para n&atilde;o ajustar este valor demasiadamente baixo.  O limite aqui &eacute; definido
	    pela &man.sysctl.8; <varname>kern.maxfiles</varname>.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>sbsize</literal></term>

	<listitem>
    <indexterm><primary>sbsize</primary></indexterm>
    <indexterm>
      <primary>limitando usu&aacute;rios</primary>
      <secondary>sbsize</secondary>
    </indexterm>
	  <para>Esta &eacute; a quantidade m&aacute;xima de mem&oacute;ria a ser utilizada em rede,
	    somatizados em quantos mbufs um usu&aacute;rio pode consumir.  Foi originalmente
	    criado em resposta a um velho ataque DoS que criava muitos <foreignphrase>sockets</foreignphrase>,
	    mas pode usualmente ser usado para limitar a comunica&ccedil;&atilde;o da rede.</para>
	</listitem>
      </varlistentry>

      <varlistentry>
	<term><literal>stacksize</literal></term>

	<listitem>
    <indexterm><primary>stacksize</primary></indexterm>
    <indexterm>
      <primary>limitando usu&aacute;rios</primary>
      <secondary>stacksize</secondary>
    </indexterm>
	  <para>Trata-se do tamanho m&aacute;ximo que uma pilha de processos pode vir a ter.
	    Sozinho, este valor n&atilde;o &eacute; suficiente para limitar a quantidade de mem&oacute;ria que
	    um programa pode usar, consequentemente, deve ser usado em conjunto com
	    outros limites.</para>
	</listitem>
      </varlistentry>
    </variablelist>

    <para>Existem outros pontos que devem ser lembrados ao ajustar limites de recursos.
      A seguir serão apresentados alguns pontos gerais, sugest&otilde;es, e coment&aacute;rios variados.</para>

    <itemizedlist>
      <listitem>
	<para>Os processos que s&atilde;o iniciados no sistema pelo
	  <filename>/etc/rc</filename> s&atilde;o atribu&iacute;dos &agrave; classe de login
	  <literal>daemon</literal>.</para>
      </listitem>

      <listitem>
	<para>Embora o <filename>/etc/login.conf</filename> que acompanha o sistema
	  seja uma fonte boa de valores razo&aacute;veis para a maioria dos limites,
	  apenas voc&ecirc;, administrador, pode saber o que &eacute; apropriado para o seu
	  sistema.  Ajustar um limite demasiadamente elevado pode abrir seu sistema
	  at&eacute; o abuso, enquanto o ajustar demasiadamente baixo pode colocar 
	  a produtividade em tensão.
      </listitem>

      <listitem>
	<para>Os usu&aacute;rios do sistema de janela X (X11) devem provavelmente ter
	  direito de utilizarem mais recursos que outros usu&aacute;rios.  O X11 por si s&oacute; usa poucos
	  recursos, mas incentiva os usu&aacute;rios &agrave; rodarem programas simultâneos.</para>
      </listitem>

      <listitem>
	<para>Recorde que muitos limites se aplicam aos processos individuais, n&atilde;o
	  usu&aacute;rio como um todo.  Por exemplo, ajustar <varname>openfiles</varname> para
	  50 significa que cada processo que o usu&aacute;rio rodar, pode abrir at&eacute; 50 arquivos.
	  Assim, a quantidade bruta de arquivos que um usu&aacute;rio pode abrir &eacute; o valor
	  <literal>openfiles</literal> multiplicado pelo <literal>maxproc</literal>.
	  Isto tamb&eacute;m se aplica ao consumo de mem&oacute;ria.</para>
      </listitem>
    </itemizedlist>

    <para>Para mais informações sobre limites de recursos e classes de login
      em geral, consulte por favor as p&aacute;ginas de manuais relevantes:
      &man.cap.mkdb.1;, &man.getrlimit.2;, &man.login.conf.5;.</para>
  </sect1>

  <sect1 id="users-personalizing">
    <title>Personalizando usu&aacute;rios</title>

    <para>A localiza&ccedil;&atilde;o &eacute; um ambiente ajustado pelo administrador ou pelo usu&aacute;rio
      do sistema para oferecer l&iacute;nguas diferentes, conjunto de caracteres, data e padr&otilde;es
      de tempo diferentes, e assim por diante.  Isto &eacute; discutido no cap&iacute;tulo sobre
      <link linkend="l10n">localiza&ccedil;&atilde;o</link>.</para>
  </sect1>

  <sect1 id="users-groups">
    <title>Grupos</title>

    <indexterm><primary>grupos</primary></indexterm>
    <indexterm>
      <primary><filename>/etc/groups</filename></primary>
    </indexterm>
    <indexterm>
      <primary>contas</primary>
      <secondary>grupos</secondary>
    </indexterm>

    <para>Um grupo &eacute; simplesmente uma lista de usu&aacute;rios.  Os grupos s&atilde;o identificados
      por nome e GID (ID de Grupo).  No FreeBSD (e na maioria de outros sistemas &unix),
      os dois fatores que o kernel usa para decidir se um processo est&aacute; tem permissão para
      algo &eacute; seu ID de usu&aacute;rio e a lista dos grupos à que ele pertence.  Diferente
      de um ID de usu&aacute;rio, um processo tem uma lista dos grupos associados à ele.  Voc&ecirc; 
      eventualmente pode precisar consultar o <quote>ID de grupo</quote> de um usu&aacute;rio ou de um
      processo; na maioria das vezes seus direitos implicam apenas no primeiro grupo da lista.</para>

   <para>O nome do grupo para ser identificado no mapa de ID de grupos está em <filename>/etc/group</filename>.
      Trata-se de um arquivo de texto plano com quatro campos delimitadores.  O primeiro campo &eacute;
      o nome do grupo, o segundo &eacute; a senha encriptada, o terceiro &eacute; o ID de grupo, e o
      quarto &eacute; a lista de membros daquele grupo, delimitado por vírgula.  Pode seguramente ser editado
      na m&atilde;o (supondo naturalmente, que voc&ecirc; n&atilde;o vá cometer erros de sintaxe!).
      Para uma descri&ccedil;&atilde;o mais completa da sintaxe, veja a p&aacute;gina de manual &man.group.5;.</para>

    <para>Se voc&ecirc; n&atilde;o quiser editar manualmente o <filename>/etc/group</filename>,
      pode utilizar o comando &man.pw.8; para adicionar e editar grupos.  Por exemplo,
      para adicionar um grupo chamado <groupname>timedois</groupname> e em seguida confirmar que
      ele foi criado, voc&ecirc; pode usar:</para>

    <example>
      <title>Adicionando um grupo por meio do &man.pw.8;</title>

      <screen>&prompt.root; <userinput>pw groupadd timedois</userinput>
&prompt.root; <userinput>pw groupshow timedois</userinput>
timedois:*:1100:</screen>
    </example>

    <para>O n&uacute;mero <literal>1100</literal> acima identifica o ID do grupo
      <groupname>timedois</groupname>.  Agora,
      <groupname>timedois</groupname> n&atilde;o tem nenhum membro, e portanto é in&uacute;til.
      Vamos modificar aquele usuário <username>jua</username> e coloca-lo no grupo
      <groupname>timedois</groupname>.</para>

    <example>
      <title>Adicionando algu&eacute;m a um determinado grupo por meio do &man.pw.8;</title>

      <screen>&prompt.root; <userinput>pw groupmod timedois -M jua</userinput>
&prompt.root; <userinput>pw groupshow timedois</userinput>
timedois:*:1100:jua</screen>
    </example>

    <para>A op&ccedil;&atilde;o <option>-M</option> deve ser uma lista de usuários que ser&atilde;o
     membros do grupo em questão, delimitados por vírgula.  Com base nas outras seções deste capítulo,
     sabemos que o arquivo de senha também contém o grupo de cada usuário. Se o usuário fizer parte apenas
     de um grupo, o valor identificado no campo em questão é valido. Do contrário o sistema inclui automaticamente
     o usuário à lista de membro de cada grupo, e o grupo primário não será apresentado com o argumento
     <option>groupshow</option> do &man.pw.8;, ou qualquer ferramenta similar.  Ou seja &man.pw.8; manipula somente
     o arquivo <filename>/etc/group</filename>; nunca tentar&aacute; ler também dados do
     <filename>/etc/passwd</filename>.</para>

    <example>
      <title>Usando o &man.id.1; para determinar grupos associados aos usuários</title>

      <screen>&prompt.user; <userinput>id jua</userinput>
uid=1001(jua) gid=1001(jua) groups=1001(jua), 1100(timedois)</screen>
    </example>

    <para>Como pode-se notar, <username>jua</username> &eacute; membro dos grupos
      <groupname>jua</groupname> e <groupname>timedois</groupname>.</para>

    <para>Para maiores informa&ccedil;&otilde;es sobre o &man.pw.8;, consulte sua página de manual
	e para maiores informa&ccedil;&otilde;es sobre o formato do <filename>/etc/group</filename>, consulte a
      p&aacute;gina de manual &man.group.5;.</para>
  </sect1>
</chapter>

<!--
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->
