<!--
     The FreeBSD Documentation Project

     $FreeBSD: pt_BR.ISO8859-1/books/handbook/serialcomms/chapter.sgml,v 1.9 2003/12/10 19:10:48 ebrandi Exp $
-->

<chapter id="serialcomms">
  <title>Comunica&ccedil;&otilde;es Seriais</title>

  <sect1 id="serial-synopsis">
    <title>Sin&oacute;pse</title>

    <indexterm><primary>Comunica&ccedil;&otilde;es Seriais</primary></indexterm>

    <para>O &unix; sempre possuiu suporte a comunica&ccedil;&otilde;es seriais.  De
    fato, as primeiras maquinas &unix; disponibilizavam linhas
    seriais para as opera&ccedil;&otilde;es de entrada e de sa&iacute;da realizada pelos
    usu&aacute;rios.  As coisas mudaram muito desde os dias em que a m&eacute;dia
    dos <quote>terminais</quote> consistiam-se em uma impressora serial de
    10 caracteres por segundo e um teclado.  Este cap&iacute;tulo ir&aacute; abordar
    algumas das formas como o FreeBSD utiliza comunica&ccedil;&otilde;es
    seriais.</para>

    <para>Ap&oacute;s ler este capitulo voc&ecirc; ir&aacute; conhecer:</para>
    <itemizedlist>
      <listitem><para>Como conectar terminais ao seu sistema FreeBSD
	  .</para></listitem>
      <listitem><para>Como utilizar um modem para discar para um servidor remoto
	  .</para></listitem>
      <listitem><para>Como permitir que usu&aacute;rios remotos se conectem
      ao seu sistema atrav&eacute;s de um modem.</para></listitem>
      <listitem><para>Como efetuar boot utilizando um console serial.</para></listitem>
    </itemizedlist>

    <para>Antes de ler este capitulo, voce deve:</para>
    <itemizedlist>
      <listitem><para>Conhecer como configurar e instalar um novo kernel (<xref
        linkend="kernelconfig">).</para></listitem>
      <listitem><para>Compreender o sistema de permiss&otilde;es e de processos no ambiente &unix;
        (<xref linkend="basics">).</para></listitem>
      <listitem><para>Ter acesso ao manual t&eacute;cnico do hardware
      serial (Modem ou Placa multi-portas) que voc&ecirc; deseja utilizar
      com o FreeBSD.</para></listitem>
    </itemizedlist>
  </sect1>

  <sect1 id="serial">
    <title>Introdu&ccedil;&atilde;o</title>

    <!-- XXX Write me! -->

    <sect2 id="serial-terminology">
      <title>Terminologia</title>

      <variablelist>
        <indexterm><primary>bits-por-segundo</primary></indexterm>
	<varlistentry>
	  <term>bps</term>
	  <listitem>
	    <para>Bits por segundo &mdash; &eacute; a taxa com que os dados
	    s&atilde;o transmitidos.</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>DTE</term>
	  <indexterm><primary>DTE</primary></indexterm>
	  <listitem>
	    <para>Equipamento Terminal de Dados &mdash; por exemplo, o seu
	    computador</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>DCE</term>
	  <indexterm><primary>DCE</primary></indexterm>
	  <listitem>
	    <para>Equipamento de Comunica&ccedil;&atilde;o de Dados &mdash;  seu
	    modem</para>
	  </listitem>
	</varlistentry>

	<varlistentry>
	  <term>RS-232</term>
	  <indexterm><primary>Cabos RS-232C</primary></indexterm>
	  <listitem>
	    <para>Padr&atilde;o EIA para hardwares de comunica&ccedil;&atilde;o serial</para>
	  </listitem>
	</varlistentry>
      </variablelist>

      <para>Quando fala sobre taxa de comunica&ccedil;&atilde;o de dados, esta sess&atilde;o
	n&atilde;o usa o termo <quote>baud</quote>.  Baud se refere ao
	numero de estados de transi&ccedil;&atilde;o el&eacute;tricas que ocorrem em um
	determinado periodo de tempo, enquanto <quote>bps</quote>
	(bits por segundo) &eacute; o termo <emphasis>correto</emphasis> a
	ser utilizado (ao menos ele n&atilde;o parece incomodar completamente
	os teimosos).</para>
    </sect2>

    <sect2 id="serial-cables-ports">
      <title>Cabos e Portas</title>

      <para>Para conectar um modem ou um terminal ao seu sistema FreeBSD,
	voc&ecirc; ir&aacute; precisar de uma porta serial em seu computador e do
	cabo apropriado para conectar o seu dispositivo serial.  Se
	voc&ecirc; j&aacute; esta familiarizado com o seu dispositivo e com o cabo
	que ele necessita, voc&ecirc; pode pular tranquilamente esta sess&atilde;o.
	.</para>

      <sect3 id="term-cables">
	<title>Cabos</title>

	<para>H&aacute; diversos tipos diferentes de cabos seriais.  Os dois
	  tipos mais comuns para os nossos prop&oacute;sitos s&atilde;o os cabos
	  <literal>null-modem</literal> e os cabos padr&atilde;o RS-232.  A
	  documenta&ccedil;&atilde;o do seu dispositivo ir&aacute; descrever o tipo de cabo
	  necess&aacute;rio.</para>

	<sect4 id="term-cables-null">
	  <title>Cabos Null-Modem</title>

	  <indexterm>
	    <primary>Cabo null-modem</primary>
	  </indexterm>
	  <para>Um cabo <literal>null-modem</literal> passa alguns sinais,
	    como o <quote>sinal terra</quote>, de forma direta (sai e
	    chega no mesmo pino em ambas as pontas), mas chaveia outros
	    sinais.  Por exemplo, o pino de <quote>envio de
	    dados</quote> em uma das pontas do cabo ir&aacute; para o pino
	    <quote>recebimento de dados</quote> na outra ponta.</para>

	  <para>Se voce preferir preparar seus pr&oacute;prios cabos, voc&ecirc; pode
	    contruir um cabo null-modem para utilizar com terminais.
	    Esta tabela mostra os nomes dos sinais RS-232C e a
	    numera&ccedil;&atilde;o dos pinos em um conector DB-25.</para>

	  <informaltable frame="none">
	    <tgroup cols="5">
	      <thead>
		<row>
		  <entry>Sinal</entry>
		  <entry>Pino #</entry>
		  <entry></entry>
		  <entry>Pino #</entry>
		  <entry>Sinal</entry>
		</row>
	      </thead>

	      <tbody>
		<row>
		  <entry>SG</entry>
		  <entry>7</entry>
		  <entry>conecta-se ao</entry>
		  <entry>7</entry>
		  <entry>SG</entry>
		</row>

		<row>
		  <entry>TxD</entry>
		  <entry>2</entry>
		  <entry>conecta-se ao</entry>
		  <entry>3</entry>
		  <entry>RxD</entry>
		</row>

		<row>
		  <entry>RxD</entry>
		  <entry>3</entry>
		  <entry>conecta-se ao</entry>
		  <entry>2</entry>
		  <entry>TxD</entry>
		</row>

		<row>
		  <entry>RTS</entry>
		  <entry>4</entry>
		  <entry>conecta-se ao</entry>
		  <entry>5</entry>
		  <entry>CTS</entry>
		</row>

		<row>
		  <entry>CTS</entry>
		  <entry>5</entry>
		  <entry>conecta-se ao</entry>
		  <entry>4</entry>
		  <entry>RTS</entry>
		</row>

		<row>
		  <entry>DTR</entry>
		  <entry>20</entry>
		  <entry>conecta-se ao</entry>
		  <entry>6</entry>
		  <entry>DSR</entry>
		</row>

		<row>
		  <entry>DCD</entry>
		  <entry>8</entry>
		  <entry></entry>
		  <entry>6</entry>
		  <entry>DSR</entry>
		</row>

		<row>
		  <entry>DSR</entry>
		  <entry>6</entry>
		  <entry>conecta-se ao</entry>
		  <entry>20</entry>
		  <entry>DTR</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </informaltable>

	  <note>
	    <para>Conecte o <quote>Data Set Ready</quote> (DSR) e o
	      <quote>Data Carrier Detect</quote> (DCD) internamente no
	      conector, e ent&atilde;o conecte-os ao <quote>Data Terminal Ready</quote>
	      (DTR) no conector remoto.</para>
	  </note>
	</sect4>

	<sect4 id="term-cables-std">
	  <title>Cabos Padr&atilde;o RS-232C</title>
	  <indexterm><primary>Cabos RS-232C</primary></indexterm>

	  <para>Um cabo serial padr&atilde;o trafega todos os sinais de forma
	    direta (sai e chega no mesmo pino em ambas as pontas).
	    Isto &eacute;, o pino de <quote>envio de dados</quote> em uma
	    ponta do cabo, ir&aacute; para o pino <quote>envio de
	    dados</quote> na outra ponta.  Este &eacute; o tipo de cabo
	    utilizado para conectar um modem ao seu sistema FreeBSD, e
	    tamb&eacute;m &eacute; adequado para alguns terminais.</para>
	</sect4>
      </sect3>

      <sect3 id="term-ports">
	<title>Portas</title>

	<para>Portas seriais s&atilde;o os dispositivos atrav&eacute;s dos quais os
	  dados s&atilde;o transferidos entre um host FreeBSD e um terminal.
	  Esta sess&atilde;o descreve os tipos de portas que existem e como
	  elas s&atilde;o reconhecidas no FreeBSD.</para>

	<sect4 id="term-portkinds">
	  <title>Tipos de portas</title>

	  <para>Existem diversos tipos de portas seriais.  Antes de
	    comprar ou contruir um cabo, voc&ecirc; precisa ter certeza que
	    ele ir&aacute; se ajustar a porta existente no seu terminal e no
	    seu sistema FreeBSD.</para>

	  <para>A maioria dos terminais ir&atilde;o ter portas DB25.
	    Computadores pessoais, incluindo PCs rodando FreeBSD,
	    ter&atilde;o portas DB25 ou portas DB9.  Se voce possui uma placa
	    multiserial para o seu PC, voce poder&aacute; ter portas RJ-12 ou
	    portas RJ-45.</para>

	  <para>Consulte a documenta&ccedil;&atilde;o que acompanha o seu hardware para
	    obter a especifica&ccedil;&atilde;o do tipo de porta que ele utiliza.
	    Uma inspe&ccedil;&atilde;o visual da porta costuma ajudar tamb&eacute;m.</para>
	</sect4>

	<sect4 id="term-portnames">
	  <title>Nomes das Portas</title>

	  <para>No FreeBSD, voc&ecirc; acessa cada porta serial atrav&eacute;s de uma
	    entrada no diret&oacute;rio <filename>/dev</filename>.  Existem 2
	    tipos diferentes de entradas:</para>

	  <itemizedlist>
	    <listitem>
	      <para>As portas utilizadas para receber liga&ccedil;&otilde;es (<literal>
	      call-in</literal>)s&atilde;o chamadas
	      <filename>/dev/ttyd<replaceable>N</replaceable></filename>,
	      onde <replaceable>N</replaceable> &eacute; o numero da porta,
	      iniciando-se em 0.  Geralmente, voc&ecirc; utiliza as portas
	      <literal>call-in</literal> para terminais.  As portas
	      <literal>call-in</literal> necessitam que a linha serial
	      estabele&ccedil;a o sinal de detec&ccedil;&atilde;o de portadora de dados
	      (DCD) para funcionar corretamente.</para>
	    </listitem>

	    <listitem>
	      <para>As portas utilizadas para efetuar liga&ccedil;&otilde;es
	      (<literal>Call-out</literal>), s&atilde;o chamadas
	      <filename>/dev/cuaa<replaceable>N</replaceable></filename>.
	      Voc&ecirc; normalmente n&atilde;o utiliza este tipo de porta para
	      terminais, usando-as apenas para modens.  Voc&ecirc; pode
	      utilizar uma porta <literal>Call-out</literal> sempre
	      que o cabo serial ou o terminal n&atilde;o suportar o sinal de
	      detec&ccedil;&atilde;o de portadora.</para>
	    </listitem>
	  </itemizedlist>

	  <para>Se voc&ecirc; conectou um terminal a sua primeira porta serial
	    (<devicename>COM1</devicename> no &ms-dos;), voc&ecirc; ter&aacute; que
	    utilizar <filename>/dev/ttyd0</filename> para acessar o
	    terminal.  Se o terminal estiver conectado a segunda
	    porta serial (tamb&eacute;m conhecida como
	    <devicename>COM2</devicename>), utilize
	    <filename>/dev/ttyd1</filename>, e assim por
	    diante.</para>

	</sect4>
      </sect3>
    </sect2>

    <sect2>
      <title>Configura&ccedil;&atilde;o do Kernel</title>

      <para>O FreeBSD por default suporta 4 portas seriais. No mundo
	&ms-dos;, elas s&atilde;o conhecidas como
	<devicename>COM1</devicename>,
	<devicename>COM2</devicename>,
	<devicename>COM3</devicename>, e
	<devicename>COM4</devicename>.
	O FreeBSD atualmente suporta diversas placas multiseriais,
	tais como a BocaBoard 1008 e 2016, bem como outras placas
	multiseriais inteligentes fabricadas com as tecnologias
	Digiboard e Stallion.  No entando, o kernel default suporta
	apenas as portas COM normais.</para>

      <para>Para verificar se o seu kernel reconhece alguma das suas
	portas seriais, olhe as mensagens exibidas no console enquanto
	o kernel esta sendo carregado, ou ent&atilde;o utilize o comando
	<command>/sbin/dmesg</command> para visualizar novamente as
	mensagens exibidas durante o processo de boot do kernel.  Em
	particular, procure por mensagens que iniciem com os
	caracteres <literal>sio</literal>.</para>

      <tip><para>Para visualizar apenas as mensagens que contenham a palavra
	<literal>sio</literal>, use o comando:</para>

      <screen>&prompt.root; <userinput>/sbin/dmesg | grep 'sio'</userinput></screen>
      </tip>

      <para>Por exemplo, em um sistema com 4 portas seriais, as mensagens
	especificas do kernel para as portas seriais durante o
	processo de boot seriam parecidas com essas:</para>

      <screen>sio0 at 0x3f8-0x3ff irq 4 on isa
sio0: type 16550A
sio1 at 0x2f8-0x2ff irq 3 on isa
sio1: type 16550A
sio2 at 0x3e8-0x3ef irq 5 on isa
sio2: type 16550A
sio3 at 0x2e8-0x2ef irq 9 on isa
sio3: type 16550A</screen>

      <para>Se o seu kernel n&atilde;o reconheceu todas as suas portas seriais,
	voc&ecirc; provavelmente precisa de um kernel customizado para o seu
	sistema FreeBSD.  Para informa&ccedil;&otilde;es detalhadas de como
	configurar o seu kernel, por favor consultexref 
	linkend="kernelconfig">.</para>

      <para>As linhas de device relevantes em seu arquivo de configura&ccedil;&atilde;o
	do kernel, ir&atilde;o se paracer com estas, para o
	FreeBSD&nbsp;4.X:</para>
      
      <programlisting>device		sio0	at isa? port IO_COM1 irq 4
device		sio1	at isa? port IO_COM2 irq 3
device		sio2	at isa? port IO_COM3 irq 5
device		sio3	at isa? port IO_COM4 irq 9</programlisting>
	  

      <para>e parecida com esta, para o FreeBSD&nbsp;5.X:</para>

      <programlisting>device		sio</programlisting>

      <para>No FreeBSD&nbsp;4.X; voc&ecirc; pode comentar ou remover por completo as linhas dos
	dispositivos que voc&ecirc; n&atilde;o possui , no caso do FreeBSD&nbsp;5.X
	voc&ecirc; tem que editar o seu arquivo
	<filename>/boot/device.hints</filename> para configurar as
	suas portas seriais.  Por favor consulte a p&aacute;gina de manual do
	&man.sio.4; para maiores informa&ccedil;&otilde;es sobre a configura&ccedil;&atilde;o de
	portas seriais e de placas muiltiseriais.  Tenha cuidado se
	voc&ecirc; estiver utilizando um arquivo de configura&ccedil;&atilde;o usado
	previamente em uma vers&atilde;o diferente do FreeBSD porque os
	<literal>flags</literal> de dispositivo e a sintaxe mudou
	entre as vers&otilde;es.</para>

      <note>
	<para><literal>port IO_COM1</literal> &eacute; a subistitui&ccedil;&atilde;o para
	  <literal>port 0x3f8</literal>, <literal>IO_COM2</literal> &eacute; 
	  <literal>0x2f8</literal>, <literal>IO_COM3</literal> &eacute; 
	  <literal>0x3e8</literal>, e <literal>IO_COM4</literal> &eacute;
	  <literal>0x2e8</literal>, os quais s&atilde;o os endere&ccedil;os mais 
	  comumente utilizados para as respectivas portas seriais.  As
	  interrup&ccedil;&otilde;es 4, 3, 5, e 9 s&atilde;o as linhas de interrup&ccedil;&atilde;o
	  normalmente solicitadas. Observe tamb&eacute;m que as portas
	  seriais comuns <emphasis>n&atilde;o podem</emphasis> compartilhar
	  IRQ no barramento ISA (as placas multiseriais possuem
	  componentes eletr&ocirc;nicos onboard que permitem que todos os
	  chips 16550A da placa compartilhem 1 ou 2 IRQs).</para>
      </note>
	  
    </sect2>

    <sect2>
      <title>Arquivos especiais de dispositivo</title>
      
      <para>A maioria dos dispositivos no kernel s&atilde;o acessados atrav&eacute;s
      de <quote>arquivos especiais de dispositivos</quote>, que est&atilde;o
      localizados no diret&oacute;rio <filename>/dev</filename>.  Os
      dispositivos <devicename>sio</devicename> s&atilde;o acessados atrav&eacute;s
      dos dispositivos
      <filename>/dev/ttyd<replaceable>N</replaceable></filename>
      (dial-in) e
      <filename>/dev/cuaa<replaceable>N</replaceable></filename> 
      (call-out).  O FreeBSD tamb&eacute;m disponibiliza dispositivos de
      inicializa&ccedil;&atilde;o
      (<filename>/dev/ttyid<replaceable>N</replaceable></filename> 
      e <filename>/dev/cuaia<replaceable>N</replaceable></filename>) e
      dispositivos de <quote>fechamento</quote>
      (<filename>/dev/ttyld<replaceable>N</replaceable></filename> e 
      <filename>/dev/cuala<replaceable>N</replaceable></filename>).
      Os dispositivos de inicializa&ccedil;&atilde;o s&atilde;o utilizados para inicializar
      os parametros das portas de comunica&ccedil;&atilde;o cada vez que elas s&atilde;o
      abertas, como por exemplo o <literal>crtscts</literal> para os
      modens que utilizam a sinaliza&ccedil;&atilde;o <literal>RTS/CTS</literal>
      para controle de fluxo.  Os dispositivos de fechamento s&atilde;o
      utilizados para travar flags nas portas para prevenir que
      usu&aacute;rios ou programas mudem certos parametros; veja as p&aacute;ginas
      de manual do &man.termios.4; &man.sio.4;, and &man.stty.1; para
      informa&ccedil;&otilde;es sobre a configura&ccedil;&atilde;o de terminais, fechamento e
      inicializa&ccedil;&atilde;o de dispositivos, e configura&ccedil;&atilde;o das op&ccedil;&otilde;es de
      terminal, respectivamente.</para>
      
      <sect3>
	<title>Criando arquivos especiais de dispositivo</title>

	<note><para>O FreeBSD&nbsp;5.0 inclui o sistema de arquivos
	&man.devfs.5;, o qual cria automaticamente os <literal>device
	nodes</literal> a medida que se fazem necess&aacute;rios.  Se voc&ecirc;
	esta executando esta vers&atilde;o do FreeBSD com o
	<literal>devfs</literal> habilitado, voc&ecirc; pode pular
	tranquilamente esta sess&atilde;o.</para></note>
	
	<para>Um script shell chamado <command>MAKEDEV</command>
	existente no diret&oacute;rio <filename>/dev</filename> ger&ecirc;ncia  os
	arquivos especiais de dispositivo.  Para utilizar o
	<command>MAKEDEV</command> para criar os arquivos especiais de 
	dispositivos de dial-up para a porta <devicename>COM1</devicename> 
	(porta 0), v&aacute; para o diret&oacute;rio <filename>/dev</filename> e
	execute o comando <command>MAKEDEV ttyd0</command>.  Da mesma
	forma, para criar os arquivos especiais de dispositivos
	dial-up para a porta <devicename>COM2</devicename> (porta 1),
	utilize o comando <command>MAKEDEV ttyd1</command>.</para>
	
	<para>O <command>MAKEDEV</command> n&atilde;o cria apenas os arquivos
	especiais de dispositivo <devicename>/dev/ttyd<replaceable>N
	</replaceable></devicename>, mas tamb&eacute;m os
	  <devicename>/dev/cuaa<replaceable>N</replaceable></devicename>,
	  <devicename>/dev/cuaia<replaceable>N</replaceable></devicename>,
	  <devicename>/dev/cuala<replaceable>N</replaceable></devicename>,
	  <devicename>/dev/ttyld<replaceable>N</replaceable></devicename>,
	  e
	  <devicename>/dev/ttyid<replaceable>N</replaceable></devicename>
	  .</para>
	    
	<para>Depois de criar os novos arquivos especiais de dispositivo,
	certifique-se sobre as permiss&otilde;es dos arquivos (especialmente
	os arquivos <filename>/dev/cua*</filename>), para ter certeza
	de que apenas os usu&aacute;rios que precisam ter acesso a eles,
	possuem permiss&atilde;o de escrita e de leitura nos mesmos &mdash;
	voce provavelmente n&atilde;o deseja permitir que os seus usu&aacute;rios
	m&eacute;dios utilizem seus modens para dial-out.  As permiss&otilde;es
	padr&otilde;es nos arquivos <filename>/dev/cua*</filename> devem ser
	suficientes:</para>

	<screen>crw-rw----    1 uucp     dialer    28, 129 Feb 15 14:38 /dev/cuaa1
crw-rw----    1 uucp     dialer    28, 161 Feb 15 14:38 /dev/cuaia1
crw-rw----    1 uucp     dialer    28, 193 Feb 15 14:38 /dev/cuala1</screen>

	<para>Estas permiss&otilde;es permitem que o usu&aacute;rio
	<username>uucp</username> e que os usu&aacute;rios do grupo
	<username>dialer</username> utilizem os dispositivos de
	<literal>call-out</literal>.</para>

      </sect3>
    </sect2>


    <sect2 id="serial-hw-config">
      <title>Configura&ccedil;&atilde;o de portas seriais</title>

    <indexterm><primary><devicename>ttyd</devicename></primary></indexterm>
    <indexterm><primary><devicename>cuaa</devicename></primary></indexterm>

    <para>O dispositivo
    <devicename>ttyd<replaceable>N</replaceable></devicename> (ou
    <devicename>cuaa<replaceable>N</replaceable></devicename>) &eacute; o
    dispositivo que normalmente voc&ecirc; ir&aacute; desejar abrir para as suas
    aplica&ccedil;&otilde;es.  Quando um processo abre um dispositivo, ele ir&aacute; ter
    um conjunto padr&atilde;o de configura&ccedil;&otilde;es de I/O para o terminal.</para>

    <screen>&prompt.root; <userinput>stty -a -f /dev/ttyd1</userinput></screen>

    <para>Quando voc&ecirc; altera as configura&ccedil;&otilde;es para este dispositivo,
      os ajustes permanecem v&aacute;lidos at&eacute; que o dispositivo seja
      fechado.  Quando ele &eacute; reaberto, ele voltar&aacute; a utilizar as
      configura&ccedil;&otilde;es padr&otilde;es.  Para fazer altera&ccedil;&otilde;es na configura&ccedil;&atilde;o
      padr&atilde;o, voc&ecirc; deve abrir e ajustar as configura&ccedil;&otilde;es de
      <quote>estado inicial</quote> do dispositivo.  Por exemplo, para
      habilitar o modo <option>CLOCAL</option>, comunica&ccedil;&atilde;o de 8 bits
      e o controle de fluxo <option>XON/XOFF</option> como padr&atilde;o para
      o dispositivo <devicename>ttyd5</devicename>, execute:</para>

    <screen>&prompt.root; <userinput>stty -f /dev/ttyid5 clocal cs8 ixon ixoff</userinput></screen>

    <indexterm>
      <primary>rc files</primary>
      <secondary><filename>rc.serial</filename></secondary>
    </indexterm>

    <!-- XXX; /etc/rc.serial is gone in 5.1.
      How do you set default parameters for these devices in 5.X ? -->

    <para>Todo o processo de iniciali&ccedil;&atilde;o dos dispositivos seriais &eacute; controlado
         pelo arquivo <filename>/etc/rc.serial</filename>. Este arquivo
         afeta as configura&ccedil;&otilde;es padr&otilde;es dos dispositivos seriais.</para>

    <para>Para impedir que configura&ccedil;&otilde;es sejam modificadas por aplica&ccedil;&otilde;es, configure
           os dispositivos em <quote>lock state</quote>. Por exemplo, para travar a velocidade
           do <devicename>ttyd5</devicename> em 57600&nbsp;bps, digite:</para>


    <screen>&prompt.root; <userinput>stty -f /dev/ttyld5 57600</userinput></screen>

    <para>Deste momento em diante, as aplica&ccedil;&otilde;es que abrirem o dispositivo <devicename>ttyd5</devicename>
          e tentarem modificar a velocidade da porta ter&atilde;o sua tentativa ignorada e far&atilde;o uso
          do dispositivo na velocidade 57600&nbsp;bps.</para>

    <indexterm>
      <primary><command>MAKEDEV</command></primary>
    </indexterm>


    <para>Naturalmente, voc&ecirc; deve definir que os dispositivos que estiverem em estado de inicializa&ccedil;&atilde;o ou travados
           tenham permiss&atilde;o de escrita somente para a conta <username>root</username>.</para>

    </sect2>
  </sect1>

  <sect1 id="term">
    <sect1info>
      <authorgroup>
        <author>
	  <firstname>Sean</firstname>
	  <surname>Kelly</surname>
	  <contrib>Contributed by </contrib>
	</author>
	<!-- 28 July 1996 -->
      </authorgroup>
    </sect1info>
    <title>Terminais</title>

    <indexterm><primary>terminals</primary></indexterm>



    <para>Terminais proporcionam um meio de acesso conveniente e de baixo-custo ao seu sistema FreeBSD
          quando voc&ecirc; n&atilde;o possui computadores para console ou uma rede para conex&atilde;o.
          Esta se&ccedil;&atilde;o descreve como utilizar terminais com o FreeBSD.</para>

    <sect2 id="term-uses">
      <title>Utilidades e Tipos de Terminais</title>

      <para>Os sistemas &unix; primitivos n&atilde;o possuiam consoles. Diante disso,
        os usu&aacute;rios conectados executavam seus programas atrav&eacute;s de terminais
        ligados nas portas seriais dos computadores. Processo muito similar
        ao uso de um modem e um programa de conex&atilde;o para um sistema remoto, para
        trabalhos em modo texto puro.</para> 

      <para>Atualmente, os PCs possuem consoles com alta defini&ccedil;&atilde;o gr&aacute;fica, mas
        as habilidades de estabelecer uma sess&atilde;o de login atrav&eacute;s de uma porta
        serial foi mantida nos sistemas operacionais &unix; atuais; O FreeBSD
        n&atilde;o &eacute; uma exce&ccedil;&atilde;o. Utilizando um terminal conectado a uma porta serial
        voc&ecirc; pode logar-se e rodar programas em modo texto normalmente como 
        seria feito em um console ou numa janela de <command>xterm</command>
        do sistema X Window.</para> 
        
      <para>Os usu&aacute;rios coorporativos tem a op&ccedil;&atilde;o de conectar diversos terminais
        num sistema FreeBSD e coloc&aacute;-los nas mesas de trabalho de seus funcion&aacute;rios.
        Os usu&aacute;rios dom&eacute;sticos podem utilizar de computadores antigos como IBM PCs
        ou &macintosh; como terminais de um computador de performance superior 
        rodando FreeBSD. Permitindo que um computador poderoso, que na maioria das vezes 
        seria utilizado por apenas um usu&aacute;rio, torne-se um sistema para m&uacute;ltiplos
        usu&aacute;rios.</para>  
  
      <para>No FreeBSD tem-se basicamente tr&ecirc;s tipos de terminais:</para>

      <itemizedlist>
	<listitem>
	  <para><link linkend="term-dumb">Terminais <foreignphrase>Dumb</foreignphrase> ou burros</link></para>
	</listitem>

	<listitem>
	  <para><link linkend="term-pcs">PCs atuando como terminais</link></para>
	</listitem>

	<listitem>
	  <para><link linkend="term-x">Termianis X</link></para>
	</listitem>
      </itemizedlist>
	  
      <para>S&atilde;o descritos em sequ&ecirc;ncia cada um dos tipos.</para>
	  
      <sect3 id="term-dumb">
	<title>Terminais <foreignphrase>Dumb</foreignphrase> ou burros</title>

        <para>Terminais <foreignphrase>Dumb</foreignphrase> s&atilde;o um tipo caracter&iacute;stico de
          equipamento para conex&atilde;o em computadores atrav&eacute;s de portas seriais. S&atilde;o chamados
          <quote>dumb</quote> ou <quote>burros</quote> devido a serem terminais que possuem
          habilidade &uacute;nica de envio e apresenta&ccedil;&atilde;o de informa&ccedil;&otilde;es em modo texto. N&atilde;o &eacute; 
          poss&iacute;vel executar nenhum programa neles. A execu&ccedil;&atilde;o dos programas como 
          editores de texto, compiladores, correio eletr&ocirc;nico, jogos, e outros, &eacute;
          feita pelo computador em que o terminal est&aacute; conectado.</para>  

        <para>Existem diversos tipos de terminais burros, fabricados pelos mais
          variados fabricantes, como por exemplo o VT-100 da <foreignphrase>Digital
          Equipment Corporation</foreignphrase>, ou o WY-75 da <foreignphrase>Wyse</foreignphrase>. 
          Qualquer que seja o tipo funcionar&aacute; com o FreeBSD. Alguns terminais 
          mais avan&ccedil;ados podem at&eacute; exibir gr&aacute;ficos, por&eacute;m apenas algums
          programas podem fazer uso destas funcionalidades.</para>  

        <para>Terminais burros s&atilde;o plataformas de trabalho bastante comuns
          em locais onde os usu&aacute;rios n&atilde;o necessitam de aplica&ccedil;&otilde;es gr&aacute;ficas
          como as providas pelo sistema X Window.</para>

      </sect3>
	  
      <sect3 id="term-pcs">
	<title>PCs atuando como terminais</title>

        <para>Se um <link linkend="term-dumb">terminal burro</link> possui habilidades suficientes para exibir,
          enviar e receber texto, certamente, qualquer computador poder&aacute; ser
          utilizado como um terminal burro. Tudo que ser&aacute; preciso &eacute; um cabo
          apropriado e a <emphasis>emula&ccedil;&atilde;o de terminal</emphasis> 
          realizada por um programa executado no computador.</para>
          
        <para>Tal configura&ccedil;&atilde;o &eacute; comum para uso dom&eacute;stico. Por exemplo, se
          tem uma pessoa ocupada trabalahndo no seu console do FreeBSD
          voc&ecirc; pode realizar trabalhos em texto ao mesmo tempo de um computador
          conectado como um terminal ao FreeBSD.</para>
      </sect3>
	  
      <sect3 id="term-x">
	<title>Terminais X</title>

        <para>Terminais X s&atilde;o o tipo mais sofisticado de terminais dispon&iacute;veis.
          Ao inv&eacute;s de serem conectados por portas seriais, estes s&atilde;o usualmente
          conectados via rede, como por exemplo <foreignphrase>Ethernet</foreignphrase>.
          No lugar de executarem aplica&ccedil;&otilde;es em modo texto, estes podem exibir
          qualquer aplica&ccedil;&atilde;o gr&aacute;fica do X Window.</para> 

        <para>Os terminais X s&atilde;o apresentados aqui somente para abordagem geral do tema.
              Entretanto, este cap&iacute;tulo <emphasis>n&atilde;o</emphasis> abrange a configura&ccedil;&atilde;o
              ou o uso de terminais X.</para>
	    
      </sect3>
    </sect2>
    
    <sect2 id="term-config">
      <title>Configura&ccedil;&atilde;o</title>

      <para>Esta sess&atilde;o descreve o que &eacute; necess&aacute;rio configurar no seu sistema FreeBSD
        para habilitar o <foreignphrase>login</foreignphrase> e utiliza&ccedil;&atilde;o atrav&eacute;s de um terminal.
        &Eacute; assumido aqui que voc&ecirc; tenha previamente habilitado o suporte para portas seriais no seu kernel
        e que voc&ecirc; tenha feito a conex&atilde;o f&iacute;sica do terminal na porta serial.</para> 
      

      <para>Relembrando o <xref linkend="boot"> que descreve que o processo
        <command>init</command> &eacute; respons&aacute;vel pelo controle e in&iacute;cializa&ccedil;&atilde;o 
        de todos os processos ao iniciar o sistema.  Uma das atividades executadas
        pelo <command>init</command> &eacute; ler o arquivo <filename>/etc/ttys</filename>
        e iniciar o processo <command>getty</command> nos terminais disponibilizados.
	O processo <command>getty</command> &eacute; respons&aacute;vel pela leitura do nome de <foreignphrase>login</foreignphrase>
	e pela inicializa&ccedil;&atilde;o do programa <command>login</command>.</para>
	  
      <para>Assim, para configurar os terminais para o seu sistema FreeBSD 
	os seguintes passos devem ser realizados como <username>root</username>:</para>

      <procedure>
	<step>
	  <para>Adicione uma linha no arquivo <filename>/etc/ttys</filename> para a entrada
	    do diret&oacute;rio <filename>/dev</filename> indicando a porta serial caso esta n&atilde;o esteja 
            descrita no arquivo.</para>
	</step>

	<step>
	  <para>Especifique que o <command>/usr/libexec/getty</command> deve ser executado
            na porta, e indique um tipo apropriado de <replaceable>getty</replaceable> no arquivo <filename>/etc/gettytab</filename>.</para>
	</step>

	<step>
	  <para>Especifique o tipo padr&atilde;o do terminal.</para>
	</step>

	<step>
	  <para>Configure a porta como <quote><foreignphrase>on</foreignphrase>.</quote></para>
	</step>
	      
	<step>
	  <para>Especifique se a porta deve ser <quote>segura.</quote></para>
	</step>

	<step>
	  <para>Force o <command>init</command> a reler o arquivo<filename>/etc/ttys</filename>.</para>
	</step>
      </procedure>
      
      <para>Como passo opcional, voc&ecirc; pode desejar criar um tipo de <replaceable>getty</replaceable> 
        personalizado para utilizar no passo 2 fazendo uma entrada no arquivo <filename>/etc/gettytab</filename>.
        Este cap&iacute;tulo n&atilde;o explica como fazer isso; &eacute; recomend&aacute;vel que voc&ecirc; leia as p&aacute;ginas de manual &man.gettytab.5;
        e a &man.getty.8; para informa&ccedil;&otilde;es detalhadas deste processo.</para>
      
      <sect3 id="term-etcttys">
	<title>Adicionando uma entrada no arquivo <filename>/etc/ttys</filename></title>

	<para>O arquivo <filename>/etc/ttys</filename> lista todas as portas do seu sistema FreeBSD em que voc&ecirc;
          deseja permitir <foreignphrase>logins</foreignphrase>. Por exemplo,
	  o primeiro console virtual que &eacute; definido em uma entrada deste arquivo &eacute; o <filename>ttyv0</filename>.  Voc&ecirc;
          pode realizar <foreignphrase>login</foreignphrase> devido esta entrada.  Este arquivo tamb&eacute;m cont&eacute;m
          entradas para outros consoles virtuais, portas seriais, e pseudo-ttys.  Para um terminal f&iacute;sico,
          apenas liste a porta serial que est&aacute; em <filename>/dev</filename> numa entrada sem a parte do 
          <filename>/dev</filename> (por exemplo, 
	  <devicename>/dev/ttyv0</devicename> deve ser listado como 
	  <devicename>ttyv0</devicename>).</para>

	<para>A instala&ccedil;&atilde;o padr&atilde;o do FreeBSD inclui no arquivo <filename>/etc/ttys</filename>
          o suporte para as quatro primeiras portas seriais: <filename>ttyd0</filename> &agrave; <filename>ttyd3</filename>.  Se 
          voc&ecirc; conectar fisicamente um terminal em uma destas portas n&atilde;o ser&aacute; necess&aacute;rio editar o <filename>/etc/ttys</filename>
          pois as entradas referentes a estes terminais j&aacute; constar&atilde;o no arquivo.</para>

	<example id="ex-etc-ttys">
	  <title>Adicionando entradas de terminais em <filename>/etc/ttys</filename></title> 

	  <para>Vamos supor que gostar&iacute;amos de conectar dois terminais ao sistema: um Wyse-50 e um velho IBM PC 286 executando
            o programa de terminal <application>Procomm</application>, que emula um terminal VT-100.
            N&oacute;s conectamos o Wyse na segunda porta serial e o 286 na sexta porta serial (uma porta de uma placa multi-serial).
	    As entradas correspondentes a esta configura&ccedil;&atilde;o no arquivo <filename>/etc/ttys</filename>
            deveriam ser algo como abaixo:</para>

	  <programlisting>ttyd1<co 
	      id="co-ttys-line1col1">  "/usr/libexec/getty std.38400"<co
	      id="co-ttys-line1col2">  wy50<co
	      id="co-ttys-line1col3">  on<co
	      id="co-ttys-line1col4">  insecure<co
	      id="co-ttys-line1col5">
ttyd5   "/usr/libexec/getty std.19200"  vt100  on  insecure
	  </programlisting>
      
	  <calloutlist>
	    <callout arearefs="co-ttys-line1col1">
	      <para>O primeiro campo normalmente especifica o nome de arquivo do terminal e ele &eacute; localizado em
	      <filename>/dev</filename>.</para>
	    </callout>
	    <callout arearefs="co-ttys-line1col2">

	      <para>O segundo campo &eacute; o comando executado para esta linha, que &eacute; usualmente &man.getty.8;.
	        <command>getty</command> que inicializa e abre a via de comunica&ccedil;&atilde;o, definindo a velocidade, al&eacute;m de perguntar
                por um nome de usu&aacute;rio e em seguida executar o programa &man.login.1;.</para>

	      <para>O programa <command>getty</command> aceita um(opcional) par&acirc;metro em sua linha de comando
                que define o tipo do <replaceable>getty</replaceable>.  Um tipo de
		<replaceable>getty</replaceable> determina as caracter&iacute;sticas de comunica&ccedil;&atilde;o 
                de um terminal, como taxa de bps e paridade. O programa <command>getty</command>
                l&ecirc; estas caracter&iacute;sticas do arquivo <filename>/etc/gettytab</filename>.</para>

	      <para>O arquivo <filename>/etc/gettytab</filename>
		cont&eacute;m v&aacute;rias entradas de terminais, tanto de terminais novos quanto de antigos. Em quase todos os casos, 
                as entradas que iniciam com o texto <literal>std</literal> funcionar&atilde;o para os terminais 
                conectados fisicamente. Estas entradas ignoram paridade.
		H&aacute; uma entrada <literal>std</literal> para cada taxa de bps
		de 110 &agrave; 115200.  &Eacute; claro que voc&ecirc; pode adicionar suas pr&oacute;prias entradas neste arquivo. A p&aacute;gina de manual &man.gettytab.5;
                possui maiores informa&ccedil;&otilde;es sobre o assunto.</para>

	      <para>Quando estiver configurando o tipo de <replaceable>getty</replaceable>
		no arquivo <filename>/etc/ttys</filename>, tenha certeza de que as configura&ccedil;&otilde;es de comunica&ccedil;&atilde;o
                do terminal sejam equivalentes.</para>
	    
	      <para>Para o nosso exemplo, o Wyse-50 n&atilde;o usa paridade e conecta &agrave; 38400&nbsp;bps.  O 286&nbsp;PC n&atilde;o usa paridade
                e conecta &agrave; 19200&nbsp;bps.</para>

	    </callout>

	    <callout arearefs="co-ttys-line1col3">

	      <para>O terceiro campo &eacute; o tipo de terminal usualmente conectado atrav&eacute;s desta tty.  Para portas<foreignphrase>dial-up</foreignphrase>,
		<literal>unknown</literal> ou
		<literal>dialup</literal> s&atilde;o tipicamente definidos neste campo 
                desde que usu&aacute;rios possam fazer <foreignphrase>dial up</foreignphrase> com praticamente
                qualquer tipo de terminal ou programa.  Para terminais f&iacute;sicos
                o tipo n&atilde;o muda, portanto, voc&ecirc; pode colocar um tipo real de terminal neste campo,
                baseando-se na cole&ccedil;&atilde;o de terminais do arquivo &man.termcap.5;.</para>

	      <para>Para o nosso exemplo, o Wyse-50 usa um tipo real de terminal enquanto o 286 PC executa o programa
                <application>Procomm</application> emulando um terminal VT-100.</para>

	    </callout>

	    <callout arearefs="co-ttys-line1col4">
	      <para>O quarto campo especifica se a porta deve ser ativada.
	        Colocando um <literal>on</literal> neste campo far&aacute; com 
	        que o processo <command>init</command> inicie o programa especificado no segundo campo,
	        <command>getty</command>.  Caso voc&ecirc; defina <literal>off</literal> neste campo
                o <command>getty</command> n&atilde;o ser&aacute; iniciado, o que resultar&aacute; na impossibilidade de 
                <foreignphrase>logins</foreignphrase> nesta porta.</para>
	    </callout>

	    <callout arearefs="co-ttys-line1col5">
	      <para>O campo final &eacute; usado para especificar se a porta ser&aacute; segura.
	        Definindo a porta como segura significar&aacute; que esta &eacute; confi&aacute;vel ao ponto de permitir
	        que a conta <username>root</username> (ou qualquer outra conta com UID 0)
                possa realizar <foreignphrase>login</foreignphrase> desta porta. 
	        Definindo como n&atilde;o segura far&aacute; com que n&atilde;o seja permitido <foreignphrase>logins</foreignphrase> com 
                direitos de acesso como os do <username>root</username>.
	        Numa porta n&atilde;o segura os usu&aacute;rios devem fazer acesso ao sistema atrav&eacute;s de contas
	        sem privil&eacute;gios de superusu&aacute;rio, e atrav&eacute;s do uso do &man.su.1; ou algum m&eacute;todo similar
                adquirir os privil&eacute;gios.</para>

	      <para>&Eacute; altamente recomand&aacute;vel que voc&ecirc; defina com <quote>insecure</quote>
	        tanto os terminais quanto as portas n&atilde;o habilitadas.
                &Eacute; bastante f&aacute;cil fazer o acesso e utilizar <command>su</command>
	        caso voc&ecirc; precise de privil&eacute;gios de superusu&aacute;rio.</para>
	    </callout>
	  </calloutlist>
	</example>
      </sect3>  

      <sect3 id="term-hup">
	<title>For&ccedil;ando o <command>init</command> a reler o <filename>/etc/ttys</filename></title>

	<para>Ap&oacute;s ter realizado as configura&ccedil;&otilde;es necess&aacute;rias no arquivo
	  <filename>/etc/ttys</filename> voc&ecirc; deve enviar um sinal SIGHUP
	  (<foreignphrase>hangup</foreignphrase>) para o processo <command>init</command>
          para for&ccedil;a-lo a reler as configura&ccedil;&otilde;es e execut&aacute;-las como descrito no arquivo. Por exemplo:</para>


	<screen>&prompt.root; <userinput>kill -HUP 1</userinput></screen>

	<note>
	  <para><command>init</command> &eacute; sempre o primeiro processo a ser executado no sistema, portanto, ele sempre
            ter&aacute; o PID 1.</para>
	</note>

	<para>Se tudo foi configurado corretamente, todos os cabos devidamente conectados,
          e os terminais ligados, ent&atilde;o o processo <command>getty</command>
          deve estar sendo executado em cada um dos terminais e voc&ecirc; j&aacute; poder&aacute;
	  ver os <foreignphrase>prompts</foreignphrase> de <foreignphrase>login</foreignphrase>.</para>
      </sect3>
    </sect2>
    
    <sect2 id="term-debug">
      <title>Resolu&ccedil;&atilde;o de problemas na sua conex&atilde;o</title>
      
      <para>Mesmo com a maior aten&ccedil;&atilde;o aos detalhes, algo pode ainda estar errado 
        enquanto configuramos um terminal. Aqui temos uma lista de sintomas e algumas sugest&otilde;es para corre&ccedil;&atilde;o de eventuais problemas.</para>
      
      <sect3>
	<title>O <foreignphrase>Prompt de Login</foreignphrase> n&atilde;o aparece</title>

	<para>Tenha certeza de que seu terminal est&aacute; conectado e ligado.
          Caso seja um computador pessoal atuando como terminal tenha certeza de que est&aacute; executando o 
          o programa de emula&ccedil;&atilde;o de terminal na porta correta.</para>

	<para>Certifique-se de que os cabos entre seu terminal e o computador FreeBSD estejam 
          conectados firmemente. Confirme estar utilizando o tipo de cabo correto 
	  para esta conex&atilde;o.</para>

	<para>Certifique-se de que seu terminal e seu sistema FreeBSD est&atilde;o configurados com a mesma
          velocidade em bps e com a mesma configura&ccedil;&atilde;o de paridade. Caso seja um terminal com tela, verifique
          os controles de contraste e brilho. Caso seja um terminal de impress&atilde;o, certifique-se de este possui 
          papel e tinta em quantidade suficiente.</para> 

	<para>Certifique-se de que o processo <command>getty</command> est&aacute; rodando e servindo um terminal. Por exemplo, para obter uma lista dos processos <command>getty</command>
          em execu&ccedil;&atilde;o use o <command>ps</command>, digite:</para>

        <screen>&prompt.root; <userinput>ps -axww|grep getty</userinput></screen>

	<para>Voc&ecirc; dever&aacute;  ver uma entrada referente ao terminal. Por
          exemplo, a listagem seguinte mostra um <command>getty</command>
          sendo executado na segunda porta serial a <literal>ttyd1</literal>
          e este est&aacute;  usando o par&acirc;metro <literal>std.38400</literal> referente a entrada no <filename>/etc/gettytab</filename>:</para>

	<screen>22189  d1  Is+    0:00.03 /usr/libexec/getty std.38400 ttyd1</screen>

	<para>Caso n&atilde;o se tenha um processo <command>getty</command> em execu&ccedil;&atilde;o,
          verifique se voc&ecirc; ativou a porta no <filename>/etc/ttys</filename>.
	  Lembre-se tamb&eacute;m de executar <command>kill -HUP 1</command>
	  ap&oacute;s modificar o arquivo <filename>ttys</filename>.</para>

	<para>Caso o processo <command>getty</command> esteja rodando e o terminal
          n&atilde;o apresente o <foreignphrase>prompt de login</foreignphrase>
          ou apresente sem permitir a digita&ccedil;&atilde;o, seu terminal ou cabo podem n&atilde;o suportar a verifica&ccedil;&atilde;o de conex&atilde;o(<foreignphrase>handshaking</foreignphrase>). Tente
          modificar a entrada no <filename>/etc/ttys</filename> de <literal>std.38400</literal> para
	  <literal>3wire.38400</literal> lembrando de executar <command>kill -HUP 1</command> ap&oacute;s
          alterar o <filename>/etc/ttys</filename>. O <literal>3wire</literal> &eacute; uma entrada
          similar ao <literal>std</literal>, por&eacute;m ignora a verifica&ccedil;&atilde;o de conex&atilde;o. Voc&ecirc; pode reduzir
          a velocidade ou ativar o controle de fluxo quando utilizar <literal>3wire</literal>, para
          prevenir estouro de &aacute;reas de troca(<foreignphrase>buffer overflows</foreignphrase>).</para>

      </sect3>

      <sect3>
	<title>Caso apare&ccedil;am caracteres estranhos ao inv&eacute;s do <foreignphrase>Prompt de Login</foreignphrase></title>

	<para>Certifique-se de que o terminal e o FreeBSD tenham a velocidade e a configura&ccedil;&atilde;o
          de paridade compat&iacute;veis. Verifique no processo <command>getty</command> se o tipo de <replaceable>getty</replaceable>
          correto est&aacute; em uso.  Se n&atilde;o, edite o <filename>/etc/ttys</filename> e execute <command>kill
	  -HUP 1</command>.</para>

      </sect3>

      <sect3>
	<title>Caracteres aparecem duplicados; a senha aparece quando digitada</title>

	<para>Altere o terminal (ou o programa de emula‡ao de terminal)
	  de <quote>half duplex</quote> ou <quote>local echo</quote> para <quote>full duplex.</quote></para>

      </sect3>
    </sect2>
  </sect1>

  <sect1 id="dialup">
    <sect1info>
      <authorgroup>
	<author>
	  <firstname>Guy</firstname>
	  <surname>Helmer</surname>
	  <contrib>Contribui&ccedil;&atilde;o de </contrib>
	</author>
      </authorgroup>
      <authorgroup>
        <author>
	  <firstname>Sean</firstname>
	  <surname>Kelly</surname>
	  <contrib>Informa&ccedil;&otilde;es adicionais por </contrib>
	</author>
      </authorgroup>
    </sect1info>
    <title>Servi&ccedil;o de Dial-in</title>
    <indexterm><primary>dial-in service</primary></indexterm>

    <para>Configurar o seu sistema FreeBSD para o servi&ccedil;oo de <foreignphrase>dial-in</foreignphrase> &eacute;
      similar ao processo de configurar terminais exceto que voc&ecirc; ter&aacute; de discar com <quote>modems</quote>.</para>

      <sect2>
	<title>Modems Externos vs. Internos</title>

	<para>Modems externos s&atilde;o mais convenientes para <foreignphrase>dial-up</foreignphrase>, devido
          a permitirem ser configurados via par&acirc;metros armazenados em RAM n&atilde;o vol&aacute;til e eles possuem
          indicadores luminosos que demonstram o estado de sinais RS-232 importantes. Luzes piscantes
          impressionam visitantes, e tamb&eacute;m s&atilde;o &uacute;teis na verifica&ccedil;&atilde;o do correto funcionamento do modem.</para>

	<para>Modems internos usualmente n&atilde;o permitem configura&ccedil;&otilde;es via RAM n&atilde;o vol&aacute;til, limitando
          a serem realizadas somente atrav&eacute;s de chaves DIP.  Caso seu modem possua algum indicador
          luminoso ser&aacute;, provavelmente, dif&iacute;cil ver as luzes enquanto seu sistema estiver no
          local pr&oacute;prio.</para>

      <sect3>
	<title>Modems e Cabos</title>
	<indexterm><primary>modem</primary></indexterm>

	<para>Se voc&ecirc; estiver utilizando um modem externo ent&atilde;o ser&aacute; necess&aacute;rio utilizar um cabo apropriado. Um
          cabo serial do padr&atilde;o RS-232 longo o suficiente com todos os fios necess&aacute;rios aos sinais:</para>

	<itemizedlist>
	  <listitem>
	    <para>Dados transmitidos (<acronym>SD</acronym>)</para>
	  </listitem>

	  <listitem>
	    <para>Dados recebidos (<acronym>RD</acronym>)</para>
	  </listitem>

	  <listitem>
	    <para>Solicitar para enviar (<acronym>RTS</acronym>)</para>
	  </listitem>

	  <listitem>
	    <para>Limpar para enviar (<acronym>CTS</acronym>)</para>
	  </listitem>

	  <listitem>
	    <para>Dados prontos (<acronym>DSR</acronym>)</para>
	  </listitem>

	  <listitem>
	    <para>Terminal de dados pronto (<acronym>DTR</acronym>)</para>
	  </listitem>

	  <listitem>
	    <para>Detec&ccedil;&atilde;o de portadora (<acronym>CD</acronym>)</para>
	  </listitem>

	  <listitem>
	    <para>Sinal terra (<acronym>SG</acronym>)</para>
	  </listitem>
	</itemizedlist>

	<para>O FreeBSD necessita dos sinais <acronym>RTS</acronym> e <acronym>CTS</acronym> para
          controle de fluxo sobre velocidades acima de 2400&nbsp;bps, o sinal <acronym>CD</acronym> serve
          para detectar que a chamada foi respondida e a linha estabilizada, e o sinal
          <acronym>DTR</acronym> para reiniciar o modem depois de uma se&ccedil;&atilde;o completa. Alguns
          cabos n&atilde;o possuem todos os fios necess&aacute;rios aos sinais, ent&atilde;o, se voc&ecirc; tiver problemas
          com a fase de login que n&atilde;o prosegue ap&oacute;s a linha ter sido estabelecida, voc&ecirc;
          deve ter um problema com o seu cabo.</para>

	<para>Assim como outros sistemas operacionais &unix;, o FreeBSD usa de sinais f&iacute;sicos
          para localizar quando uma chamada foi respondida ou a linha estabelecida e para
          reiniciar o modem ap&oacute;s uma chamada. O FreeBSD evita enviar comandos para o modem
          ou observar por estados reportados pelo modem. Se voc&ecirc; est&aacute; acostumado a conectar modems
          a sistemas PC-BBS, isto deve parecer impr&oacute;prio.</para>
      </sect3>
      </sect2>

      <sect2>
	<title>Considera&ccedil;&otilde;es da Interface Serial</title>

	<para>O FreeBSD tem suporte as interfaces de comunica&ccedil;&atilde;o NS8250-, NS16450-, NS16550-, e
          NS16550A- baseadas na EIA RS-232C (CCITT V.24).  Os dispositivos 8250 e 16450 que possuem
          &aacute;rea de troca de caractere &uacute;nico.  O dispositivo 16550 prov&ecirc; &aacute;reas de troca de 16
          caracteres, o que garante uma melhor perfomance ao sistema.  (Problemas na implementa&ccedil;&atilde;o
          da 16550's evita o uso da &aacute;rea de troca de 16 caracteres, ent&atilde;o use a 16550A's
          se poss&iacute;vel).  Devido a dispositivos de &aacute;rea de troca de caractere &uacute;nico
          requerirem maior processamento do sistema operacional que os dispositivos com
          &aacute;rea de troca de 16 caracteres, prefira utilizar interfaces seriais com sinais baseados em 16550A. Se
          o sistema possuir diversas portas seriais ativas ou tiver uma carga de servi&ccedil;os muito grande, as
          placas seriais baseadas em 16550A s&atilde;o melhores para que se tenham taxas baixas de
         erros de comunica&ccedil;&atilde;o.</para>
      </sect2>

    <sect2>
      <title>R&aacute;pida Vis&atilde;o Geral</title>

      <indexterm><primary>getty</primary></indexterm>
      <para>Assim como os terminais, o <command>init</command> iniciar&aacute; um processo <command>getty</command> para
        cada porta serial configurada para aceitar conex&otilde;es discadas. Por exemplo, se
        um modem est&aacute; anexado a <filename>/dev/ttyd0</filename> o comando <command>ps ax</command> deve
        apresentar algo como:</para>

      <screen> 4850 ??  I      0:00.09 /usr/libexec/getty V19200 ttyd0</screen>

      <para>Quando um usu&aacute;rio disca para a linha em que o modem est&aacute; conectado
        um sinal de <acronym>CD</acronym> (<foreignphrase>Carrier Detect</foreignphrase> - Detec&ccedil;&atilde;o de Portadora)
        &eacute; reportado pelo modem. O kernel anuncia a detec&ccedil;&atilde;o da portadora e completa a abertura do <command>getty</command> daquela
        porta.  O <command>getty</command> envia um <foreignphrase>prompt</foreignphrase> <prompt>login:</prompt> para
        a linha na velocidade especificada. O <command>getty</command> verifica se os caracteres est&atilde;o
        sendo recebidos corretamente e, numa configura&ccedil;&atilde;o t&iacute;pica, se ele encontra ru&iacute;dos de
        comunica&ccedil;&atilde;o (provavelmente a velocidade da conex&atilde;o do modem &eacute; diferente da estabelecida
        no  <command>getty</command>), o <command>getty</command> tenta ajustar a velocidade da linha
        at&eacute; que possa receber caracteres cab&iacute;veis.</para>

      <indexterm>
        <primary><command>/usr/bin/login</command></primary>
      </indexterm>
      <para>Ap&oacute;s o usu&aacute;rio informar seu nome de login, o <command>getty</command> executa
	<filename>/usr/bin/login</filename>, que se responsabiliza pelo login perguntando ao
        usu&aacute;rio sua senha e posteriormente iniciando o <foreignphrase>shell</foreignphrase> definido para este.</para>
    </sect2>


    <sect2>
      <title>Arquivos de configura&ccedil;&atilde;o</title>

      <para>Temos tr&ecirc;s arquivos de configura&ccedil;&atilde;o do sistema no diret&oacute;rio <filename>/etc</filename> que
        provavelmente ser&aacute; necess&aacute;rio editar para permitir acesso discado ao seu sistema FreeBSD. O
        primeiro deles &eacute; o <filename>/etc/gettytab</filename> que cont&eacute;m as informa&ccedil;&otilde;es de configura&ccedil;&atilde;o
        do processo de servidor <filename>/usr/libexec/getty</filename>. O segundo, o <filename>/etc/ttys</filename>,
        armazena informa&ccedil;&otilde;es que descrevem ao <filename>/sbin/init</filename> quais dispositivos <filename>tty</filename>
        devem possuir um processo <command>getty</command> rodando sobre eles.
        E por &uacute;ltimo, voc&ecirc; poder&aacute; colocar seus comandos de inicializa&ccedil;&atilde;o
        no <foreignphrase>script</foreignphrase> <filename>/etc/rc.serial</filename>.</para>

      <para>Temos dois grupos distintos relativos as conex&otilde;es com modems em &unix;.
        Um grupo gosta de configurar seus modems e sistemas para que independendo
        da velocidade seja poss&iacute;vel discar, por&eacute;m a interface local RS-232 entre
        o computador e o modem roda numa velocidade travada. O benef&iacute;cio disso &eacute; que
        o usu&aacute;rio remoto sempre ver&aacute; o prompt de login imediatamente. O negativo disso
        &eacute; que o sistema n&atilde;o sabe qual a verdadeira velocidade do usu&aacute;rio, o que far&aacute;
        que programas que rodam utilizando toda a tela, como o Emacs, n&atilde;o ajustarem
        seus m&eacute;todos de exibi&ccedil;&atilde;o para responderem de maneira melhor quando for executada
        uma conex&atilde;o lenta.</para>

      <para>O outro grupo configura as interfaces RS-232 de seus modems de maneira a diversificarem
        suas velocidades baseando-se na velocidade da conex&atilde;o do usu&aacute;rio remoto. Por exemplo, conex&otilde;es
        V.32bis (14.4&nbsp;Kbps) devem fazer com que o modem execute sua interface RS-232 em 19.2&nbsp;Kbps, enquanto
        conex&otilde;es 2400&nbsp;bps far&atilde;o com que a interface RS-232 do modem rode em 2400&nbsp;bps. Devido ao
        <command>getty</command> n&atilde;o entender qualquer particularidade da velocidade reportada
        do modem ele dar&aacute; a mensagem <prompt>login:</prompt> na velocidade inicial e observar&aacute;
        os caracteres que ter&aacute; em resposta. Se o usu&aacute;rio verificar que os caracteres s&atilde;o impr&oacute;prios
        ou err&ocirc;neo, ele assumir&aacute; que os usu&aacute;rios dever&atilde;o saber que devem pressionar a
        tecla <keycode>Enter</keycode> at&aacute; que possa ver um prompt reconhec&iacute;vel. Se as velocidades
        n&atilde;o combinarem o <command>getty</command> verificar&aacute; que o usu&aacute;rio est&aacute;  digitando <quote>lixo</quote>,
        ou seja, caracteres impr&oacute;prios e tentar&aacute; estabelecer a pr&oacute;xima velocidade e enviar
        o prompt <prompt>login:</prompt> novamente.  Este procedimento poder&aacute; perdurar por um tempo, por&eacute;m
        normalmente ap&oacute;s uma ou duas pressionadas de tecla o usu&aacute;rio ver&aacute; um prompt bom.  Obviamente, esta
        sequ&ecirc;ncia de login n&atilde;o aparecer&aacute; t&atilde;o limpa quanto a de m&eacute;todo de velocidade travada, mas
        um usu&aacute;rio de conex&atilde;o lenta deve receber uma melhor resposta interativa para programas
        que utilizam toda a tela para exibi&ccedil;&atilde;o.</para>

      <para>Esta se&ccedil;&atilde;o tentar&aacute; prover informa&ccedil;&otilde;es numa configura&ccedil;&atilde;o balanceada, mas isso ser&aacute;        influenciado tendo em vista a velocidade do modem com a velocidade da conex&atilde;o.</para>

      <sect3>
	<title><filename>/etc/gettytab</filename></title>

  <indexterm>
    <primary><filename>/etc/gettytab</filename></primary>
  </indexterm>
	<para>O arquivo <filename>/etc/gettytab</filename> &eacute; um arquivo de estilos de &man.termcap.5;-style
	  de informa&ccedil;&otilde;es de configura&ccedil;&atilde;o para o &man.getty.8;.  Por favor, visite a p&aacute;gina de manual
          do &man.gettytab.5; para informa&ccedil;&otilde;es detalhadas sobre o formato do arquivo e a lista
          de habilidades.</para>

	<sect4>
	  <title>Configura&ccedil;&atilde;o de velocidade travada ou fixa</title>

          <para>Se voc&ecirc; est&aacute; travando a velocidade de comunica&ccedil;&atilde;o de seu modem numa espec&iacute;fica,
            voc&ecirc; provavelmente n&atilde;o precisar&aacute; fazer qualquer altera&ccedil;&atilde;o no arquivo <filename>/etc/gettytab</filename>.</para>
	</sect4>

	<sect4>
	  <title>Configura&ccedil;&atilde;o de velocidades compat&iacute;veis</title>

          <para>Voc&ecirc; precisar&aacute; definir uma entrada no arquivo <filename>/etc/gettytab</filename> para
            fornecer informa&ccedil;&otilde;es ao <command>getty</command> sobre velocidades que voc&ecirc; deseja
            utilizar para seu modem. Se voc&ecirc; tiver um modem de 2400&nbsp;bps, voc&ecirc; provavelmente
            poder&aacute; usar a entrada <literal>D2400</literal> existente.</para>

	  <programlisting>#
# Terminais de conex&otilde;es discadas r&aacute;pidas, giram em torno de 2400/1200/300 (podendo inciar em um deles)
#
D2400|d2400|Fast-Dial-2400:\
        :nx=D1200:tc=2400-baud:
3|D1200|Fast-Dial-1200:\
        :nx=D300:tc=1200-baud:
5|D300|Fast-Dial-300:\
        :nx=D2400:tc=300-baud:</programlisting>

	  <para>Se voc&ecirc; possui um modem de alta velocidade, voc&ecirc; provavelmente precisar&aacute; adicionar
            uma entrada no arquivo <filename>/etc/gettytab</filename>; temos aqui uma
            entrada que poderia ser utilizada para um modem de 14.4&nbsp;Kbps com
            uma interface de velocidade m&aacute;xima igual a 19.2&nbsp;Kbps:</para>

	  <programlisting>#
# Adi&ccedil;&otilde;es para modems V.32bis
#
um|V300|High Speed Modem at 300,8-bit:\
        :nx=V19200:tc=std.300:
un|V1200|High Speed Modem at 1200,8-bit:\
        :nx=V300:tc=std.1200:
uo|V2400|High Speed Modem at 2400,8-bit:\
        :nx=V1200:tc=std.2400:
up|V9600|High Speed Modem at 9600,8-bit:\
        :nx=V2400:tc=std.9600:
uq|V19200|High Speed Modem at 19200,8-bit:\
        :nx=V9600:tc=std.19200:</programlisting>

	  <para>Isto resultar&aacute; em conex&otilde;es de 8 bits sem paridade.</para>

	  <para>O exemplo acima inicia as velocidade de comunica&ccedil;&atilde;o em 19.2&nbsp;Kbps
	    (para conex&otilde;es V.32bis), ent&atilde;o girando em torno de 9600&nbsp;bps (para
	    V.32), 2400&nbsp;bps, 1200&nbsp;bps, 300&nbsp;bps, e retornando para 19.2&nbsp;Kbps.
	    Velocidades de comunica&ccedil;&atilde;o c&iacute;clicas s&atilde;o implementadas com a habilidade
	    <literal>nx=</literal> (<quote>pr&oacute;xima tabela</quote>).
            Cada uma das linhas usa uma entrada <literal>tc=</literal> (<quote>continua&ccedil;&atilde;o de tabela</quote>) para
            a escolha do resto das configura&ccedil;&otilde;es <quote>padr&otilde;es</quote> para
            uma velocidade em espec&iacute;fico.</para>

	  <para>Se voc&ecirc; tem um modem de 28.8&nbsp;Kbps e voc&ecirc; quer fazer uso das vantagens de
            compress&atilde;o dos modems de 14.4&nbsp;Kbps, voc&ecirc; precisa utilizar velocidades de conex&atilde;o
            maiores que 19.2&nbsp;Kbps.  Aqui temos um exemplo de uma entrada no <filename>gettytab</filename> iniciando
            em 57.6&nbsp;Kbps:</para>

	  <programlisting>#
# Adi&ccedil;&otilde;es para modems V.32bis ou V.34
# Iniciando em 57.6 Kbps
#
vm|VH300|Very High Speed Modem at 300,8-bit:\
        :nx=VH57600:tc=std.300:
vn|VH1200|Very High Speed Modem at 1200,8-bit:\
        :nx=VH300:tc=std.1200:
vo|VH2400|Very High Speed Modem at 2400,8-bit:\
        :nx=VH1200:tc=std.2400:
vp|VH9600|Very High Speed Modem at 9600,8-bit:\
        :nx=VH2400:tc=std.9600:
vq|VH57600|Very High Speed Modem at 57600,8-bit:\
        :nx=VH9600:tc=std.57600:</programlisting>

	  <para>Caso voc&ecirc; tenha uma CPU lenta ou um sistema sobre altas cargas de utiliza&ccedil;&atilde;o
            e n&atilde;o possua portas seriais basedas em 16550A, voc&ecirc; poder&aacute; receber erros <errorname>sio</errorname>
	    <quote>silo</quote> em 57.6&nbsp;Kbps.</para>
	</sect4>
      </sect3>

      <sect3 id="dialup-ttys">
	<title><filename>/etc/ttys</filename></title>
	<indexterm>
	  <primary><filename>/etc/ttys</filename></primary>
	</indexterm>

	<para>A configura&ccedil;&atilde;o do arquivo <filename>/etc/ttys</filename> &eacute; abordada no <xref linkend="ex-etc-ttys">. A
          configura&ccedil;&atilde;o para modems &eacute; similar por&eacute;m temos que passar um argumento diferente
          para o <command>getty</command> e especificar um tipo de terminal diferente. O formato
          geral para ambas as configura&ccedil;&otilde;es, velocidade travada e velocidades compat&iacute;veis s&atilde;o:</para>

	<programlisting>ttyd0   "/usr/libexec/getty <replaceable>xxx</replaceable>"   dialup on</programlisting>

	<para>O primeiro item da linha acima &eacute; o arquivo especial de dispositivo
          para esta entrada &mdash; <literal>ttyd0</literal> significando que <filename>/dev/ttyd0</filename> &eacute;
          o arquivo que este <command>getty</command> observar&aacute;.  O segundo item, <literal>"/usr/libexec/getty
	    <replaceable>xxx</replaceable>"</literal>
	  (<replaceable>xxx</replaceable> ser&aacute; substitu¡do pela habilidade
          inicial do <filename>gettytab</filename>) que ser&aacute; executado no dispositivo pelo
          processo <command>init</command>.  O terceiro item, <literal>dialup</literal>, &eacute;
          o tipo padr&atilde;o de terminal.  O quarto par&acirc;metro, <literal>on</literal>, diz ao <command>init</command> que
          a linha &eacute; operacional.  Pode haver um quinto par&acirc;metro, <literal>secure</literal>, mas
          deve ser utilizado somente para terminais fisicamente seguros (como a console do sistema).</para>

	<para>O tipo padr&atilde;o de terminal (no exemplo acima &eacute; um <literal>dialup</literal>)
          poder&aacute; depender das configura&ccedil;&otilde;es nativas. O tipo <literal>dialup</literal>
          &eacute; o padr&atilde;o para terminais de linhas de acesso discado, portanto, os usu&aacute;rios podem
          personalizar seus scripts de login para que estes informem que o tipo do terminal
          &eacute; <literal>dialup</literal> e automaticamente sejam feitos ajustes. Entretanto, o
          autor deste acha mais f&aacute;cil para suas configura&ccedil;&otilde;es definir o tipo padr&atilde;o
          como <literal>vt102</literal>, desde que os usu&aacute;rios somente usem a emula&ccedil;&atilde;o de
          VT102 em seus sistemas.</para>

	<para>Depois de realizar estas altera&ccedil;&otilde;es no <filename>/etc/ttys</filename>
	  voc&ecirc; deve enviar um sinal <acronym>HUP</acronym> para o processo <command>init</command>
          para que este releia o arquivo e aplique as altera&ccedil;&otilde;es.  Voc&ecirc; pode usar o comando
	  <screen>&prompt.root; <userinput>kill -HUP 1</userinput></screen> para enviar o sinal. Caso
          esta seja a primeira vez que voc&ecirc; configura o sistema, voc&ecirc; pode esperar at&eacute; que
          seus modems estejam conectados e configurados corretamente para depois
          sinalizar ao <command>init</command>.
	  </para>

	<sect4>
	  <title>Configura&ccedil;&atilde;o de velocidade travada ou fixa</title>

	  <para>Para configura&ccedil;&otilde;es de velocidade fixa sua entrada em <filename>ttys</filename>
            precisa especificar ao <command>getty</command> a velocidade.  Para um modem
            com a velociade da porta fixa em 19.2&nbsp;Kbps, a entrada em <filename>ttys</filename> deve ser algo como isso:</para>

	  <programlisting>ttyd0   "/usr/libexec/getty std.19200"   dialup on</programlisting>

	  <para>Caso seu modem esteja com a velocidade fixa diferente, substitua pelo valor apropriado
            utilizando <literal>std.<replaceable>velocidade</replaceable></literal>
	    no lugar de <literal>std.19200</literal>. Certifique-se de utilizar um tipo v&aacute;lido
            no arquivo <filename>/etc/gettytab</filename>.</para>
	</sect4>

	<sect4>
	  <title>Configura&ccedil;&atilde;o de velocidades compat&iacute;veis</title>

	  <para>Na configura&ccedil;&atilde;o de velocidades compat&iacute;veis, sua entrada em
	    <filename>ttys</filename> precisa referenciar o in&iacute;cio apropriado <quote>auto-baud</quote> (sic)
            em <filename>/etc/gettytab</filename>.  Por exemplo, se voc&ecirc; adicionar acima a entrada sugerida para
            iniciar em 19.2&nbsp;Kbps (a entrada em <filename>gettytab</filename> cont&eacute;m o ponto de in&iacute;cio
            <literal>V19200</literal>), sua entrada em <filename>ttys</filename> deve parecer com isso:</para>
            <programlisting>ttyd0   "/usr/libexec/getty V19200"   dialup on</programlisting>
	</sect4>
      </sect3>

      <sect3>
	<title><filename>/etc/rc.serial</filename></title>
	<indexterm>
	  <primary>rc files</primary>
	  <secondary><filename>rc.serial</filename></secondary>
	</indexterm>

	<para>Modems de alta velocidade como V.32, V.32bis, e V.34 precisam usar o controle f&iacute;sico
          de fluxo (<filename>RTS/CTS</filename>). Voc&ecirc; pode acidicionar o
          comando <command>stty</command> no arquivo <filename>/etc/rc.serial</filename> para
          definir o controle f&iacute;sico de fluxo do kernel do FreeBSD na porta do modem.</para>

	<para>Por exemplo, para definir a configura&ccedil;&atilde;o de <varname>crtscts</varname>, <literal>termios</literal>,
        na primeira porta serial de dispositivos de discagem (<devicename>COM2</devicename>) as seguintes
        linhas poderiam ser adicionadas ao <filename>/etc/rc.serial</filename>:</para>
	<programlisting># Configura&ccedil;&atilde;o de inicializa&ccedil;&atilde;o de porta serial
stty -f /dev/ttyid1 crtscts
stty -f /dev/cuaia1 crtscts</programlisting>

      </sect3>
    </sect2>

    <sect2>
      <title>Configura&ccedil;&otilde;es do Modem</title>

      <para>Caso voc&ecirc; possua um modem que possibilite que seus par&acirc;metros possam ser definidos
        em RAM n&atilde;o vol&aacute;til, voc&ecirc; precisar&aacute; utilizar um programa de terminal (como o Telix sobre
        &ms-dos; ou o <command>tip</command> sobre o FreeBSD) para definir os par&acirc;metros.  Conecte
        ao modem utilizando como inicial a mesma velocidade de comunica&ccedil;&atilde;o que o
	<command>getty</command> utilizar&aacute; e configure o modem com RAM n&atilde;o vol&aacute;til
        combinando com os seguintes requerimentos:</para>

      <itemizedlist>
	<listitem>
	  <para><acronym>CD</acronym> alertou quando conectado</para>
	</listitem>

	<listitem>
	  <para><acronym>DTR</acronym> alertou quando em opera&ccedil;&atilde;o; apagando DTR
	    e conectando a linha, e reinicia o modem</para>
	</listitem>

	<listitem>
	  <para><acronym>CTS</acronym> alertou a transmiss&atilde;o do controle de fluxo</para>
	</listitem>

	<listitem>
	  <para>Desativa o controle de fluxo <acronym>XON/XOFF</acronym></para>
	</listitem>

	<listitem>
	  <para><acronym>RTS</acronym> controle de fluxo de dados recebidos</para>
	</listitem>

	<listitem>
	  <para>Modo silencioso (n&atilde;o retorna c&oacute;digos)</para>
	</listitem>

	<listitem>
	  <para>Sem retorno de comando</para>
	</listitem>
      </itemizedlist>

      <para>Por favor, leia a documenta&ccedil;&atilde;o do seu modem para identificar quais comandos e configura&ccedil;&otilde;es
       de chaves DIP voc&ecirc; precisar&aacute; dar ao modem.</para>

      <para>Por exemplo, para definir os par&acirc;metros acima num modem externo &usrobotics;
	&sportster; 14,400 voc&ecirc; poderia dar estes comandos ao modem:</para>

      <programlisting>ATZ
AT&amp;C1&amp;D2&amp;H1&amp;I0&amp;R2&amp;W</programlisting>

      <para>Voc&ecirc; pode querer tamb&eacute;m usar esta oportunidade para fazer outros ajustes
        na configura&ccedil;&atilde;o do modem, como por exemplo se este utilizar&aacute; compress&atilde;o V.42bis ou MNP5.</para>

      <para>O modem externo &usrobotics; &sportster; 14,400 tamb&eacute;m possui algumas chaves DIP
        que necessitam ser configuradas; para outros modems talvez possa utilizar estas
        configura&ccedil;&otilde;es, por exemplo:</para>

      <itemizedlist>
	<listitem>
	  <para>Chave 1: PARA CIMA &mdash; DTR Normal</para>
	</listitem>

	<listitem>
	  <para>Chave 2: N/D (C&oacute;digos verbais como resultado/C&oacute;digos num&eacute;ricos como resultado)</para>
	</listitem>

	<listitem>
	  <para>Chave 3: PARA CIMA &mdash; Supress&atilde;o de c&oacute;digos de resultado</para>
	</listitem>

	<listitem>
	  <para>Chave 4: PARA BAIXO &mdash; Sem emiss&atilde;o de comandos quando desconectado</para>
	</listitem>

	<listitem>
	  <para>Chave 5: PARA CIMA &mdash; Resposta autom&aacute;tica</para>
	</listitem>

	<listitem>
	  <para>Chave 6: PARA CIMA &mdash; Detec&ccedil;&atilde;o normal de portadora</para>
	</listitem>

	<listitem>
	  <para>Chave 7: PARA CIMA &mdash; Carregar padr&otilde;es da NVRAM</para>
	</listitem>

	<listitem>
	  <para>Chave 8: N/D (Modo inteligente/Modo burro)</para>
	</listitem>
      </itemizedlist>

      <para>C&oacute;digos de resultados devem ser suprimidos para modems de discagem o que evitar&aacute; problemas
        que podem ocorrer se erroneamente o <command>getty</command> dar um prompt de <prompt>login:</prompt>
        para o modem que estiver em modo de comando e o modem neste estado retornaria o comando ou
        o c&oacute;digo de resultado. Esta sequ&ecirc;ncia pode resultar numa conversa boba entre o
 	<command>getty</command> e o modem.</para>

      <sect3>
	<title>Configura&ccedil;&atilde;o de velocidade travada ou fixa</title>

	<para>Para a configura&ccedil;&atilde;o de velocidade fixa ser&aacute; necess&aacute;rio definir no modem que este
          mantenha constante a velocidade de comunica&ccedil;&atilde;o entre ele e o computador independente
          da velocidade de comunica&ccedil;&atilde;o. Num modem externo &usrobotics; &sportster; 14,400 estes
          comandos fixar&atilde;o a velocidade de comunica&ccedil;&atilde;o entre o modem e o computador na velocidade
          fornecida pelos comandos:</para>

	<programlisting>ATZ
AT&amp;B1&amp;W</programlisting>
      </sect3>

      <sect3>
	<title>Configura&ccedil;&atilde;o de velocidades compat&iacute;veis</title>

	<para>Para a configura&ccedil;&atilde;o de velocidades compat&iacute;veis ou vari&aacute;veis voc&ecirc; precisar&aacute; configurar
          seu modem para que este ajuste sua velocidade de acordo com a velocidade que for percebida
          na chamada. Num modem externo &usrobotics; &sportster; 14,400 estes comandos travar&atilde;o
          a velocidade de corre&ccedil;&atilde;o de erros na mesma que for utilizada no envio dos comandos, por&eacute;m
          permitir&aacute; que a porta serial varie em conex&otilde;es sem corre&ccedil;&atilde;o de erros:</para>

	<programlisting>ATZ
AT&amp;B2&amp;W</programlisting>
      </sect3>

      <sect3>
	<title>Verificando a configura&ccedil;&atilde;o do modem</title>

	<para>A maioria dos modems de alta velocidade disponibiliza comandos para verifica&ccedil;&atilde;o
          dos par&acirc;metros correntes de opera&ccedil;&atilde;o numa forma humanamente leg&iacute;vel. Em um modem externo
          &usrobotics; &sportster; 14,400 o comando <command>ATI5</command> lista as configura&ccedil;&otilde;es
          armazenadas em RAM n&atilde;o vol&aacute;til. Para verificar as configura&ccedil;&otilde;es reais de opera&ccedil;&atilde;o do
          modem (como determinadas nas configura&ccedil;&otilde;es das chaves DIP), use o
          comando <command>ATZ</command> e ent&atilde;o <command>ATI4</command>.</para>

	<para>Se voc&ecirc; tem um tipo diferente de modem verifique o manual para saber como rechecar
          as configura&ccedil;&otilde;es feitas.</para>

      </sect3>
    </sect2>

    <sect2>
      <title>Resolu&ccedil;&atilde;o de Problemas</title>

      <para>Temos aqui alguns passos que voc&ecirc; pode seguir para verificar o modem
        no seu sistema em rela&ccedil;&atilde;o a discagem e atendimento.</para>

      <sect3>
	<title>Checagem do sistema FreeBSD</title>

	<para>Conecte fisicamente seu modem no seu sistema FreeBSD, inicie o sistema e
          se seu modem tiver luzes que indicam seu estado, observe se a luz indicadora <acronym>DTR</acronym>
          &eacute; sinalizada quando o prompt <prompt>login:</prompt> aparece no console do sistema
          &mdash; se a luz acender, significa que o FreeBSD iniciou o processo <command>getty</command>
          na porta correta de comunica&ccedil;&atilde;o e est&aacute; esperando pelo modem para aceitar uma chamada.</para>

	<para>Se a luz indicadora <acronym>DTR</acronym> n&atilde;o acender, execute login no sistema
            FreeBSD no console e atrav&eacute;s do comando <command>ps ax</command> verifique se o FreeBSD
            est&aacute; tentando executar o processo <command>getty</command> na porta correta. Voc&ecirc;
            deve ver uma linha como essa em meio aos processos listados:</para>

	<screen>  114 ??  I      0:00.10 /usr/libexec/getty V19200 ttyd0
  115 ??  I      0:00.10 /usr/libexec/getty V19200 ttyd1</screen>

	<para>Se voc&ecirc; ver algo diferente, como isso:</para>

	  <screen>  114 d0  I      0:00.10 /usr/libexec/getty V19200 ttyd0</screen>

	<para>e o modem ainda n&atilde;o ter aceitado uma chamada, isso significa que o <command>getty</command>
          completou a abertura das portas de comunica&ccedil;&atilde;o.  Isto pode indicar um problema com o cabo
          ou uma mal configura&ccedil;&atilde;o do modem, devido ao <command>getty</command> n&atilde;o estar habilitado
          a abrir a porta de comunica&ccedil;&atilde;o at&eacute; que o <acronym>CD</acronym> (detec&ccedil;&atilde;o de portadora) seja
          informado pelo modem.</para>

	<para>Caso voc&ecirc; n&atilde;o veja nenhum processo <command>getty</command> indicado para abrir a porta
	  <filename>ttyd<replaceable>N</replaceable></filename> designada, recheque suas entradas
          no arquivo <filename>/etc/ttys</filename> para ver se n&atilde;o h&aacute; erros. Verifique tamb&eacute;m o arquivo
          de log <filename>/var/log/messages</filename> para ver se n&atilde;o h&aacute; nenhuma mensagem de log
          do <command>init</command> ou do <command>getty</command> relativa a um problema. Se houver
          verifique novamente os arquivos de configura&ccedil;&atilde;o <filename>/etc/ttys</filename> e o
          <filename>/etc/gettytab</filename>, assim como o arquivo especial de dispositivo
          <filename>/dev/ttydN</filename>, buscando por qualquer erro, entradas erradas ou arquivos
          especiais de dispositivos perdidos.</para>
      </sect3>

      <sect3>
	<title>Tentando conectar-se ao sistema discando para ele</title>

	<para>Tente discar para o sistema; tenha certeza de usar 8 bits, sem paridade, e 1 bit
          de parada no sistema remoto. Se voc&ecirc; n&atilde;o conseguir um prompt correto, ou receber
          caracteres impr&oacute;prios, tente pressionar <keycode>Enter</keycode> uma vez por segundo. Se ainda
          assim voc&ecirc; n&atilde;o ver um prompt <prompt>login:</prompt> tente enviar um comando <command>BREAK</command>. Caso
          voc&ecirc; esteja utilizando um modem de alta velocidade para a conex&atilde;o discada, tente discar novamente ap&oacute;s
          o travamento da velocidade da interface para a linha de discagem(via o comando <command>AT&amp;B1</command> como num modem &usrobotics;
          &sportster;,  por exemplo).</para>)

	<para>Se voc&ecirc; ainda assim n&atilde;o conseguir um prompt <prompt>login:</prompt>, verifique novamente o
	  <filename>/etc/gettytab</filename> e recheque que:</para>

	<itemizedlist>
	  <listitem>
	    <para>O nome da capacidade inicial especificada no <filename>/etc/ttys</filename> para
              a linha combina com o nome da capacidade em <filename>/etc/gettytab</filename></para>
		</listitem>

	  <listitem>
	    <para>Cada entrada <literal>nx=</literal> combine com outro nome de capacidade <filename>gettytab</filename></para>
	  </listitem>

	  <listitem>
	    <para>Cada entrada <literal>tc=</literal> combine com outro nome de capacidade <filename>gettytab</filename></para>
	  </listitem>
	</itemizedlist>

	<para>Se voc&ecirc; disca mas o modem no sistema FreeBSD n&atilde;o responde, certifique-se de que o modem
          est&aacute; configurado para responder a chamada telef&ocirc;nica quando <acronym>DTR</acronym> &eacute; informado. Se
          o modem parecer estar configurado corretamente, verifique se o <acronym>DTR</acronym> da linha
          &eacute; informado observando as luzes indicadoras do modem(se ele tiver alguma).</para>

	<para>Se voc&ecirc; tiver feito tudo isso diversas vezes e ainda assim n&atilde;o funcionar, descanse
          e tente mais tarde. Se ainda assim n&atilde;o funcionar, voc&ecirc; pode, talvez, enviar um email
          para &a.questions; descrevendo seu modem e seu problema e pessoal bom da lista tentar&aacute; te ajudar.</para>
      </sect3>
    </sect2>

  </sect1>

  <sect1 id="dialout">
    <title>Servi&ccedil;o de Dial-out</title>
    <indexterm><primary>dial-out service</primary></indexterm>

    <para>A seguir, dicas para que seu sistema conecte em outro computador atrav&eacute;s de um modem.  Isto
      &eacute; apropriado para estabilizar uma sess&atilde;o de terminal com um sistema remoto.</para>

    <para>Isto pode ser &uacute;til para logar em uma BBS.</para>

    <para>Este tipo de conex&atilde;o pode ser de extremo aux&iacute;lio para conseguir um arquivo na Internet
      caso voc&ecirc; tenha problemas com PPP. Caso voc&ecirc; precise de fazer FTP de algo e o PPP falhar, use
      a sess&atilde;o de terminal para o FTP, ent&atilde;o use zmodem para tranferir o arquivo pra a sua m&aacute;quina.</para>

    <sect2>
      <title>Meu modem Stock Hayes n&atilde;o &eacute; suportado, o que posso fazer?</title>

      <para>Atualmente, a p&aacute;gina de manual para o <command>tip</command> est&aacute; desatualizada. H&aacute; um discador
        gen&eacute;rico para Hayes j&aacute; embutido. S&oacute; &eacute; necess&aacute;rio usar <literal>at=hayes</literal> no seu
        arquivo <filename>/etc/remote</filename>.</para>

      <para>O driver Hayes n&atilde;o &eacute; inteligente o bastante para reconhecer algumas das avan&ccedil;adas funcionalidades
        do modems modems&mdash;messages mais novos como <literal>BUSY</literal>, <literal>NO DIALTONE</literal>, ou
        <literal>CONNECT 115200</literal>, estas apenas ir&atilde;o confund&iacute;-lo. Voc&ecirc; deve desativar estas mensagens
        quando utilizar o <command>tip</command> (utilizando <command>ATX0&amp;W</command>).</para>

      <para>Al&eacute;m disso, o intervalo entre discagens do <command>tip</command> &eacute; de 60 segundos.
	Seu modem deve utilizar um valor menor ou este achar&aacute; que h&aacute; um problema na comunica&ccedil;&atilde;o.  Tente
        <command>ATS7=45&amp;W</command>.</para>

      <note>
	<para>O <command>tip</command> ainda n&atilde;o tem suporte completo a modems Hayes.  A
          solu&ccedil;&atilde;o &eacute; editar o arquivo <filename>tipconf.h</filename> no diret&oacute;rio <filename>/usr/src/usr.bin/tip/tip</filename>. Obviamente,
          voc&ecirc; precisar&aacute; do c&oacute;digo fonte do sistema para fazer isso.</para>

	<para>Altere a linha <literal>#define HAYES 0</literal> para <literal>#define HAYES 1</literal>. ent&atilde;o execute os comandos
          <command>make</command> e <command>make install</command>.  Tudo funcionar&aacute;  bem ap&oacute;s isso.</para>
      </note>
    </sect2>

    <sect2 id="direct-at">
      <title>Como eu fa&ccedil;o para entrar com estes comandos AT?</title>

      <indexterm>
        <primary><filename>/etc/remote</filename></primary>
      </indexterm>
      <para>Fa&ccedil;a o que &eacute; chamada de entrada <quote>direta</quote> em seu arquivo <filename>/etc/remote</filename>.  Por exemplo,
        se seu modem est&aacute; ligado fisicamente na primeira porta serial, a <filename>/dev/cuaa0</filename>,
	ent&atilde;o insira a seguinte linha:</para>

      <programlisting>cuaa0:dv=/dev/cuaa0:br#19200:pa=none</programlisting>

      <para>Informe a maior velocidade suportada pelo seu modem na habilidade br.
	ent&atilde;o, digite <command>tip cuaa0</command> e voc&ecirc; ser&aacute; conectado ao seu modem.</para>

      <para>Caso n&atilde;o exista um <filename>/dev/cuaa0</filename> no seu sistema, fa&ccedil;a isso:</para>

      <screen>&prompt.root; <userinput>cd /dev</userinput>
&prompt.root; <userinput>sh MAKEDEV cuaa0</userinput></screen>

      <para>Ou ent&atilde;o, fa&ccedil;a uso do comando <command>cu</command> como usu&aacute;rio <username>root</username> com o seguinte
        comando:</para>

      <screen>&prompt.root; <userinput>cu -l<replaceable>linha</replaceable> -s<replaceable>velocidade</replaceable></userinput></screen>

      <para><replaceable>linha</replaceable> &eacute; a porta serial (<filename>/dev/cuaa0</filename>) e a <replaceable>velocidade</replaceable> &eacute;
        a velocidade (<literal>57600</literal>).  Quando voc&ecirc; terminar de entrar com os comandos AT tecle <keycap>~.</keycap> para sair.</para>
    </sect2>

    <sect2>
      <title>O sinal <literal>@</literal> para a habilidade pn n&atilde;o funciona!</title>

      <para>O sinal <literal>@</literal> no n&uacute;mero do telefone diz ao tip para que este verifique
        o arquivo <filename>/etc/phones</filename> para buscar um n&uacute;mero telef&ocirc;nico. Mas o sinal
        <literal>@</literal> tamb&eacute;m &eacute; um caractere especial com habilidades em arquivos
        como o <filename>/etc/remote</filename>.  Fuja disso com um sinal <literal>/</literal>:</para>

      <programlisting>pn=\@</programlisting>
    </sect2>

    <sect2>
      <title>Como discar para um n&uacute;mero telef&ocirc;nico pela linha de comando?</title>

      <para>Coloque o que &eacute; chamado de entrada <quote>gen&eacute;rica</quote> no seu arquivo <filename>/etc/remote</filename>.  Por exemplo:</para>

      <programlisting>tip115200|Disca para qualquer n&uacute;mero telef&ocirc;nico &agrave; 115200 bps:\
        :dv=/dev/cuaa0:br#115200:at=hayes:pa=none:du:
tip57600|Disca para qualquer n&uacute;mero telef&ocirc;nico &agrave; 57600 bps:\
        :dv=/dev/cuaa0:br#57600:at=hayes:pa=none:du:</programlisting>

      <para>ent&atilde;o voc&ecirc; pode fazer coisas como:</para>

      <screen>&prompt.root; <userinput>tip -115200 5551234</userinput></screen>

      <para>Se voc&ecirc; preferir utilizar o comando <command>cu</command> ao inv&eacute;s do <command>tip</command>,
	use uma entrada gen&eacute;rica para o comando <literal>cu</literal>:</para>

      <programlisting>cu115200|Use o comando cu para discar &agrave; 115200bps:\
        :dv=/dev/cuaa1:br#57600:at=hayes:pa=none:du:</programlisting>

      <para>e digite:</para>

      <screen>&prompt.root; <userinput>cu 5551234 -s 115200</userinput></screen>
    </sect2>

    <sect2>
      <title>Toda vez que eu for fazer isso tenho que faz&ecirc;-lo na mesma velocidade?</title>

      <para>Coloque uma entrada para o <literal>tip1200</literal> ou <literal>cu1200</literal>, mas
        v&aacute; em frente e utilize qualquer velocidade que seja condizente com a habilidade br. O <command>tip</command> acha
        um bom padr&atilde;o 1200&nbsp;bps que &eacute; o motivo para a entrada <literal>tip1200</literal>.  Voc&ecirc;
        n&atilde;o &eacute; obrigado a usar 1200&nbsp;bps,
	no entanto.</para>
    </sect2>

    <sect2>
      <title>Eu acesso diversos computadores atrav&eacute;s de um servidor de terminais</title>

      <para>Particularmente para quem fica esperando at&eacute; estar conectado digitando <command>CONNECT &lt;host&gt;</command> toda vez,
        utilize a habilidade <literal>cm</literal> do tip. Por exemplo, estas entradas em <filename>/etc/remote</filename>:</para>

      <programlisting>pain|pain.deep13.com|Computador do Forrester:\
        :cm=CONNECT pain\n:tc=deep13:
muffin|muffin.deep13.com|Computador do Frank:\
        :cm=CONNECT muffin\n:tc=deep13:
deep13:Servidor de Terminais do Instituo Gizmonics:\
        :dv=/dev/cuaa2:br#38400:at=hayes:du:pa=none:pn=5551234:</programlisting>

      <para>permitir  que voc&ecirc; digite <command>tip pain</command> ou <command>tip muffin</command> para
        conectar aos computadores pain ou muffin, e <command>tip deep13</command> para acessar o servidor de
        terminais.</para>
    </sect2>

    <sect2>
      <title>O Tip pode tentar utilizar mais de uma linha para cada local?</title>

      <para>Este problema ocorre com frequ&ecirc;ncia em universidades que possuem diversas
        linhas com modems e milhares de estudantes tentando utiliz&aacute;-los.</para>

      <para>Fa&ccedil;a uma entrada para sua universidade em <filename>/etc/remote</filename> e use o <literal>@</literal> para
        a habilidade <literal>pn</literal>:</para>

      <programlisting>big-university:\
        :pn=\@:tc=dialout
dialout:\
        :dv=/dev/cuaa3:br#9600:at=courier:du:pa=none:</programlisting>

      <para>ent&atilde;o, informe os n&uacute;meros da universidade no <filename>/etc/phones</filename>:</para>

      <programlisting>big-university 5551111
big-university 5551112
big-university 5551113
big-university 5551114</programlisting>

      <para>O <command>tip</command> tentar&aacute; cada um dos n&uacute;meros em ordem e ent&atilde;o desistir&aacute;.  Se
        voc&ecirc; desejar que outras tentativas senha feitas, execute o <command>tip</command> num
        la&ccedil;o de repeti&ccedil;&atilde;o como o <quote>while</quote>.</para>
    </sect2>

    <sect2>
      <title>Por que eu tenho que pressionar <keycombo action="simul"><keycap>Ctrl</keycap>
          <keycap>P</keycap></keycombo> duas vezes para enviar um <keycombo action="simul">
          <keycap>Ctrl</keycap><keycap>P</keycap></keycombo>?</title>

      <para>A combina&ccedil;&atilde;o <keycombo action="simul"><keycap>Ctrl</keycap><keycap>P</keycap></keycombo> &eacute;
        o padr&atilde;o para <quote>for&ccedil;ar</quote> um caractere, utilizado para dizer ao <command>tip</command>
        que o pr&oacute;ximo caractere &eacute; um dado literal.  Voc&ecirc; pode utilizar o escape <command>~s</command>
        para definir o caractere de for&ccedil;ar qualquer outro, o que significa <quote>definir uma vari&aacute;vel.</quote></para>

      <para>Digite <command>~sforce=<replaceable>caractere &uacute;nico</replaceable></command>
	seguido pela nova linha. O <replaceable>caractere &uacute;nico</replaceable> &eacute; qualquer caractere. Se voc&ecirc;
        Se voc&ecirc; n&atilde;o informar o <replaceable>caractere &uacute;nico</replaceable>, ent&atilde;o ser&aacute; for&ccedil;ado
        o caractere nulo, que voc&ecirc; obtem com <keycombo action="simul"><keycap>Ctrl</keycap><keycap>2</keycap>
	</keycombo> ou <keycombo action="simul"><keycap>Ctrl</keycap><keycap>Space</keycap>
	</keycombo>. Um bom valor para o <replaceable>caractere &uacute;nico</replaceable> &eacute;
	<keycombo action="simul"><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>6</keycap>
	</keycombo>, que s&oacute; &eacute; utilizado em alguns servidores de terminais.</para>

      <para>Voc&ecirc; pode ter o caractere que quiser especificando num arquivo em seu diret&oacute;rio pessoal, <filename>&#36;HOME/.tiprc</filename>:</para>

      <programlisting>force=&lt;caractere &uacute;nico&gt;</programlisting>
    </sect2>

    <sect2>
      <title>Repentinamente tudo que &eacute; digitado aparece em letra mai&uacute;scula??</title>

      <para>Voc&ecirc; tem que pressionar <keycombo action="simul"><keycap>Ctrl</keycap>
	<keycap>A</keycap></keycombo>, o <quote>caractere de levantamento</quote> do <command>tip</command>
        especialmente designado para pessoas com a tecla caps-lock quebradas. Use o <command>~s</command> como
        abaixo para definir algo cab&iacute;vel como <literal>raisechar</literal>(caractere de levantamento). De fato,
        voc&ecirc; pode definir o mesmo que o caractere de for&ccedil;ar caso voc&ecirc; nunca venha a fazer uso destas
        funcionalidades.</para>

      <para>Temos aqui um exemplo, um simples arquivo .tiprc perfeito para usu&aacute;rios do
        <application>Emacs</application> que necessitam digitar <keycombo action="simul">
	  <keycap>Ctrl</keycap><keycap>2</keycap></keycombo> e <keycombo action="simul">
	  <keycap>Ctrl</keycap><keycap>A</keycap></keycombo> diversas vezes:</para>

      <programlisting>force=^^
raisechar=^^</programlisting>

      <para>O ^^ &eacute; o <keycombo action="simul"><keycap>Shift</keycap><keycap>Ctrl</keycap><keycap>6</keycap>
	</keycombo>.</para>

    </sect2>

    <sect2>
      <title>Como transfiro arquivos com o <command>tip</command>?</title>

      <para>Se voc&ecirc; estiver falando de um outro sistema &unix;, voc&ecirc; pode enviar e receber arquivos com
        <command>~p</command> (put) e <command>~t</command> (take).  Estes comandos executam
	<command>cat</command> e <command>echo</command> no sistema remoto para aceitar e enviar
        arquivos.  A sintaxe &eacute;:</para>

      <cmdsynopsis>
	<command>~p</command>
	<arg choice="plain">Arquivo-local</arg>
	<arg choice="opt">Arquivo-remoto</arg>
      </cmdsynopsis>

      <cmdsynopsis>
	<command>~t</command>
	<arg choice="plain">Arquivo-remoto</arg>
	<arg choice="opt">Arquivo-local</arg>
      </cmdsynopsis>

      <para>n&atilde;o h&aacute; checagem de erro, ent&atilde;o voc&ecirc; deve utilizar um outro protocolo para isso, como zmodem.</para>
    </sect2>

    <sect2>
      <title>Como eu executo o zmodem com o <command>tip</command>?</title>

      <para>Para receber um arquivo, inicie o programa de envio no sistema remoto.
	ent&atilde;o, digite <command>~C rz</command> para iniciar o recebimento localmente.</para>

      <para>Para enviar arquivos, inicie o programa de recebimento no sistema remoto.
	ent&atilde;o, digite <command>~C sz <replaceable>arquivos</replaceable></command> para envi&aacute;-los
        para o sistema remoto.</para>
    </sect2>
  </sect1>

  <sect1 id="serialconsole-setup">
    <sect1info>
      <authorgroup>
        <author>
	  <firstname>Kazutaka</firstname>
	  <surname>YOKOTA</surname>
	  <contrib>Contribui&ccedil;&atilde;o de </contrib>
	</author>
      </authorgroup>
      <authorgroup>
	<author>
	  <firstname>Bill</firstname>
	  <surname>Paul</surname>
	  <contrib>Baseado no documento de </contrib>
	</author>
      </authorgroup>
    </sect1info>
    <title>Configurando uma console serial</title>
    <indexterm><primary>serial console</primary></indexterm>

    <sect2 id="serialconsole-intro">
      <title>Introdu&ccedil;&atilde;o</title>

      <para>O FreeBSD tem a habilidade de bootar em um sistema que possua somente um terminal burro
        como console, conectado na porta serial.  Esta configura&ccedil;&atilde;o pode ser &uacute;til para duas classes
        de pessoas: administradores de sistema que desejam instalar o FreeBSD em m&aacute;quinas
        que n&atilde;o possuem teclado ou monitor conectados, e desenvolvedores que querem depurar o kernel
        ou drivers de dispositivos.</para>

      <para>Como descrito em <xref linkend="boot">, o FreeBSD emprega em seu boot tr&ecirc;s est&aacute;gios.  Os
        primeiros dois est&aacute;gios est&atilde;o no c&oacute;digo do bloco de boot que &eacute; armazenado no in&iacute;cio da parti&ccedil;&atilde;o
        do disco de boot do FreeBSD. O bloco de boot carregar&aacute; e executar&aacute; o carregador de
        boot (<filename>/boot/loader</filename>) como o terceiro est&aacute;gio de boot.</para>

      <para>Visando iniciar a console serial voc&Ecirc; deve configurar o c&oacute;digo do bloco de boot, o carregador
        de boot e o kernel do sistema.</para>

    </sect2>

    <sect2 id="serialconsole-howto">
      <title>Configura&ccedil;&atilde;o da console serial</title>

      <procedure>
	<step>
	  <para>Prepare um cabo serial.</para>

	  <indexterm><primary>null-modem cable</primary></indexterm>
	  <para>Voc&ecirc; precisar&aacute; de um cabo serial para modem ou um cabo serial padr&atilde;o
            e um conector para serial de modem. Visite <xref linkend="serial-cables-ports"> para
            um debate sobre cabos seriais.</para>
	</step>

	<step>
	  <para>Desconecte seu teclado.</para>

	  <para>A maioria dos sistemas PC testa a exist&ecirc;ncia de um teclado durante o POST (Power-On
	    Self-Test) e gerar&aacute; um erro se o teclado n&atilde;o for detectado. Algumas m&aacute;quinas reclamam
            a falta de um teclado de maneira tal que n&atilde;o prosseguem para o boot at&eacute;
            que se tenha um teclado conectado.</para>

	  <para>Se seu computador retorna este erro mas ainda assim prossegue com o boot ent&atilde;o
            voc&ecirc; n&atilde;o ter&aacute; que fazer nada especial. (Algumas m&aacute;quinas que possuem a BIOS Phoenix
            instalada apenas retornam <errorname>Keyboard failed</errorname> e continuam com
            o boot normalmente.)</para>

	  <para>Se seu computador se recusa a continuar o boot sem ter um teclado conectado ent&atilde;o
            voc&ecirc; ter&aacute; que configurar a BIOS para que este erro seja ignorado(se for poss&iacute;vel). Consulte
            o manual da sua placa-m&atilde;e para verificar como fazer isso.</para>

	  <tip>
	    <para>Configurar na BIOS que o teclado <quote>n&atilde;o foi instalado</quote> n&atilde;o
              significa que voc&ecirc; n&atilde;o poder&aacute; fazer uso do seu teclado posteriormente. Isso &eacute; para dizer para
              a BIOS que n&atilde;o cheque por um teclado quando a m&aacute;quina for ligada, o que
              far&aacute; com que ela n&atilde;o reporte que o teclado n&atilde;o est&aacute; conectado. Voc&ecirc; pode deixar
              o teclado conectado mesmo com esta configura&ccedil;&atilde;o feita e este funcionar&aacute; normalmente.</para>
	  </tip>

	  <note>
	    <para>Se seu sistema possue um mouse &ps2;, s&atilde;o grandes as chances de voc&ecirc; ter que desconectar
              seu mouse assim como seu teclado. Isto devido a mouses &ps2; compartilharem dispositivos
              f&iacute;sicos com teclados e deixando o mouse conectado pode resultar na detec&ccedil;&atilde;o de que
              o teclado tamb&eacute;m est&aacute; conectado. Isto &eacute; reportado pelo sistema Gateway 2000 Pentium 90&nbsp;MHz
              com a BIOS AMI, que se comporta desta maneira. No geral, isto n&atilde;o &eacute; um problema desde
              que o mouse n&atilde;o &eacute; muito &uacute;til sem um teclado.</para>
	  </note>
	</step>

	<step>
	  <para>Conecte o terminal burro na <devicename>COM1</devicename>
	    (<devicename>sio0</devicename>).</para>

	  <para>Se voc&ecirc; n&atilde;o possui um terminal burro, &eacute; poss¡vel fazer uso de um PC/XT antigo
            com um programa de modem, ou uma porta serial num outro sistema &unix;. Se voc&ecirc; n&atilde;o
            possui uma <devicename>COM1</devicename>
            (<devicename>sio0</devicename>), consiga uma. Para o que se pretende n&atilde;o h&aacute; uma maneira de selecionar outra
            porta que n&atilde;o a <devicename>COM1</devicename>, para ser utilizada com o bloco de boot sem recompil&aacute;-lo. Se
            voc&ecirc; j&aacute; est&aacute; usando a <devicename>COM1</devicename> para outro dispositivo, voc&ecirc; ter&aacute; que remov&ecirc;-lo temporariamente para instalar um novo bloco de boot e kernel, uma vez que
            seu FreeBSD esteja em execu&ccedil;&atilde;o. (&Eacute; assumido que a <devicename>COM1</devicename> estar&aacute;
            dispon&iacute;vel neste servidor sem monitor e teclado; se voc&ecirc; realmente tem a necessidade
            de usar a <devicename>COM1</devicename> para outra coisa (e voc&ecirc; n&atilde;o pode mudar a utiliza&ccedil;&atilde;o
            da <devicename>COM1</devicename> para a <devicename>COM2</devicename> (<devicename>sio1</devicename>)),
            ent&atilde;o provavelmente voc&ecirc; n&atilde;o tem que se pertubar com isso em primero lugar.)</para>
	</step>

	<step>
	  <para>Certifique-se de que o arquivo de configura&ccedil;&atilde;o do seu kernel tem as configura&ccedil;&otilde;es
            apropriadas para a <devicename>COM1</devicename>
            (<devicename>sio0</devicename>).</para>

	  <para>s&atilde;o configura&ccedil;&otilde;es relevantes:</para>

	  <variablelist>
	    <varlistentry>
	      <term><literal>0x10</literal></term>

	      <listitem>
		<para>Ativa o suporte a console nesta unidade. As outras configura&ccedil;&otilde;es ser&atilde;o ignoradas se esta
                  for definida. Atualmente, pelo menos uma unidade tem que ter a configura&ccedil;&atilde;o de suporte a console; &eacute;
                  desej&aacute;vel que seja a primeira (na ordem do arquivo de configura&ccedil;&atilde;o). Esta op&ccedil;&atilde;o sozinha n&atilde;o far&aacute; da porta serial uma porta para console. Defina a configura&ccedil;&atilde;o seguinte ou use a op&ccedil;&atilde;o <option>-h</option> descrita abaixo, junto com a configura&ccedil;&atilde;o de console.</para>
	      </listitem>
	    </varlistentry>

	    <varlistentry>
	      <term><literal>0x20</literal></term>

	      <listitem>
		<para>For&ccedil;a que esta unidade seja uma console (a menos que exista uma outra com maior prioridade),
                  sem levar em considera&ccedil;&atilde;o a op&ccedil;&atilde;o <option>-h</option> discutida abaixo.  Esta configura&ccedil;&atilde;o sobrep&otilde;e
                  a op&ccedil;&atilde;o <literal>COMCONSOLE</literal> na vers&atilde;o 2 do FreeBSD 2.<replaceable>X</replaceable>.  O valor de configura&ccedil;&atilde;o <literal>0x20</literal>
                  deve ser usado junto com o valor <option>0x10</option>.</para>
	      </listitem>
	    </varlistentry>

	    <varlistentry>
	      <term><literal>0x40</literal></term>

	      <listitem>
		<para>Reserve esta unidade (em conjunto com <literal>0x10</literal>) e
                  far&aacute; com que a unidade fique indispon&iacute;vel para acesso normal. Voc&ecirc; n&atilde;o deve configurar este valor para a unidade de porta serial que voc&ecirc; quer usar
                  como console. A &uacute;nica utiliza&ccedil;&atilde;o deste valor &eacute; para designar a unidade para
                  depura&ccedil;&atilde;o remota de kernel. Visite <ulink
                  url="../developers-handbook/index.html">The
                  Developer's Handbook</ulink> para maiores informa&ccedil;&otilde;es sobre depura&ccedil;&atilde;o remota.</para>

		<note>
		  <para>No FreeBSD&nbsp;4.0 ou acima a sem&acirc;ntica do valor <literal>0x40</literal>
                    &eacute; ligeiramente diferente e h&aacute; um outro valor para especificar que a porta serial ser&aacute; utilizada para depura&ccedil;&atilde;o remota.</para>
		</note>
	      </listitem>
	    </varlistentry>
	  </variablelist>

	  <para>Exemplo:</para>

	  <programlisting>device sio0 at isa? port IO_COM1 flags 0x10 irq 4</programlisting>

	  <para>Veja a p&aacute;gina de manual do &man.sio.4; para maiores detalhes.</para>

	  <para>Se os valores n&atilde;o forem definidos, voc&ecirc; precisar&aacute; executar UserConfig (em um console diferente)
            ou recompilar o kernel.</para>
	</step>

	<step>
	  <para>Crie o arquivo <filename>boot.config</filename> no diret&oacute;rio root da parti&ccedil;&atilde;o
            <literal>a</literal> no disco de boot.</para>

	  <para>Este arquivo instruir&aacute; o c&oacute;digo do bloco de boot do sistema. Visando ativar
            a console serial, voc&ecirc; precisar&aacute; de uma ou mais da seguinte op&ccedil;&atilde;o options&mdash;
            se voc&ecirc; quiser m&uacute;ltiplas op&ccedil;&otilde;es inclua todas na mesma linha:</para>

	  <variablelist>
	    <varlistentry>
	      <term><option>-h</option></term>

	      <listitem>
		<para>Alterna entre console interna e seriais.  Voc&ecirc; pode utilizar para
		  alternar dispositivos de console.  Por exemplo, se voc&ecirc; iniciar o sistema com a console interna (monitor de v&iacute;deo)
              voc&ecirc; pode utilizar <option>-h</option> para direcionar o carregamento do boot e o kernel para a porta
              serial como um dispositivo de console. No contr&aacute;rio, com <option>-h</option> voc&ecirc; pode direcionar da console
              da porta serial para a sua console do monitor de v&iacute;deo.</para>
	      </listitem>
	    </varlistentry>

	    <varlistentry>
	      <term><option>-D</option></term>

	      <listitem>
		<para>Alterna configura&ccedil;&otilde;es de console &uacute;nica ou dupla.  Numa configura&ccedil;&atilde;o de console &uacute;nica voc&ecirc; ter&aacute; unicamente
              a console interna(monitor de v&iacute;deo) ou a console da porta serial, dependendo do que foi configurado na
              op&ccedil;&atilde;o <option>-h</option>. Numa configura&ccedil;&atilde;o de console dupla, ambas, a console interna e a console serial
              ser&atilde;o utiliz&aacute;veis simult&acirc;neamente, independente da configura&ccedil;&atilde;o do <option>-h</option>. Entretanto, a
              configura&ccedil;&atilde;o de console dupla ter&aacute; efeito somente durante a execu&ccedil;&atilde;o do bloco de boot. Uma vez que o
              controlador de boot assumir o controle, a console especificada pela op&ccedil;&atilde;o <option>-h</option> ser&aacute; a
              &uacute;nica console.</para>
	      </listitem>
	    </varlistentry>

	    <varlistentry>
	      <term><option>-P</option></term>

	      <listitem>
		<para>Faz com que o bloco de boot tente detectar o teclado.  Caso n&atilde;o encontre, a op&ccedil;&atilde;o <option>-D</option> e <option>-h</option>
              s&atilde;o ajustadas automaticamente.</para>

		<note>
		  <para>Devido as defini&ccedil;&otilde;es de espa&ccedil;o da vers&atilde;o atual dos blocos de boot a op&ccedil;&atilde;o <option>-P</option>
                s&oacute; &eacute; capaz de detectar teclados extendidos.  Teclados com menos de 101 teclas (e sem as teclas F11 e F12)
                n&atilde;o poderao ser detectados. Alguns tipos de teclados de computadores port&aacute;teis(laptops) n&atilde;o poder&atilde;o ser detectados
                corretamente devido a esta limita&ccedil;&atilde;o.  Se este &eacute; o caso do seu sistema, voc&ecirc; ter&aacute; que abandonar o uso da
                op&ccedil;&atilde;o <option>-P</option>. Infelizmente, n&atilde;o h&aacute; op&ccedil;&otilde;es para este problema.</para>
		</note>
	      </listitem>
	    </varlistentry>
	  </variablelist>

	  <para>Utilize uma op&ccedil;&atilde;o qualquer de <option>-P</option> para selecionar a console automaticamente, ou a op&ccedil;&atilde;o
	    <option>-h</option> para ativar a console serial.</para>

	  <para>Voc&ecirc; pode ainda incluir outras op&ccedil;&otilde;es como bem descrito em &man.boot.8;.</para>

	  <para>As op&ccedil;&otilde;es, com exce&ccedil;&atilde;o da op&ccedil;&atilde;o <option>-P</option>, ser&atilde;o passadas ao carregador de boot (<filename>/boot/loader</filename>).  O
          carregador de boot determinar&aacute; entre o v&iacute;deo ou a porta serial qual dever&aacute; ser utilizado para a console examinando
          a configura&ccedil;&atilde;o da op&ccedil;&atilde;o <option>-h</option>. Isto significa que, se voc&ecirc; especificar a op&ccedil;&atilde;o <option>-D</option>
          mas n&atilde;o a op&ccedil;&atilde;o <option>-h</option> no arquivo <filename>/boot.config</filename>, voc&ecirc; poder&aacute; utilizar a porta serial
          como console apenas durante o bloco de boot;  o carregador de boot usar&aacute; o v&iacute;deo como console.</para>
	</step>

	<step>
	  <para>Boot o computador.</para>

	  <para>Quando voc&ecirc; iniciar o seu sistema FreeBSD, o bloco de boot listar&aacute; o conte&uacute;do de <filename>/boot.config</filename>
          na console.  Por exemplo:</para>

	  <screen>/boot.config: -P
Keyboard: no</screen>

	  <para>A segunda linha aparece somente se voc&ecirc; colocar a op&ccedil;&atilde;o <option>-P</option> no <filename>/boot.config</filename> que
          indicar&aacute; a presen&ccedil;a/aus&ecirc;ncia do teclado.  Estas mensagens ir&atilde;o tanto para a console serial, ou para a interna, ou ainda para ambas, depender&aacute;
          das op&ccedil;&otilde;es em <filename>/boot.config</filename>.</para>

	  <informaltable frame="none">
	    <tgroup cols="2">
	      <thead>
	        <row>
		  <entry>Op&ccedil;&otilde;es</entry>
		  <entry>Mensagens ir&atilde;o para</entry>
		</row>
	      </thead>

	      <tbody>
		<row>
		  <entry>none</entry>
		  <entry>console interna</entry>
		</row>

		<row>
		  <entry><option>-h</option></entry>
		  <entry>console serial</entry>
		</row>

		<row>
		  <entry><option>-D</option></entry>
		  <entry>console serial e interna</entry>
		</row>

		<row>
		  <entry><option>-Dh</option></entry>
		  <entry>console serial e interna</entry>
		</row>

		<row>
		  <entry><option>-P</option>, teclado presente</entry>
		  <entry>console interna</entry>
		</row>

		<row>
		  <entry><option>-P</option>, teclado ausente</entry>
		  <entry>console serial</entry>
		</row>
	      </tbody>
	    </tgroup>
	  </informaltable>

	  <para>Ap&oacute;s as mensagens acima haver&aacute; uma pequena pausa antes que bloco de boot continue o carregamento do boot
          e antes que qualquer mensagem seja listada na console. Sob circunst&acirc;ncias normais, voc&ecirc; n&atilde;o precisar&aacute; interromper o
          boot, mas voc&ecirc; pode querer fazer algo para certificar que tudo foi configurado corretamente.</para>

	  <para>Pressione qualquer tecla diferente de <keycode>Enter</keycode> na console para interromper o processo de boot.  O bloco
          de boot apresentar&aacute; um prompt que permitir&aacute; fazer a&ccedil;&otilde;es adicionais.  Voc&ecirc; deve ver algo como:</para>

	  <screen>>> FreeBSD/i386 BOOT
Default: 0:wd(0,a)/boot/loader
boot:</screen>

	  <para>Verifique se a mensagem acima aparece somente na serial ou na interna, ou ainda em ambas, de acordo como voc&ecirc; definiu
          em <filename>/boot.config</filename>.  Se a mensagem aparece na console correta, pressione <keycode>Enter</keycode> para
          continuar o processo de boot.</para>

	  <para>Se voc&ecirc; quer usar a console serial mas voc&ecirc; n&atilde;o v&ecirc; o prompt no terminal serial, algo est&aacute; errado em suas
          configura&ccedil;&otilde;es.  No momento certo, voc&ecirc; entrou com a op&ccedil;&atilde;o <option>-h</option> e pressionou
          Enter/Return (se porss&iacute;vel) para dizer ao bloco de boot(e ent&atilde;o ao carregador de boot e ao kernel) para
          escolher a porta serial para a console. Uma vez que o sistema estiver utiliz&aacute;vel, volte e verifique o que est&aacute; errado.</para>
	</step>
      </procedure>

      <para>Ap&oacute;s o carregamento do controlador de boot, voc&ecirc; estar&aacute; no terceiro est&aacute;gio
      do processo de boot, voc&ecirc; pode ainda alternar entre a console interna e a serial configurando
      as vari&aacute;veis de ambiente de maneira apropriada no carregador de boot. Consulte a <xref linkend="serialconsole-loader">.</para>
    </sect2>

  <sect2 id="serialconsole-summary">
    <title>Sum&aacute;rio</title>

      <para>Temos aqui um sum&aacute;rio das v&aacute;rias configura&ccedil;&otilde;es discutidas nesta se&ccedil;&atilde;o e eventualmente a console selecionada.</para>

      <sect3>
	<title>Caso 1: Voc&ecirc; definiu o valor 0x10 para <devicename>sio0</devicename></title>

	<programlisting>device sio0 at isa? port IO_COM1 flags 0x10 irq 4</programlisting>

	<informaltable frame="none">
	  <tgroup cols="4">
	    <thead>
	      <row>
		<entry>Op&ccedil;&otilde;es em /boot.config</entry>
		<entry>Console durante o bloco de boot</entry>
		<entry>Console durante o carregador de boot</entry>
		<entry>Console no kernel</entry>
	      </row>
	    </thead>

	    <tbody>
	      <row>
		<entry>nenhuma</entry>
		<entry>interna</entry>
		<entry>interna</entry>
		<entry>interna</entry>
	      </row>

	      <row>
		<entry><option>-h</option></entry>
		<entry>serial</entry>
		<entry>serial</entry>
		<entry>serial</entry>
	      </row>

	      <row>
		<entry><option>-D</option></entry>
		<entry>serial e interna</entry>
		<entry>interna</entry>
		<entry>interna</entry>
	      </row>

	      <row>
		<entry><option>-Dh</option></entry>
		<entry>serial e interna</entry>
		<entry>serial</entry>
		<entry>serial</entry>
	      </row>

	      <row>
		<entry><option>-P</option>, teclado presente</entry>
		<entry>interna</entry>
		<entry>interna</entry>
		<entry>interna</entry>
	      </row>

	      <row>
		<entry><option>-P</option>, teclado ausente</entry>
		<entry>serial e interna</entry>
		<entry>serial</entry>
		<entry>serial</entry>
	      </row>
	    </tbody>
	  </tgroup>
	</informaltable>
      </sect3>

      <sect3>
	<title>Caso 2: Voc&ecirc; definiu o valor 0x30 para sio0</title>

	<programlisting>device sio0 at isa? port IO_COM1 flags 0x30 irq 4</programlisting>

	<informaltable frame="none">
	  <tgroup cols="4">
	    <thead>
	      <row>
		<entry>Op&ccedil;&otilde;es em /boot.config</entry>
		<entry>Console durante o bloco de boot</entry>
		<entry>Console durante o carregador de boot</entry>
		<entry>Console no kernel</entry>
	      </row>
	    </thead>

	    <tbody>
	      <row>
		<entry>nenhuma</entry>
		<entry>interna</entry>
		<entry>interna</entry>
		<entry>serial</entry>
	      </row>

	      <row>
		<entry><option>-h</option></entry>
		<entry>serial</entry>
		<entry>serial</entry>
		<entry>serial</entry>
	      </row>

	      <row>
		<entry><option>-D</option></entry>
		<entry>serial e interna</entry>
		<entry>interna</entry>
		<entry>serial</entry>
	      </row>

	      <row>
		<entry><option>-Dh</option></entry>
		<entry>serial e interna</entry>
		<entry>serial</entry>
		<entry>serial</entry>
	      </row>

	      <row>
		<entry><option>-P</option>, teclado presente</entry>
		<entry>interna</entry>
		<entry>interna</entry>
		<entry>serial</entry>
	      </row>

	      <row>
		<entry><option>-P</option>, teclado ausente</entry>
		<entry>serial e interna</entry>
		<entry>serial</entry>
		<entry>serial</entry>
	      </row>
	    </tbody>
	  </tgroup>
	</informaltable>
      </sect3>
    </sect2>

    <sect2 id="serialconsole-tips">
      <title>Dicas para a console serial</title>

      <sect3>
	<title>Configurante a mais r&aacute;pida velocidade da porta serial</title>

	<para>Por padr&atilde;o, a porta serial est&aacute; configurada para: 9600 baud, 8
	  bits, sem paridade, e 1 bit de parada.  Se voc&Ecirc; quiser alterar a velocidade ter&aacute; de recompilar
        pelo menos o bloco de boot.  Adicione a seguinte linha ao <filename>/etc/make.conf</filename>
        e compile o novo bloco de boot:</para>

	<programlisting>BOOT_COMCONSOLE_SPEED=19200</programlisting>

	<para>Se a console serial est&aacute; configurada de maneira diferente de estar realizando o boot com <option>-h</option>, ou
        se a console serial utilizada pelo kernel &eacute; diferente da utilizada pelo bloco de boot, ent&atilde;o
        voc&ecirc; deve tamb&eacute;m adicionar a seguinte op&ccedil;&atilde;o no arquivo de configura&ccedil;&atilde;o do seu kernel e compilar um novo kernel:</para>

	<programlisting>options CONSPEED=19200</programlisting>
      </sect3>

      <sect3 id="serialconsole-com2">
	<title>Utilizando outra porta serial que n&atilde;o seja a <devicename>sio0</devicename> para a console</title>

	<para>Utilizar outra porta que n&atilde;o seja a <devicename>sio0</devicename> como a que a console usa necessitar&aacute; de
        recompila&ccedil;&atilde;o. Se voc&ecirc; deseja utilizar uma outra porta serial por qualquer que seja a raz&atilde;o, recompile o
        bloco de boot, o carregador de boot e o kernel como a seguir.</para>

	<procedure>
	  <step>
	    <para>Obtenha o c&oacute;digo fonte do kernel. (Visite o <xref linkend="cutting-edge">)</para>
	  </step>

	  <step>
	    <para>Edite o <filename>/etc/make.conf</filename> e configure <literal>BOOT_COMCONSOLE_PORT</literal> para
            o endere&ccedil;o da porta que voc&ecirc; quer utilizar(0x3F8, 0x2F8, 0x3E8 ou 0x2E8).  Somente de
            <devicename>sio0</devicename> a <devicename>sio3</devicename> (<devicename>COM1</devicename>
	      a <devicename>COM4</devicename>) podem ser utilizadas;  placas de multiseriais n&atilde;o funcionar&atilde;o. N&atilde;o &eacute; necess&aacute;ria
            a configura&ccedil;&atilde;o de interrup&ccedil;&atilde;o.</para>
	  </step>

	  <step>
	    <para>Crie um arquivo de configura&ccedil;&atilde;o de kernel personalizado e adicione as op&ccedil;&otilde;es apropriadas
            para a porta serial que voc&ecirc; deseja utilizar.  Por exemplo, se voc&ecirc; quer usar a <devicename>sio1</devicename>
	      (<devicename>COM2</devicename>) como console:</para>

	    <programlisting>device sio1 at isa? port IO_COM2 flags 0x10 irq 3</programlisting>

	    <para>ou</para>

	    <programlisting>device sio1 at isa? port IO_COM2 flags 0x30 irq 3</programlisting>

	    <para>As op&ccedil;&otilde;es de console para as outras portas n&atilde;o devem ser definidas.</para>
	  </step>

	  <step>
	    <para>Recompile e instale o bloco de boot e o carregador de boot:</para>

	    <screen>&prompt.root; <userinput>cd /sys/boot</userinput>
&prompt.root; <userinput>make</userinput>
&prompt.root; <userinput>make install</userinput></screen>
	  </step>

	  <step>
	    <para>Recontrua e instale o kernel.</para>
	  </step>

	  <step>
	    <para>Grave o bloco de boot no disco de boot com &man.disklabel.8; e boot com este novo kernel.</para>
	  </step>
	</procedure>
      </sect3>

      <sect3>
	<title>Entrando no DDB Debugger atrav&eacute;s da linha serial</title>

	<para>Se voc&ecirc; deseja definir que as informa&ccedil;&otilde;es de depura&ccedil;&atilde;o do kernel sejam emitidas na console
        serial (muito &uacute;til para diagn&oacute;sticos remotos, por&eacute;m tamb&eacute;m perigoso se houver
        a gera&ccedil;&atilde;o de um BREAK falso na porta serial!) ent&atilde;o voc&Ecirc; deve compilar o seu kernel com as seguintes op&ccedil;&otilde;es:</para>

	<programlisting>options BREAK_TO_DEBUGGER
options DDB</programlisting>
      </sect3>

      <sect3>
	<title>Obtendo um prompt de login na console serial</title>

	<para>Enquanto isso n&atilde;o &eacute; requerido, voc&ecirc; pode desejar obter um prompt de <emphasis>login</emphasis>
        atrav&eacute;s da linha serial, o que at&eacute; agora permitiria ver mensagens do boot e entrar em depura&ccedil;&atilde;o de kernel
        atrav&eacute;s da console serial.  Veja aqui como fazer isso.</para>

	<para>Abra o arquivo <filename>/etc/ttys</filename> com um editor de textos e localize as linhas:</para>

      <programlisting>ttyd0 "/usr/libexec/getty std.9600" unknown off secure
ttyd1 "/usr/libexec/getty std.9600" unknown off secure
ttyd2 "/usr/libexec/getty std.9600" unknown off secure
ttyd3 "/usr/libexec/getty std.9600" unknown off secure</programlisting>

	<para>De <literal>ttyd0</literal> a <literal>ttyd3</literal> que corresponde da <devicename>COM1</devicename> a
        <devicename>COM4</devicename>.  Altere onde est&aacute; <literal>off</literal> para <literal>on</literal> para
        as portas que desejar.  Se voc&ecirc; tiver alterado a velocidade da porta serial, voc&ecirc; precisar&aacute; alterar <literal>std.9600</literal> para
        a configura&ccedil;&atilde;o correspondente, como por exemplo <literal>std.19200</literal>.</para>

	<para>Voc&ecirc; pode tamb&eacute;m querer alterar o tipo do terminal de <literal>unknown</literal> para o tipo atual
        do seu terminal serial.</para>

	<para>Ap&oacute;s editar o arquivo voc&ecirc; deve executar <command>kill -HUP 1</command>
	  para que as altera&ccedil;&otilde;es realizadas tenham efeito.</para>
      </sect3>
    </sect2>
  spurious
    <sect2 id="serialconsole-loader">
      <title>Alterando a console atrav&eacute;s do carregador de boot</title>

      <para>Se&ccedil;&otilde;es anteriores descreveram como configurar uma console no bloco de boot. Esta se&ccedil;&atilde;o demonstra que voc&ecirc;
      pode especificar a console entrando com alguns comandos e configurando algumas vari&aacute;veis de ambiente no carregador de boot.  Como
      o carregador de boot &eacute; executado como o terceiro est&aacute;gio do processo de boot, depois do bloco de boot, as configura&ccedil;&otilde;es
      do carregador de boot ir&atilde;o sobrep&ocirc;r as configura&ccedil;&otilde;es definidas no bloco de boot.</para>

      <sect3>
	<title>Configurando a console serial</title>

	<para>Voc&ecirc; pode facilmente especificar ao carregador de boot e ao kernel para que estes usem a console serial
        adicionando apenas uma linha em <filename>/boot/loader.rc</filename>:</para>

	<programlisting>set console=comconsole</programlisting>

	<para>Isto ter&aacute; efeito apesar das configura&ccedil;&otilde;es feitas no bloco de boot, como discutido em se&ccedil;&otilde;es anteriores.</para>

	<para>Prefira colocar a linha acima como a primeira linha do <filename>/boot/loader.rc</filename> pois
        assim voc&ecirc; ver&aacute; as mensagens de boot na console serial o mais r&aacute;pido poss&iacute;vel.</para>

	<para>Da mesma maneira que voc&ecirc; pode especificar o uso da console interna com:</para>

	<programlisting>set console=vidconsole</programlisting>

	<para>Se voc&ecirc; n&atilde;o configurou a vari&aacute;vel de ambiente <envar>console</envar> no carregador de boot, este, e posteriormente o kernel,
        utilizar&atilde;o qualquer console indicada pela op&ccedil;&atilde;o <option>-h</option> no bloco de boot.</para>

	<para>Nas vers&otilde;es 3.2 ou posteriores, voc&ecirc; pode especificar a console em
	  <filename>/boot/loader.conf.local</filename> ou
	  <filename>/boot/loader.conf</filename>, assim tamb&eacute;m como no
	  <filename>/boot/loader.rc</filename>.  Neste m&eacute;todo, seu
	  <filename>/boot/loader.rc</filename> deve apresentar algo como:</para>

	<programlisting>include /boot/loader.4th
start</programlisting>

	<para>ent&atilde;o, crie o <filename>/boot/loader.conf.local</filename> e coloque a seguinte linha nele.</para>

	<programlisting>console=comconsole</programlisting>

	<para>ou</para>

	<programlisting>console=vidconsole</programlisting>

	<para>Visite a &man.loader.conf.5; para mais informa&ccedil;&otilde;es.</para>

	<note>
	  <para>Neste momento, o carregador de boot n&atilde;o tem equivalente para a op&ccedil;&atilde;o <option>-P</option> como
          no bloco de boot, e n&atilde;o h&aacute; o fornecimento de uma sele&ccedil;&atilde;o autom&aacute;tica de console interna ou serial baseadas
          na presen&ccedil;a do teclado.</para>
	</note>
      </sect3>

      <sect3>
	<title>Utilizando outra porta serial que n&atilde;o seja a <devicename>sio0</devicename> para a console</title>

	<para>Voc&ecirc; precisa recompilar o carregador de boot para poder utilizar outra porta serial que n&atilde;o seja a <devicename>sio0</devicename>
        como console. Siga os procedimentos descritos na <xref linkend="serialconsole-com2">.</para>
      </sect3>
    </sect2>

    <sect2 id="serialconsole-caveats">
      <title>Advert&ecirc;ncias</title>

      <para>A id&eacute;ia aqui &eacute; a de permitir que pessoas configurem servidores dedicados que n&atilde;o requerem dispositivos gr&aacute;ficos
      ou teclados conectados. Desafornutadamente, enquanto a maioria dos sistemas permitir&aacute; que seja feito o boot sem um
      teclado, h&aacute; um pequeno grupo de equipamentos que n&atilde;o permitir&atilde;o o boot sem um adaptador gr&aacute;fico(placa de v&iacute;deo). Computadores
      com AMI BIOS podem ser configurados para que fa&ccedil;am o boot sem um adaptador gr&aacute;fico instalado simplesmente definindo na configura&ccedil;&atilde;o da CMOS
      que o <quote>adaptador gr&aacute;fico n&atilde;o foi instalado</quote>.</para>

      <para>Entretanto, diversas m&aacute;quinas n&atilde;o disponibilizar&atilde;o esta op&ccedil;&atilde;o e se negar&atilde;o a continuarem at&eacute; o boot sem um
      adaptador gr&aacute;fico conectado ao equipamento. Com estas m&aacute;quinas voc&ecirc; ter&aacute; que ter alguma placa gr&aacute;fica conectada ao
      equipamento(mesmo que esta for uma p&eacute;ssima placa monocrom&aacute;tica) ainda que voc&ecirc; n&atilde;o conectar&aacute; o monitor. Voc&ecirc; tamb&eacute;m
      pode tentar instalar uma AMI BIOS.</para>
    </sect2>
  </sect1>
</chapter>

<!--
     Local Variables:
     mode: sgml
     sgml-declaration: "../chapter.decl"
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     sgml-parent-document: ("../book.sgml" "part" "chapter")
     End:
-->

