<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;
<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous
FreeBSD Entities//EN"> %freebsd;
<!ENTITY % newsgroups PUBLIC "-//FreeBSD//ENTITIES DocBook Newsgroup Entities//EN"> %newsgroups;
<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN">
%authors;
<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//EN"> %mailing-lists;
<!ENTITY % not.published "IGNORE">
]>

<article>
  <articleinfo>
    <title>Contribuindo para o FreeBSD</title>

    <pubdate>$FreeBSD: articles/contributing/article.sgml,v 1.9 2002/10/08 01:07:27 ebrandi Exp $</pubdate>

    <abstract>
      <para>Este artigo descreve as diferentes maneiras pelas quais um
	indiv&iacute;duo ou uma organiza&ccedil;&atilde;o podem
	contribuir com o projeto FreeBSD.</para> 
    </abstract>

    <authorgroup>
      <author>
	<firstname>Jordan</firstname>
	<surname>Hubbard</surname>
	<contrib>Colabora&ccedil;&atilde;o de </contrib>
      </author>
    </authorgroup>
  </articleinfo>

  <indexterm><primary>Contribuindo</primary></indexterm>

  <para>Ent&atilde;o voc&ecirc; quer contribuir para o  FreeBSD? Isso
    &eacute; &oacute;timo!  O FreeBSD depende das contribui&ccedil;&otilde;es
    da sua base de usu&aacute;rio para sobreviver.  Suas contribui&ccedil;&otilde;es
    n&atilde;o s&atilde;o apenas apreciadas, elas s&atilde;o vitais
    para que o FreeBSD continue crescendo.</para>

  <para>Ao contr&aacute;rio do que algumas pessoas podem tentar
    faz&ecirc;-lo acreditar, voc&ecirc; n&atilde;o precisa ser um
    programador super experiente ou amigo pessoal de um membro do
    <literal>Core Team</literal> do FreeBSD para ter suas
    contribui&ccedil;&otilde;es aceitas.  Um grande e crescente
    n&uacute;mero de colaboradores internacionais, de idades e de
    &aacute;reas t&eacute;cnicas extremamente variadas, desenvolvem o
    FreeBSD.  H&aacute; sempre mais trabalho a ser realizado do que
    pessoas dispon&iacute;veis para faz&ecirc;-lo, toda e qualquer
    ajuda &eacute; sempre bem vinda.</para>

  <para>O projeto FreeBSD &eacute; respons&aacute;vel por todo um
    sistema operacional, ou seja, &eacute; respons&aacute;vel  por
    muito mais que apenas um <literal>kernel</literal> ou alguns
    utilit&aacute;rios dispersos.  Da forma como est&aacute;, o nosso
    <literal>TODO</literal>, possui tarefas em uma escala muito ampla:
    da documenta&ccedil;, realiza&ccedil;&atilde;o beta testes e de
    apresenta&ccedil;&atilde;o, ao instalador do sistema e ao
    desenvolvimento altamente especializado de componentes para o
    <literal>kernel</literal>.  Pessoas de todos o n&iacute;veis de
    habilidade, de qualquer &aacute;rea t&eacute;cnica, certamente
    podem ajudar o projeto de alguma forma.</para>

  <para>As institui&ccedil;&otilde;es comerciais envolvidas com
    projetos relacionados ao FreeBSD, tamb&eacute;m devem nos
    contatar.  Voc&ecirc; necessita de uma extens&atilde;o especial
    fazer seu produto funcionar?  Voc&ecirc; ir&aacute; nos encontrar
    receptivos aos seus pedidos, desde que eles n&atilde;o sejam
    demasiadamente descabidos.  Voc&ecirc; est&aacute; trabalhando em
    um produto que agrega valor ao sistema?  Por favor deixe-nos
    saber!  N&oacute;s podemos trabalhar conjunto em algum aspecto
    dele.  O mundo do software livre desafia  muitos dos conceitos
    existentes sobre como um software &eacute; desenvolvido, vendido,
    e mantido, e n&oacute;s o incitamos a dar ao menos uma segunda
    olhada.</para>

  <sect1 id="contrib-what">
    <title>Do que est&atilde;o necessitando?</title>
    
    <para>A seguinte lista de tarefas e projetos secund&aacute;rios
      representa uma jun&ccedil;&atilde;o de v&aacute;rios
      <filename>TODO</filename>s e de solicita&ccedil;&otilde;s
      enviadas pelos usu&aacute;rios.</para> 

    <sect2 id="non-programmer-tasks">
      <title>Tarefas em execu&ccedil;&atilde;o por
	n&atilde;o-programadores.</title>

      <para>Muitas das pessoas que est&atilde;o envolvidas com o
	FreeBSD n&atilde;o s&atilde;o programadores.  O projeto inclui
	autores de documenta&ccedil;&atilde;o, <literal>Web
	  designers</literal>, e pessoas de suporte.  Tudo o que estas
	pessoas precisam para contribuir &eacute; algum tempo livre
	para investir e vontade de aprender.</para>

      <orderedlist>
	<listitem>
	  <para>Leia o <literal>FAQ</literal> e do manual
	    peri&oacute;dicamente.  Se algo estiver mal explicado,
	    desatualizado ou mesmo completamente errado, por favor nos
	    fa&ccedil;a saber.  Ou melhor, envie-nos a
	    corre&ccedil;&atilde;o.  (SGML n&atilde;o &eacute;
	    dif&iacute;cil de aprender, mas n&atilde;o exite nenhuma
	    obje&ccedil;&atilde;o &agrave;s submiss&otilde;es em
	    formato ASCII).</para>
	</listitem>

	<listitem>
	  <para>Ajude a traduzir a documenta&ccedil;&atilde;o do
	    FreeBSD para a sua l&iacute;ngua nativa.  Se a
	    documenta&ccedil;&atilde;o j&aacute; existir no seu idioma,
	    voc&ecirc; pode ajudar traduzir novos documentos ou
	    verificar se as tradu&ccedil;&otilde;es existentes  est&atilde;o
	    atualizadas.  Verifique primeiramente o <ulink
	      url="../../books/fdp-primer/translations.html">FAQ sobre
	      tradu&ccedil;&otilde;es</ulink> no guia do projeto de
	    documenta&ccedil;&atilde;o do FreeBSD.  Voc&ecirc;
	    n&atilde;o estar&aacute; se comprometendo a traduzir todos
	    os documentos do FreeBSD fazendo isto &mdash; como um
	    volunt&aacute;rio, voc&ecirc; pode traduzir muitos ou
	    poucos documentos, quantos desejar.  Uma vez que
	    algu&eacute;m come&ccedil;a a traduzir, outros quase
	    sempre se juntam ao esfor&ccedil;o.  Se voc&ecirc; tiver
	    tempo livre ou energia para traduzir somente uma pequena
	    parte da documenta&ccedil;&atilde;o, por favor de
	    prefer&ecirc;ncia a tradu&ccedil;&atilde;o das
	    instru&ccedil;&otilde;es de
	    instala&ccedil;&atilde;o.</para>
	</listitem>

	<listitem>
	  <para>Leia a &a.questions e o &ng.misc; ocasionalmente (ou
	    se poss&iacute;vel regularmente).  Pode ser muito
	    recompensador compartirlhar a sua experi&ecirc;ncia e
	    ajudar as outras pessoas a resolverem seus problemas;
	    Muitass vezes este processo o levar&aacute &agrave;
	    aprender coisas novas sozinho!  Estes f&oacute;rums
	    tamb&eacute;m podem ser uma fonte de id&eacute;ias para
	    assuntos aos quais se dedicar.</para>
	</listitem>
      </orderedlist>
    </sect2>

    <sect2 id="ongoing-programmer-tasks">

      <title>Tarefas em execu&ccedil;&atilde;o por programadores</title> 

        <para>A maioria das tarefas listadas aqui requerem um
	investimento consider&aacute;vel do tempo, ou um conhecimento
	profundo do kernel do FreeBSD, ou ambos.  Entretanto,
	tamb&eacute;m existem muitas tarefas &uacute;teis que
	s&atilde;o apropriadas para os hackers de <quote>final de
	  semana</quote>.</para> 
      <orderedlist>
	<listitem>
	  <para>Se voc&ecirc; executar o FreeBSD-CURRENT e tiver uma
	    boa conex&atilde;o Internet, existe uma m&aacute;quina
	    <hostid role="fqdn">current.FreeBSD.org</hostid> que
	    constr&oacute;i um release completo uma vez por dia
	    &mdash; tente instalar diariamente a ultima release gerada
	    e relate todas as falhas encontradas no processo.</para>
	</listitem>

	<listitem>
	  <para>Leia os &a.bugs;.  P&ecirc;de existir um problema o
	    qual voc&ecirc; possa comentar construtivamente ou mesmo
	    um <literal>patch</literal> que voc&ecirc; possa testar.
	    Ou voc&ecirc; mesmo pode tentar reparar um dos problemas
	    reportados.</para>
	</listitem>

	<listitem>
	  <para>Se voc&ecirc; souber de qualquer problema que tenha
	    sido corrigido com sucesso no <literal>-CURRENT</literal>
	    e cuja corre&ccedil;&atilde;o n&atilde;o tenha sido
	    aplicada ao <literal>-STABLE</literal> ao ap&oacute;s um
	    intervalo razoavel de tempo (normalmente algumas semanas),
	    envie ao <literal>committer</literal> um educado
	    lembrete.</para>
	</listitem>

	<listitem>
	  <para>Mova as contribui&ccedil;&otilde;es de software para
	    <filename>src/contrib</filename> na &aacute;rvore do
	    c&oacute;digo fonte.</para>
	</listitem>

	<listitem>
	  <para>Tenha certeza que o c&oacute;digo disponivel em
	    <filename>src/contrib</filename> est&aacute;
	    atualizado</para>
	</listitem>

	<listitem>
	  <para>Compile o sistema (ou apenas uma parte dele) com
	    <literal>warnings</literal> extras habilitados e limpe os
	    <literal>warnings</literal>.</para>
	</listitem>

	<listitem>
	  <para>Corriga os <literal>warnings</literal> para os
	    <literal>ports</literal> que ainda utilizam coisas
	    ultrapassadas tais como o <function>gets()</function> ou a
	    inclus&atilde;o do <filename>malloc.h</filename>.</para>
	</listitem>

	<listitem>
	  <para>Se voc&ecirc; contribuiu com algum
	    <literal>ports</literal>, envie seus
	    <literal>patchs</literal> de volta aos autores originais
	    (isto far&aacute; sua vida mais f&aacute;cil quando eles
	    lan&ccedil;arem a vers&atilde;o seguinte).</para>
	</listitem>

	<listitem>
	  <para>Consiga c&oacute;pias de padr&atilde;es formais tais
	    como POSIX.  Voc&ecirc; pode obter alguns
	    <literal>links</literal> sobre estes padr&otilde;es no
	    sitio web <ulink
	      url="http://www.FreeBSD.org/projects/c99/index.html">FreeBSD 
	      C99 e projeto de conformidade com o padr&atilde;o
	      POSIX</ulink>.  Compare o comportamento do FreeBSD
	    &agrave;quele requerido pelo padr&atilde;o.  Se o
	    comportamento diferir, particularmente em pontos obscuros
	    da especifica&ccedil;&atilde;o, envie-nos um
	    <literal>PR</literal> sobre ele.  Se voc&ecirc; puder e
	    descobrir como corrigi-lo, inclua um patch no seu
	    <literal>PR</literal>.  Se voc&ecirc; acredita que o
	    padr&atilde;o est&aacute; errado, pe&ccedil;a ao
	    comit&ecirc; de padr&otilde;es que considere a
	    pergunta.</para>
	</listitem>

	<listitem>
	  <para>Sugira novas tarefas para esta lista.</para>
	</listitem>
      </orderedlist>
    </sect2>

    <sect2>
      <title>Trabalho atrav&eacute;s da base de dados de PR
	(relat&oacute;rio de problemas)</title>

      <indexterm><primary>base de dados de relat&oacute;rios de
	  problemas</primary></indexterm>

      <para>A <ulink
	  url="http://www.FreeBSD.org/cgi/query-pr-summary.cgi">Lista
	  de PRs do FreeBSD</ulink> mostra todos os relat&oacute;rios de
	problemas ativos no momento e os pedidos de melhoria que foram
	submetidos pelos usu&aacute;rios do FreeBSD.  O banco de dados
	inclui tarefas para programadores e para
	n&atilde;o-programadores.  Consulte os PRs abertos, e veja se
	algum deles &eacute; de seu interesse.  Alguns deles podem ser
	tarefas muito simples que necessitam apenas que um o par extra
	de olhos olhe para eles e confirme que a
	corre&ccedil;&atilde;o proposta funciona.  Outros podem ser
	muito mais complexos, ou podem nem ter vindo com uma
	corre&ccedil;&atilde;o.</para> 

      <para>Comece com os PRs que ainda n&atilde;o foram
	atribu&iacute;dos a ningu&eacute;m.  Se um PR estiver
	atribu&iacute;do a alguma outra pessoa, mas se parecer com
	algo que voce pode cuidar, envie um e-mail para pessoa
	encarregada do mesmo e pergunte se voc&ecirc; pode trabalhar
	nele &mdash; ele pode j&aacute; ter um
	<literal>patch</literal> pronto para ser testado, ou
	voc&ecirc; pode discutir novas id&eacute;ias com ele.</para>
    </sect2>
  </sect1>

  <sect1 id="contrib-how">
    <title>Como contribuir</title>

    <para>As contribui&ccedil;&otilde;es ao sistema caem geralmente em
      uma ou em mais das seguintes 5 categorias:</para>

    <sect2 id="contrib-general">
      <title>Relat&oacute;rios do erro e coment&aacute;rios em
	geral</title>

      <para>
	Uma id&eacute;ia ou sugest&atilde;o t&eacute;cnica de interesse
	<emphasis>general</emphasis> deve ser enviada para a
	&a.hackers;.  Da mesma forma, pessoas com interesse neste tipo
	de assunto ( e com toler&acirc;ncia para um
	<emphasis>alto</emphasis> volume de mensagens!), devem se
	inscrever na &a.hackers; atrav&eacute;s do envio de um email para
	&a.majordomo;.  Consulte <ulink 
	url="../../books/handbook/eresources.html#ERESOURCES-MAIL">O
	Handbook do FreeBSD</ulink> para maiores informa&ccedil;&otilde;es sobre
	esta e outras listas de discuss&atilde;o.</para>
      
      <para>If you find a bug or are submitting a specific change,
	please report it using the &man.send-pr.1; program or its
	<ulink url="../../../../send-pr.html">WEB-based
	equivalent</ulink>.  Try to fill-in each field of the bug
	report.  Unless they exceed 65KB, include any patches directly
	in the report.  If the patch is suitable to be applied to the
	source tree put <literal>[PATCH]</literal> in the synopsis of
	the report.  When including patches, <emphasis>do
	not</emphasis> use cut-and-paste because cut-and-paste turns
	tabs into spaces and makes them unusable.  Consider
	compressing patches and using &man.uuencode.1; if they exceed
	20KB.  Upload very large submissions to <ulink
	url="ftp://ftp.FreeBSD.org/pub/FreeBSD/incoming/">ftp.FreeBSD.org:/pub/FreeBSD/incoming/</ulink>.</para>

      <para>After filing a report, you should receive confirmation
	along with a tracking number.  Keep this tracking number so
	that you can update us with details about the problem by
	sending mail to <email>bug-followup@FreeBSD.org</email>.  Use
	the number as the message subject, e.g.  <literal>"Re:
	kern/3377"</literal>.  Additional information for any bug
	report should be submitted this way.</para>

      <para>If you do not receive confirmation in a timely fashion (3
	days to a week, depending on your email connection) or are,
	for some reason, unable to use the &man.send-pr.1; command,
	then you may ask someone to file it for you by sending mail to
	the &a.bugs;.</para>

      <para>See also <ulink
  	URL="../../articles/problem-reports/article.html">this
  	article</ulink> on how to write good problem reports.</para>
    </sect2>

    <sect2>
      <title>Changes to the Documentation</title>

      <indexterm><primary>documentation submissions</primary></indexterm>

      <para>Changes to the documentation are overseen by the &a.doc;.
	Please look at the <ulink
	url="../../books/fdp-primer/index.html">FreeBSD Documentation
	Project Primer</ulink> for complete instructions.  Send
	submissions and changes (even small ones are welcome!) using
	&man.send-pr.1; as described in <link
	linkend="contrib-general">Bug Reports and General
	Commentary</link>.</para>
    </sect2>

    <sect2>
      <title>Changes to Existing Source Code</title>

      <indexterm><primary>FreeBSD-CURRENT</primary></indexterm>

      <para>An addition or change to the existing source code is a
	somewhat trickier affair and depends a lot on how far out of
	date you are with the current state of FreeBSD
	development. There is a special on-going release of FreeBSD
	known as <quote>FreeBSD-CURRENT</quote> which is made
	available in a variety of ways for the convenience of
	developers working actively on the system. See <ulink url="
	../../books/handbook/current-stable.html">The FreeBSD
	Handbook</ulink> for more information about getting and using
	FreeBSD-CURRENT.</para>

      <para>Working from older sources unfortunately means that your
	changes may sometimes be too obsolete or too divergent for
	easy re-integration into FreeBSD.  Chances of this can be
	minimized somewhat by subscribing to the &a.announce; and the
	&a.current; lists, where discussions on the current state of
	the system take place.</para>

      <para>Assuming that you can manage to secure fairly up-to-date sources
	to base your changes on, the next step is to produce a set of diffs to
	send to the FreeBSD maintainers.  This is done with the &man.diff.1;
	command.</para>

      <para>The preferred &man.diff.1; format for submitting patches
        is the unified output format generated by <command>diff
        -u</command>.  However, for patches that substantially change a
        region of code, a context output format diff generated by
        <command>diff -c</command> may be more readable and thus
        preferable.</para>

      <indexterm>
        <primary><command>diff</command></primary>
      </indexterm>

      <para>For example:</para>

      <para>
	<screen>&prompt.user; <userinput>diff -c oldfile newfile</userinput></screen>

	or

	<screen>&prompt.user; <userinput>diff -c -r olddir newdir</userinput></screen>

	would generate such a set of context diffs for the given
	source file or directory hierarchy.</para>

      <para>Likewise,
        <screen>&prompt.user; <userinput>diff -u oldfile newfile</userinput></screen>
        or
        <screen>&prompt.user; <userinput>diff -u -r olddir newdir</userinput></screen>

        would do the same, except in the unified diff format.</para>

      <para>See the manual page for &man.diff.1; for more details.</para>

      <para>Once you have a set of diffs (which you may test with the
	&man.patch.1; command), you should submit them for inclusion
	with FreeBSD.  Use the &man.send-pr.1; program as described in
	<link linkend="contrib-general">Bug Reports and General
	Commentary</link>.  <emphasis>Do not</emphasis> just send the
	diffs to the &a.hackers; or they will get lost! We greatly
	appreciate your submission (this is a volunteer project!);
	because we are busy, we may not be able to address it
	immediately, but it will remain in the PR database until we
	do.  Indicate your submission by including
	<literal>[PATCH]</literal> in the synopsis of the
	report.</para>

      <indexterm>
        <primary><command>uuencode</command></primary>
      </indexterm>

      <para>If you feel it appropriate (e.g. you have added, deleted,
	or renamed files), bundle your changes into a
	<command>tar</command> file and run the &man.uuencode.1;
	program on it.  Shar archives are also welcome.</para>

      <para>If your change is of a potentially sensitive nature,
	e.g. you are unsure of copyright issues governing its further
	distribution or you are simply not ready to release it without
	a tighter review first, then you should send it to &a.core;
	directly rather than submitting it with &man.send-pr.1;.  The
	&a.core; reaches a much smaller group of people who
	do much of the day-to-day work on FreeBSD.  Note that this
	group is also <emphasis>very busy</emphasis> and so you should
	only send mail to them where it is truly necessary.</para>

      <para>Please refer to &man.intro.9; and &man.style.9; for
	some information on coding style. We would appreciate it if
	you were at least aware of this information before submitting
	code.</para>
    </sect2>

    <sect2>
      <title>New Code or Major Value-Added Packages</title>

      <para>In the case of a significant contribution of a large body
	work, or the addition of an important new feature to FreeBSD,
	it becomes almost always necessary to either send changes as
	uuencoded tar files or upload them to a web or FTP site for
	other people to access.  If you do not have access to a web or
	FTP site, ask on an appropriate FreeBSD mailing list for
	someone to host the changes for you.</para>

      <para>When working with large amounts of code, the touchy
	subject of copyrights also invariably comes up.  Acceptable
	copyrights for code included in FreeBSD are:</para>

      <orderedlist>
  <indexterm><primary>BSD copyright</primary></indexterm>
	<listitem>
	  <para>The BSD copyright.  This copyright is most preferred
	    due to its <quote>no strings attached</quote> nature and
	    general attractiveness to commercial enterprises.  Far
	    from discouraging such commercial use, the FreeBSD Project
	    actively encourages such participation by commercial
	    interests who might eventually be inclined to invest
	    something of their own into FreeBSD.</para>
	</listitem>

  <indexterm><primary>GPL</primary><see>GNU General Public License</see></indexterm>
  <indexterm><primary>GNU General Public License</primary></indexterm>
	<listitem>
	  <para>The GNU General Public License, or <quote>GPL</quote>.
	    This license is not quite as popular with us due to the
	    amount of extra effort demanded of anyone using the code
	    for commercial purposes, but given the sheer quantity of
	    GPL'd code we currently require (compiler, assembler, text
	    formatter, etc) it would be silly to refuse additional
	    contributions under this license.  Code under the GPL also
	    goes into a different part of the tree, that being
	    <filename>/sys/gnu</filename> or
	    <filename>/usr/src/gnu</filename>, and is therefore easily
	    identifiable to anyone for whom the GPL presents a
	    problem.</para>
	</listitem>
      </orderedlist>

      <para>Contributions coming under any other type of copyright
	must be carefully reviewed before their inclusion into FreeBSD
	will be considered.  Contributions for which particularly
	restrictive commercial copyrights apply are generally
	rejected, though the authors are always encouraged to make
	such changes available through their own channels.</para>

      <para>To place a <quote>BSD-style</quote> copyright on your
	work, include the following text at the very beginning of
	every source code file you wish to protect, replacing the text
	between the <literal>%%</literal> with the appropriate
	information:</para>

      <programlisting>Copyright (c) %%proper_years_here%%
        %%your_name_here%%, %%your_state%%  %%your_zip%%.  
	All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions
are met:
1. Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer as
   the first lines of this file unmodified.
2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

THIS SOFTWARE IS PROVIDED BY %%your_name_here%% ``AS IS'' AND ANY EXPRESS OR
IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL %%your_name_here%% BE LIABLE FOR ANY DIRECT, INDIRECT,
INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

        &#36;Id&#36;</programlisting>

      <para>For your convenience, a copy of this text can be found in
	<filename>/usr/share/examples/etc/bsd-style-copyright</filename>.</para>
    </sect2>

    <sect2>
      <title>Money, Hardware or Internet Access</title>

      <para>We are always very happy to accept donations to further
	the cause of the FreeBSD Project and, in a volunteer effort
	like ours, a little can go a long way! Donations of hardware
	are also very important to expanding our list of supported
	peripherals since we generally lack the funds to buy such
	items ourselves.</para>

      <sect3>
	<title><anchor id="donations">Donating Funds</title>

	<para>The FreeBSD Foundation is a non-profit, tax-exempt
	  foundation established to further the goals of the FreeBSD
	  Project.  As a 501(c)3 entity, the Foundation is generally
	  exempt from US federal income tax as well as Colorado State
	  income tax.  Donations to a tax-exempt entity are often
	  deductible from taxable federal income.</para>

	<para>Donations may be sent in check form to:
	  <address>
	    The FreeBSD Foundation
	    <street>7321 Brockway Dr.</street>
	    <city>Boulder</city>, <state>CO</state> <postcode>80303</postcode>
	    <country>USA</country>
	  </address>
	</para>

	<para>The FreeBSD Foundation is now able to accept donations
	  through the web with PayPal.  To place a donation, please
	  visit the Foundation <ulink
	  url="http://www.freebsdfoundation.org">web
	  site</ulink>.</para>

	<para>More information about the FreeBSD Foundation can be
	  found in <ulink
	  url="http://people.freebsd.org/~jdp/foundation/announcement.html">The
	  FreeBSD Foundation -- an Introduction</ulink>.  To contact
	  the Foundation by email, write to
	  <email>bod@FreeBSDFoundation.org</email>.</para>
      </sect3>

      <sect3>
	<title>Donating Hardware</title>
  <indexterm><primary>donations</primary></indexterm>

	<para>Donations of hardware in any of the 3 following
	  categories are also gladly accepted by the FreeBSD
	  Project:</para>

	<itemizedlist>
	  <listitem>
	    <para>General purpose hardware such as disk drives, memory
	      or complete systems should be sent to the FreeBSD
	      Foundation address listed in the <link linkend="donations">donating
	      funds</link> section.</para>
	  </listitem>

	  <listitem>
	    <para>Hardware for which ongoing compliance testing is
	      desired.  We are currently trying to put together a
	      testing lab of all components that FreeBSD supports so
	      that proper regression testing can be done with each new
	      release.  We are still lacking many important pieces
	      (network cards, motherboards, etc) and if you would like
	      to make such a donation, please contact &a.dg; for
	      information on which items are still required.</para>
	  </listitem>

	  <listitem>
	    <para>Hardware currently unsupported by FreeBSD for which
	      you would like to see such support added.  Please
	      contact the &a.core; before sending such items as we
	      will need to find a developer willing to take on the
	      task before we can accept delivery of new
	      hardware.</para>
	  </listitem>
	</itemizedlist>
      </sect3>

      <sect3>
	<title>Donating Internet Access</title>

	<para>We can always use new mirror sites for FTP, WWW or
	  <command>cvsup</command>.  If you would like to be such a
	  mirror, please contact the &a.hubs; for more
	  information.</para>
      </sect3>
    </sect2>
  </sect1>

</article>

<!-- 
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
