<!DOCTYPE article PUBLIC "-//FreeBSD//DTD DocBook V4.1-Based Extension//EN" [
<!ENTITY % man PUBLIC "-//FreeBSD//ENTITIES DocBook Manual Page Entities//EN">
%man;
<!ENTITY % freebsd PUBLIC "-//FreeBSD//ENTITIES DocBook Miscellaneous
FreeBSD Entities//EN"> %freebsd;
<!ENTITY % newsgroups PUBLIC "-//FreeBSD//ENTITIES DocBook Newsgroup Entities//EN"> %newsgroups;
<!ENTITY % authors PUBLIC "-//FreeBSD//ENTITIES DocBook Author Entities//EN">
%authors;
<!ENTITY % mailing-lists PUBLIC "-//FreeBSD//ENTITIES DocBook Mailing List Entities//EN"> %mailing-lists;
<!ENTITY % trademarks PUBLIC "-//FreeBSD//ENTITIES DocBook Trademark Entities//EN">
%trademarks;
<!ENTITY % not.published "IGNORE">
]>

<article>
  <articleinfo>
    <title>Contribuindo para o FreeBSD</title>

    <pubdate>$FreeBSD: articles/contributing/article.sgml,v 1.15 2003/12/11 02:00:09 ebrandi Exp $</pubdate>

    <abstract>
      <para>Este artigo descreve as diferentes maneiras pelas quais um
	indiv&iacute;duo ou uma organiza&ccedil;&atilde;o podem
	contribuir com o projeto FreeBSD.</para> 
    </abstract>

    <authorgroup>
      <author>
	<firstname>Jordan</firstname>
	<surname>Hubbard</surname>
	<contrib>Colabora&ccedil;&atilde;o de </contrib>
      </author>
    </authorgroup>
  </articleinfo>

  <indexterm><primary>Contribuindo</primary></indexterm>

  <para>Ent&atilde;o voc&ecirc; quer contribuir para o  FreeBSD? Isso
    &eacute; &oacute;timo!  O FreeBSD depende das
    contribui&ccedil;&otilde;es da sua base de usu&aacute;rio para
    sobreviver.  Suas contribui&ccedil;&otilde;es n&atilde;o
    s&atilde;o apenas apreciadas, elas s&atilde;o vitais para que o
    FreeBSD continue crescendo.</para>

  <para>Ao contr&aacute;rio do que algumas pessoas podem tentar
    faz&ecirc;-lo acreditar, voc&ecirc; n&atilde;o precisa ser um
    programador super experiente ou amigo pessoal de um membro do
    <literal>Core Team</literal> do FreeBSD para ter suas
    contribui&ccedil;&otilde;es aceitas.  Um grande e crescente
    n&uacute;mero de colaboradores internacionais, de idades e de
    &aacute;reas t&eacute;cnicas extremamente variadas, desenvolvem o
    FreeBSD.  H&aacute; sempre mais trabalho a ser realizado do que
    pessoas dispon&iacute;veis para faz&ecirc;-lo, toda e qualquer
    ajuda &eacute; sempre bem vinda.</para>

  <para>O projeto FreeBSD &eacute; respons&aacute;vel por todo um
    sistema operacional, ou seja, &eacute; respons&aacute;vel  por
    muito mais que apenas um <literal>kernel</literal> ou alguns
    utilit&aacute;rios dispersos.  Da forma como est&aacute;, o nosso
    <literal>TODO</literal>, possui tarefas em uma escala muito ampla:
    da documenta&ccedil;, realiza&ccedil;&atilde;o beta testes e de
    apresenta&ccedil;&atilde;o, ao instalador do sistema e ao
    desenvolvimento altamente especializado de componentes para o
    <literal>kernel</literal>.  Pessoas de todos o n&iacute;veis de
    habilidade, de qualquer &aacute;rea t&eacute;cnica, certamente
    podem ajudar o projeto de alguma forma.</para>

  <para>As institui&ccedil;&otilde;es comerciais envolvidas com
    projetos relacionados ao FreeBSD, tamb&eacute;m devem nos
    contatar.  Voc&ecirc; necessita de uma extens&atilde;o especial
    fazer seu produto funcionar?  Voc&ecirc; ir&aacute; nos encontrar
    receptivos aos seus pedidos, desde que eles n&atilde;o sejam
    demasiadamente descabidos.  Voc&ecirc; est&aacute; trabalhando em
    um produto que agrega valor ao sistema?  Por favor deixe-nos
    saber!  N&oacute;s podemos trabalhar conjunto em algum aspecto
    dele.  O mundo do software livre desafia  muitos dos conceitos
    existentes sobre como um software &eacute; desenvolvido, vendido,
    e mantido, e n&oacute;s o incitamos a dar ao menos uma segunda
    olhada.</para>

  <sect1 id="contrib-what">
    <title>Do que est&atilde;o necessitando?</title>
    
    <para>A seguinte lista de tarefas e projetos secund&aacute;rios
      representa uma jun&ccedil;&atilde;o de v&aacute;rios
      <filename>TODO</filename>s e de solicita&ccedil;&otilde;s
      enviadas pelos usu&aacute;rios.</para> 

    <sect2 id="non-programmer-tasks">
      <title>Tarefas em execu&ccedil;&atilde;o por
	n&atilde;o-programadores.</title>

      <para>Muitas das pessoas que est&atilde;o envolvidas com o
	FreeBSD n&atilde;o s&atilde;o programadores.  O projeto inclui
	autores de documenta&ccedil;&atilde;o, <literal>Web
	  designers</literal>, e pessoas de suporte.  Tudo o que estas
	pessoas precisam para contribuir &eacute; algum tempo livre
	para investir e vontade de aprender.</para>

      <orderedlist>
	<listitem>
	  <para>Leia o <literal>FAQ</literal> e do manual
	    peri&oacute;dicamente.  Se algo estiver mal explicado,
	    desatualizado ou mesmo completamente errado, por favor nos
	    fa&ccedil;a saber.  Ou melhor, envie-nos a
	    corre&ccedil;&atilde;o.  (SGML n&atilde;o &eacute;
	    dif&iacute;cil de aprender, mas n&atilde;o exite nenhuma
	    obje&ccedil;&atilde;o &agrave;s submiss&otilde;es em
	    formato ASCII).</para>
	</listitem>

	<listitem>
	  <para>Ajude a traduzir a documenta&ccedil;&atilde;o do
	    FreeBSD para a sua l&iacute;ngua nativa.  Se a
	    documenta&ccedil;&atilde;o j&aacute; existir no seu
	    idioma, voc&ecirc; pode ajudar traduzir novos documentos
	    ou verificar se as tradu&ccedil;&otilde;es existentes
	    est&atilde;o atualizadas.  Verifique primeiramente o
	    <ulink url="../../books/fdp-primer/translations.html">FAQ
	      sobre tradu&ccedil;&otilde;es</ulink> no guia do projeto
	    de documenta&ccedil;&atilde;o do FreeBSD.  Voc&ecirc;
	    n&atilde;o estar&aacute; se comprometendo a traduzir todos
	    os documentos do FreeBSD fazendo isto &mdash; como um
	    volunt&aacute;rio, voc&ecirc; pode traduzir muitos ou
	    poucos documentos, quantos desejar.  Uma vez que
	    algu&eacute;m come&ccedil;a a traduzir, outros quase
	    sempre se juntam ao esfor&ccedil;o.  Se voc&ecirc; tiver
	    tempo livre ou energia para traduzir somente uma pequena
	    parte da documenta&ccedil;&atilde;o, por favor de
	    prefer&ecirc;ncia a tradu&ccedil;&atilde;o das
	    instru&ccedil;&otilde;es de
	    instala&ccedil;&atilde;o.</para>
	</listitem>

	<listitem>
	  <para>Leia a &a.questions e o &ng.misc; ocasionalmente (ou
	    se poss&iacute;vel regularmente).  Pode ser muito
	    recompensador compartirlhar a sua experi&ecirc;ncia e
	    ajudar as outras pessoas a resolverem seus problemas;
	    Muitass vezes este processo o levar&aacute &agrave;
	    aprender coisas novas sozinho!  Estes f&oacute;rums
	    tamb&eacute;m podem ser uma fonte de id&eacute;ias para
	    assuntos aos quais se dedicar.</para>
	</listitem>
      </orderedlist>
    </sect2>

    <sect2 id="ongoing-programmer-tasks">

      <title>Tarefas em execu&ccedil;&atilde;o por programadores</title> 

        <para>A maioria das tarefas listadas aqui requerem um
	investimento consider&aacute;vel do tempo, ou um conhecimento
	profundo do kernel do FreeBSD, ou ambos.  Entretanto,
	tamb&eacute;m existem muitas tarefas &uacute;teis que
	s&atilde;o apropriadas para os hackers de <quote>final de
	  semana</quote>.</para> 
      <orderedlist>
	<listitem>
	  <para>Se voc&ecirc; executar o FreeBSD-CURRENT e tiver uma
	    boa conex&atilde;o Internet, existe uma m&aacute;quina
	    <hostid role="fqdn">current.FreeBSD.org</hostid> que
	    constr&oacute;i um release completo uma vez por dia
	    &mdash; tente instalar diariamente a ultima release gerada
	    e relate todas as falhas encontradas no processo.</para>
	</listitem>

	<listitem>
	  <para>Leia os &a.bugs;.  Pode existir um problema o
	    qual voc&ecirc; possa comentar construtivamente ou mesmo
	    um <literal>patch</literal> que voc&ecirc; possa testar.
	    Ou voc&ecirc; mesmo pode tentar reparar um dos problemas
	    reportados.</para>
	</listitem>

	<listitem>
	  <para>Se voc&ecirc; souber de qualquer problema que tenha
	    sido corrigido com sucesso no <literal>-CURRENT</literal>
	    e cuja corre&ccedil;&atilde;o n&atilde;o tenha sido
	    aplicada ao <literal>-STABLE</literal> ao ap&oacute;s um
	    intervalo razoavel de tempo (normalmente algumas semanas),
	    envie ao <literal>committer</literal> um educado
	    lembrete.</para>
	</listitem>

	<listitem>
	  <para>Mova as contribui&ccedil;&otilde;es de software para
	    <filename>src/contrib</filename> na &aacute;rvore do
	    c&oacute;digo fonte.</para>
	</listitem>

	<listitem>
	  <para>Tenha certeza que o c&oacute;digo disponivel em
	    <filename>src/contrib</filename> est&aacute;
	    atualizado</para>
	</listitem>

	<listitem>
	  <para>Compile o sistema (ou apenas uma parte dele) com
	    <literal>warnings</literal> extras habilitados e limpe os
	    <literal>warnings</literal>.</para>
	</listitem>

	<listitem>
	  <para>Corriga os <literal>warnings</literal> para os
	    <literal>ports</literal> que ainda utilizam coisas
	    ultrapassadas tais como o <function>gets()</function> ou a
	    inclus&atilde;o do <filename>malloc.h</filename>.</para>
	</listitem>

	<listitem>
	  <para>Se voc&ecirc; contribuiu com algum
	    <literal>ports</literal>, envie seus
	    <literal>patchs</literal> de volta aos autores originais
	    (isto far&aacute; sua vida mais f&aacute;cil quando eles
	    lan&ccedil;arem a vers&atilde;o seguinte).</para>
	</listitem>

	<listitem>
	  <para>Consiga c&oacute;pias de padr&atilde;es formais tais
	    como &posix;.  Voc&ecirc; pode obter alguns
	    <literal>links</literal> sobre estes padr&otilde;es no
	    sitio web <ulink
	      url="http://www.FreeBSD.org/projects/c99/index.html">FreeBSD 
	      C99 e projeto de conformidade com o padr&atilde;o
	      &posix;</ulink>.  Compare o comportamento do FreeBSD
	    &agrave;quele requerido pelo padr&atilde;o.  Se o
	    comportamento diferir, particularmente em pontos obscuros
	    da especifica&ccedil;&atilde;o, envie-nos um
	    <literal>PR</literal> sobre ele.  Se voc&ecirc; puder e
	    descobrir como corrigi-lo, inclua um patch no seu
	    <literal>PR</literal>.  Se voc&ecirc; acredita que o
	    padr&atilde;o est&aacute; errado, pe&ccedil;a ao
	    comit&ecirc; de padr&otilde;es que considere a
	    pergunta.</para>
	</listitem>

	<listitem>
	  <para>Sugira novas tarefas para esta lista.</para>
	</listitem>
      </orderedlist>
    </sect2>

    <sect2>
      <title>Trabalho atrav&eacute;s da base de dados de PR
	(relat&oacute;rio de problemas)</title>

      <indexterm><primary>base de dados de relat&oacute;rios de
	  problemas</primary></indexterm>

      <para>A <ulink
	  url="http://www.FreeBSD.org/cgi/query-pr-summary.cgi">Lista
	  de PRs do FreeBSD</ulink> mostra todos os relat&oacute;rios
	de problemas ativos no momento e os pedidos de melhoria que
	foram submetidos pelos usu&aacute;rios do FreeBSD.  O banco de
	dados inclui tarefas para programadores e para
	n&atilde;o-programadores.  Consulte os PRs abertos, e veja se
	algum deles &eacute; de seu interesse.  Alguns deles podem ser
	tarefas muito simples que necessitam apenas que um o par extra
	de olhos olhe para eles e confirme que a
	corre&ccedil;&atilde;o proposta funciona.  Outros podem ser
	muito mais complexos, ou podem nem ter vindo com uma
	corre&ccedil;&atilde;o.</para> 

      <para>Comece com os PRs que ainda n&atilde;o foram
	atribu&iacute;dos a ningu&eacute;m.  Se um PR estiver
	atribu&iacute;do a alguma outra pessoa, mas se parecer com
	algo que voce pode cuidar, envie um e-mail para pessoa
	encarregada do mesmo e pergunte se voc&ecirc; pode trabalhar
	nele &mdash; ele pode j&aacute; ter um
	<literal>patch</literal> pronto para ser testado, ou
	voc&ecirc; pode discutir novas id&eacute;ias com ele.</para>
    </sect2>
  </sect1>

  <sect1 id="contrib-how">
    <title>Como contribuir</title>

    <para>As contribui&ccedil;&otilde;es ao sistema caem geralmente em
      uma ou em mais das seguintes 5 categorias:</para>

    <sect2 id="contrib-general">
      <title>Relat&oacute;rios do erro e coment&aacute;rios em
	geral</title>

      <para>
	Uma id&eacute;ia ou sugest&atilde;o t&eacute;cnica de
	interesse <emphasis>general</emphasis> deve ser enviada para a
	&a.hackers;.  Da mesma forma, pessoas com interesse neste tipo
	de assunto ( e com toler&acirc;ncia para um
	<emphasis>alto</emphasis> volume de mensagens!), devem se
	inscrever na &a.hackers; atrav&eacute;s do envio de um email
	para &a.majordomo;.  Consulte <ulink
	  url="../../books/handbook/eresources.html#ERESOURCES-MAIL">O
	  Handbook do FreeBSD</ulink> para maiores
	informa&ccedil;&otilde;es sobre esta e outras listas de
	discuss&atilde;o.</para>
      
      <para>
	Se voc&ecirc; encontrar um bugt ou estiver enviando uma altera&ccedil;&atilde;o
	especifica, por favor fa&ccedil;a o relat&oacute;rio utilizando o programa
	&man.send-pr.1; ou a suas interface <ulink 
	url="../../../../send-pr.html">Web equivalente</ulink>.
	A n&atilde;o ser que ele exceda 65KB, inclua qualquer patch
	diretamente no relat&oacute;rio.  Se o patch &eacute; destinado a ser
	aplicado na &aacute;rvore de c&oacute;digo coloque a palavra
	<literal>[PATCH]</literal> na sin&oacute;pse do relat&oacute;rio.  Quando
	incluir um pacth <emphasis>n&atilde;o</emphasis> o fa&ccedil;a utilizando
	copiar-e-colar porque ao copiar-e-colar os tabs ser&atilde;o
	convertidos para espa&ccedil;os, e tornar&aacute; o patch inutilizav&eacute;l.
	Se o patch ultrapassar 20KB considere a possibilidade de 
	comprimi-lo e utilizar o &man.uuencode.1; antes de
	envi&aacute;-lo.</para>
      
      <para>
	Depois de enviar o relat&oacute;rio, voce deve receber uma
	confirma&ccedil;&atilde;o junto com um numero de registro.
	Mantenha este numero de registro de forma que voc&ecirc; possa
	nos manter atualizados sobre o seu problema, enviando um email
	para <email>bug-followup@FreeBSD.org</email>.  Coloque o
	numero no assunto da mensagem, por ex. <literal>"Re:
	  kern/3377"</literal>. Informa&ccedil;&otilde;es adicionais
	sobre qualquer relat&oacute;rio de bug deve ser submetido
	desta forma.</para>
      
      <para>
	Se voc&ecirc; n&atilde;o receber a confirma&ccedil;&atilde;o em prazo razo&aacute;vel (3 dias a
	1 semana, dependendo da sua conex&atilde;o de email), ou est&aacute; por
	alguma raz&atilde;o, impossibilitado de utilizar o comando
	&man.send-pr.1; , ent&atilde;o voc&ecirc; pode pedir que algu&eacute;m o envie
	para voc&ecirc; atrav&eacute;s do envio de uma mensagem para
	&a.bugs;.</para>
      
      <para>Consulte tamb&eacute;m <ulink
  	URL="../../articles/problem-reports/article.html">este
  	artigo</ulink> sobre como escrever um bom relat&oacute;rio de
	problema.</para>
    </sect2>

    <sect2>
      <title>Altera&ccedil;&otilde;es na Documenta&ccedil;&atilde;o</title>

      <indexterm><primary>Envio de documenta&ccedil;&atilde;o</primary></indexterm>

      <para>
	Altera&ccedil;&otilde;es na documenta&ccedil;&atilde;o s&atilde;o administradas pelo &a.doc;.
	Por favor verifique o <ulink 
	url="../../books/fdp-primer/index.html">livro de instru&ccedil;&otilde;es
	aos iniciantes no projeto de documenta&ccedil;&atilde;o do FreeBSD</ulink>
	para obter instru&ccedil;&otilde;es detalhadas.  Envie suas colabora&ccedil;&otilde;es e
	altera&ccedil;&otilde;es (inclusive as pequenas ser&atilde;o bem vindas!) usando o
	&man.send-pr.1; como descrito no <link linkend="contrib-general">
	Relat&oacute;rios de bug e comentarios gerais</link>.</para>
    </sect2>

    <sect2>
      <title>Altera&ccedil;&otilde;es no c&oacute;digo fonte existente</title>

      <indexterm><primary>FreeBSD-CURRENT</primary></indexterm>

      <para>
	Uma adi&ccedil;&atilde;o ou altera&ccedil;&atilde;o ao
	c&oacute;digo fonte existente s&atilde;o um caso um pouco mais
	complicado e dependem muito de qu&atilde;o desatualizado
	voc&ecirc; est&aacute; em rela&ccedil;&atilde;o ao estado
	atual de desenvolvimento do FreeBSD.  Existe um release
	especial em andamento do FreeBSD conhecida como
	<quote>FreeBSD-CURRENT</quote> a qual &eacute; disponibilizada
	em uma grande variedade de formas para a comodidade dos
	desenvolvedores que trabalham ativamente no sistema.  Consulte
	o<ulink url=" ../../books/handbook/current-stable.html">
	  Handbook do FreeBSD</ulink> para maiores
	informa&ccedil;&otilde;es sobre como obter e utilizar o
	FreeBSD-CURRENT.</para>
      
      <para>
	Trabalhar com vers&otilde;es antigas do c&oacute;digo
	infelizmente muitas vezes significa que as suas
	altera&ccedil;&otilde;es ser&atilde;o demasiadamente obsoletas
	ou muito divergentes para possibilitar uma f&aacute;cil
	re-integra&ccedil;&atilde;o ao FreeBSD.  As possibilidades de
	que isso ocorra podem ser um pouco minimizadas atrav&eacute;s
	da sua inscri&ccedil;&atilde;o nas listas &a.announce; e
	&a.current;, onde as discuss&otilde;es sobre o estado atual do
	sistema ocorrem.</para>

      <para>
	Supondo que voc&ecirc; possa manter de forma bastante segura ias
	atualiza&ccedil;&otilde;es dos c&oacute;digos para basear as suas altera&ccedil;&otilde;es neles,
	o pr&oacute;ximo passo &eacute; produzir um conjunto de
	<literal>diffs</literal> para enviar aos mantenedores do
	FreeBSD.  Isto &eacute; feito com o comando &man.diff.1;.</para>
      
      <para>
	O formato preferido do &man.diff.1; para enviar um patch, &eacute; o
	formato de sa&iacute;da unificada gerado pelo <command>diff -u</command>.  
	No entando, para patches que alterem substancialmente uma
	regi&atilde;o do c&oacute;digo, o formato de saida de contexto gerada pelo
	<command>diff -c</command> pode ser mais leg&iacute;vel e por isso
	preferida.</para>
      
      <indexterm>
        <primary><command>diff</command></primary>
      </indexterm>

      <para>Por exemplo:</para>

      <para>
	<screen>&prompt.user; <userinput>diff -c oldfile newfile</userinput></screen>

	or

	<screen>&prompt.user; <userinput>diff -c -r olddir newdir</userinput></screen>

	geraria o tal conjunto de diffs de contexto para um dado
	arquivo de c&oacute;digo ou para uma hierarquia de diret&oacute;rios.</para>
	
      <para>Da mesma forma,
        <screen>&prompt.user; <userinput>diff -u oldfile newfile</userinput></screen>
        or
        <screen>&prompt.user; <userinput>diff -u -r olddir newdir</userinput></screen>

        faria o mesmo, exceto que utilizando o formato de diff unificado.</para>

      <para>Consulte o manual do &man.diff.1; para maiores detalhes.</para>

      <para>
	Uma vez que voc&ecirc; tenha o conjunto de diffs (os quais voc&ecirc; pode
	testar com o comando &man.patch.1;), voc&ecirc; deve submet&ecirc;-los
	para inclus&atilde;o no FreeBSD.  Utilize o comando &man.send-pr.1;
	como descrito no <link linkend="contrib-general">Relat&oacute;rios de
	bugs e coment&aacute;rios gerais</link>.  <emphasis>N&atilde;o</emphasis>
	envie os diffs apenas para a &a.hackers; ou eles ser&atilde;o
	perdidos!  N&oacute;s aprecisamos extremamente a sua submiss&atilde;o (este
	&eacute; um projeto volunt&aacute;rio!); porque n&oacute;s somos ocupados, n&oacute;s
	podemos n&atilde;o ter como responder-lhe imediatamente, mas ele
	permanecer&aacute; em nosso bando de dados de PRs at&eacute; que n&oacute;s
	analisemos.  Marque a sua submiss&atilde;o, incluindo a palavra
	<literal>[PATCH]</literal> na sin&oacute;pse do relat&oacute;rio.</para>
      
      <indexterm>
        <primary><command>uuencode</command></primary>
      </indexterm>

      <para>
	Se voc&ecirc; sentir que &eacute; apropriado (por ex. voce adicionou,
	deletou ou renomeou arquivos), empacote as suas mudan&ccedil;as em um
	arquivo <command>tar</command> e execute o programa
	&man.uuencode.1; nele.  Arquivos criados com o &man.shar.1;
	tamb&eacute;m s&atilde;o bem vindos.</para>
      
      <para>
	Se suas mudan&ccedil;as s&atilde;o de uma natureza potencialmente sens&iacute;vel,
	por ex. voc&ecirc; est&aacute; inseguro sob quais politicas de direito
	autoral as novas vers&otilde;es ser&atilde;o distribuidas ou se voc&ecirc;
	simplesmente n&atilde;o est&aacute; pronto para liber&aacute;-lo sem realizar
	primeiro uma revis&atilde;o cuidadosa, ent&atilde;o voc&ecirc; deve envi&aacute;-lo
	idiretamente para o &a.core; ao inv&eacute;s de de submet&ecirc;-lo com o
	&man.send-pr.1;.  O &a.core; alcan&ccedil;a um grupo muito menor de
	pessoas que cuidam de muitas das tarefas di&aacute;rias do FreeBSD.
	Observe que este grupo tamb&eacute;m &eacute; <emphasis>muito ocupado</emphasis>
	e assim voc&ecirc; s&oacute; deve enviar um email a eles se for realmente
	necess&aacute;rio.</para>
      
      <para>Por favor consulte o &man.intro.9; e o &man.style.9; para
      obter alguma informa&ccedil;&atilde;o sobre o estilo de codigica&ccedil;&atilde;o.  N&oacute;s
      apreciar&iacute;amos se voc&ecirc; estivesse ao menos ciente destas
      informa&ccedil;&otilde;es antes de submeter o seu c&oacute;digo.</para>
      
    </sect2>

    <sect2>
      <title>C&oacute;digo novo ou pacotes principais de valor adicionado</title>

      <para>
	No caso de uma contribui&ccedil;&atilde;o significativa de um
	trabalho grande porte, ou na adi&ccedil;&atilde;o de uma nova
	caracter&iacute;stica importante ao FreeBSD, torna-se quase
	sempre necess&aacute;rio que se envie as
	altera&ccedil;&otilde;es em um arquivo tar
	<literal>uuencoded</literal> ou ent&atilde;o que se
	fa&ccedil;a o upload das mesmas para um servidor web ou de FTP
	para que as outras pessoas possam acess&aacute;-las.  Se
	voc&ecirc; n&atilde;o possui acesso a um servidor web ou de
	FTP, pergunte em uma lista de discuss&atilde;o apropriada do
	FreeBSD se alguem pode hospedar essas altera&ccedil;&otilde;es
	para voc&ecirc;.</para>
	
      <para>
	Quando se trabalha com grandes quantidades de c&oacute;digo,
	sensivel assunto dos direitos autorais vem a tona.  Os
	direitos autorais aceitos para os c&oacute;digos incluidos no
	FreeBSD s&atilde;o:</para> 
      
      <orderedlist>
  <indexterm><primary>Licensa BSD</primary></indexterm>
	<listitem>
	  <para>Os diretitos autorais BSD.  Este tipo de licensa
	    &eacute; o mais prefer&iacute;vel devido a sua natureza
	    <quote>n&atilde;o restitiva</quote> e pela sua afinidade
	    com iniciativas comerciais.  Longe de desencorajar o uso
	    comercial, o Projeto FreeBSD encoraja ativamente tais
	    participa&ccedil;&otilde;es, uma vez que estes interesses
	    comerciais que podem eventualmente se converter em
	    investimentos no proprio FreeBSD.</para>
	</listitem>

  <indexterm><primary>GPL</primary><see>GNU General Public License</see></indexterm>
  <indexterm><primary>GNU General Public License</primary></indexterm>
	<listitem>
	  <para>A licensa geral publica GNU, ou <quote>GPL</quote>.
	    Esta licensa n&atilde;o &eacute; t&atilde;o popular
	    conosco, devido aos esfor&ccedil;os extras que exigem de
	    qualquer pessoa que venha a utilizar o c&oacute;digo com
	    finalidades comerciais, mas dada a grande quantidade de
	    c&oacute;digo GPL que n&oacute;s necessitamos atualmente
	    (compilador, assembler, formatador de texto, etc) seria
	    tolice recusar contribui&ccedil;&otilde;es adicionais sob
	    esta licensa. O c&oacute;digo sob a GPL tamb&eacute;m
	    v&atilde;o para uma parte diferente da &aacute;rvore, mais
	    especificamente para <filename>/sys/gnu</filename> ou
	    <filename>/usr/src/gnu</filename>, de forma que &eacute;
	    muito facil de identifica-los para qualquer um para quem a
	    GPL representa um problema.</para>
	</listitem>
      </orderedlist>

      <para>
	As contribui&ccedil;&otilde;es que v&ecirc;m sob qualquer
	outro tipo de licensa devem ser cuidadoamente revistas antes
	de serem incluidas no FreeBSD.  Contribui&ccedil;&otilde;es
	com algum tipo de restri&ccedil;&atilde;o particular ao seu
	uso comercial s&atilde;o geralmente rejeitadas, embora os
	autores sejam incentivados a fazerem este tipo de
	altera&ccedil;&atilde;o atrav&eacute;s de seus pr&oacute;prios
	canais.</para>
      
      <para>
	Para colocar o seu trabalho sob <quote>licensa BSD</quote>,
	inclua o texto abaixo no inicio de cada um dos arquivos que
	voc&ecirc; deseja proteger, substituindo o texto entre
	<literal>%%</literal> com as informa&ccedil;&otilde;es
	apropriadas:</para>
      
      <programlisting>Copyright (c) %%proper_years_here%%
        %%your_name_here%%, %%your_state%%  %%your_zip%%.  
	All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions
are met:
1. Redistributions of source code must retain the above copyright
   notice, this list of conditions and the following disclaimer as
   the first lines of this file unmodified.
2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

THIS SOFTWARE IS PROVIDED BY %%your_name_here%% ``AS IS'' AND ANY EXPRESS OR
IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL %%your_name_here%% BE LIABLE FOR ANY DIRECT, INDIRECT,
INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

        &#36;Id&#36;</programlisting>

      <para>
	Para a sua comodidade, uma c&oacute;pia deste texto pode ser
	encontrada em
	<filename>/usr/share/examples/etc/bsd-style-copyright
	</filename>.</para>
    </sect2>

    <sect2>
      <title>Dinheiro, Hardware ou Acesso Internet</title>

      <para>
	N&oacute;s ficamos sempre muito felizes em aceitar
	doa&ccedil;&otilde;es para a causa futura do Projeto FreeBSD,
	e em um trabalho volunt&aacute;rio como o nosso, com se pouco
	pode ir longe! Doa&ccedil;&otilde;es de hardware tamb&eacute;m
	s&atilde;o muito importantes para expandir a nossa lista de
	perif&eacute;ricos suportados, uma vez que normalmente
	n&atilde;o temos recursos para comprar estes itens n&oacute;s
	mesmos.</para>
      
      <sect3>
	<title><anchor id="donations">Doando Dinheiro</title>

	<para>A funda&ccedil;&atilde;o FreeBSD &eacute; uma entidade
	  sem fins lucrativos e isenta de impostois, estabelecida com
	  o objetivo de promover os objetivos do Projeto FreeBSD.
	  Como uma entidade 501(c)3, a funda&ccedil;&atilde;o &eacute;
	  isenta de recolher as taxas do governo federal, bem como as
	  do Estado do Colorado.  As doa&ccedil;&otilde;es para uma
	  entidade isenta de impostos s&atilde;o frequentemente
	  dedut&iacute;veis dos impostos federais.</para>
	
	<para>As doa&ccedil;&otilde;es podem ser enviadas
	  atrav&eacute;s de cheques para: 
	  <address> The FreeBSD Foundation 
	  <street>7321 Brockway Dr.</street>
	  <city>Boulder</city>, <state>CO</state>
	  <postcode>80303</postcode> <country>USA</country>
	  </address>
	</para>

	<para>
	  A Funda&ccedil;&atilde;o FreeBSD &eacute; capaz agora de
	  receber doa&ccedil;&otilde;es atrav&eacute;s da web com o
	  PayPal.  Para fazer uma doa&ccedil;&atilde;o, por favor
	  visite o <ulink
	    url="http://www.freebsdfoundation.org">website</ulink> da
	  funda&ccedil;&atilde;o.</para>
	
	<para>
	  Maiores informa&ccedil;&otilde;es sobre a
	  funda&ccedil;&atilde;o FreeBSD podem ser obtidas no
	  documento <ulink
	    url="http://people.freebsd.org/~jdp/foundation/announcement.html"> 
	    A Funda&ccedil;&atilde;o FreeBSD - Uma
	    introdu&ccedil;&atilde;o</ulink>.  Para contatar a
	  funda&ccedil;&atilde;o por email, escreva para
	  <email>bod@FreeBSDFoundation.org</email>.</para>
      </sect3>

      <sect3>
	<title>Doando Hardware</title>
  <indexterm><primary>doac&otilde;es</primary></indexterm>

	<para>O projeto de FreeBSD aceita alegremente
	  doa&ccedil;&otilde;es de hardware que sem encontram em boas
	  condi&ccedil;&otilde;es de uso. Se voce estiver interessado
	  em doar componentes de Hardware, por favor contate o <ulink
	    url="http://www.FreeBSD.org/donations/"> Escrit&oacute;rio
	    de relacionamento com doadores</ulink>.</para>
	
      </sect3>

      <sect3>
	<title>Doando Acesso Internet</title>

	<para>
	  N&oacute;s sempre podemos utilizar novos sites espelho para
	  os servi&ccedil;os de FTP, WWW ou <command>cvsup</command>.
	  Se voc&ecirc; desejar se tornar um site espelho, por favor
	  consulte o artigo <ulink
	    url="../../articles/hubs/index.html">Espelhando o FreeBSD
	  </ulink> para maiores informa&ccedil;&otilde;es.</para>
      </sect3>
    </sect2>
  </sect1>

</article>

<!-- 
     Local Variables:
     mode: sgml
     sgml-indent-data: t
     sgml-omittag: nil
     sgml-always-quote-attributes: t
     End:
-->
